[
  {
    "author": "TheYellowWatchdog  Guest Posts: 1 Joined: Mon Dec 29, 2008 12:47 pm Gender: Male",
    "title": "Do I even stand a chance of getting into med school?",
    "content": "I am 29 years old. I have a BA in political science and was a reporter for various newspapers until a couple of years ago when I returned to school and became a radiographer.   I've considered medical school on several occasions, but researching that avenue has always been discouraging. The fierce competition is intimidating. All admissions literature indicates that only the best of the best should apply, and then only if they've been working solely and ferociously toward that goal since birth.   I don't have a history of impressive volunteer and extracurricular activities, my verifiable work history is patchy, I haven't been published in high-level medical journals - in short, I don't know if I'd stand a chance. Even if I made it to the interview process, I don't have a background that's going to knock a panel's socks off. My GPA is good and I know I would do well in school and as a doctor.   But should I not even bother applying? Would I be better off applying for PA school? And would my matriculation odds be any better there?\n\n",
    "posted_time": "Post  by TheYellowWatchdog » Mon Dec 29, 2008 12:58 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=66269&sid=68085dc9a59b2ed0dd8f712280430888#p66269"
  },
  {
    "author": "DamonDSH  Guest Posts: 2 Joined: Sun Jun 13, 2010 11:50 am Gender: Male",
    "title": "Re: Do I even stand a chance of getting into med school?",
    "content": "Of course you would have a chance.  It's not so much about your lifelone preparation as it is your passion, which is what the interviewer's will see in you personally and not just what's on paper.  Take some MCAT prep courses, study hard and long, and score high on your MCAT and you'll have just as good of a chance as anyone else.\n\n",
    "posted_time": "Post  by DamonDSH » Sun Jun 13, 2010 12:11 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=93978&sid=68085dc9a59b2ed0dd8f712280430888#p93978"
  },
  {
    "author": "Vadoff  Guest Posts: 2 Joined: Thu Jul 29, 2010 6:44 pm Gender: Male",
    "title": "Re: Do I even stand a chance of getting into med school?",
    "content": "You don't stand a chance UNTIL you at least meet the prerequisites for medical school, which involve taking the general sciences: biology I/II (one year so I/II/III for quarter system), general chemistry (one year), organic chemistry (one year), and physics (one year).  Once you've met these requirements, you need to have a decent GPA for allopathic (MD) medical school. A GPA of 3.5 or above is preferable, but above a 3.6 is needed to be above the average. At the very least a 3.0 is required for a very low chance, any lower and you'll most likely just be wasting your time.  Next you'll need to take the MCAT. This is a very difficult test, and it'll be hard to pass unless you're up to date on your sciences and have reviewed. A MCAT score of 30+ is highly recommended.  Additionally, although not an explicit requirement. It is almost impossible to get into medical school without some form of clinical experience. This can be in many forms: shadowing, volunteering, working, etc  You're 29 now, even if you applied to medical school next cycle, that wouldn't mean you start medical school until you're 31. Follow that up with 4 years of medical school and 3 years of residency, and you'll be 38. Most likely though (if you haven't done the sciences recently/at all), you'll need 2 years to prep your application so that could bring you to 40. This amount of time investment is very real, and you'll be spending almost all of it on intense study. Ask yourself if this is what you really want to do.  If you still want to pursue medical school but don't have the GPA or MCAT scores, you can try for DO medical school which is more lenient in their admission requirements and allow for the replacement of grades with retakes (to improve GPA).  Matriculating into a PA school is much easier than either an MD or DO medical school. The GPA and MCAT requirements are lower, many schools don't even need an MCAT score to apply. Moreover, the schooling only requires 2-3 years instead of 7, and the study hours is much more manageable.\n\n",
    "posted_time": "Post  by Vadoff » Thu Jul 29, 2010 7:30 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=99134&sid=68085dc9a59b2ed0dd8f712280430888#p99134"
  },
  {
    "author": "StillNotThere  Guest Posts: 2 Joined: Fri Jul 08, 2005 7:30 pm Location: Bay City",
    "title": "Is it really that hard???",
    "content": "I've been interested in becoming a physician for some time now (family practice or emergency medicine in particular), I'm currently in high school, and in all the article's I've read on the subject of becoming one, I consistently read on how hard the process is.  I was just wondering this simple question. How?  Is it the intense studying you must do in medical school, or the rigorous hours in residency? Is it the constant pressure of malpractice, or the difficulty of the subject?  Just wondering on this matter, and if anyone who has gone through this can give an aspiring physician some insight, I'd appreciate it.  Thanks\n\n",
    "posted_time": "Post  by StillNotThere » Sun Jul 10, 2005 8:16 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=16602&sid=68085dc9a59b2ed0dd8f712280430888#p16602"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Well you pretty much summed it all up. It's all these causes I guess. You don't stop reading and learning. The questions is: Is it worth it? And I don't mean financially. If you like helping people, if you like the intellectual challenge that you face with every case, then nothing could be better.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Thu Jul 14, 2005 6:14 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=16795&sid=68085dc9a59b2ed0dd8f712280430888#p16795"
  },
  {
    "author": "Marwan Azar  Guest Posts: 1 Joined: Tue Jul 19, 2005 7:12 pm Location: lebanon",
    "title": "hard or heavy..",
    "content": "Well i'm in no position to say whether medicine as a career is hard or not since i'm just beginning my first year at med school but i would think that its more the time consuming aspect rather than the difficulty per say that is hard to overcome. Dr.Fouad would you agree? All i can say is that medicine is pretty challenging and the load is unparralleled but in terms of pure practice and theory, other disciplines such as space physics (yes, rocket science!) or mathermatical biology seem harder to assimilate.\n\n",
    "posted_time": "Post  by Marwan Azar » Tue Jul 19, 2005 7:31 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=17093&sid=68085dc9a59b2ed0dd8f712280430888#p17093"
  },
  {
    "author": "lars1297  Guest Posts: 2 Joined: Thu Oct 20, 2005 2:32 pm Location: Des Moines, IA",
    "title": "its like a fire hydrant",
    "content": "In addition to all the previous posts... I am a second year med student and like everyone said..its a challenge in every way you mentioned...but if you are determined, dedicated and love what you are doing... you can do it. The analogy I've always heard is that the med school material is difficult but not impossible...its just that there's so much of it coming at you at one time. Its alot like trying to drink water from a fire hydrant...\n\n",
    "posted_time": "Post  by lars1297 » Thu Oct 20, 2005 2:44 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=23762&sid=68085dc9a59b2ed0dd8f712280430888#p23762"
  },
  {
    "author": "ahughes06  Guest Posts: 4 Joined: Fri Nov 07, 2008 10:20 pm Gender: Female",
    "title": "Re: Is it really that hard???",
    "content": "As far as undergraduate work goes... watch out for organic chemistry. That was the tallest mountain for me to conquer. But all said and done, I'm applying for med school now, and although I've spent long (really long) hours in the library and sacrificed much of my social life at times, school has been challenging but equally rewarding so far. I think you'll love it. :)\n\n",
    "posted_time": "Post  by ahughes06 » Wed Jun 23, 2010 12:45 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=94924&sid=68085dc9a59b2ed0dd8f712280430888#p94924"
  },
  {
    "author": "pra1120  Guest Posts: 1 Joined: Mon Apr 27, 2009 7:56 pm Gender: Male",
    "title": "Can background have negative effect on career",
    "content": "I am not sure that this is the right place to ask, but my internet search has been rediculously inconclusive.  In my immature youth, I was kicked out of the military for failing a UA for thc. I'm currently going to school to meet my aspirations to become a surgeon. I've recently tried to return to the military to help pay for some of the costs...but i can not enter without completion of a drug and alcohol class/rehab. I have been told that with a drug charge/rehab in your background, it becomes impossible to become a MD. I was just wonering if there is any truth to this. Would the treatment actually show that I have squared myself away, and am no longer the kid I was, or should i just try and find another major, and pursue another career. I would hate to put in all the time and effort it takes to become a great doctor, and it be fruitless. Thank you for any guidance you can give me on the matter.\n\n",
    "posted_time": "Post  by pra1120 » Mon Apr 27, 2009 8:01 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=76045&sid=68085dc9a59b2ed0dd8f712280430888#p76045"
  },
  {
    "author": "cvickers15  Guest Posts: 2 Joined: Thu Sep 17, 2009 8:35 pm Gender: Male",
    "title": "Re: Can background have negative effect on career",
    "content": "I am not a licensed in the medical field, however I am sure the drug charges will affect your career to an extent. You will probably be able to obtain your degree but it will be extremely difficult to obtain a license to practice due to the fact the you will have to be certified to distribute medicine. I believe there are steps you can take to clear the record, like rehabilitation and close observation, I am sure it will be worth it in long run.\n\n",
    "posted_time": "Post  by cvickers15 » Thu Sep 17, 2009 9:14 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=82733&sid=68085dc9a59b2ed0dd8f712280430888#p82733"
  },
  {
    "author": "Jan Ellenor  Guest Posts: 1 Joined: Mon Sep 07, 2009 8:30 pm Gender: Female",
    "title": "Whant a jump start on med school",
    "content": "I have taken some med courses origionally working towards a RN however after being a medic for the Army now for a year I have learned that my passion in medicane would be more full filling with a MD.  I now have to go overseas for a year and really want to study in a much deeper depth in Anatomy, Microbiology and Human Physiology but am very overwhelmed with looking for the right books.   With weeks left before I leave I am running out of time, do you have a favorit author, and or some good books that will help jump start my studies that will help my understanding for when I come back from Iraq and start my schooling?   Thanks\n\n",
    "posted_time": "Post  by Jan Ellenor » Mon Sep 07, 2009 8:55 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=82047&sid=68085dc9a59b2ed0dd8f712280430888#p82047"
  },
  {
    "author": "e.r.doctorcarter",
    "title": "want to become a doctor",
    "content": "hi im in high school in florida and i am really wanting to become a doctor. I want to become a doctor working in the e.r. I want to go to UF and then move to downtown atlanta and work there. Can anyonw help me with information on how i can prepare my self to become a doctor. like what classes i need to take. what classes would help me in high school and what classes in college. Then i belive i have to attend pre-med at the medical school at UF. (how long is pre-med) Then how long is my intership and before i become a doctor working in the e.r. Please someone reply all i think about is becoming a doctor when i grow up. Please someone help me with information. Thank you.\n\n",
    "posted_time": "Post  by e.r.doctorcarter » Wed Aug 20, 2003 1:10 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1233&sid=68085dc9a59b2ed0dd8f712280430888#p1233"
  },
  {
    "author": "DeLWolcott  Guest Posts: 293 Joined: Fri Jun 24, 2005 5:47 pm Location: Texas",
    "title": "[no title]",
    "content": "Get as much science and math as you can.  Becoming fluent in Spanish would be a plus in your area and in the ER.  When you begin college, your advisor will be able to list the classes necessary for medical school admission.  Pre-Med is not a major.  Your college major could be Music, but you can apply for med school as long as you have all of the required classes and grades to back them up.  You can begin your research by going to the college you are planning on attending for undergraduate studies.  Universities have information books that list the different degrees available, and if they are directly affiliated with a medical school, they will have requirements also listed for admission.  Good luck in your ambitions!  There are many different ways you can get where you want to go.  Decide wisely and work hard!\n\n",
    "posted_time": "Post  by DeLWolcott » Thu Oct 06, 2005 8:22 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=22685&sid=68085dc9a59b2ed0dd8f712280430888#p22685"
  },
  {
    "author": "med-geek  Guest Posts: 5 Joined: Sat Jun 11, 2005 3:42 pm",
    "title": "Undergrad Choices",
    "content": "At the University I plan on attending in Canada, they offer two ways to become a doctor. One is through this new BHSc. (Bachelor Of Health Sciences) and the other is simply through a regular BSc. (Bachelor Of Science). I don't know which one I should set my sights on. I can take the right courses in both programs but one is already in the Faculty Of Medicine. The BHsc. seems kind of boring and it would only allow me to work in a hospital environment. The BSc. would allow me to apply my education elsewhere if I change my mind (HIGHLY UNLIKELY).  Any help would be much appreciated. Thanks  :D  Med-Geek\n\n",
    "posted_time": "Post  by med-geek » Tue Dec 06, 2005 10:48 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=26296&sid=68085dc9a59b2ed0dd8f712280430888#p26296"
  },
  {
    "author": "MUSChopeful  Guest Posts: 4 Joined: Thu Dec 28, 2006 2:38 am",
    "title": "[no title]",
    "content": "I am 19 in college at Clemson University and am having a really hard time in college mainly because I was not adequately prepared in High School for math or sciences; however I have a passion for science and have been dreaming of becoming an doctor in the field orthopedics, specifically in surgery.  Do any of you have words of advice?  I have recieved below par grades in math and biology, I am currently taking a semester off to do some hardcore tutoring in these subjects to try and cope with what is ahead of me.  My major at Clemson is microbiology.\n\n",
    "posted_time": "Post  by MUSChopeful » Thu Dec 28, 2006 2:46 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=36852&sid=68085dc9a59b2ed0dd8f712280430888#p36852"
  },
  {
    "author": "Dr. K. Eisele  Psychiatrist Posts: 328 Joined: Fri Dec 08, 2006 10:32 pm Location: US",
    "title": "re:  want to be a doctor",
    "content": "MUSChopeful:  I think the first thing to do is find out what the medical school's prerequisites are.  When I went to med school (not that long ago), there was no particular undergraduate course of study that you had to complete.  For example, some of the students in my med school had degrees in art history, engineering, etc.  I will say that you should probably avoid underwater basket-weaving, though.  Study what you enjoy, and what you do the best, because it will help you open your mind, and learn how to think.  That is what college is for, after all.  Then, once you are in your senior year of undergraduate college, take the prescribed prerequisites.  Usually they are Biology I & II, Chemistry, Organic Chemistry, Anatomy and Physiology or Biochemistry, and maybe Physical Sciences.  Usually only introductory level classes are required.  Having done that, get yourself into one of MCAT prep courses.  They are designed to teach you not only some of those basics, but they also teach you how to do well on the MCAT.  Hope this helps.\n\n",
    "posted_time": "Post  by Dr. K. Eisele » Sat Jan 06, 2007 12:30 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=37367&sid=68085dc9a59b2ed0dd8f712280430888#p37367"
  },
  {
    "author": "dr. janak patel  Medical Doctor Posts: 5 Joined: Sat Nov 01, 2008 5:46 am Gender: Male",
    "title": "Re: want to become a doctor",
    "content": "College will be four years no matter where you attend. Then four years in medical school if you donot want to do a MD/PHD while in medical school. Then four years in residency training in emergency medicine. Then you get to practice on your own as a qualified specialist in that field.  I am excited that you are planning out the time period and commitment needed. I am in the same field and I love the ER, though I have practiced in the typical group practice w Hopsital inpatient and outpatient work as well as housecalls. I believe what is also very important is how you spend the time along the way at each step. One must realize that we can learn at all the steps and we are never done no matter what field of work you go into, especially in medicine. If you enjoy learning and have a constant inquisitive mind then this is a good philosophy, if not... then goal oriented thinking is good also as you will need to have stamina, perserverance, and true love of medicine and helping people and sounds like you will succeed w the right attitude. Emergency medicine is challenging in that it helps alot if you can think on your feet, if you enjoy managing situations that might make others nervous or paralyzed intellectually or practically, if you enjoy variety, if you enjoy pressure and it drives you and challenges you all the time. Remember study hard always, play to win always as your patient will count on it, party hard, and make all your days in this world count for yourself and others. Best wishes young colleague!\n\n",
    "posted_time": "Post  by dr. janak patel » Wed Nov 05, 2008 5:12 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=63199&sid=68085dc9a59b2ed0dd8f712280430888#p63199"
  },
  {
    "author": "amberangel  Guest Posts: 3 Joined: Thu Apr 23, 2009 2:38 am Gender: Female",
    "title": "Re: want to become a doctor",
    "content": "I too am considering a medical field, I suppose. Recently I've read a lot of medical and crime books and find I like them a lot. I quite enjoy reading up and researching various illnesses as well as methods of crime investigation. I'd considered forensic medicine, but I really have no idea.  I really don't like looking at the inside of a body much though.  While reading previous posts, I have to say ER sounds very interesting. Although I'd not really considered medicine that much until recently, I don't know if it's an idea worth pursuing now. (I also have aspirations of joining the police force or doing web design, photography, television and animation. I can't really swim well though, so the first one is already ruled out.)  In any case, I'd really like the gain medical knowledge, since I also love writing and would probably like to write some medical novels. :)''\n\n",
    "posted_time": "Post  by amberangel » Thu Apr 23, 2009 2:56 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=75506&sid=68085dc9a59b2ed0dd8f712280430888#p75506"
  },
  {
    "author": "Jonno  Guest Posts: 2 Joined: Fri Apr 10, 2009 9:25 am Gender: Male",
    "title": "Kosice Medical University, Slovakia?",
    "content": "Hi!  Does anyone know anything about this Medical School?  Jonno\n\n",
    "posted_time": "Post  by Jonno » Wed Apr 15, 2009 12:42 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=74331&sid=68085dc9a59b2ed0dd8f712280430888#p74331"
  },
  {
    "author": "Jonno  Guest Posts: 2 Joined: Fri Apr 10, 2009 9:25 am Gender: Male",
    "title": "Medical University Gdansk - What's it like?",
    "content": "Hi!  I am an English student looking to study medicine in Europe.  Can any one comment on these questions in relation to courses taught in English at the Medical University Gdansk, Poland?  1.\tHow good are the lecturers? 2.\tAre they easy to understand? 3.\tHow good is the library? 4.\tHow good is the IT? 5.\tWhat size are the classes? 6.\tHow many British students enroll each year? 7.\tWhat are the halls of residence like? 8.\tHow long does it take to get from the halls of residence to the lecture theatres? 9.\tWhat percentage of the exams are oral, not written? 10.\tWhat’s it like overall?  Thanks!   Jonno\n\n",
    "posted_time": "Post  by Jonno » Fri Apr 10, 2009 9:32 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=73757&sid=68085dc9a59b2ed0dd8f712280430888#p73757"
  },
  {
    "author": "Kaplan_T3  Guest Posts: 1 Joined: Sun Apr 05, 2009 6:13 pm Gender: Male",
    "title": "Need advice and guidance on becoming a doctor",
    "content": "Hi, this is my 1st post so sorry if Ive posted in the wrong place.  Im currently 18 and live in London. I want to become a doctor but im not sure on a few things. I need to retake my science GCSE's next year to get the required grade for A level. I got a C in maths but was wondering if I HAD to take that in A level  or would science be enough. I reall want become a doctor and a surgeon. So my main question is, what is the exact route I should take from now?   Thanks for any answers.\n\n",
    "posted_time": "Post  by Kaplan_T3 » Sun Apr 05, 2009 6:36 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=73239&sid=68085dc9a59b2ed0dd8f712280430888#p73239"
  },
  {
    "author": "nursinghopful  Guest Posts: 2 Joined: Thu Nov 06, 2008 4:58 am Gender: Female",
    "title": "Nursing Terminology Tips",
    "content": "Hello,   I just finished my first year of nursing. I'm finding that I am having trouble getting my head around the terminology. I am fine doing the prac things, but most of my lecturers say I need to use \"nursing terminology\". Any hints or tips for going about this would be much appreciated.  Many Thanks, Nursinghopeful\n\n",
    "posted_time": "Post  by nursinghopful » Thu Nov 06, 2008 5:18 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=63306&sid=68085dc9a59b2ed0dd8f712280430888#p63306"
  },
  {
    "author": "Debbie Miller, RN  Nurse Posts: 4746 Joined: Mon Apr 16, 2007 2:41 pm Gender: Female Location: USA",
    "title": "Re: Nursing Terminology Tips",
    "content": "Hello, I would recommend doing lots of reading on medical-based websites, in books and magazines.  You could subscribe to one of the nursing magazines.  Just immerse yourself in the medical field.  In addition, it would be very helpful if you were able to work part-time as a CNA or technician so you were exposed to this terminology on a regular basis.  If you sit in on report at shift change and talk to the nurses about their patients as well as reading your patients' charts, this can help you to become more comfortable with the verbage, charting and dialogue in the hospital setting.  Good luck and congratulations on your choice of a wonderful, fulfilling career.  Best wishes.\n\n",
    "posted_time": "Post  by Debbie Miller, RN » Tue Nov 11, 2008 10:59 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=63967&sid=68085dc9a59b2ed0dd8f712280430888#p63967"
  },
  {
    "author": "nursinghopful  Guest Posts: 2 Joined: Thu Nov 06, 2008 4:58 am Gender: Female",
    "title": "Re: Nursing Terminology Tips",
    "content": "Hey thank you for your reply it was much appreciated and very helpful :)\n\n",
    "posted_time": "Post  by nursinghopful » Thu Nov 20, 2008 4:40 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=64710&sid=68085dc9a59b2ed0dd8f712280430888#p64710"
  },
  {
    "author": "missmoonshine08  Guest Posts: 4 Joined: Fri Nov 07, 2008 10:49 pm Gender: Female",
    "title": "Nurse/Midwife Discussion/Forum",
    "content": "I am going to begin a two year college to become an RN and then I plan to continue on to the four year college to become a Nurse/Midwife. Are there any other Nurse/Midwifes on here that i can contact to find out more about the position. My aunt is a Nurse/Midwife but I do not speak to her anymore and the only other Nurse I know is in the ER trauma team at my local hospital and he never really has time to talk to me about what it is like to be an RN. I plan to work in Labor and Delivery after getting my associates in nursing and have the hospital pay the remainder of my education so that I may become a Nurse/Midwife\n\n",
    "posted_time": "Post  by missmoonshine08 » Fri Nov 07, 2008 11:24 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=63542&sid=68085dc9a59b2ed0dd8f712280430888#p63542"
  },
  {
    "author": "Debbie Miller, RN  Nurse Posts: 4746 Joined: Mon Apr 16, 2007 2:41 pm Gender: Female Location: USA",
    "title": "Re: Nurse/Midwife Discussion/Forum",
    "content": "Hello, I assume you are talking about becoming a certified nurse midwife as opposed to a direct entry midwife.  If so, you will need to achieve your bachelor's degree first so, while an associates degree is a good place to start, you will need the bachelor's before you will be admitted to a nurse midwife program.  That is considered graduate work so after the bachelor's you go on for the nurse midwife program.  Plan your classes to be sure everything will transfer to apply towards your bachelor's degree later.  Sometimes people lose classes because of the numbering system and then they need to take more to compensate.  I would talk to a university nursing program counselor to be sure everything you do in the first two years will apply to your BSN (or other bachelor program) without any loss of credits.  This is a good goal and I wish you luck in your endeavor.  Nursing itself affords a huge variety of rewarding job options.  Best wishes.\n\n",
    "posted_time": "Post  by Debbie Miller, RN » Sun Nov 09, 2008 9:30 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=63647&sid=68085dc9a59b2ed0dd8f712280430888#p63647"
  },
  {
    "author": "mta41  Guest Posts: 2 Joined: Sat Jan 05, 2008 9:56 pm",
    "title": "Obstacle keeping me from goal",
    "content": "Ever since I was in kindergarten (I have written proof! =P), I've always wanted to become a doctor...more specifically, a pediatrician. I never used to be scared of blood, but recently the sight of blood other than my own makes me feel a bit sick. Although I think it's more of the thought that the person is in pain that is causing that feeling.   I still really want to become a doctor, but how can I?!  My family doctor once told me that he fainted a few times during med school. It makes me feel better knowing that. =)  Is this something that I'll be able to overcome? I guess that might be a question only I can answer. A better question might be: how can I overcome this recent fear to continue reaching towards my goal? I have no other back up plan; there isn't anything else that I want to do.   Care to share some thoughts/stories/experiences?\n\n",
    "posted_time": "Post  by mta41 » Wed Jan 23, 2008 10:54 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=53347&sid=68085dc9a59b2ed0dd8f712280430888#p53347"
  },
  {
    "author": "Sandy Tracy RN  Nurse Posts: 60 Joined: Wed Nov 07, 2007 6:57 pm",
    "title": "Re: Obstacle keeping me from goal",
    "content": "Hi mta41,  Do not let this interfere with your goals to be a pediatrician.  I am a nurse and I find the sight of snot to be revolting :).  I still clean trachs, play with NG tubes and wipe my kids nose feeling nauseated.  This can be overcome by thinking of something else while dealing with the blood, snot ect...  I still make it through my days.  I have been told the more I expose myself to snot the less anxious I will feel around it.. I am still waiting for this to happen.  It is possible to do your job feeling nauseated if you love your job enough :).     Thanks for writing in and good luck with your goals. Sandy Tracy RN\n\n",
    "posted_time": "Post  by Sandy Tracy RN » Sun Feb 03, 2008 10:58 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=53530&sid=68085dc9a59b2ed0dd8f712280430888#p53530"
  },
  {
    "author": "dr. janak patel  Medical Doctor Posts: 5 Joined: Sat Nov 01, 2008 5:46 am Gender: Male",
    "title": "Re: Obstacle keeping me from goal",
    "content": "Every medical person I have come across has some story or medical scenario that is unpleasant for them specifically and they seem to deal with it just fine. I am quite impressed that your goals have been that clear and remain clear as to helping humankind w lessening suffering and pain of any kind and want to choose a profession of healing since such a young age. I ,myself, love medical procedures and truly enjoy suturing, surgical procedures, running codes when a pt stops breathing, and helping control bleeding. However, I have great difficulty in hearing, watching a person throwing up and that makes me want to throw up also, and I never throw up in my life much at all. What I have learned is to not concentrate on the smell of vomit, the sounds of vomit, or anthing else related to it and I do just fine.  I have found that our mind can control so much including our reflexes and any problem we have can be controlled at least by practice of mental discipline and repeated exposure to what bothers us.  I have also learned that our general attitude every moment, our physical and emotional health currently, our awareness or lack of awareness to the wordly signs of say bleeding as in your case is what helps us manage our dislikes. When I am exposed to this situation that can bother me physically and mentally, I try to think of other things such as how much I care for this person, what would I want if I was in their situation out of the person helping me, what is special about this person I am treating, what a gift it is to be able to help a person with any medical problem, that just by being in control myself as best as I can I am that much closer to helping this person get better, the fact that I am a human being also and I am not supposed to be perfect and I need to do my best and try hard always, honestly. And I find that as I am doing this the literal things that affect me such as smell of vomit, sounds of vomiting, donot seem so real to me and offending and controlling of me as they could be otherwise. In psychology teaching, we learn that repeated gradual increasing and escalated exposure to the stimulus that upsets us will gradually make us comfortable or at least not overly sensitive to the stimulus/blood/vomit that we find so bothersome...this process is formally called ....\"habituation and graded densensitization\" and you should read about it in any psychology/psychiatry forum online. This habituation is how we formally treat \"post traumatic stress disorder\" and \"phobias\" of all kinds and your problem would most likely fall in the phobia category. In this way , I have seen many colleagues deal with their specific medical, physical or emotional specific problems in taking care of patients and they do just fine and sometimes we have backsteps but just like everything in life nothing is too powerful, too overwhelming UNTIL we decide it is and then it most surely will be unfortunately. So, my counselling to you is to realize that in just asking this question and having the desire and wish to succeed in this calling of helping the ill, you have already started on the right path by your thinking, questionning, seeking advice, and that all you have to do is see what helps you today already in everyday life to cope with your particular problem. This problem may be too much for you to deal with everyday as a part of your profession and if so there are fields of medicine that you can go into that donot expose you to that much blood at all and some that will expose you all the time and you must decide if this is one way for you to be flexible in your preferences but still be a physician.  If it is just a mild aversion to blood and you can handle it as you seem very capable of doing then by all means proceed full steam as advised above and make sure you play to succeed and truly work hard at solving your problem.  If it is very serious problem and a major aversion to blood, then perhaps you may need to reconsider if being some nervous  everyday while working in your preferred occupation as a physician is going to make you happy in your heart of hearts, if so great, if not great, but decide first honestly and then proceed with your  goal. Regardless of what you decide, it sounds very much that you will succeed in whatever field you train in and I am confident that you are proceeding in the most sensible, caring, introspective, thoughtful manner, and I as a pt or fellow colleague in medicine would be much more proud to work alongside someone such as yourself and most importantly receive patient care from such a serious professional. Hope I have given you some real tools to sort through this process, Dr. Janak Patel, MD\n\n",
    "posted_time": "Post  by dr. janak patel » Wed Nov 05, 2008 4:26 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=63194&sid=68085dc9a59b2ed0dd8f712280430888#p63194"
  },
  {
    "author": "Tammy15  Guest Posts: 1 Joined: Tue Mar 25, 2008 12:11 pm Gender: Female",
    "title": "Tips on my A Level choices",
    "content": "Hello,  i am a 15 year old girl from london, and i am in year 10.  I dream of becoming a doctor and to do so i know i need al the help i can get. Next year, i have to choose my A Level choices and i would like to know what people may suggest. I am aiming to go to University College of London to become a Diagnostic doctor. The GCSE's i have taken are:   Double Science, Maths, English, ICT, French, Geography, PE, Music, Media and Short Course  RE.  I would really appreciate any tips you could give me on choosing my A Levels however i already know i would like to take Biology and Chemistry  Thank you\n\n",
    "posted_time": "Post  by Tammy15 » Tue Mar 25, 2008 12:33 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=56855&sid=68085dc9a59b2ed0dd8f712280430888#p56855"
  },
  {
    "author": "Jenova  Guest Posts: 2 Joined: Fri Oct 24, 2008 7:29 pm Gender: Male",
    "title": "Re: Tips on my A Level choices",
    "content": "All I can tell you (I'm not a doctor) is that most people will recommend that you take Biology, Chemistry, another science/maths and a different subject such as english.\n\n",
    "posted_time": "Post  by Jenova » Fri Oct 24, 2008 7:41 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=62434&sid=68085dc9a59b2ed0dd8f712280430888#p62434"
  },
  {
    "author": "CG15  Guest Posts: 1 Joined: Sat Dec 29, 2007 8:24 pm  Contact:   Contact CG15       Website",
    "title": "Residency Training",
    "content": "Hello I'm a High School student who is really considering going into the radiology field. I found out that i must complete 4 years undergrad, 4 years medical school, and complete 5+ years of residency/internship training.    I would like to be married after undergrad and start a family after med school. I was curious if it would be really really difficult to start a family during the residency and training. Should I wait until after the residency and training? Or go for it and start a family?\n\n",
    "posted_time": "Post  by CG15 » Sat Dec 29, 2007 8:31 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=52318&sid=68085dc9a59b2ed0dd8f712280430888#p52318"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "Re: Residency Training",
    "content": "Hi GC15,  Many people face the same question you are when contemplating a career in medicine.  Is it worth it to put in all the time and will I be able to do other things.  The short answer is that it takes some work but it is quite possible to start a family during medical school or residency.    Good time management is important to be able to coordinate all the aspects of your life and not let any of them get overlooked.  Also, it will take some understanding of your partner that your medical commitments will be a lot.  But, with open communication it can work very well.  I personally got married during residency and several of my friends got married during medical school.  Others in my class were married before starting medical school.  Still others chose to wait until after residency.  Basically all options can work if you're committed.  Best wishes.  Perhaps we'll be colleagues some day.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sun Dec 30, 2007 8:43 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=52366&sid=68085dc9a59b2ed0dd8f712280430888#p52366"
  },
  {
    "author": "Torqnut05  Guest Posts: 1 Joined: Sat Sep 01, 2007 10:16 pm",
    "title": "Health Administrator degree's",
    "content": "i am considering a career as a health administrator, and i've come across an issue about the degrees.  Through research on the field, i found out about AUPHA and CAHME.  i'm currently serving in the Air Force and am looking to do this after i retire (still have 8 years left).  since i work aircraft maintenance and have far from a normal schedule (as well as an infant to raise), online schooling is my easiest bet.  If i get a BHSA, an MSHA, and pursue a doctorate online, the curriculum's aren't accredited under AUPHA or CAHME (yes, i'm looking at the University of Phoenix as a heavy option).  would i be shooting myself in the foot?  i could always take extra classes to try to mirror AUPHA and CAHME.  i've wanted to pursue medicine since first grade, and i just cant see myself not doing something in the field.  Health Administration seems to be my best bet now, for a job that is challenging and far enough up the chain that i can make my own decisions.  Also, any possible information/suggestions are more than welcome.\n\n",
    "posted_time": "Post  by Torqnut05 » Mon Sep 03, 2007 8:30 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=47311&sid=68085dc9a59b2ed0dd8f712280430888#p47311"
  },
  {
    "author": "Bama_RN  Guest Posts: 1 Joined: Sat Sep 08, 2007 4:53 pm",
    "title": "Medical Career",
    "content": "I have a BSN, and will be finishing my MSN in spring.  Hopefully, by fall of 2008 I will be in the Doctorate program of Nurse Practitionare.  All this accomplished in 2 years in ADN, 2 years in BSN, and 2 years (I hope in MSN) a total of 6 years.  So plus another 2-3 years of DNP that should be it for me!!!    Well, I make it sound too simplistic - I do have most of my basics done prior to my ADN.  So count another 2 years of being a free lance student of nothing.  As for the online education - I spent my BSN, and MSN 100% online through UNA. Most universities now offer online education - I suggest that you check out your local university for this option.  It is cheaper than UOP, and you will have the benefit of having a campus to go to just in-case you need to go there.    I also would not give up on the MD dream yet - if anything look into being a NP, or MA. We do need good hospital admin., but personally I would like to see someone up there that has some medical background - this is why my MSN is like a hybrid + MBA.\n\n",
    "posted_time": "Post  by Bama_RN » Sat Sep 08, 2007 5:15 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=47510&sid=68085dc9a59b2ed0dd8f712280430888#p47510"
  },
  {
    "author": "bodave2  Guest Posts: 7 Joined: Fri Dec 22, 2006 11:27 am",
    "title": "grades and credit hours",
    "content": "Hi, I am about to graduate soon with a BS in Biology and want am preparing to take my MCAT. I was wondering if the poor history i had when i was 17-18 due to health problems will haunt me. I had 2 semesters of all F's but I have repalced them all with A's on my 2nd attempt and fixed my gpa. I also knew nothing about how manny credit hours to take my first 2 years and was taking only 9-12 hours each semester and my last 2 years I have been taking 14 hours and have a 4.0 in science/math classes but i have a 3.5 cumulative becouse i was young and dumb and took a bunch of art calsses and got some C's. If I do good on MCAT do you think the addmissions will look at my most recent success more than when i was first starting college?\n\n",
    "posted_time": "Post  by bodave2 » Fri Aug 17, 2007 11:11 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=46438&sid=68085dc9a59b2ed0dd8f712280430888#p46438"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Bodave2,  Medicine is a very rewarding career.  I think you'll really enjoy it.  When applying to medical school, part of the process is writing a personal statement and interviews.  With these two aspects you can explain why you had the rough semesters.  A GPA of 3.5 with a rocky start is very respectable.  With some explanation of why your initial grades were low I suspect the medical schools will see this as 1) understandable and 2) that you have really committed to this to pull your grades up so dramatically.  Best wishes.  Perhaps we will work together someday.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sat Aug 18, 2007 12:01 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=46448&sid=68085dc9a59b2ed0dd8f712280430888#p46448"
  },
  {
    "author": "MUSChopeful  Guest Posts: 4 Joined: Thu Dec 28, 2006 2:38 am",
    "title": "Tips",
    "content": "Does anyone have any helpful tips on getting into a Medical School or recommendations on whether I should go for a Medical School or a teaching hospital.  I'd like to eventually become an orthopedic surgeon.\n\n",
    "posted_time": "Post  by MUSChopeful » Thu Dec 28, 2006 9:18 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=36903&sid=68085dc9a59b2ed0dd8f712280430888#p36903"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "There are many tips on getting in to medical school.  Several books have been written on the topic that can be helpful.  The basic needs are:   1) to do well in your undergraduate course work-especially in the sciences (but keep in mind that you do not need to be a science major to apply to medical school-major in what you like and be sure to take the science prerecs.)  2) Study and do well on the MCAT.  Double digit scores in each category are generally considered competitive.  3) Get some good volunteer experience in the medical field.  4) If you can, do some research.  5) Look into the schools your interested in to see if they have any specific requirements or \"preferences\" for their applicants.  Above all, look into the medical field some and see if that is really what you want to do.  Medicine is an extremely rewarding and fun field-but not if you don't really like the medical field.  Those who go into medicine \"for the money\" or some other type of reason tend to find themselves unhappy in the end, but those who really love medicine go on to have very fulfilling careers.  Regarding a medical school vs. a teaching hospital, all medical schools need to be affiliated with a hospital somehow to be able to let their medical students have a place for their clinical years.  Really, the two are inseparable.  Best of luck.  Medicine is a challenging and fascinating career.  Let us know if there is anything else we can help you with.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Fri Dec 29, 2006 2:57 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=36927&sid=68085dc9a59b2ed0dd8f712280430888#p36927"
  },
  {
    "author": "tgr1scr17  Guest Posts: 3 Joined: Mon Aug 01, 2005 10:31 pm Location: Tennessee  Contact:   Contact tgr1scr17       Yahoo Messenger",
    "title": "high school student",
    "content": "im interested in oncology. I was just wondering what classes I would need to take in college to help me have a better chance to get into med school and what would help me the most in the oncology field.\n\n",
    "posted_time": "Post  by tgr1scr17 » Mon Aug 01, 2005 11:11 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=17919&sid=68085dc9a59b2ed0dd8f712280430888#p17919"
  },
  {
    "author": "happylouyear  Guest Posts: 3 Joined: Mon Feb 14, 2005 8:44 pm Location: Montreal, Qubec, Canada",
    "title": "[no title]",
    "content": "Hi¹ I am a 4th year medical student.  The most important thing for you if you want to explore your interest in oncology is to get into medicine in the first place.  To get into medicine, you need high grades, involvement in your community and a well-balanced personnality (i.e. other interests).  As for oncology, you will be able to specialize in that field after premed, 4 years of medicine, 3 years of internal medicine and then you will do a fellowship in oncology.  In short, you will have a lot of time to learn about this field, so I suggest you take any classes that you are interested in for now. What might relate to oncology include immunology as it relates to cancer treatments. Good luck.\n\n",
    "posted_time": "Post  by happylouyear » Sun Sep 18, 2005 9:21 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=20994&sid=68085dc9a59b2ed0dd8f712280430888#p20994"
  },
  {
    "author": "gstep  Guest Posts: 4 Joined: Wed Dec 28, 2005 7:20 pm Location: Butler Co., Ohio",
    "title": "Oncology classes",
    "content": "The most important High School subjects for any type of Medical Profession, is all the various Science's and Math.  Most students hate these classes and will always ask \"when will we ever use this stuff\".  In the Medical field you will use \"this stuff\" daily.  If you don't learn it now you will have to take and pass these classes before you even start the college level Science's and Math. Good Luck!  Gina\n\n",
    "posted_time": "Post  by gstep » Sat Dec 31, 2005 12:55 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=27470&sid=68085dc9a59b2ed0dd8f712280430888#p27470"
  },
  {
    "author": "med-geek  Guest Posts: 5 Joined: Sat Jun 11, 2005 3:42 pm",
    "title": "Re: Oncology classes",
    "content": "[quote=\"gstep\"]Most students hate these classes and will always ask \"when will we ever use this stuff\".  In the Medical field you will use \"this stuff\" daily.    Gina[/quote]  Do the necessary classes include Calculus (Math 31). It is a university level course offered in high school. I'm doing alright in it but I want to know if I will need it in the medical field. Does anyone know if it is used?\n\n",
    "posted_time": "Post  by med-geek » Thu Mar 09, 2006 10:48 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=31851&sid=68085dc9a59b2ed0dd8f712280430888#p31851"
  },
  {
    "author": "Sherille  Guest Posts: 2 Joined: Wed Apr 13, 2005 9:55 am Location: austin",
    "title": "WHAT DOES AN IMMUNOLOGIST DO ?",
    "content": "Im currently a highschool Junior and it`s time for me to start looking into carrers and for a major for college. Im really interested in science and medicine. I been looking into what an immunologist does, but im not to sure of what the college requirements are as far courses I will have to take and post graduate school. If anyone is an immunologist, could you please tell me what exactly it is that you do and how many years of school I will need to attend. also is Michigan State a good college to attend for science ?   Does anyone know what type of Doctor, Dr.House is on that T.V show \"HOUSE\" on FOx?\n\n",
    "posted_time": "Post  by Sherille » Wed Apr 13, 2005 10:03 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=12286&sid=68085dc9a59b2ed0dd8f712280430888#p12286"
  },
  {
    "author": "Dr. Wafaa Abdel-Hadi  Medical Doctor Posts: 228 Joined: Mon Mar 07, 2005 2:15 pm",
    "title": "[no title]",
    "content": "Dear Sherille,  well, Immunology is the science of The immune system(immunity)...It's very specific...yet very IMPORTANT....The immune system apart from being your body's defensive system, sometimes it goes crazy and causes you a disease i.e. the immune system even plays a role in most of the diseases these days .  It's a very interesting field....helps a lot of people in all aspects. A new trend in Medicine...and what's also new and extremely as important as immunology...is genetics, especially with the increasing incidence of cancer among people all over the world.  To study either of them , you have to enter Medicine.I think it takes about 6-7 years to finish it...2-3 years premedical and 3-4 years medical, I am not sure how's it like in the States?(will contact a friend of mine and tell you )  you can check out websites of medical schools near you. send them e-mails and they'll reply back and even send  ua prospectus of their school and its facilities by post.  There is a nice and simple book for  immunology... you can read it, it's easy and actually very funny!!... called \" how does the immune system works\" by Lauren Sompayrac .  anyway, i hope i've helped, and about Dr.House on the tv show \"house\"...I'll check it out and tell you  , never watched it before!   Best wishes,\n\n",
    "posted_time": "Post  by Dr. Wafaa Abdel-Hadi » Wed Apr 13, 2005 11:55 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=12292&sid=68085dc9a59b2ed0dd8f712280430888#p12292"
  },
  {
    "author": "Sherille  Guest Posts: 2 Joined: Wed Apr 13, 2005 9:55 am Location: austin",
    "title": "Thanks",
    "content": "thanks alot for your info, you really helped me out.   Do you think you could ask your friend,what he or she considers to be a good university for my major. I've been considering The University of Michigan, Oklahoma University,or The University of Texas at Austin.  Thanks again.\n\n",
    "posted_time": "Post  by Sherille » Thu Apr 14, 2005 9:51 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=12342&sid=68085dc9a59b2ed0dd8f712280430888#p12342"
  },
  {
    "author": "Neo776  Guest Posts: 4 Joined: Thu Dec 08, 2005 6:01 am Location: Australia",
    "title": "Re: WHAT DOES AN IMMUNOLOGIST DO ?",
    "content": "Sherille wrote: Does anyone know what type of Doctor, Dr. House is on that T. V show \"HOUSE\" on FOx?  I think he's a diagnostician with a double specialty of infectious disease and nephrology.\n\n",
    "posted_time": "Post  by Neo776 » Thu Dec 08, 2005 7:14 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=26367&sid=68085dc9a59b2ed0dd8f712280430888#p26367"
  },
  {
    "author": "Neo776  Guest Posts: 4 Joined: Thu Dec 08, 2005 6:01 am Location: Australia",
    "title": "Oncology",
    "content": "Hi,  After a long hard thinking time, I have decided to go for a career in medicine, specifically in Oncology/Neurology.   I have asked around my area and they have told me I have to get a GP qualification, or at least become a doctor first. I still have 2 years left of secondary education, and I need to know:  1. What marks will I have to obtain in Year 12 VCE? And in what areas?  2. After Secondary School, if I want to study medicine/specialist field, do I head over to University or somewhere else? Please answer this one in depth as the GP's I've asked weren't to clear about it.   3. How much years of study am I in for if I want to become a specialist (Oncology/Neurology)?   It might seem to everyone that I am a little young to want to become a doctor, as for most people when they are children want to become doctors as well, but I have my mind set on Oncology/Neurology. Family experiences and my father having a run-in with RCC have made me decide on my future. I also have backup plans just in case i fail at Oncology/Neurology, or even becoming a GP. I need all the information that I can get so I can strengthen my weaknesses to at least be ready.   I want to prepare not only for Year 12, but to ace it and hopefully fulfill my dream of having a career in medicine.  Regards,     Angel C.   (Sorry if this has been posted before, I couldn't find anything similar to this)\n\n",
    "posted_time": "Post  by Neo776 » Thu Dec 08, 2005 7:05 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=26365&sid=68085dc9a59b2ed0dd8f712280430888#p26365"
  },
  {
    "author": "Neo776  Guest Posts: 4 Joined: Thu Dec 08, 2005 6:01 am Location: Australia",
    "title": "[no title]",
    "content": "^ Forgot to add I live in Victoria, Australia.\n\n",
    "posted_time": "Post  by Neo776 » Thu Dec 08, 2005 7:08 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=26366&sid=68085dc9a59b2ed0dd8f712280430888#p26366"
  },
  {
    "author": "helen737  Guest Posts: 1 Joined: Sun Feb 06, 2005 2:27 pm Location: Worcester, England",
    "title": "becoming a doctor in the US",
    "content": "Hi, Hopefully i'll be at medical school later this year, and was just wondering about the US system. . I'm interested in studying medicine in the UK then moving to the states. Does anyone know if this is a hard thing to do? It seems really quite complicated to become a doctor in the states. Applying to medical school is very different from in england because most people apply straight after school- does everyone have to take a university course before you can apply to medical school in the states? Also we can only apply to maximum of 4 universities and I hear you can apply to loads in the US. Anyway any advice on how to be a doc in the states after I graduate would be great.  Thanks!\n\n",
    "posted_time": "Post  by helen737 » Sun Feb 06, 2005 2:36 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8992&sid=68085dc9a59b2ed0dd8f712280430888#p8992"
  },
  {
    "author": "anisarit  Guest Posts: 4 Joined: Sat May 21, 2005 4:24 pm",
    "title": "Re: becoming a doctor in the US",
    "content": "All International Medical Graduates (IMGs) need to undergo certain things before licensure in the US. You must pass Step 1, Step 2CK, Step 2CS (and Step 3 if you need a Visa). Then you can apply for residencies. It is, ofcourse mucfh more difficult to get a residency if you are an IMG, but definately doable, and even easy in some states (New York). If you need a Visa, it's a bit more difficult, so make sure you score very high. Some residency positions (Dermatology, Radiology, Neurosurgery, Orthopedics) don't normally take IMGs and scores that are minimums for interviews would be in the high 90s (98, 99). If you can't get accepted in the States, do what you can and go through this procedure, but know the consequences attached.  Oh, study Kaplan!  Good Luck!\n\n",
    "posted_time": "Post  by anisarit » Tue Nov 01, 2005 7:50 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=24450&sid=68085dc9a59b2ed0dd8f712280430888#p24450"
  },
  {
    "author": "Osteopath-to-be  Guest Posts: 2 Joined: Tue Feb 01, 2005 7:03 pm Location: Gainesville",
    "title": "Where are all the Osteopaths at?!?!?!?",
    "content": "I'm a recent graduate with a BA in microbiology and I am planning on applying to osteopathic schools. I am very interested in osteopathic medicine but am discouraged to find out that there are no real true-practicing osteopaths in my area. Anyone know of any \"ten-fingered\" osteopathic physicians anywhere in north Florida\n\n",
    "posted_time": "Post  by Osteopath-to-be » Tue Feb 01, 2005 7:10 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8801&sid=68085dc9a59b2ed0dd8f712280430888#p8801"
  },
  {
    "author": "MaximLA  Guest Posts: 2 Joined: Wed Aug 31, 2005 12:18 am Location: LA  Contact:   Contact MaximLA       AOL",
    "title": "Osteopaths",
    "content": "Hi im also interested in Osteopathy and it seems to be very shady and unpopular can anyone shed some light as to the abilities and job descriptions a DO vs an MD had?\n\n",
    "posted_time": "Post  by MaximLA » Wed Aug 31, 2005 12:57 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=19749&sid=68085dc9a59b2ed0dd8f712280430888#p19749"
  },
  {
    "author": "lars1297  Guest Posts: 2 Joined: Thu Oct 20, 2005 2:32 pm Location: Des Moines, IA",
    "title": "difference between MD's and DO's",
    "content": "I am currently an osteopathic med student and I can tell you the difference between MD's and DO's. When I applied to med school- I applied and was accepted to both allopathic (MD) and osteopathic (DO) schools...and I chose to go osteopathic. Since you are probably already aware of the general abilities of an MD, I'll just tell you that DO's can do EVERYTHING an MD can do..and MORE. DO's have all of the same rights to see patients, diagnose, prescribe medicine...everything. There is no difference or inferiority in that realm. I say that DO's can do more because we have a more \"whole-person\" view of medicine and because we also can use manipulative treatment to help patients feel better. Everything in the body is connected and oftentimes a medication is not necessary to make someone feel better... a simple adjustment to their body structure- whether it be bones, muscles, or other tissues... can heal the body just as well, if not better, than putting a medication into your body. This is not to say that we don't like meds or anything... but we try to use ALL the aspects of a person rather than just utilizing the physiology of a drug's mechanism in the body. Another example- if a patient comes into our office with a headache...we are not just going to automatically prescribe a pill and send them on their way...we're going to talk to them, get to know them, and find out what else in their life might be causing the headaches..i.e. stress, a misalignment of their body structures, etc... we don't just see a patient as a particular set of symptoms walking through the door... we see them as a person and try to treat them accordingly. Hope this helps!\n\n",
    "posted_time": "Post  by lars1297 » Thu Oct 20, 2005 2:41 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=23761&sid=68085dc9a59b2ed0dd8f712280430888#p23761"
  },
  {
    "author": "chrisy  Guest Posts: 11 Joined: Sun Nov 02, 2003 11:39 am Location: NY",
    "title": "Med school and undergrad schools",
    "content": "Dear doctors and others, I'm a student interested in medical school. My friend an I got into a debate about undergraduate schools. I believe that applicants from very competitive schools (harvard, mit, berkeley...) have an advantage when applying to medical schools. He believes that medicals don't give preference to rigorous schools such as mit. His argument is:  berkeley students need a 3.74-3.87 and princeton students need a 3.62 to get into uc-davis medical school whose average gpa is 3.55, thus medical school does not give preference to very rigorous colleges. He also thinks that \"WSJ top feeder list\" is useless and the reason why harvard, princeton, yale, and stanford top the list is because of grade inflation.  We need a professional opinion, what's your take? please help.\n\n",
    "posted_time": "Post  by chrisy » Wed Jul 21, 2004 12:37 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=4185&sid=68085dc9a59b2ed0dd8f712280430888#p4185"
  },
  {
    "author": "DeLWolcott  Guest Posts: 293 Joined: Fri Jun 24, 2005 5:47 pm Location: Texas",
    "title": "[no title]",
    "content": "I believe your results on your MCAT, along with a consistent high grade point average in undergrad will give you the biggest advantage no matter where you attend undergrad.\n\n",
    "posted_time": "Post  by DeLWolcott » Thu Oct 06, 2005 8:44 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=22693&sid=68085dc9a59b2ed0dd8f712280430888#p22693"
  },
  {
    "author": "DrNyC  Guest Posts: 1 Joined: Wed Aug 03, 2005 12:11 am Location: massachusetts  Contact:   Contact DrNyC       AOL",
    "title": "NEED To Be A DOCTOR! PLEASE HELP!",
    "content": "Since I entered High School I have been considering becoming a Doctor. I am very serious about it and I am doing many things to make it possible. The school I am in is a vocational school and I am in the health program there. I have volunteered at Hospitals and I do very well in school......basically A's and B's.....But I wanted to know if Medical School is time consuming as well as Pre Med School. This is because I am a religous person....Jehovah's Witness........and i want to know if i can go to school and still go to church 3 days a week in the evening..........please help me because i really want to be a doctor, it is my calling, i guess you can say....Is there anything i can do in my junior year to help me prepare for this?\n\n",
    "posted_time": "Post  by DrNyC » Wed Aug 03, 2005 12:48 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=18003&sid=68085dc9a59b2ed0dd8f712280430888#p18003"
  },
  {
    "author": "happylouyear  Guest Posts: 3 Joined: Mon Feb 14, 2005 8:44 pm Location: Montreal, Qubec, Canada",
    "title": "becoming a medical student",
    "content": "Hello! I am currently a 4th year medical student.  you seem to be doing a good job. You have to do well in school, as grades are usually the first criteria the schools use to select students for interviews.  Then, I think most schools are looking for people who live a well balanced life and that are involved in their community. So the volunteering that you do shows your interest in the well being of others.  Then, do not hesitate to explore other interests that you have and to get involved in committees, sports, teams, clubs, etc.  Good luck!\n\n",
    "posted_time": "Post  by happylouyear » Sun Sep 18, 2005 9:11 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=20993&sid=68085dc9a59b2ed0dd8f712280430888#p20993"
  },
  {
    "author": "surae  Guest Posts: 1 Joined: Tue Jul 19, 2005 8:13 am Location: india  Contact:   Contact surae       Website   Yahoo Messenger   AOL",
    "title": "to become a doctor",
    "content": "Hai my dear friend,  iam happy to see ur mail & query,i had been to ur church & i love the worship of yours, i took baptism in ur church only, aae guy ,what u have to do is take a good persentage in your hr sec/pre degree,  as i advice you to appy ur application in christian medical college ,vellore,in s.india, i too studied in tghis college,you will be a schollar in ur carrier ,spritually,and u will be moulded as a man                          good luck\n\n",
    "posted_time": "Post  by surae » Fri Sep 30, 2005 6:22 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=21954&sid=68085dc9a59b2ed0dd8f712280430888#p21954"
  },
  {
    "author": "8Liter  Guest Posts: 1 Joined: Sat Jul 23, 2005 8:04 pm Location: Flint, MI",
    "title": "What are all the possible jobs I can have?",
    "content": "Soon will be going into my first year of Med School (undergrad in Mechanical Engineering). And was sort of at a crossroads. I can either go for my M.D. or an MBA. With an MBA I sort have an idea of what will happen/ what kind of job i'll get, but if I go for the M.D. I have no idea what I will want to do.   With my MBA I will easily make 200k+ in a few years, and probibly similar depending on the speciality of the M.D. I decide to get. So could someone please list for me all the possible careers I have a choice of with a Doctrate? Thanks\n\n",
    "posted_time": "Post  by 8Liter » Sat Jul 23, 2005 8:43 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=17298&sid=68085dc9a59b2ed0dd8f712280430888#p17298"
  },
  {
    "author": "MaximLA  Guest Posts: 2 Joined: Wed Aug 31, 2005 12:18 am Location: LA  Contact:   Contact MaximLA       AOL",
    "title": "how much do u have to work as an MD",
    "content": "Hi im interested in finding out how much you have to work as an MD and if its possible to work as a normal steady job of 9-5 or something like that, because I want to become a doctor but im not sure if im willing to sacrifice my family life for it, a problem I hear from a lot of ppl!!!!!!!!\n\n",
    "posted_time": "Post  by MaximLA » Wed Aug 31, 2005 1:08 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=19750&sid=68085dc9a59b2ed0dd8f712280430888#p19750"
  },
  {
    "author": "med-geek  Guest Posts: 5 Joined: Sat Jun 11, 2005 3:42 pm",
    "title": "Job Security",
    "content": "From what I've been reading, it seems that almost everyone wants to go into emergency medicine. The question that I have is, are there too many doctors in the working world (or training to be)? If I do become an ER doc, will there be room for me?? Thanks\n\n",
    "posted_time": "Post  by med-geek » Mon Jul 25, 2005 11:14 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=17473&sid=68085dc9a59b2ed0dd8f712280430888#p17473"
  },
  {
    "author": "Dr. Wafaa Abdel-Hadi  Medical Doctor Posts: 228 Joined: Mon Mar 07, 2005 2:15 pm",
    "title": "[no title]",
    "content": "Dear med-geek,  There is always a room for new doctors or else the medical colleges would be shut    . It depends on the hospitals in your surrounding area and after all, it depends on how good you are so that they'd ask for you   ....you have to train well and build up your qualifications .  Best wishes,\n\n",
    "posted_time": "Post  by Dr. Wafaa Abdel-Hadi » Wed Jul 27, 2005 11:05 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=17578&sid=68085dc9a59b2ed0dd8f712280430888#p17578"
  },
  {
    "author": "mikeron9  Guest Posts: 1 Joined: Tue Jul 05, 2005 2:37 pm",
    "title": "25, no pre-med, med school in Egypt?",
    "content": "To anyone who can provide good advice:  I am 25 and have considered going into medicine, but my undergrad was in International Relations.  I have experience living abroad, but would it be possible to start medical studies in Egypt (pre-med included....meaning everything).  I would like to be able to practice in countries where doctors are scarce and basic medical training is an asset (I know there is a large list of countries that fit this description).  Also, any ideas on what are needed areas to specialize in?  Any and all advice would be much appreciated.  Please be honest with all answers (pros/cons).  Thank you/Shukran,  Mike\n\n",
    "posted_time": "Post  by mikeron9 » Tue Jul 05, 2005 3:10 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=16332&sid=68085dc9a59b2ed0dd8f712280430888#p16332"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Hi Mike, I am not aware of the particular requirements for foreign medical students wishing to study in Egypt. However, Egypt is not a country where doctors are scarce. To be honest medical education in Egypt is better than some countries in the region but still falls way short of the kind of education you would expect to have in the US.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Wed Jul 13, 2005 4:14 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=16765&sid=68085dc9a59b2ed0dd8f712280430888#p16765"
  },
  {
    "author": "Wannabadr  Guest Posts: 1 Joined: Thu Jun 23, 2005 11:22 pm",
    "title": "high school senior needing help",
    "content": "Hey all!    I am currently a high school senior and I have a strong interest in becoming a pediatrician. The problem is, I have absolutely no idea where to even begin!  I just have a few questions that maybe someone could help me answer. And if there is a pediatrician logged on, I'd appreciate it so much if he/she could give me advice on where to start!  *Does the undergraduate school that I chose matter that much? *What courses, besides pre med, should I take in undergraduate school? *Are there colleges with \"Pediatrican classes\" so to say, and if so, where can I learn more about them? *When should I start looking at medical schools? *Where, on the east coast, would you recommend an undergraduate and medical program?  Any other information you are willing to give will be so greatly appreciated! Thank you so much and God bless.\n\n",
    "posted_time": "Post  by Wannabadr » Thu Jun 23, 2005 11:31 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=15720&sid=68085dc9a59b2ed0dd8f712280430888#p15720"
  },
  {
    "author": "Rhonda P, CEP  Paramedic Posts: 252 Joined: Wed Mar 16, 2005 8:37 am Gender: Female Location: USA",
    "title": "pediatrics",
    "content": "Hello,  I'm not a Pediatrician but I think this may help you find some information, The American Academy of Pediatrics offers good advice to students considering a career in the field of pediatrics, congratulations.  Here is a basic timeline of what you will be doing on your journey to become a Pediatrician: It will be even longer if you want to specialize in a specific area.  •\tHigh School  •\tCollege (4 years)  •\tMedical School (4 years)  •\tPediatric Internship (1 year)  •\tPediatric Residency (2 years)  •\tPediatric Specialized field\n\n",
    "posted_time": "Post  by Rhonda P, CEP » Sat Jul 09, 2005 11:16 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=16587&sid=68085dc9a59b2ed0dd8f712280430888#p16587"
  },
  {
    "author": "med-geek  Guest Posts: 5 Joined: Sat Jun 11, 2005 3:42 pm",
    "title": "Humanitarian Work",
    "content": "Hi! I have seen the commercials and have looked at the websites for aid agencies like Doctors Without Borders. In what field would these doctors specialize, to be able to do this work?  Thanks\n\n",
    "posted_time": "Post  by med-geek » Sat Jun 11, 2005 3:51 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=14976&sid=68085dc9a59b2ed0dd8f712280430888#p14976"
  },
  {
    "author": "Kim C, RN  Nurse Posts: 39 Joined: Fri Jun 17, 2005 7:36 pm Location: New Orleans, Louisiana",
    "title": "[no title]",
    "content": "Hi med-geek,  Think about what you'd see when going to a third world country where health care is substandard or non-existent. People may need corrective surgery for a birth defect, or they've had devastating injuries that need intervention. Older folks have cataracts and think they're blind. Dental hygiene is often poor. Ear infections, diarrhea, communicable diseases, obstetrical/gynecological issues, heart disease, immunizations... The list is endless.  I imagine that ANY specialty would be useful. Were you thinking of specializing in something with the purpose of serving in this capacity?? That would be wonderful... I would think that if you email one of these agencies, they'd be happy to give you advice.   Good luck... and if you find something out, let me know. I'm curious now!\n\n",
    "posted_time": "Post  by Kim C, RN » Sun Jun 19, 2005 1:39 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=15386&sid=68085dc9a59b2ed0dd8f712280430888#p15386"
  },
  {
    "author": "med-geek  Guest Posts: 5 Joined: Sat Jun 11, 2005 3:42 pm",
    "title": "Is Physics useful?",
    "content": "I'm a Canadian high school student that is extremely interested in medicine. I know I need Physics to enter University and eventually med school but is it vital to becoming a doctor??  Thanks\n\n",
    "posted_time": "Post  by med-geek » Sat Jun 11, 2005 3:44 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=14975&sid=68085dc9a59b2ed0dd8f712280430888#p14975"
  },
  {
    "author": "Kirsty_Oz  Guest Posts: 64 Joined: Wed Aug 18, 2004 3:59 am Location: Australia",
    "title": "[no title]",
    "content": "i am from australia and it is a pre-requisite here. as far as i am aware, physics is rarely used in the study of medicine, however it represents the ability of higher level thinking, practical application and problem solving. all essential in the study of medicine.   good luck with your studies.\n\n",
    "posted_time": "Post  by Kirsty_Oz » Sun Jun 12, 2005 8:01 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=14988&sid=68085dc9a59b2ed0dd8f712280430888#p14988"
  },
  {
    "author": "TheShoelessWonder  Guest Posts: 8 Joined: Mon Nov 22, 2004 2:17 am Location: Edmonds, WA  Contact:   Contact TheShoelessWonder       AOL",
    "title": "Wanting to become a doctor!",
    "content": "I'm a senior in high school and have been an aspiring doctor since I was very little.  I can't even remember making the conscious decision to become one and there are no doctors in my family.  I have two cousins who are recent biochem majors, but otherwise, I would be the first scientist.  My family all have high hopes for me and are worried that my grades might be indicative of my success, or lack thereof.  First, I have to say that I am a student in the Full IB (International Baccalaureate) program, which is even more stringent and rigorous than AP.  Thus, it is understood that my grades may not be A level, but still make an equivalent A+ in other science classes.  That being said, I took Introductory Bio in freshman year and got an A both semesters.  Then I took Introductory Chem and got an A- and B+.  Then I took Inorganic Chemistry and got a B and a C+ (yikes inorganic is hard!), and now I am in Organic Chemistry and have a B+ or so.  I realize this won't bear too heavily on my medical school applications in the future, if at all, but I was just wondering if there is anyone who would think this could be a good, bad, or mediocre indicator of my potential to become a doctor.\n\n",
    "posted_time": "Post  by TheShoelessWonder » Wed Nov 24, 2004 12:18 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6654&sid=68085dc9a59b2ed0dd8f712280430888#p6654"
  },
  {
    "author": "Kirsty_Oz  Guest Posts: 64 Joined: Wed Aug 18, 2004 3:59 am Location: Australia",
    "title": "[no title]",
    "content": "i am assuming you are from the united states?  what is the process of gettg into medicine at uni.....?  here in australia you have to get pretty much a perfect ENTER (equivalent national teritary entrance rank) have studied, physics, chem and specialist maths AND complete a pre med exam... all before your even selected.  IB is good because it always pushes you to aim high!\n\n",
    "posted_time": "Post  by Kirsty_Oz » Wed Nov 24, 2004 1:09 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6655&sid=68085dc9a59b2ed0dd8f712280430888#p6655"
  },
  {
    "author": "gemma-kirstie  Guest Posts: 1 Joined: Mon May 23, 2005 6:05 am Location: West Sussex  Contact:   Contact gemma-kirstie       ICQ   Website",
    "title": "[no title]",
    "content": "hi!  im 19 and have only just decided i want to be a doctor. however, i only have maths and science at grade c at gcse. how can i still become one? im am sort of at a dead end. can anyone help?  Gemma-Kirstie\n\n",
    "posted_time": "Post  by gemma-kirstie » Mon May 23, 2005 6:07 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=14136&sid=68085dc9a59b2ed0dd8f712280430888#p14136"
  },
  {
    "author": "xela950  Guest Posts: 2 Joined: Sat Jun 04, 2005 2:12 pm Location: Norwich",
    "title": "[no title]",
    "content": "Just to let the person with the IB know that I did the full IB with Bio, Chem and English A1 at higher level and maths methods, physics and french at standard and I am currently studying medicine (i'm a newbie in my first year!) I think that the IB more than prepares you for the course because so much of it is finding answers for yourself rather than other diplomas which just teach you how to pass the exams. Good luck finding a med school!!\n\n",
    "posted_time": "Post  by xela950 » Sat Jun 04, 2005 2:17 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=14635&sid=68085dc9a59b2ed0dd8f712280430888#p14635"
  },
  {
    "author": "xela950  Guest Posts: 2 Joined: Sat Jun 04, 2005 2:12 pm Location: Norwich",
    "title": "[no title]",
    "content": "Oh and to gemma-kirstie, you could always to a access to medicine course, a few people on my course have done them and i think some give you a guaranteed interview at the local university, but don't quote me on that! I lived in West Sussex once! It's lovely. Good luck, I know how it feels when all you want to do is study medicine.\n\n",
    "posted_time": "Post  by xela950 » Sat Jun 04, 2005 2:21 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=14636&sid=68085dc9a59b2ed0dd8f712280430888#p14636"
  },
  {
    "author": "Tf888tkm  Guest Posts: 1 Joined: Tue May 17, 2005 9:19 am Location: Texas",
    "title": "I would like to become an ER Doctor or a Veterinarian",
    "content": "Hello Ladies and Gentalmen: I would like to become either an ER doctor or a veterinarian. I can't decide right now. But I do volunteer at a vet clinic regularly and I'm going to do clinical rotation and EMT my senior year of high school, which is in the fall. I would liek to know what else can I do now to start getting prepared for that career. I am also learning my medical terminology and anatomy and phsyiology. School year is almost over and I'm starting my senior year soon. I would like to go to Texas A&M either way I go; ER Doctor or Vet.\n\n",
    "posted_time": "Post  by Tf888tkm » Tue May 17, 2005 9:25 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=13849&sid=68085dc9a59b2ed0dd8f712280430888#p13849"
  },
  {
    "author": "Dr. Wafaa Abdel-Hadi  Medical Doctor Posts: 228 Joined: Mon Mar 07, 2005 2:15 pm",
    "title": "[no title]",
    "content": "Way to go  ...you are doing a great job doing what you do... you are on the right track.. there is nothing more you can do  while you are at senior year high school... attending ER several times with may be doctors/friends can give you an idea on how an ER doctor can be like....u should take full shifts with them and attend their meetings...  being an ER doctor is very stressful but it has a wonderful phsycological feedback...especially when you're good at it and helping a lot of people with your skills.. anyone can be a doctor....but few who become pioneer in it   or even do it well      it's a good thing you're reading medical terminology , anatomy and physiology... these are the basics... by which you can at least understand what's going on in the ER while you are there.... then you can learn new stuff and go back to read about it,ok?  keep up the good work, best regards,\n\n",
    "posted_time": "Post  by Dr. Wafaa Abdel-Hadi » Tue May 17, 2005 3:58 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=13861&sid=68085dc9a59b2ed0dd8f712280430888#p13861"
  },
  {
    "author": "beefmerciful  Guest Posts: 3 Joined: Sat Apr 30, 2005 1:03 am Location: leclaire  Contact:   Contact beefmerciful       Website",
    "title": "selective service's will draft medical workers",
    "content": "\"An article in The New York Times titled “U.S. Has Contingency Plans for a Draft of Medical Workers” appears, revealing that Widemeyer Communications was hired during the summer to help the SSS prepare an enormous draft of doctors, nurses, and 61 medical specialties. What is not mentioned is that the Medical Draft will be expanded to include medical equipment repairpersons and even medical form processors. SSS spokesman Flavahan says that 36,000 doctors and nurses, more than 1% of the total 3.4 million men and women in the U.S. under the age of 44, are planned to be inducted in the first batch once the Skills Draft is activated, showing the current great need or possibly a future need from new invasions and conquests.\"  READ MORE\n\n",
    "posted_time": "Post  by beefmerciful » Sat Apr 30, 2005 1:11 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=13137&sid=68085dc9a59b2ed0dd8f712280430888#p13137"
  },
  {
    "author": "Rhonda P, CEP  Paramedic Posts: 252 Joined: Wed Mar 16, 2005 8:37 am Gender: Female Location: USA",
    "title": "draft",
    "content": "Hello Beefmerciful,   Thank you for your interest and desire to share your findings. This could be a possibility or maybe not, I encourage anyone interested in the details to do research themselves to verify the details. There are controversies on both sides and you will find pros and cons leaning to right and the left.\n\n",
    "posted_time": "Post  by Rhonda P, CEP » Sat Apr 30, 2005 10:28 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=13152&sid=68085dc9a59b2ed0dd8f712280430888#p13152"
  },
  {
    "author": "spiritedeye  Guest Posts: 15 Joined: Tue Jan 04, 2005 11:45 pm Location: UK",
    "title": "I want to study medicine - don't know which specialty?",
    "content": "Hi,  I've wanted to study medicine since I was about 15, but as I left school early because of problems, I never got the chance to do my GCSE's. So obviously, I thought it was impossible to study it. After overcoming the problems I had at school, I'm now taking my exams at college, and I'm hoping to become a medical student if and when I pass.   The problem is, I'm unsure of which field I'd like to work in. I've searched on the internet for some information, but I haven't really found anything helpful. I thought maybe Dentistry or Audiological Scientist, but I'd like to know more about the other fields of medicine before I make a decision. Does anyone know of any useful sites that would tell me what's involved and the qualifications needed?  I hope someone can help. Thanks :)\n\n",
    "posted_time": "Post  by spiritedeye » Thu Feb 17, 2005 12:38 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=9580&sid=68085dc9a59b2ed0dd8f712280430888#p9580"
  },
  {
    "author": "Dr. Wafaa Abdel-Hadi  Medical Doctor Posts: 228 Joined: Mon Mar 07, 2005 2:15 pm",
    "title": "[no title]",
    "content": "Dear Spiritedeye,  well, this is a very tricky question!!?cause we never knew which speciality we wanted untill we've tried it all. welll, this is a nice medical site that might help you. http://www.medical-training.info/index.html  but my advice to you is to search online for Medical schools in UK ...see which one's near you ...then you can browse inside their website...they can tell you about the different specialityies they've got.  this is a website for all medical schools in UK.  http://www.chms.ac.uk/fschlweb.html  this is just a start ...I hope that's helped you? Best wishes\n\n",
    "posted_time": "Post  by Dr. Wafaa Abdel-Hadi » Sat Apr 09, 2005 2:22 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=12111&sid=68085dc9a59b2ed0dd8f712280430888#p12111"
  },
  {
    "author": "spiritedeye  Guest Posts: 15 Joined: Tue Jan 04, 2005 11:45 pm Location: UK",
    "title": "[no title]",
    "content": "Thank you so much for your reply.  I'll have a look at those websites. I didn't think of searching for medical schools, so thank you for your advice. It's helped a lot   Spiritedeye\n\n",
    "posted_time": "Post  by spiritedeye » Tue Apr 12, 2005 5:57 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=12263&sid=68085dc9a59b2ed0dd8f712280430888#p12263"
  },
  {
    "author": "Dr. Wafaa Abdel-Hadi  Medical Doctor Posts: 228 Joined: Mon Mar 07, 2005 2:15 pm",
    "title": "[no title]",
    "content": "Good luck and best wishes future colleague\n\n",
    "posted_time": "Post  by Dr. Wafaa Abdel-Hadi » Wed Apr 13, 2005 11:32 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=12291&sid=68085dc9a59b2ed0dd8f712280430888#p12291"
  },
  {
    "author": "spiritedeye  Guest Posts: 15 Joined: Tue Jan 04, 2005 11:45 pm Location: UK",
    "title": "[no title]",
    "content": "Thank you     I found a university near me and I've ordered a prospectus.   Thanks again!  Spiritedeye\n\n",
    "posted_time": "Post  by spiritedeye » Wed Apr 13, 2005 4:12 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=12302&sid=68085dc9a59b2ed0dd8f712280430888#p12302"
  },
  {
    "author": "Jacenta  Guest Posts: 1 Joined: Fri Feb 25, 2005 3:50 pm Location: Canada, BC",
    "title": "Quick course question.",
    "content": "Hi, I am currently a grade 12 student that will be graduating this coming June. I am going to be upgrading my marks and taking a few courses in the year after. I have a few question though about courses. Do you need: Math 12 Calculus 12 Physics 12 Language 12 Phycology 12?  I know you need Bio 12 and Chem 12 and I have taken also Geo 12 , English 12 and History 12 and a few others. Also before you apply to Med School (Am am wanting to get into the UBC and NUBC med program) do you need to have collage credits of some sort?  Thanks so much to the people that are able to help me.  -Jacenta\n\n",
    "posted_time": "Post  by Jacenta » Fri Feb 25, 2005 4:10 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=9944&sid=68085dc9a59b2ed0dd8f712280430888#p9944"
  },
  {
    "author": "Dr. D. Sawh  Medical Doctor Posts: 18 Joined: Sun Mar 20, 2005 7:05 am Location: GUYANA  Contact:   Contact Dr. D. Sawh       Yahoo Messenger   AOL",
    "title": "Quick course question",
    "content": "Dear Jacenta, Good question. I am NOT from NORTH AMERICA. HOWEVER, U MUST HAVE MATHEMATICS & ENGLISH for without them we won't be able to correctly interpret the world around us. Phycology & calculus are not really essential in order to get into medschool. However, PHYSICS does play an important part in medicine whichever university you attend in the world, especially medical physics or even biophysics--- enquire whether your school,etc. are offering these subjects e.g. summer courses,etc. THESE SUBJECTS ARE VITAL IF U R GOING TO INTERPRET X-RAYS, CT SCANS, MRI'S, PET SCANS, ETC.With regards to college credits, I AM NOT TOO SURE ABOUT THIS, BUT I DO KNOW THAT YOU MUST HAVE A GOOD GRADE POINT AVERAGE. PLEASE NOTE GPA'S VARY GREATLY DEPENDING ON THE UNIVERSITY U WOULD LIKE TO ATTEND TO GET INTO MEDSCHOOL. WRITE TO ADMISSIONS DEPT. OF UNIVERSITY OF YOUR CHOICE ASKING THEM WHAT ARE THEIR MINIMUM REQUIREMENTS TO GAIN ADMISSION INTO MEDSCHOOL. KINDLY REPLY AS SOON AS POSSIBLE. GEOGRAPHY & HISTORY ARE NOT REALLY ESSENTIAL. BEST REGARDS,                                                                                                 D.SAWH M.D., F.R.C.P.\n\n",
    "posted_time": "Post  by Dr. D. Sawh » Sun Mar 27, 2005 12:25 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=11415&sid=68085dc9a59b2ed0dd8f712280430888#p11415"
  },
  {
    "author": "Rhonda P, CEP  Paramedic Posts: 252 Joined: Wed Mar 16, 2005 8:37 am Gender: Female Location: USA",
    "title": "becoming a Doctor",
    "content": "Each area requirements may be different, go to the area you plan on practicing in and see what they require and than go to the area you will be studying at and see what they require. If they are that far off, you have a choice to make.   Canadian Federation of Medical Students National Office  130 Slater Street, Suite 750  Ottawa, ON K1P 6E2 Canada  Tel: (613) 565-7740 Fax: (613) 594-8705  The Canadian Federation of Medical Students has a very good website with information on classes starting at high school and on.  _________________\n\n",
    "posted_time": "Post  by Rhonda P, CEP » Mon Mar 28, 2005 1:15 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=11470&sid=68085dc9a59b2ed0dd8f712280430888#p11470"
  },
  {
    "author": "Dr. D. Sawh  Medical Doctor Posts: 18 Joined: Sun Mar 20, 2005 7:05 am Location: GUYANA  Contact:   Contact Dr. D. Sawh       Yahoo Messenger   AOL",
    "title": "Quick course question",
    "content": "Dear Jacenta,  Each area requirements might be different, go to the special area you plan on practicing in & see what they require of you to gain admission into med school. Kindly contact the following: Canadian Federation of Medical Students National Office   130 Slater Street, Suite 750,   Ottawa, ON K1P 6E2 CANADA,   Tel: (613) 565-7740   Fax: (613) 594-8705 The CANADIAN FEDERATION OF MEDICAL STUDENTS HAS A VERY GOOD WEBSITE WITH PERTINENT INFORMATION ON CLASSES STARTING AT HIGH SCHOOL AND ONWARDS. KINDLY INFORM ME AS TO WHETHER THIS INFO WAS OF ANY ASSISTANCE TO YOU. BEST REGARDS, D.A. SAWH M.D., F.R.C.P.(UK)\n\n",
    "posted_time": "Post  by Dr. D. Sawh » Mon Mar 28, 2005 10:16 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=11476&sid=68085dc9a59b2ed0dd8f712280430888#p11476"
  },
  {
    "author": "DK",
    "title": "Process",
    "content": "I am interrested in becoming a clinical doctor. What is the process of post-secondary education that one would go through in order to achieve this? I am still in high-school, so I still have a while to go, however, I am trying to plan my future now.\n\n",
    "posted_time": "Post  by DK » Mon Jan 13, 2003 4:53 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=131&sid=68085dc9a59b2ed0dd8f712280430888#p131"
  },
  {
    "author": "Rhonda P, CEP  Paramedic Posts: 252 Joined: Wed Mar 16, 2005 8:37 am Gender: Female Location: USA",
    "title": "becoming a Doctor",
    "content": "Here are some general links to start your search for information for Canadian and British  British Medical Association BMA House Tavistock Square London WC1H 9JP Tel: 020 7387 4499 Fax: 020 7383 6400 Email: info.web@bma.org.uk   Canadian Federation of Medical Students National Office 130 Slater Street, Suite 750 Ottawa, ON K1P 6E2 Canada Tel: (613) 565-7740 Fax: (613) 594-8705\n\n",
    "posted_time": "Post  by Rhonda P, CEP » Sat Mar 26, 2005 11:21 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=11387&sid=68085dc9a59b2ed0dd8f712280430888#p11387"
  },
  {
    "author": "isthedrin  Guest Posts: 9 Joined: Sun Oct 05, 2003 7:42 pm Location: near st. louis, mo",
    "title": "Can old dogs learn new tricks?",
    "content": "Hello, I graduated from college in 2000 with a 4-yr degree in Eglish/creative writing. Over the past few years I've seriously given some thought to going into medicine. (I'm 27--I know it's a  late to make such a drastic change in life--maybe unrealistic even. As an undergrad, medicine was the farthest thing from my mind so I have very few of the required courses needed for med school admission. However, I did have great grades, etc, including in the science and math courses I did take (In college I had only zoology, algebra and stats that would relate to medicine, although in high school I had gen chem, biology, anatomy/physiology, physical science, etc.) My question is--what would be the most practical way to get on a \"fast track to medicine\"  at this stage in my life? I know I need to start by taking chem 1 and 2, physics 1 and 2, biology 1 and 2, and organic chem 1 and 2. But what would be the best way to get these classes--do med schools accept community college or CLEP credits? Or should I take these classes at a 4-year university to be competitive? Also, anyone know of med school programs designed for people who have BAs in something else? Thanks for any info along these lines\n\n",
    "posted_time": "Post  by isthedrin » Sun Mar 06, 2005 4:47 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=10451&sid=68085dc9a59b2ed0dd8f712280430888#p10451"
  },
  {
    "author": "thaovan  Guest Posts: 1 Joined: Mon Mar 21, 2005 2:11 pm Location: Santa Monica, California",
    "title": "[no title]",
    "content": "Hi,  I've been thinking of going to medical school too, and I found the following website to be a great starting point for my research:  http://services.aamc.org/postbac/   It allows you to search for postbaccalaureate pre-medical programs in the USA, even allowing you to narrow your search to programs for career-changers, such as yourself.  Good luck!\n\n",
    "posted_time": "Post  by thaovan » Mon Mar 21, 2005 3:13 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=11183&sid=68085dc9a59b2ed0dd8f712280430888#p11183"
  },
  {
    "author": "premed16  Guest Posts: 2 Joined: Wed Feb 09, 2005 12:45 am Location: Canada",
    "title": "High School student here,",
    "content": "Hello. I'm currently in grade 11 and thinking a lot about what I want to have as a career when I'm older. I truly want to be a doctor, but I'm not sure about my capabilities academically. I'm one of those people who procrastinates until the last minute. I'm not getting the best grades I could be. I'm getting about 3 or 4 A's, and 4 B's at the halfway mark for the year. I'm taking 3 sciences. Chem 11, Bio 11, and Physics 11.  I'm aware that our GPA has to be in the high 90's to become a doctor, and I need advice. Also, I know that it's very expensive to become a doctor. My family is financially unstable at the moment, and I don't know how I will pay for everything. I could take a big loan, which I'm planning on doing. Do you think it's hopeless for me to want to be a doctor with my grades being so low and my financial situation? I know that it's a very long and challenging process, but I'm willing to do it. I truly am. If you know, do I have to take Physics 12 and Calculus in high school? I'm really wondering what I need to do.   I enjoy helping people so much, and that truly must be the greatest feeling in the world.. to have the ability to heal. I haven't even started volunteering yet at hospitals. I haven't really done anything at this point. Can you give me some pointers on what I should do at this point? Like volunteering at hospitals? What else could I do? If you could help me out it would be great. I live in Canada, not the US, by the way. Thanks for your time.\n\n",
    "posted_time": "Post  by premed16 » Wed Feb 09, 2005 12:58 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=9089&sid=68085dc9a59b2ed0dd8f712280430888#p9089"
  },
  {
    "author": "dlugose  Guest Posts: 38 Joined: Tue Feb 22, 2005 6:08 pm Gender: Male Location: Boulder, CO, USA",
    "title": "Re: High School student here,",
    "content": "Gee, 3 sciences at once?  Is that kind of unusual there as it would be in the US? You say you procrastinate.  Is that just a motivation thing, or is it possible you both have ADHD but do pretty well because you are gifted (as I was)? You seem to have enough science background for your level; in college diversify, satisfy other curiosities, follow various interests so you can find studying more interesting and raise your average, while keeping up with how much science most other pre-meds take. Borrowing is feasible if you are going to make it into med school AND if you will love medicine so much that you don't mind paying a big chunk of your income on college loans.  Volunteer in hospitals both to make sure you are realistic about your interests and to diversify your applications when you get to med school.  Also learn in the hospital more about what other health care workers do, partly because there are too many applicants for med school. premed16 wrote:Hello. I'm currently in grade 11 and thinking a lot about what I want to have as a career when I'm older. I truly want to be a doctor, but I'm not sure about my capabilities academically. I'm one of those people who procrastinates until the last minute. I'm not getting the best grades I could be. I'm getting about 3 or 4 A's, and 4 B's at the halfway mark for the year. I'm taking 3 sciences. Chem 11, Bio 11, and Physics 11.  I'm aware that our GPA has to be in the high 90's to become a doctor, and I need advice. Also, I know that it's very expensive to become a doctor. My family is financially unstable at the moment, and I don't know how I will pay for everything. I could take a big loan, which I'm planning on doing. Do you think it's hopeless for me to want to be a doctor with my grades being so low and my financial situation? I know that it's a very long and challenging process, but I'm willing to do it. I truly am. If you know, do I have to take Physics 12 and Calculus in high school? I'm really wondering what I need to do.   I enjoy helping people so much, and that truly must be the greatest feeling in the world.. to have the ability to heal. I haven't even started volunteering yet at hospitals. I haven't really done anything at this point. Can you give me some pointers on what I should do at this point? Like volunteering at hospitals? What else could I do? If you could help me out it would be great. I live in Canada, not the US, by the way. Thanks for your time.\n\n",
    "posted_time": "Post  by dlugose » Wed Feb 23, 2005 7:35 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=9876&sid=68085dc9a59b2ed0dd8f712280430888#p9876"
  },
  {
    "author": "premed16  Guest Posts: 2 Joined: Wed Feb 09, 2005 12:45 am Location: Canada",
    "title": "[no title]",
    "content": "Yeah, it is kind of unusual to take the sciences at once here too. Everyone thinks I'm insane for taking all 3. Even I thought I wouldn't be able to do it, but half way into the year... it's not so bad. I've adjusted to it. For the procrastination... it's not so much motivation as it is laziness. When I start studying, I'm on a role. But it's getting into the position of starting that's my problem. However, I finally realized that I need to stop procrastinating in order to get some better marks... I have a GPA of 84% for term one. That's when I wasn't really applying myself and putting things off till the last minute. This term, I'm actually starting to study whenever I can and I actually care about future tests. I guess that's the first step right?    I still haven't started volunteering at hospitals, but you're right, I think I should start now so I know for sure that that's the kind of environment I want to work in. It would be such a waste for me to be all set to go into medicine and then realize that I don't even like it. I don't think that'll happen though, because I can't imagine NOT wanting to go into that field. I realize that there are a huge number of applicants for med school, and that's kind of the only thing that is holding me back. I don't want to study in this field for 4 years only to be shut down. That's a good idea, to learn what other health care workers do. I will definitely keep an open mind. Thank you very much for your advice, I will certainly take all what you said into consideration.\n\n",
    "posted_time": "Post  by premed16 » Fri Feb 25, 2005 7:20 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=9957&sid=68085dc9a59b2ed0dd8f712280430888#p9957"
  },
  {
    "author": "Wondering",
    "title": "Pre-Med and Choices",
    "content": "Hi, I am a senior undergrad applying to med schools and writing the personal statement is driving me crazy. Is there anything you could recommend?\n\n",
    "posted_time": "Post  by Wondering » Thu Jul 03, 2003 9:33 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1062&sid=68085dc9a59b2ed0dd8f712280430888#p1062"
  },
  {
    "author": "happylouyear  Guest Posts: 3 Joined: Mon Feb 14, 2005 8:44 pm Location: Montreal, Qubec, Canada",
    "title": "[no title]",
    "content": "Hi,  i am a 4th year medical student in Montréal, Qc, Canada.  My best advice concerning your personal statement is be honest about everything you put down. Chances are you will have to discuss what you wrote in your interviews, so you better have something to say about the experiences you talk about.   Do not hesitate to talk about your accomplishments other than academics. It will show your wholeness as an individual. Talk about the volleyball team in which you've been for so long and how you exerced your leadership in that team... etc.   Most importantly, be yourself!  Good luck.\n\n",
    "posted_time": "Post  by happylouyear » Mon Feb 14, 2005 8:53 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=9410&sid=68085dc9a59b2ed0dd8f712280430888#p9410"
  },
  {
    "author": "Socalemt",
    "title": "Premed",
    "content": "who has the better pre-med program, UCLA or USC and which school of medicine is better.\n\n",
    "posted_time": "Post  by Socalemt » Sat Jan 04, 2003 6:19 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=85&sid=68085dc9a59b2ed0dd8f712280430888#p85"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "which one?",
    "content": "I am so sorry i really have no idea but i will try to find out and reply later. thanx\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Tue Jan 07, 2003 12:24 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=106&sid=68085dc9a59b2ed0dd8f712280430888#p106"
  },
  {
    "author": "elias  Guest Posts: 15 Joined: Tue Jan 18, 2005 3:40 am Location: Torrance, CA  Contact:   Contact elias       AOL",
    "title": "[no title]",
    "content": "UCLA\n\n",
    "posted_time": "Post  by elias » Tue Jan 18, 2005 3:43 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8254&sid=68085dc9a59b2ed0dd8f712280430888#p8254"
  },
  {
    "author": "Sanddpm@aol.com",
    "title": "Survey:Reasons I Chose To Become A Physician",
    "content": "To all doctors and pre-med students. Would you please help me in my research by replying to the one or two questions below? It would be greatly appreciated and provide future students with realistic expectations regarding the practice of Medicine in 2003. Thank You!!!! Please send responses to Sanddpm@aol.com. Feel free to request results of mini poll.          1) This question is for pre-med students and all Medical Doctors  What are or were, your reasons for wanting to become a physician? (List as many letters that apply and in order of most important) A-independence B-high income C-respect  D-power to help people  E-not sure  F-other =======                    2.) These 2 questions are for Doctors who've been out of residency 3 years or less Now that you are practicing medicine, which of the following if any, do you feel dissapointed by it's actual level of presence in the field? (List as many letters that apply and in order of most dissapointed.  ) A- independence B-Income C-respect D-Power to help People  E-none apply F-other =======  If you knew then what you know now, would you have chosen a different career path? Y N\n\n",
    "posted_time": "Post  by Sanddpm@aol.com » Sun Jun 29, 2003 12:50 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1044&sid=68085dc9a59b2ed0dd8f712280430888#p1044"
  },
  {
    "author": "Guest",
    "title": "[no title]",
    "content": "1) 1-d 2-c 3-a\n\n",
    "posted_time": "Post  by Guest » Mon Jul 07, 2003 9:55 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1079&sid=68085dc9a59b2ed0dd8f712280430888#p1079"
  },
  {
    "author": "noura  Guest Posts: 1 Joined: Mon Jul 07, 2003 9:50 am Location: uae",
    "title": "[no title]",
    "content": "1) d, c, f: i like to work with people and hate office work\n\n",
    "posted_time": "Post  by noura » Mon Jul 07, 2003 9:59 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1080&sid=68085dc9a59b2ed0dd8f712280430888#p1080"
  },
  {
    "author": "Rei  Guest Posts: 1 Joined: Tue Aug 03, 2004 12:25 am Location: Philippines",
    "title": "[no title]",
    "content": "1)   a   d    c\n\n",
    "posted_time": "Post  by Rei » Tue Aug 03, 2004 12:37 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=4353&sid=68085dc9a59b2ed0dd8f712280430888#p4353"
  },
  {
    "author": "TheShoelessWonder  Guest Posts: 8 Joined: Mon Nov 22, 2004 2:17 am Location: Edmonds, WA  Contact:   Contact TheShoelessWonder       AOL",
    "title": "too late?",
    "content": "hmm i realize this may be a little late, but i'd have to say D and F (I too love working with people and know I would abhor office work).  had some issues and now must go out and do something about them in the world ^_^. I'm still in senior year of high school, but I've known where I'm going since I was a kid\n\n",
    "posted_time": "Post  by TheShoelessWonder » Tue Nov 23, 2004 11:56 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6653&sid=68085dc9a59b2ed0dd8f712280430888#p6653"
  },
  {
    "author": "redpepper  Guest Posts: 2 Joined: Sun Nov 07, 2004 2:19 pm Location: U.K",
    "title": "Advice Needed!",
    "content": "Hi,  Im interested in becoming a doctor, and having stayed in hospital recently I very keen to work in a hospital environment in the future. I was wondering if anyone could give me any advice on Alevels to take and anything I could do to ensure a place in medical school. Also if I would be interested to know anyones experiences of working in a hospital. Thanx    Marissa x\n\n",
    "posted_time": "Post  by redpepper » Sun Nov 07, 2004 2:27 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6333&sid=68085dc9a59b2ed0dd8f712280430888#p6333"
  },
  {
    "author": "Dr. A. Saif  Medical Doctor Posts: 101 Joined: Mon Oct 25, 2004 1:56 pm Location: UK  Contact:   Contact Dr. A. Saif       Yahoo Messenger",
    "title": "[no title]",
    "content": "Hi Marissa,  I am pleased you wish to become a doctor.  It is a very rewarding, if also a very demanding profession, and hope that you are able to fulfill your ambitions.  Most Universities require science at A level.  The order of preference at A level is generally felt to be Chemistry, Biology, Physics and Mathematics.  If your A'levels includes three of these then you will stand a good chance.   The grdes you reqire generally are at least one A and a couple of Bs.  However you just need to show (according to your GCSEs and your teachers report) the potential to reach these grades to get an offer.  Certainly at GCSE you would have to have sciences, mathematics and English, and perhaps something that suggest a breadth of knowledge.    If you apply to Oxford or Cambridge, they have their own tests that bypass the A'level to some extent.    Other critical factors that you can do to make yourself a better candidate,  in any field really, are things like Edinburgh Awards, or  Volunteering, or an expertise in Computing etc.  This helps the selectors sort out the huge numbers of applicants that try for Medicine.  This way is effectively the fast track for getting into medicine, and the way the vast majority .  If you wish there are alternative pathways, and I am happy to discuss this with you if you want.  However my one advice is that if you wish to get into Medicine, get into it for the right reasons, and go into it with yor eyes open.  Medicine can be stressful, and a lot of hard work both in the University studying, and afterwards trying to carve a career for yourself.  It is however a very rewarding, prestigious and I believe,  honourable  profession.  Regrds  Saif\n\n",
    "posted_time": "Post  by Dr. A. Saif » Mon Nov 08, 2004 1:14 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6348&sid=68085dc9a59b2ed0dd8f712280430888#p6348"
  },
  {
    "author": "redpepper  Guest Posts: 2 Joined: Sun Nov 07, 2004 2:19 pm Location: U.K",
    "title": "Thanks",
    "content": "Dr. Saif  Thank you so much for your response and for taking the time to answer. I have found your advice most helpful and it has inspired me to work hard and pursue my chosen career of medicine.  Best wishes  Marissa\n\n",
    "posted_time": "Post  by redpepper » Tue Nov 09, 2004 10:18 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6365&sid=68085dc9a59b2ed0dd8f712280430888#p6365"
  },
  {
    "author": "Dr. A. Saif  Medical Doctor Posts: 101 Joined: Mon Oct 25, 2004 1:56 pm Location: UK  Contact:   Contact Dr. A. Saif       Yahoo Messenger",
    "title": "[no title]",
    "content": "Dear Red Pepper,  Good luck, hope to be working with you once you become one of our colleagues!  Saif\n\n",
    "posted_time": "Post  by Dr. A. Saif » Sat Nov 13, 2004 1:54 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6423&sid=68085dc9a59b2ed0dd8f712280430888#p6423"
  },
  {
    "author": "bermejo02  Guest Posts: 3 Joined: Tue Apr 06, 2004 9:29 am Location: Orlando  Contact:   Contact bermejo02       AOL",
    "title": "Help!!!",
    "content": "Looking for money to pay for my school. It is a private school, and I am struggling to pay it. I was fired becuase of a misunderstading at my job. At this job I scanned in medical documents and Mammogramographic information. Now I can't find a job and I need to pay my school bills. I am planning to go into the medical field when I start college.  Any help would be GREATLY APPRECIATED.\n\n",
    "posted_time": "Post  by bermejo02 » Tue Apr 06, 2004 9:33 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3024&sid=68085dc9a59b2ed0dd8f712280430888#p3024"
  },
  {
    "author": "Dr. Russell M  Medical Doctor Posts: 650 Joined: Mon Jun 09, 2003 12:34 pm Location: USA",
    "title": "[no title]",
    "content": "Hi!  Am sorry I can't be of more help. But am sure you'll find a way out.   My best to you.  bill\n\n",
    "posted_time": "Post  by Dr. Russell M » Mon Apr 12, 2004 6:43 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3061&sid=68085dc9a59b2ed0dd8f712280430888#p3061"
  },
  {
    "author": "Jenniec  Guest Posts: 30 Joined: Fri Feb 06, 2004 1:51 am Location: ID  Contact:   Contact Jenniec       Yahoo Messenger",
    "title": "tired",
    "content": "Right now I am taking some Med classes. Our program is quite rigorous, and we don’t get a lot of time off, furthermore I have a job 4am-7am (part time). In between the hospital clinical and studying I haven’t been able to get a lot of sleep and am having a hard time trying to get through school. I get ill but I can’t just stop because falling behind really isn’t an option. Yet, its kind of sad when I’m in a clinical and I start feeling faint and have to sit down because I haven’t gotten enough sleep or couldn’t get time off yet to eat. What would you suggest that I do to do well in my classes, go to all my clinics, work and still be healthy?\n\n",
    "posted_time": "Post  by Jenniec » Fri Feb 06, 2004 2:13 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2408&sid=68085dc9a59b2ed0dd8f712280430888#p2408"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "I personally think your trying to accomplish the impossible. The job may have to go. Did you try finding a job on campus. Some universities have student programs designed to support students by giving them work to do on campus.   Good luck!\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Fri Feb 06, 2004 2:38 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2410&sid=68085dc9a59b2ed0dd8f712280430888#p2410"
  },
  {
    "author": "Jenniec  Guest Posts: 30 Joined: Fri Feb 06, 2004 1:51 am Location: ID  Contact:   Contact Jenniec       Yahoo Messenger",
    "title": "Thanks",
    "content": "Thanks for your suggestion. I think I will be quitting my job soon, do you think there are other jobs that would work with med classes? Or do you think that a loan would be a better idea?\n\n",
    "posted_time": "Post  by Jenniec » Fri Feb 06, 2004 2:59 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2411&sid=68085dc9a59b2ed0dd8f712280430888#p2411"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "I'm glad that your considering dropping the job. With campus jobs its just a matter of timing. If its not compatible with your program then it wont work. Eitherwise if it is compatible then anything would do fine. It doesn't matter what the nature is. Maybe you can try discussing an alternative with them.   Otherwise you may try looking for a job outside campus. If you are really lucky you can get a job assisting a doctor in his private clinic. While you ofcourse will not be elegible to prescribe medication or examine patients, there are lots of other things you can assist with especially in a busy clinic. If given the choice I would choose a specialty I am interested in or if I haven't made my mind up yet then something really general e.g. Internal medicine, a family doctor (general practitioner) to give one a broad perspective about medicine in general. It will be very informative and they usually pay well too     I personally don't like loans, especially ones I am not sure I will be able to pay. But that's just me.  Good luck and always keep a positive attitude during these hard times!\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Fri Feb 06, 2004 5:19 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2412&sid=68085dc9a59b2ed0dd8f712280430888#p2412"
  },
  {
    "author": "Jenniec  Guest Posts: 30 Joined: Fri Feb 06, 2004 1:51 am Location: ID  Contact:   Contact Jenniec       Yahoo Messenger",
    "title": "Sleep",
    "content": "Quick question: How much sleep is enough? to go to school, and function?\n\n",
    "posted_time": "Post  by Jenniec » Fri Feb 06, 2004 10:08 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2422&sid=68085dc9a59b2ed0dd8f712280430888#p2422"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Ideally it would be 8 hours. Some need less (6 1/2 hours) while some may need more (9 hours). The important question to ask yourself is \"Do I wake up feeling refreshed and energetic?\". If the answer is no then you are probably sleeping too little.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Sat Feb 07, 2004 2:23 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2425&sid=68085dc9a59b2ed0dd8f712280430888#p2425"
  },
  {
    "author": "Jenniec  Guest Posts: 30 Joined: Fri Feb 06, 2004 1:51 am Location: ID  Contact:   Contact Jenniec       Yahoo Messenger",
    "title": "[no title]",
    "content": "Thanks, and FYI I did drop my job\n\n",
    "posted_time": "Post  by Jenniec » Tue Feb 10, 2004 1:25 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2455&sid=68085dc9a59b2ed0dd8f712280430888#p2455"
  },
  {
    "author": "emergencyroomdoc  Guest Posts: 1 Joined: Tue Dec 02, 2003 7:17 pm",
    "title": "Info on becoming a doctor",
    "content": "Hi everyone, I was wondering what courses do i need to take if i major to be an ER doctor and minor in Psychology? How long do you think it will take until i get paid? I'd appreciate any information. Well, have a great day and God Bless!  ~Brandy\n\n",
    "posted_time": "Post  by emergencyroomdoc » Tue Dec 02, 2003 7:23 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1806&sid=68085dc9a59b2ed0dd8f712280430888#p1806"
  },
  {
    "author": "Dr. Jeffrey Gordon  Medical Doctor Posts: 127 Joined: Sun Jan 05, 2003 5:22 pm",
    "title": "Becoming a doctor",
    "content": "It is good hear that someone wants to become a doctor.  I am not an emergency room physician, so i do not know first-hand what is needed or required to apply to such a training program.  In general, to apply to a medical school, one needs to complete all of the require pre-med courses at an university or college.  Once in medical school, then the basic curriculum is needed.  You may want to talk with emergency room doctors to learn more specifics.  Jeffrey A. Gordon, M.D.\n\n",
    "posted_time": "Post  by Dr. Jeffrey Gordon » Mon Jan 19, 2004 10:30 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2210&sid=68085dc9a59b2ed0dd8f712280430888#p2210"
  },
  {
    "author": "hp  Guest Posts: 1 Joined: Sun Jan 12, 2003 10:35 am Location: sidney  Contact:   Contact hp       Yahoo Messenger   AOL",
    "title": "thanks for helping me decide what i should be",
    "content": "thanks to the people that replied to my question i appreciate it and i hope that it will help me decide what i want to be. I think that since i am only a high school student that maybe i will go to our local hospital and talk to some of the doctors. My aunt is an optometrist and my mother is an LPN so i can always talk to some of there friends that they work with. thanks again hp\n\n",
    "posted_time": "Post  by hp » Sun Jan 12, 2003 10:44 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=126&sid=68085dc9a59b2ed0dd8f712280430888#p126"
  },
  {
    "author": "thedocto  Medical Doctor Posts: 1 Joined: Thu Dec 26, 2002 6:36 pm",
    "title": "Re: What would i like to be",
    "content": "Dear Hp, First of all you have to answer the question: would you like to deal with patients or do you want to teach medicine or do you want to do medical research? A researcher is more or less like any other scientist he usually doesnt have anything to do with patients. A teacher of medicine could be both a clinical doctor and university professor, or he could be a teacher of academic medical sciences such as anatomy. A clinical doctor, like the ones you see on ER are responsible for patient care (they are also the ones that take night shifts). So lets start from here, ok?\n\n",
    "posted_time": "Post  by thedocto » Sun Jan 12, 2003 4:30 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=127&sid=68085dc9a59b2ed0dd8f712280430888#p127"
  },
  {
    "author": "Ms. Yui",
    "title": "It starts from within!",
    "content": "Hey Hp. I think to be a good doctor - you need to prepare yourself for everything.  First you start with being a good student.  You can only be a good student if you are a good teacher.  That means - you can teach other people what you have learned.  You can't really be a good teacher - if you don't Practice what you Preach. So to be a good teacher - you need to have experience. To have experience you have to be on the field. (as in the hospital or in any medical environment.)   See? Its linked all together - after which - you can figure out what - or where you want to concentrate more.   Hope I helped in some way.  I am still a student myself - planning to teach - and practice as well.\n\n",
    "posted_time": "Post  by Ms. Yui » Mon Jan 27, 2003 5:53 am",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=166&sid=68085dc9a59b2ed0dd8f712280430888#p166"
  },
  {
    "author": "nurseAngie",
    "title": "Question",
    "content": "Can one jump from being an LPN to a PA(phys. Asst) ?  This question is from a friend of mine.  She is a new LPN grad and she wants to become a PA not a NP (nurse Practitioner) What is the difference? Should she go on for at least an ADN before trying PA?  Thanks\n\n",
    "posted_time": "Post  by nurseAngie » Tue Mar 25, 2003 4:43 pm",
    "category": "Medical Students",
    "sub_category": "Becoming a Medical Student",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=567&sid=68085dc9a59b2ed0dd8f712280430888#p567"
  }
]