[
  {
    "author": "mskyy22  Guest Posts: 1 Joined: Fri Jul 23, 2010 12:25 pm Gender: Female",
    "title": "Lab results: Fish-Bladder Cancer",
    "content": "I was sent to Duke Health Center two months ago. I was having pains and my urine smelled different. They took a sample of my urine and scheduled a follow up visit, which is next week. I registered to there online health portable and was able to view the lab results. The first lab was my urinalysis that stated my WBC was 6 and Squamous Epithelial cell is 5...the next lab stated Fish-Bladder Cancer and said refer to image but there was no image that I could see. Can someone tell me what this means.  Sincerely, Confused\n\n",
    "posted_time": "Post  by mskyy22 » Fri Jul 23, 2010 12:32 pm",
    "category": "Oncology",
    "sub_category": "Bladder Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=98335&sid=a411861eb707bd150816cf685b2c7c07#p98335"
  },
  {
    "author": "Dr.M.jagesh kamath  Medical Doctor Posts: 1303 Joined: Mon Aug 03, 2009 7:24 am Gender: Male",
    "title": "Re: Lab results: Fish-Bladder Cancer",
    "content": "Hello,I guess you got it all wrong! FISH (UroVysion assay) UroVysion is a fluorescence in situ hybridization assay that was developed for the detection of bladder cancer in urine specimens.It detects chromosomal abnormalities in cells suspected for from the urinary bladder in voided urine specimens.Those with gross bleeding in urine,or microscopic hematuria may be subjected to this test for diagnosis.So do not worry and come to conclusions. Cheers!\n\n",
    "posted_time": "Post  by Dr.M.jagesh kamath » Sun Aug 15, 2010 2:58 am",
    "category": "Oncology",
    "sub_category": "Bladder Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=100910&sid=a411861eb707bd150816cf685b2c7c07#p100910"
  },
  {
    "author": "Dodge  Guest Posts: 1 Joined: Fri Jan 01, 2010 12:17 pm Gender: Male",
    "title": "Urachal growth",
    "content": "In September 2009 I ended up in the hospital with pain--turned out to be kidney stones.  The scan that was done showed I had an enlarged urachal.  In October I had a procedure when they went up and bioposied it from the inside of the bladder, the cells and muscle wall showed no cancer.  The dr. sent me for an MRI and he suggested we would continue to monitor the part sticking out of the bladder...but after discussion, as I am a Remicade patient we have decided to have the surgery and cut it out now.  It is very dificult to find information, are urachal and bladder cancer the same thing?  Does urachal cancer turn into bladder cancer?  Is it possible to have this growth and not have cancer?  I also have colitis and  have been on remicade for 1 year...my GI has informed me if this is cancerous, I would have to stop remicade and move towards having my colon removed.  I am 39 year old male, healthy (besides the colitis -- I've only had one major flare in 10 years, last year that led to the remicade.)  thank you.\n\n",
    "posted_time": "Post  by Dodge » Fri Jan 01, 2010 12:29 pm",
    "category": "Oncology",
    "sub_category": "Bladder Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=90454&sid=a411861eb707bd150816cf685b2c7c07#p90454"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: Urachal growth",
    "content": "Hi, The urachus, is a midline tubular structure that extends upward from the dome of the urinary bladder to the umbilicus in fetal life.  The tubular urachus normally involutes prior to birth, only remaining as a fibrous vestigial remnant with no known function(median umbilical ligament).    Histologically,it is a three-layered tubular structure, with the innermost layer being lined by transitional epithelium in 70% of cases and with columnar epithelium in 30%. This is surrounded by connective tissue and an outermost muscular layer in continuity with the detrusor muscle of the urinary bladder.  Diseases associated with persistent urachus are relatively rare. Congenital urachal anomalies are more common in men than in women(2:1).   There are four basic types of congenital urachal anomalies: a patent urachus, umbilical-urachal sinus, vesicourachal diverticulum, and urachal cyst.  Vesico-urachal diverticulum(more relevant from point of view of your problem) - Here,the urachus communicates only with the bladder dome. This condition results when the bladder end of the urachus fails to close. This lesion tends to manifest in patients with chronic bladder outlet obstruction and may be complicated by urinary tract infection, intra-urachal calculus formation, and an increased prevalence of carcinoma after puberty.  Benign urachal neoplasms are extremely rare; however, they are important as they mimic urachal malignancies.Malignant urachal neoplasms are also rare, representing <0.5% of all bladder cancers. Although the persistent urachus is most commonly lined by the transitional epithelium, urachal carcinoma predominantly manifests as adenocarcinoma (in approx 90% of cases), probably due to the metaplasia of the urachal mucosa into columnar epithelium followed by malignant transformation or due to the fact that in about 30% of cases(as alluded to earlier), urachal mucosa may be lined by columnar epithelium. These tumors are most commonly seen in patients 40–70 years of age.  95% of the primary bladder neoplasms are transitional cell carcinomas. These usually arise from the lateral walls of the urinary bladder(47%) or from the trigone(21%).  Adenocarcinomas arising from the urinary bladder are rare(3% of all bladder cancers).They usually arise from the bladder trigone.  Urachal carcinomas arise in the juxtavesical portion of the urachus and extend upward (in the perivesical space) towards the umbilicus and downwards through the bladder wall . Thus, urachal carcinomas may be confused with primary tumors of the bladder dome.  A CT scan or an MRI will usually be able to differentiate between a tumor arising from the urachus from a primary bladder tumor. Good luck!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Mon Feb 22, 2010 4:43 am",
    "category": "Oncology",
    "sub_category": "Bladder Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=91880&sid=a411861eb707bd150816cf685b2c7c07#p91880"
  },
  {
    "author": "Angie  Guest Posts: 1 Joined: Mon Aug 08, 2005 3:26 am Location: Egypt",
    "title": "Hiccups After Chemotherapy",
    "content": "My dad has Grade 3 bladder tumor, with metastases in the lungs.  He is now under chemotherapy treatment.  He has taken the 3rd dose.  Since the administration of the 3rd dose he has been suffering from recurring hiccups, every 15 minutes.  The hiccups are severe and shake his whole body.\n\n",
    "posted_time": "Post  by Angie » Mon Aug 08, 2005 3:48 am",
    "category": "Oncology",
    "sub_category": "Bladder Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=18301&sid=a411861eb707bd150816cf685b2c7c07#p18301"
  },
  {
    "author": "indigo36d  Guest Posts: 7 Joined: Fri Dec 10, 2004 11:09 pm",
    "title": "resolving hiccups",
    "content": "I've often seen oral or IV thorazine prescribed for hiccups that don't espond to other non pharmacologic ( using medications) efforts to control them.  try having him hold his breath for 10 seconds then, take a drink of water before breathing in.  If nothing else works his doctor should be able to order some thorazine.  I'ts typically thought of as a psycotropic medication but is very useful for hiccups.  Nina Koch RN OCN\n\n",
    "posted_time": "Post  by indigo36d » Tue Sep 13, 2005 2:30 pm",
    "category": "Oncology",
    "sub_category": "Bladder Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=20525&sid=a411861eb707bd150816cf685b2c7c07#p20525"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: Hiccups After Chemotherapy",
    "content": "Hi, To the best of my knowledge,hiccups is not a reported side effect of chemotherapy agents used for bladder cancer.They do produce nausea and vomiting.  It is posssible that the hiccups may be related to his renal function which needs to be looked into. Best wishes!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Mon Dec 07, 2009 12:10 am",
    "category": "Oncology",
    "sub_category": "Bladder Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=88316&sid=a411861eb707bd150816cf685b2c7c07#p88316"
  },
  {
    "author": "hello xxxx  Guest Posts: 1 Joined: Tue Nov 04, 2008 6:25 am Gender: Female",
    "title": "lower abdominal pains",
    "content": "i am 18 years old and have been experiencing lower abdominal pains for the past 2/3 months, i have also felt bloated quite often and keep needing the toilet for a wee. i don't know what to do but am quite worried can you halp me ???\n\n",
    "posted_time": "Post  by hello xxxx » Tue Nov 04, 2008 6:31 am",
    "category": "Oncology",
    "sub_category": "Bladder Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=63116&sid=a411861eb707bd150816cf685b2c7c07#p63116"
  },
  {
    "author": "Shelly Hoppe EMTP  Paramedic Posts: 11 Joined: Tue Oct 28, 2008 10:11 pm Gender: Female",
    "title": "Re: lower abdominal pains",
    "content": "Greetings Hello,  You may be experiencing a urinary tract infection.  Urinary tract infection can have many different symptoms.  Cloudy/smelly urine, full heavy feeling in bladder, low back (achy) pain, pain in bladder at the end of urination are all classic symptoms.  This is something that if not treated can become Pyelonephritis which means the infection has spread to your kidneys and can make you very very sick.  You need to go see a doctor Hello.  If you don't have a regular doctor, go to the nearest Urgent Care clinic.  If you develop a fever or your symptoms worsen go the the Emergency Room at your local hospital.  This is not something to ignore call your doctor.\n\n",
    "posted_time": "Post  by Shelly Hoppe EMTP » Wed Nov 05, 2008 7:29 pm",
    "category": "Oncology",
    "sub_category": "Bladder Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=63262&sid=a411861eb707bd150816cf685b2c7c07#p63262"
  },
  {
    "author": "scojo641213  Guest Posts: 2 Joined: Thu Sep 18, 2008 7:22 pm Gender: Female",
    "title": "Fingerlike protrusions in the bladder",
    "content": "In the past few months I have been plagued with urinary tract infections.  My physician gave me a cat-scan that showed nothing.  Today I underwent a scope of my bladder.  The physician found a finger-like protrusion inside my bladder.  He has scheduled a biopsy of the protrusion next month.  I have researched this on the internet and all information suggest bladder cancer.  Are these protrusions always malignant?  If not, what are some other conditions that these might be?\n\n",
    "posted_time": "Post  by scojo641213 » Thu Sep 18, 2008 7:40 pm",
    "category": "Oncology",
    "sub_category": "Bladder Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=60940&sid=a411861eb707bd150816cf685b2c7c07#p60940"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "Re: Fingerlike protrusions in the bladder",
    "content": "Hello, Bladder polyps are growths in the superficial layer of the bladder. They may be symptomatic causing cystitis and bleeding or asymptomatic.   Polyps can be benign or malignant. The only way to differentiate between them is through transurtheral resection TUR and pathological examination.  Causes of most benign and cancerous bladder polyps is unknown and risk factors include smoking and exposure to certain chemicals.   Bladder cancer is not common in adults under age 55 and men are frequently affected than women.    Benign bladder polyps may require only complete resection while the standard treatment in malignant (superficial non invasive) cases is repeat transurethral resection TUR. However, according to the depth of invasion and grade, intravesical therapy with bacillus Calmette-Guérin (BGC) or mitomycin (MMC) may be recommended.    I advise you to follow up with your doctor and to go for cystoscopy and biopsy for proper management. Please keep us updated. Best regards.\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Thu Oct 09, 2008 12:37 pm",
    "category": "Oncology",
    "sub_category": "Bladder Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=62010&sid=a411861eb707bd150816cf685b2c7c07#p62010"
  },
  {
    "author": "scojo641213  Guest Posts: 2 Joined: Thu Sep 18, 2008 7:22 pm Gender: Female",
    "title": "Re: Fingerlike protrusions in the bladder",
    "content": "Thank you so much Dr. Mahmoud!  I guess I need to ask more questions of my physician instead of doing searches on-line and getting worked up and fearing the worst.  This site is a great service.  Thank you\n\n",
    "posted_time": "Post  by scojo641213 » Thu Oct 09, 2008 9:18 pm",
    "category": "Oncology",
    "sub_category": "Bladder Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=62038&sid=a411861eb707bd150816cf685b2c7c07#p62038"
  },
  {
    "author": "okaythen  Guest Posts: 1 Joined: Sun Dec 23, 2007 12:38 pm",
    "title": "Long-lasting chest pain on left side of body",
    "content": "My name is Jillian and I am 18 years old.  I'm not exactly up to date on my family's health history, however I know that heart problems are somewhat common on my father's side and bladder issues are very common on my mother's.  Also, my grandmother just recently died from breast cancer that spread to her liver, because it was discovered very late.   Just recently, four days ago, a chest pain has developed within me.  It is on the left side of my body, and it wraps around to my back.  I guess you could say it is a tight feeling.  It feels as though there is something heavy in my chest cavity, around the area where my heart is.  It almost feels like a hunger pain in my heart.  It seems to also affect my arm, but I'm not sure that it does as I have been going through a lot of random, strange pains lately.  But  it started, out of nowhere, and has continued every day since it began.  It is not constant, however.  It appears about an ahour after I wake up, continutes throughout the day (for about 8 hours) and then sort of goes away at night, only to happen again the next day.    It is hard to tell whether or not it feels  more like it is heart or lung related, though i just had an EKG and the doctor told me it was normal.  I also had a chest x-ray that came out normal, as well.    I've noticed that I've been weak feeling and tired lately.  But I am worried as to what this could be, since it affects me to the point of being unable to work.  I have not been overly stressed out until this began, so i don't see it as being caused by stress.  i would just like to have an idea as to what i should do about it, since it affects me every day.  what type of doctor should i go see for it?  how can i figure out what it is?\n\n",
    "posted_time": "Post  by okaythen » Sun Dec 23, 2007 1:51 pm",
    "category": "Oncology",
    "sub_category": "Bladder Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=51895&sid=a411861eb707bd150816cf685b2c7c07#p51895"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "Re: Long-lasting chest pain on left side of body",
    "content": "Hi Jillian,  There are quite a number of things that could be causing your symptoms.  In an 18 year old heart pain would be fairly uncommon.  Probably one of the most common causes of symptoms like you are describing is reflux.  There are also several viral infections that can do this.  I would suggest that you see your primary care doctor for a full evaluation.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sun Dec 23, 2007 9:24 pm",
    "category": "Oncology",
    "sub_category": "Bladder Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=51912&sid=a411861eb707bd150816cf685b2c7c07#p51912"
  },
  {
    "author": "nucat78  Guest Posts: 2 Joined: Mon Jan 01, 2007 9:01 am Location: Chicago",
    "title": "Half-brother dx'd with advanced bladder CA",
    "content": "My half-brother,  in his mid sixties, has started chemo following the removal of his bladder and prostate for bladder cancer.  There is no other family history.  Only identified risk factor was that he was a heavy smoker for a number of years.  I am a 51 y.o. male, never smoked, a couple of bouts of prostatitis (PSA was 0.7 a few years back), one non-specific UTI in college.  SInce I am now statistically at a higher risk for bladder CA, what is a prudent course of action for me to take regarding check-ups, etc?  Thank you.\n\n",
    "posted_time": "Post  by nucat78 » Mon Jan 01, 2007 10:00 am",
    "category": "Oncology",
    "sub_category": "Bladder Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=37035&sid=a411861eb707bd150816cf685b2c7c07#p37035"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Hello,  The association between cigarette smoking and BC is well established.     Genetic causes on the other hand is suggested by different studies.   Recent studies examined the additive effects of family history of BC and smoking showed that the risk increased in smokers when they have a family history especially when this family member was diagnosed with bladder cancer before 65 years of age.  Another study suggested also that the disease linked to genetic factor is X-linked that it is more prevalent in females (parental-offspring).  Regarding screening procedure, till now there is inadequate evidence to support that screening for bladder and other urothelial cancers may improve the mortality due to bladder cancer.   I do not think you can be considered at high risk (to my knowledge) and even so screening methods are still investigational.   You better follow up with your family doctor, he might recommend a frequent microscopic examination for urine (urine analysis) which would be adequate as long as you have no symptoms that require more investigations.  Keep us updated. Best regards.\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Mon Jan 01, 2007 7:00 pm",
    "category": "Oncology",
    "sub_category": "Bladder Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=37057&sid=a411861eb707bd150816cf685b2c7c07#p37057"
  },
  {
    "author": "delila  Guest Posts: 1 Joined: Fri May 27, 2005 1:14 pm Location: biloxi mississippi",
    "title": "pain and pressure in left back under rib",
    "content": "diagnosed with bladder cancer Ta and CIS in 2003.  Four TURBTs and 12 BCGs later I have had three clear cystos.  My last cysto was a week ago.  I will begin next BCG in July.  At my cysto last week, I told my doctor of a mild pain I was having in my left back behind my last rib and sometimes at waist level.  It is intermittent, about a 3 to 4 pain level out of 10, does not hurt at night or when I urinate, feels normal in the morning, but begins to hurt after I am up and have eaten.  My cytology was negative.  I had no blood in my urine.  When I exert myself, this hurts more.  When it is hurting more, I feel generally bad...almost sick.  It can come and go in a day, or last a whole day.  It has been happening for about a month.  My uro does not think it is a kidney stone or infection.  He says to wait until my next IVP or CAT scan...which is months away.  I have been taking many vitamins and herbal extracts.  I was afraid that I had developed a kidney stone or ulcer.  I drink at least a gallon of distilled water a day.  This continues to bother me.  I have called my uro back once about it.  He does not seem to be worried.  I am wondering if I should go to my internist to press for finding out what is happening in my back.\n\n",
    "posted_time": "Post  by delila » Fri May 27, 2005 1:40 pm",
    "category": "Oncology",
    "sub_category": "Bladder Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=14291&sid=a411861eb707bd150816cf685b2c7c07#p14291"
  },
  {
    "author": "mwaura  Guest Posts: 4 Joined: Thu Oct 27, 2005 12:47 pm Location: nairobi",
    "title": "[no title]",
    "content": "i think you should be concerned about the pain the most adequate test to go for would be a a urinalysis completee to look for microscopic blood traces and casts which would give a reson to query for kidney stones even before other conclusive investigatios are caried uot also i would advise you to press for an abdominal pelvic ct scan and a chest x ray this would rule ot metastatic desease from youre primary fdesease well after this tests then discuss with youre intern on the best course good luck an wish u all the best cheers\n\n",
    "posted_time": "Post  by mwaura » Thu Oct 27, 2005 1:58 pm",
    "category": "Oncology",
    "sub_category": "Bladder Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=24185&sid=a411861eb707bd150816cf685b2c7c07#p24185"
  },
  {
    "author": "Avarus  Guest Posts: 13 Joined: Wed Apr 27, 2005 3:42 pm Location: Canada",
    "title": "Need to urinate a lot",
    "content": "For the past week or so I have had to urinate a lot like once every 1-1 1/2 hours. Sometimes there will be a lot depending on how much I have drank and sometimes little if I haven't drank much of anything. I don't have any pain and I had my urine dipped as well as looked at by my GP and he said that it was crystal clear and fine.   He said it's probably just stress or anxiety and that I shouldn't worry about it and it will go away eventually. It doesn't seem to be getting worse and sometimes if I get distracted I find I can go 2-3 hours without having to urinate. I also asked if my prozac could be causing it because I had heard that it was one of the side effects but he said no.   Also I am able to sleep 5-7 hours without having to get up and go to the bathroom. (If that is at all relavent)\n\n",
    "posted_time": "Post  by Avarus » Wed Jul 20, 2005 11:13 pm",
    "category": "Oncology",
    "sub_category": "Bladder Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=17167&sid=a411861eb707bd150816cf685b2c7c07#p17167"
  },
  {
    "author": "indigo36d  Guest Posts: 7 Joined: Fri Dec 10, 2004 11:09 pm",
    "title": "[no title]",
    "content": "I wouldn't be concerned that what you are dealing with is neessariiy a malignancy, It appears under Bladder Cancer in the forum.  If the symptoms persist and you are concerned ask your primary care provider to refer you to a urologist for further evaluation.    N Koch RN OCN\n\n",
    "posted_time": "Post  by indigo36d » Tue Sep 13, 2005 2:43 pm",
    "category": "Oncology",
    "sub_category": "Bladder Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=20527&sid=a411861eb707bd150816cf685b2c7c07#p20527"
  },
  {
    "author": "mwaura  Guest Posts: 4 Joined: Thu Oct 27, 2005 12:47 pm Location: nairobi",
    "title": "[no title]",
    "content": "Hello well youre condition is called urinary frequency  it may signal the onset off type 2 diabetes meleitus  which is characterised by increased amount off blood glucose this blood glucose trigers a mechanism caled osmotic diuresis which causes increased urination  . a test of glucose in urine is useles at this point as renal threshhold for glucose hasnt been surpased  so only  a blood glucose  test would be sensitive .also irritation off the baldder mucosa irritation of the blader mucosa may be due to multiple factors the most common is infection of the urinary tract which may may not nessecarily be transmited from person to person by sexual intercoourse but could be due to urinary stasis in the bladder well i would recomend that you start by taking a simple urine test for culture the physician should advise you on taking an appropriate sample called mid stream urine and test it for the ammount off the bacteria present .in women a condition caled cystoceale occurs mainly after childbirth and would cause this. i would also recomend that you relax things are definately going to be okay cheers . i recomend the following tests. random blood glucose. abdominal pelvic ultrasound.\\ cystourethrograpy mid stream urine fro culture and sensitivity\n\n",
    "posted_time": "Post  by mwaura » Thu Oct 27, 2005 1:37 pm",
    "category": "Oncology",
    "sub_category": "Bladder Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=24184&sid=a411861eb707bd150816cf685b2c7c07#p24184"
  },
  {
    "author": "willie49  Guest Posts: 2 Joined: Sun Jun 20, 2004 9:18 am Location: USA",
    "title": "Bladder Cancer, \"2 of 3\", \"Moderately-Aggress",
    "content": "Hello,  I am a healthy, active and alert 84 yr old, white male. I have high blood pressure which is under control w/ a prescription.   And I take a water pill for swollen ankles.   4 mths ago and again last month, tumors were removed from my bladder. This question may be premature because I don't know the name of the cancer and more details yet. (The Dr. & I keep having to reschedule post-op appt).   On the phone I was given confusing, limited details but I clearly understood that I have \"2 of 3\" type __________ ________?cancer, continue to scope/test me every 3 mths. And if it was worse they would \"remove my bladder\". Also \"moderately-aggressive\". Wondering how alarmed I should be?   Would greatly appreciate any more info.  Thanks Alot,   Michigan\n\n",
    "posted_time": "Post  by willie49 » Sun Jun 20, 2004 9:24 am",
    "category": "Oncology",
    "sub_category": "Bladder Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3753&sid=a411861eb707bd150816cf685b2c7c07#p3753"
  },
  {
    "author": "Dr. Jeffrey Gordon  Medical Doctor Posts: 127 Joined: Sun Jan 05, 2003 5:22 pm",
    "title": "Bladder cancer",
    "content": "Thanks for posting you question here at The Lounge.  There are some key points of information needed in your case for me to talk further about it.  It would seem that from what you describe, your bladder cancer may be a superficial type involving only the inside layer of the bladder but going deeper into the muscle of the bladder.  Here are some questions to ask your doctor:  1.)  Was the cancer superficial or invasive into the muscle. 2.)  Is the type of bladder cancer a transitional cell carcinoma (the most common type) or is it some other type. 3.)  How many lesions were there? One or more?  Superficial lesions, as they become more \"aggressive\" appearing or of a higher grade number, have increased risks of recurring.  If a bsuperficial bladder cancer recurs, then it could invade deeper into the baldder and involve the muscle layers.  In such situations, more aggresive treatment, such as removing the baldder, can be contemplated.  Otherwise, superficial bladder tumors are removed without the need, for the most part, for removal of the baldder.  Has you doctor talked with you about the need for any type of therapy instilled into the bladder in order to decrease the risk of the bladder tumor recurring?\n\n",
    "posted_time": "Post  by Dr. Jeffrey Gordon » Tue Mar 01, 2005 8:53 am",
    "category": "Oncology",
    "sub_category": "Bladder Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=10128&sid=a411861eb707bd150816cf685b2c7c07#p10128"
  },
  {
    "author": "carmenalba",
    "title": "Bladder Cancer can it wait?",
    "content": "My husband has been diagnosed with bladder cancer and is in stage 3.  We have gone to see the surgeon, but he doesn't have anything available till about 3 - 4 weeks to do the surgery. Is it advisable to wait, or should we try to find a surgeon that can provide the surgery sooner?\n\n",
    "posted_time": "Post  by carmenalba » Sat May 10, 2003 7:55 pm",
    "category": "Oncology",
    "sub_category": "Bladder Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=719&sid=a411861eb707bd150816cf685b2c7c07#p719"
  },
  {
    "author": "Dr. Jeffrey Gordon  Medical Doctor Posts: 127 Joined: Sun Jan 05, 2003 5:22 pm",
    "title": "Bladder cancer",
    "content": "I do not know the specifics of the bladder cancer diagnosis.  It is a common feeling that if surgery is recommended to treat a cancer, that one would want that surgery done as soon as possible so that no time is lost in treating the cancer.  Most cancers do not need to be treated on an emergency basis.  What I mean by this is that the effectiveness of the surgery or the outcome after the surgery is not affected by doing the surgery within several hours or several days or several weeks.  Most cancers do not change rapidly and are relatively slow growing so that the stage or extent of the cancer will not be affected by doing a surgery in a reasonable period of time.  However, if there are significant anatomic or symptom problems being caused by the cancer, then surgery is usually done sooner rather than later in order to tackle these problems.  I would recommend that you speak with the Surgeon and discuss the timing of the surgery.  It will help alleviate some of your concerns about the surgery and when it will be done.  My best.\n\n",
    "posted_time": "Post  by Dr. Jeffrey Gordon » Sat May 17, 2003 7:59 pm",
    "category": "Oncology",
    "sub_category": "Bladder Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=743&sid=a411861eb707bd150816cf685b2c7c07#p743"
  },
  {
    "author": "Guest",
    "title": "Early signs of bladder cancer",
    "content": "What are early signs of bladder cancer and is  incontinence one of them?\n\n",
    "posted_time": "Post  by Guest » Sat Jan 04, 2003 7:16 pm",
    "category": "Oncology",
    "sub_category": "Bladder Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=95&sid=a411861eb707bd150816cf685b2c7c07#p95"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "Early Signs of Bladder Cancer",
    "content": "Blood in the urine is usually the first sign of bladder cancer. Many times, blood in the urine cannot be noticed by the individual but is found by urinalysis done as part of a regular checkup or treatment for another medical condition. If blood can be seen in the urine, it may change the color of the urine from yellow to smoky to rusty to bright red. The blood may disappear for days or even weeks, only to reappear. Blood in the urine can be caused by a number of medical problems besides cancer. These include infection, benign tumors, kidney stones and a number of kidney diseases. If blood is noticed, a doctor should be consulted to determine its cause.  Early-stage bladder cancer does not usually cause pain, but pain may sometimes occur along with the bleeding. The need to urinate may seem more urgent and frequent. Signs of late-stage bladder cancer may include all of the above plus possible bowel problems, loss of appetite, and weight loss. Pain may be felt in the lower back and in the bones.  Incontinence is not a common sign of early bladder cancer, however; bladder cancer may cause detrusor muscle overactivity (involuntary bladder contractions). This leads some degree of incontinence. Associated infection may be associated with incontinence. So to summarize, incontinence could be associated with early bladder cancer but it is not common mode of presentation.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Fri Jan 10, 2003 12:39 pm",
    "category": "Oncology",
    "sub_category": "Bladder Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=112&sid=a411861eb707bd150816cf685b2c7c07#p112"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "I agree with this, incontinence to urine is not a usual presenting symptom for early bladder cancer. The frequencies of a specific symptom for bladder cancer at diagnosis parallel the occurrence of its clinical subtypes. At presentation, 75% of tumours are superficial, 20% are invasive, and up to 5% have metastases. Hematuria is the presenting symptom in 80-90% of cases, urinary frequency (the result of irritative symptoms or a reduction in overall bladder capacity) is common, urgency dur to associated infections can also occur and might be mistaken for intocontinence. Depending on a lesion's location and depth of invasion, ureteral obstruction may develop, resulting in flank pain, discomfort, and overall reduced renal function. In rare cases, pain from a metastatic bone lesion or local progression of disease is the presenting sign. Individuals older than 40 years of age who develop hematuria should have a urine specimen for cytology and undergo cystoscopy and imaging of the urinary tract with an intravenous pyelogram or computed tomographic (CT) scan.  In regard to urine incontinence: Urine incontinence in  women may be a symptom  for menopause and also for other gynaecological problems like genital prolapse (common in multipara). Also, in diabetic patients it might be a part of autonomic neuropathy that complicate the disease.  Incontinence as symptom for cancer might caused by direct extension of tumour into the bladder and usually is associated with hematuria as in the case of cancer cervix as a result of a vesicovaginal fistula. Also,  as a result of complication of treatment for most of pelvic and gynaecological tumours (radical surgery and or RT in cancer rectum, prostate, cervix & vulva). Thanks\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Sat Jan 11, 2003 7:45 am",
    "category": "Oncology",
    "sub_category": "Bladder Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=117&sid=a411861eb707bd150816cf685b2c7c07#p117"
  }
]