[
  {
    "author": "problems101  Guest Posts: 110 Joined: Sun Sep 16, 2007 5:04 pm",
    "title": "Having a toe removed",
    "content": "my mom is 78, is diabetic, lost her right kidney due to artery disease & the stent closing, now she has a sore on the tip of the middle toe on one of her feet.  after removing the dead skin the doc said there is a red ring could be caused by arthritis, (that I don't understand)  Do to recent tests He said the number show the infection might be in the bone,  the other doctor disagrees.   They say it's her choice to remove the toe & she asked me.    I have no Idea except, my head says as long as it isn't  the Big toe, balance isn't an issue.   Do you have any thoughts, or any questions to ask this doctor so we can make a good decision??   She was even told there is no guarentee removing of this toe will solve her problem & I do have a fear that once we start chopping parts off things continue to worsen to the foot & leg.   Any thoughts would be appreciated. Diane\n\n",
    "posted_time": "Post  by problems101 » Mon Jun 28, 2010 5:50 pm",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=95476&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p95476"
  },
  {
    "author": "problems101  Guest Posts: 110 Joined: Sun Sep 16, 2007 5:04 pm",
    "title": "Re: Having a toe removed",
    "content": "Interesting day,  Doctors disagreeing & sabatoging other doctors.  Mom is scheduled for surgery tomarrow, but she was told by the doctor she needs to stop her plavix & blood thinner for surgery.  the infectious doctor changed the orders to start plavix.  lucky mom knew the pill & refused to take it.   He told her she should try the antibiotic IVs but she'd need to do them at home.     We just signed the papers for the surgery & don't know why this doctor is doing this.  I called her family physician & told him, we have 2 doctors with differing opinion & they are working against each other.  If he got the bone test could he confirm to us that the infection is in the bone.     Another doctor from the infection doctor's firm talked with mom & she informed him that she had many allergies to medicine plus her stent to her kidney got clogged & killed the kidney, she preferrs that the infection gets out of her body,  This doctor agrees,  I hope this situation clears itself.  I'll know tomarrow if the surgery happens.\n\n",
    "posted_time": "Post  by problems101 » Wed Jun 30, 2010 9:21 pm",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=95684&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p95684"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: Having a toe removed",
    "content": "Hello, Typically if osteomyelitis (bone infection) is suspected, we start IV antibiotics.  In the presence of kidney failure, the dose of antibiotics will need to be carefully titrated...usually done by a clinical pharmacist.  Amputation of toes and feet in diabetics unfortunately is a reality for too many people.  Having one toe amputated should not significantly impact her gait and ability to do daily activities.  Needing a higher amputation will depend on post operative healing and how well she controls the diabetes...and other factors - i.e. quality of blood supply to and from the foot.  Get as much education on the risks and benefits of the treatments options to make the best decision.  Take care.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Thu Jul 08, 2010 10:34 am",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=96422&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p96422"
  },
  {
    "author": "problems101  Guest Posts: 110 Joined: Sun Sep 16, 2007 5:04 pm",
    "title": "Re: Having a toe removed",
    "content": "Thank you for your post,  The toe is off & mom is doing good.   She's just got the stitches out & is allowed 15minutes every hour on the foot.    The circulation is good.  So he's pleased.  Mom's family doctor told me, as he read the report, getting off of the plavix wasn't absolutely necessary, because it was just the toe.   I didn't know that when I wrote the first post.  I was scared & upset.  during her recovery in the hospital  the doctor introduced himself to me as \"the trouble maker\".  I didn't say anything to him.  the surgery was over by that time.  All he told me was  surgeons like to cut things off & he likes to try to save things.  I didn't want to relive it.    So anyway mom's doing Good & since having the toe removed, her blood pressuer & sugar numbers are much better, so maybe the infection  was causing these numbers to be high.   Again thanks,  I was upset & I just wanted you to know the outcome.  Diane\n\n",
    "posted_time": "Post  by problems101 » Thu Jul 15, 2010 10:07 pm",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=97354&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p97354"
  },
  {
    "author": "desperate4help  Guest Posts: 1 Joined: Mon Nov 10, 2008 6:34 pm Gender: Female",
    "title": "Mass under rib cage and swelling on righrt side of breast",
    "content": "I am desperately trying to figure out what is wrong with me.  Six and a half months ago I woke up one morning with pain under my right rib cage (under where the underwire of a bra goes). I did not go to the doctor the next day because I figured I slept on it wrong. The pain continued and got worse so I made an appointment with a local general practitioner. The doctor did a chest x-ray and a regular x-ray to see if I had a broken rib (even though I did nothing to cause it) but they both came back normal and he said it must just be a pulled muscle. He gave me vicodin and told me to take it to relieve the pain and come back if the pain persists. The pain continued so I went back about a week later and he did lots of blood tests and they all came back normal so he scheduled me for a catscan, hydascan and an ultrasound of my gallbladder. All of these tests were normal too. After all of the tests, I still had the pain so he admitted me into the hospital for observation. They did liver profile tests, lots of other blood tests and released me after 2 days because they had no idea what was wrong with me. When I was released from the hospital the doctor refused to see me anymore because he thought I was just there for pain medicine I guess but I was not. Yes I have been and still am in sever pain but I want the source of the problem fixed. About a week later, when the pain under my ribcage was severe I started swelling on my right side (beside my right breast about 3 inches from my armpit). I always have the pain but it is more severe some days than others and when the pain is severe there is always swelling. My entire side by my right breast leading into my back swells to the size of a grapefruit and it is easy to see how swolen it is through my shirt.  So next I go see my mom's gp and she saw me a few times and said she did not know what was wrong with me and she told me to see her nurse practitioner from now on. I started seeing the nurse practitioner and she has seen my side slightly swollen but never swollen as bad as it gets. I have called and tried to get the doctor to see me when my side is really swollen but no one will see me. The nurse practitioner finally decided to do a breast exam one day and said she felt a mass and scheduled me to have a diagnostic mammogram. I went for the mammogram and the tech that did the mammogram said she could not see anything but could definately feel the mass and it was deep and under my rib cage so she sent me to have an ultrasound to see if they could see more. Of course they could find nothing wrong but the radiologist said since both techs felt something that my gp needed to refer me to a surgeon. So the nurse practitioner referred me to a general surgeon last week. I went to see him about a week after my doctor scheduled the appt. In the consultation the surgeon did feel the \"mass\" as he called it and he said that it was either in the bone of my rib cage or in the cartilidge between my ribs but he still didnt know what it was. He said it was about the size of a quarter and kept saying it was really deep. He wanted to schedule me for another cat scan (even though I had already had one for the same reason 3 months earlier) but I agreed. He said that he felt sure the cat scan would not show anything but he wanted to do it just to be sure and he said that if it showed nothing, he would schedule me for a bone scan as soon as he got the results from the cat scan and he would definately find out what was wrong because I had been dealing with this for so long. Well I had the cat scan on a wednesday and they said they would call me back on Thursday and they did not so I called them back on Friday. I spoke the the surgeon's nurse on Friday and she said that she had not had a chance to talk to the doctor yet but she would talk to him and call me back before the end of the day Friday to schedule my bone scan. I did not hear from them Friday so I called them today (Monday) about lunch time and the nurse said she still had not had time to talk to him but she would call me back before the end of the day.  She called me back late this afternoon and told me that since my cat scan was fine (although the doctor told me in his office that he felt like it would be and thats why he needed to do a bone scan) there was nothing else they could do for me. I said what about the bone scan and she said oh no thats not necessary. I have called and asked the nurse to please let me come in to show the doctor how swollen my side is and they say no. They said I have no need for a surgeon I need to go back to my gp (who has no idea what is wrong with me). I have insurance but I have already spent almost $15,000 this year in medical bills and I still hurt daily and have a grapefruit sized lump or swollen area beside my right breast. I don't know what I should do anymore. Please help.\n\n",
    "posted_time": "Post  by desperate4help » Mon Nov 10, 2008 6:41 pm",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=63808&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p63808"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Mass under rib cage and swelling on righrt side of breast",
    "content": "Hello -  It may be time to start from square one. It seems no one has taken this quite seriously other than you, and this  is beyond unfortunate. Obviously something is going on, but it is extremely difficult to visualize. It would seem you have some sort of herniating defect in the right chest wall. It may even literally inflate from time to time, like a chronically rupturing bulla on the lung which occasionally herniates or possibly infiltrates into the tissues on the outside of the chest wall (this is usually seen as the result of trauma and is called subcutaneous emphysema). Such a lesion, were it to exist (I'm not sure it's even possible, but at least I'm trying), would have certain qualities. If you could describe the swelling or \"mass\" in a little more detail it would be helpful. Surely you've felt it, pressed on it, etc. Is it firm when at its most swollen or does it always feel relatively soft and pliable? Does it make any noises when pressed upon? Can it be reduced wth manual pressure?   Any additonal  information you can provide may help get us at least pointed in the right direction.  I look forward to hearing from you. Hang in there.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Thu Nov 27, 2008 8:57 pm",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=64935&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p64935"
  },
  {
    "author": "SuzieQuzie  Guest Posts: 1 Joined: Fri May 15, 2009 10:24 am Gender: Female",
    "title": "Re: Mass under rib cage and swelling on righrt side of breast",
    "content": "So sorry it took me a while to get back to you. (Its me again...desperate4help). I really appreaciate your help. I lost my password for that account and cannot get it reactivated. The pain is always under my right breast (where the underwire of my bra sits) and when it hurts there, I always have swelling on the right side of my rib cage. It never swells where it hurts, just on the side of my ribs close to my armpit. And where it swells it never hurts. Where it hurts is not swollen but if you press deeply there you will feel a mass. Almost like a cyst you would have in your breast but much bigger. It is hard but it does not move around. It cannot be reduced with manual pressure. I went back to the doctor about 2 weeks ago and she felt that it was swollen and said lots of things make you swell, maybe its too much salt. I don't ever add salt to anything I eat. I am not overweight and seem to be in fairly good health besides this. I am no doctor but I do not think salt has anything to do with this. Also, my pulse rate has started going crazy lately. My resting pulse is like 148 and all the doctor said was take propanolol and would not test to see why this is happening either.\n\n",
    "posted_time": "Post  by SuzieQuzie » Fri May 15, 2009 10:34 am",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=78309&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p78309"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Mass under rib cage and swelling on righrt side of breast",
    "content": "Hello again --  So sorry you had problems getting back here. It sounds as though things are continuing to be a little weird with that swelling, which does sound more and more like either a cyst or calcium deposit. I am a little concerned about your doctor because a) you're right, this would not have anything to do with salt, which does not cause highly localized swelling like you describe but overall water retention which then finds its way to the lower extremities, so that's not a very good answer; and b) a resting heart rate of 148 deserves some exploration, maybe along with a beta blocker to get it slowed down. That's pretty fast, and while you seem to be doing well (and I'm sure this is unrelated to the swelling) it deserves a closer look!  It might be time for a change in doctors, or at least a frank discussion of what you rightfully expect in terms of medical care. The tachycardia might also warrant a cardiology consult. I don't think it's anything serious, but it's not right,  and that's reason enough.   Thanks for getting back here and updating. Take good care of you and stay in touch.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Fri May 15, 2009 3:59 pm",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=78358&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p78358"
  },
  {
    "author": "susanchere  Guest Posts: 1 Joined: Mon Nov 16, 2009 8:16 pm Gender: Female",
    "title": "Re: Mass under rib cage and swelling on righrt side of breast",
    "content": "I have the \"EXACT\" same situation...I've gone to 13 doctors, had x-rays, ultra sounds, bone scans, MRI's, Ct scans all kinds of meds.....I was finally diagnosed by Shands with a Bone Lesions----but the thorasic surgeon said it doesn't fall under his area and I can't find \"anyone\" else to help me that knows anything about this rib thing.  I've been told it could be a number of thing-even possibly a chordoma of the chest wall (theres only ever been a few cases of one in the ribs).  I was taking pain meds quite a bit, but I've learned what triggers the pain and can manage it most of the time.  Its gotten quite large, probably 3x5, it hurts like heart burn or a stabbing pain- enough to make me cry at times.  Its starting to effect my wearing a bra because the bra rubs on it.  I wish I could find someone in Florida who has knowledge of the ribs and could help me.  I don't know if its going to keep growing or whats going to happen to me.  It almost seems as though it freaks doctors out when they see it or they'll say its just how I'm proportioned, but it wasn't like this a year ago.  Its grown quite a bit and I've taken pictures.  It shows on the Ct scans, but is very hard to notice unless the person looking goes over the scan slow.  The dr at Shands showed it to me on the scan.  I don't know what to do... I even have trouble breathing at times.  If you get any answers, Well, hopefully they'll help me too.....\n\n",
    "posted_time": "Post  by susanchere » Mon Nov 16, 2009 8:39 pm",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=87128&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p87128"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: Mass under rib cage and swelling on righrt side of breast",
    "content": "Hello, I might suggest a thoracic surgery to evaluate your case especially if the growth is limiting your ability to breathe. Take care.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Fri Nov 20, 2009 2:10 pm",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=87441&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p87441"
  },
  {
    "author": "cbdkart  Guest Posts: 1 Joined: Tue May 12, 2009 4:15 am Gender: Male",
    "title": "bone decay",
    "content": "Hello Doc,               My friend was complaining of consistent leg pain for the past 2 to 3 months. We initially thought it could be due to his nature of work, but it persisted even on weekends. He recenty consulted a doctor and was told that bone decay might be a possible cause and has given his report to a radiologist. We have to wait for 10 days for the report.  HE did not tell us anything abt wat a bone decay is. Could you please assist by letting us know its impact?  Thanks in advance for your response.\n\n",
    "posted_time": "Post  by cbdkart » Tue May 12, 2009 4:30 am",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=77806&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p77806"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: bone decay",
    "content": "Hello, Another word for bone decay is osteonecrosis.  Often this is caused by poor blood supply to a bone especially after a fracture but may occur spontaneously.    Osteonecrosis is more common in the hip and the knee.    Depending on the extent of necrosis and the location, conservative treatment is attempted first but if failed, then surgical correction may be needed.  Take care.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Wed Jun 10, 2009 9:41 pm",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=80541&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p80541"
  },
  {
    "author": "Musicman  Guest Posts: 5 Joined: Sat Apr 04, 2009 10:17 am Gender: Male",
    "title": "Osteomyleitis in tooth socket/jaw?",
    "content": "Hello- I am 56 year old male, totally healthy and no major problems ever. In 2005 I had my 2 left wisdom teeth pulled along with the molar next to the upper wisdom tooth. Both upper extractions perforated my sinus floor. The dentist who pulled the molar talked me into letting him \"debreid\" the area after extraction with a dental burr. I have had permanent recurring burning and pain ever since, and a sensation of liquid seepage from the upper site area. I have had numerous dentists and oral surgeons and TMJ guys look at me. I have had x-rays which they all say look great and healed. I had CT scan of sinus (normal & floor healed) but last year had an MRI which the oral surgeon/doctor said showed \"bone marrow edema\" in the sites. I am aware that osteomyletis/necrosis of the jaw/tooth sockets is a controversial subject. Some dentists recognize this and some do not. I believe the dentist who scraped the molar socket traumatized the area deeply and it hasn't recovered in some way,although a panoramic x-ray from 3 weeks ago looked fine according to my local dentist.   Is it possible to have a low grade osteomyleitis situation around empty tooth sockets from the dental trauma which lingers for years and causes the burning and referred pain?? I have had 3 rounds of bone specific antibiotics which didn't seem to make any difference. I have had some recent success with the herb goldenseal (antiinflammatory and antiinfection). According to some dentists the only recourse is to re-open the gums and re-clean the area. Before I would do anything like this I would like to be positive that it's a necessary procedure.Plus the success rate of these types of surgeries isn't good enough for me, and many people require repeat surgeries after that. Is there a definitive way or scan to tell if there's a problem in the site because many websites say x-rays and traditional scans don't show these things well on the jaw area?\n\n",
    "posted_time": "Post  by Musicman » Sat Apr 04, 2009 10:33 am",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=73058&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p73058"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Osteomyleitis in tooth socket/jaw?",
    "content": "Hello --  This  is a fairly complex problem, but it may not be as complex as it first appears. It depends. First, the best imaging method for a clear look is probably MRI. All others will run into varying degrees of difficulty. MRI may not be possible, however, depending upon the possible presence of any metal in your teeth.   What may have happened is there has developed some edema of the marrow due to a rather slow healing process (which might be considered a form of low-grade osteomyelitis), and this may be affecting a distant branch of the facial nerve. A good way to test this theory would be to try a course of medication intended to block nerve pain. If it is effective this is probably the case. Since there appears to be no evidence of current infection it may not be justifiable to re-disturb the area,  especially if the symptoms can be managed medically until the problem resolves.   This is far from a definitive answer, but as you've already learned,  the area is obscure enough to make the matter highly controversial. You can almost choose your approach via the doctor you decide seems most agreeable. Personally I'd hope for symptomatic relief until and unless infection shows a definite presence via positive blood cultures, elevated white count, fever and local pain and swelling. It sounds as though this could  be a long term, chronic problem without any acute manifestation, so if blocking the pain works this may be your best bet.  I hope this is helpful. Good luck to you and please follow up with us as needed.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Sat Apr 04, 2009 9:40 pm",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=73134&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p73134"
  },
  {
    "author": "Musicman  Guest Posts: 5 Joined: Sat Apr 04, 2009 10:17 am Gender: Male",
    "title": "Re: Osteomyleitis in tooth socket/jaw?",
    "content": "Thank you for the response,Dr. Is there anything you can recommend to speed up healing process besides the supplements I take? How long can bone traumas like the socket being debreded take to recover? After all this happened in late 2005. I realize everyone heals at different rates but as I read different online forums there are thousands of folks who have the same type of problem and some for many many years. I read that one gentleman had to go on intravenous antibiotic for 12 weeks.  The only swelling in the area I ever had was right after the upper molar was pulled and I used a hot wet washcloth all evening and awoke with a swollen parotid area like a chipmunk, which only lasted one day.My temperature is usually LOW(96.7), never have any fevers.Weather fronts affect the pain too.\n\n",
    "posted_time": "Post  by Musicman » Mon Apr 06, 2009 9:46 am",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=73318&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p73318"
  },
  {
    "author": "Musicman  Guest Posts: 5 Joined: Sat Apr 04, 2009 10:17 am Gender: Male",
    "title": "Re: Osteomyleitis in tooth socket/jaw?",
    "content": "I found the answer. I visited a TMJ/Pain expert/oral surgeon and after some exams he ground down the top of one of the lower molars a bit. It appears the upper and lower teeth were coming together with too much pressure, like having a high filling, causing inflammatory process in my cheek muscles,bone, and surrounding upper teeth.A massage therapist had mentioned to me this might be the cause. It's been four weeks and the area is 99% pain free and resolving nicely. It will take a while, since the area was inflammed for almost 4 years.\n\n",
    "posted_time": "Post  by Musicman » Thu May 07, 2009 6:31 pm",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=77349&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p77349"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: Osteomyleitis in tooth socket/jaw?",
    "content": "Thanks for the update.  Good to hear things are working out and pain levels are down.  Take care.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Thu May 14, 2009 8:44 pm",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=78230&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p78230"
  },
  {
    "author": "ds28  Guest Posts: 1 Joined: Sat Dec 10, 2005 1:10 am Location: jamnagar",
    "title": "ribcage pain",
    "content": ":(   i am very much in pain.i have pain in my ribcage,spinal coprd and in jopints since my delivery before 1 yr .docter said that  i have gaps inbetween my vertrebral colums but i don't know why my ribcage is so painful.i have severe backpain and ribcage pain.\n\n",
    "posted_time": "Post  by ds28 » Sat Dec 10, 2005 1:22 am",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=26480&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p26480"
  },
  {
    "author": "derek  Guest Posts: 14 Joined: Sun Jan 22, 2006 5:01 am Location: scotland",
    "title": "Re: ribcage pain",
    "content": "ds28 wrote::(   I am very much in pain. I have pain in my ribcage, spinal coprd and in jopints since my delivery before 1 yr .docter said that  I have gaps inbetween my vertrebral colums but I don't know why my ribcage is so painful. I have severe backpain and ribcage pain.  hi ds 28  I am almost acertain that the pain you are experienceing in your rib cage is due to the intravertebral spaces. what happenes in this case is that the space between the vertebrea is beginning to seperate the ribs and the only main treatment can be to take oral analgesics\n\n",
    "posted_time": "Post  by derek » Fri Apr 28, 2006 8:48 am",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=32482&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p32482"
  },
  {
    "author": "budgie  Guest Posts: 1 Joined: Wed Apr 01, 2009 5:45 am Gender: Male",
    "title": "Re: ribcage pain",
    "content": "Rib Pain  Bent down to fasten my shoe laces Had a lot of clothing on.   As I bent down heard a cracking noise thought is was m y braces that had snapped.   thereafterwards had rib pain Went to doctor not sure if muscle damage or rib damage.  Now had for 8 weeks slight improvement  but difficulty sleeping and still painful.   what should I be doing to help cure or could it more  more serious than thought?     DG\n\n",
    "posted_time": "Post  by budgie » Wed Apr 01, 2009 6:08 am",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=72667&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p72667"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: ribcage pain",
    "content": "Hello, With questionable fractures in the ribs, it is important to get an xray.  This helps determine the extent of the damage including lung tissue involvement. Pain control is also important.  Normal respiration will move the rib cage and cause pain in a fractured rib or strained intercostal muscle (between the ribs).   Analgesics like acetaminophen or NSAIDS along with heating pad are often helpful. Take care.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Tue Apr 07, 2009 10:34 am",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=73444&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p73444"
  },
  {
    "author": "j.hassall  Guest Posts: 1 Joined: Mon Apr 18, 2005 4:54 am Location: Stoke-on-Trent, United Kingdom",
    "title": "Bone Infection",
    "content": "I have been suffering with neck problems since 2001, at the time I was diagnosed as having an irritated nerve although after various tests including MRI and Ct scan mainly looking at the brain and neck area, and also blood tests, no definite cause could be found.  I was put on various painkillers and anti-depressants to cope with the continuing pain.  Eventually I had a nerve block in the C2/C3 neck area which numbed the whole area.  A week or so after this I was  very ill with vomiting and my face became puffy and swollen and painful, my doctor thought it was some kind of allergic  reaction and no treatment was offered.  I continued with the pain but eventually the puffiness subsided but still I felt very weak and thougjh something wasnot quite right.  Eventually I was treated with trimethprim antibiotics for a urinary tract infection and my neck pain improved.  Also a while after I was given a course of erythromycin for a sinus infection and again my condition improved and I had loads of energy.  It appeared to me that there could be some deep seated infection that temporarily improved with antibiotics and then reocurred, but after blood tests my doctor said  that this wasnot so.  Eventually I moved to a new doctor who tried to help by giving me erthromycin tablets,  but because I have had so many of these in the past, they didnot appear to help.  He said that they didnot know what was causing the problem and that I would have to continue on painkillers.  But to me this was only masking the problem and not getting to the cause of it.   Over the last few months I have felt feverish with swelling in my face and at the top of my spine.  Some nights I cannot sleep because of the intense pain, which drenches me in sweat and sometimes makes me vomit.  I am very weak and pain seems to be spreading to my chest and across my back. I had a urinary tract infection a few weeks ago and was treated with antibiotics.  There is a lady doctor new to our surgery and I have been to see her, I asked whether I could have an abscess in my neck area because of the feeling of fluid I have around the back of the right ear and into my spine.  She did blood tests and last week I had an X-ray of my chest and neck area for which I am awaiting the results.  The blood test showed that my white cells were up slightly and she is repeating the blood test again this week and  doing a CBC and ESR.  I have also noticed that the pain is worse before my period and I have lots of catarrh which I cannot seem to shift.  Today the pain feels like it is spreading through my bones, and  my neck cannot  move without intense pain and there is reduced motion with the feeling of fluid increasing.   I am also very thirsty all the time, but I am not a diabetic, this has been checked previously.   My question is if I have an infection somewhere in my neck and spine, will it show up in the blood tests that my doctor is doing or are more specific tests required?  Because my symptons are getting worse I am concerned that eventually I willnot be able to move at all.   I feel like I need to be in hospital so that they can find the cause but my doctor says she  needs to complete her investigations so she knows what is causing the problem and which department to send me.  Our hospital is always short of beds so you are not automatically admitted, and recently I went to the accident and emergency department and I was sent home with antibiotics.  I live in the UK so we are subject to waiting times through the National Health Service.  I would be most grateful for any advice or suggestions you may be able to give to me.  Thanking you.\n\n",
    "posted_time": "Post  by j.hassall » Mon Apr 18, 2005 5:42 am",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=12499&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p12499"
  },
  {
    "author": "reb  Guest Posts: 1 Joined: Mon Aug 15, 2005 4:30 am Location: portland, oregon",
    "title": "bone infection",
    "content": "I have been experiencing the same thing.  I had my wisdom teeth removed 6 months ago, and since then I have had severe neck pain that gets better and worse dep. on antibiotics.  I also have had a very strange sweet bitter taste in my mouth, been very thirsty, and tired.  I have had nerve pain and tinglyness throughout my arms and legs since the surgury and 2 sinus infections.  I feel good while i am on antibiotics, but then after that, the neck pain and everything else gets worse.   It is some kind of infection and I have no idea what it is.  Can you please let me know what your doctors find?  thanks\n\n",
    "posted_time": "Post  by reb » Mon Aug 15, 2005 4:38 am",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=18828&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p18828"
  },
  {
    "author": "Musicman  Guest Posts: 5 Joined: Sat Apr 04, 2009 10:17 am Gender: Male",
    "title": "Re: Bone Infection",
    "content": "I have had similar problems following wisdom tooth removal (age 56) and you might want to do a websearch on jawbone cavitations/osteomyletis. There are thousands of people with this problem.\n\n",
    "posted_time": "Post  by Musicman » Sat Apr 04, 2009 10:41 am",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=73059&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p73059"
  },
  {
    "author": "skm  Guest Posts: 1 Joined: Wed Mar 25, 2009 6:55 pm Gender: Female",
    "title": "Help with back pain and ostoemylities",
    "content": "What will help the pain from osteomylities, degenerative disc disease, L5S1 discectomy and several bulging discs?    I was in a MVA, emergency discectomy, still suffering the original pain(caudina equina suspected).  I had relief for THREE days after surgery.  I am concerened with the numbness spreading.  Cramps in the right hip,thigh and calf are also spreading to the left leg and hip as well as moving up into my shoulder areas.  I lose my balance easily, (falling), walking with great pain (and increasing!) Osteomylities was found 18 months after surgery.   (Chronic?)  I have tried several pain medications but was taken off as they were not relieving the pain just partial symptoms.   I am currently in pain management with no solution in sight as i am not a candidate for nerve root injections or any other options given.  My general practicioner is no help as she feels this pain is in my head not my body.  I would like to locate a new perspective on this, how do i approach this in finding a new gp?  Any suggestions on a) pain control and b) will this ever go away.   I am at a loss for sleep and just plain normal life.    Thank you\n\n",
    "posted_time": "Post  by skm » Wed Mar 25, 2009 7:39 pm",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=71859&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p71859"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: Help with back pain and ostoemylities",
    "content": "Hello, I am sorry to hear about the MVA and subsequent back problems.  If indeed the spine has osteomyelitis, you are a candidate for IV antibiotics.  Often these can be done as an outpatient at your local hospital and often a PICC line is placed for delivery of IV.  The osteomyelitis is a significant concern to address.  Talking to the neurosurgeon about worsening radiating leg pain especially going into both legs with weakness is very important.  With a history of suspected cauda equina (a neurological emergency), do not hesitate to see the neurosurgeon again for evaluation.   Lastly, a TENS unit for the back may relive some localized back pain.  Your GP can order this.   Keep us posted and if we can answer any more questions, just let us know.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Thu Mar 26, 2009 4:42 pm",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=71963&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p71963"
  },
  {
    "author": "Davidjames  Guest Posts: 1 Joined: Tue Dec 30, 2008 5:44 am Gender: Male",
    "title": "Severe back pain &  pain in  breasts",
    "content": "Hi Doctor, I am writing this forum for my friend whose name is Merlin. For the past few months she is facing a difficult problem. Hope you can help me in this matter. During her periods she gets severe back pain & also feels pain in her breasts. Whenever she squeezes her breasts a white discharge is coming out. Nowadays she having hair fall & shes getting tired at times. Often used to get breathing trouble when she gets cold. When she consulted an Ayurvedic person she was told one side of her nose is not working properly & she is having a problem with her bones somewhat like something melting inside her bone & that's the reason shes getting the white discharge in her breasts & also during 15-16 day of her periods. I am in a great confusion what to do next. Should I get her to any clinical examination.Please help me !  Thanks  David\n\n",
    "posted_time": "Post  by Davidjames » Tue Dec 30, 2008 6:08 am",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=66352&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p66352"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: Severe back pain &  pain in  breasts",
    "content": "Hello,  Breast pain during menstruation is common but I would not expect milky discharge under normal circumstances.   The nipple discharge you describe may be galactorrhea - a milky discharge from the nipple.   Since galactorrhea can be associated with thyroid disease or pituitary tumor, it will be important to see a physician who can gather her history and do a physcial exam.    I do not think the nose issue (deviated septum?) is related to the nipple discharge.  Let us know how things turn out.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Thu Jan 08, 2009 6:30 pm",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=67467&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p67467"
  },
  {
    "author": "morenitapr  Guest Posts: 2 Joined: Sun Nov 16, 2008 8:16 pm Gender: Female",
    "title": "Leg pain starting from foot up to the thigh",
    "content": "Hello. I really hope you can help me.  I have a a lot of pain starting from the inside of my thigh all the way down to my foot. Its on my left leg and has been going on for a couple of weeks. It has been increasingly hard to walk and is becoming more painful. Just today my leg is very swollen. The pain started about 10 years ago and it was unbearable, couldn's even walk and it would come and go. Now I've started to notice the pain even more and is almost getting imposible for me to walk. I have been trying to avoid going to the doctor because I don't have medical insurance and really can't afford it. Please help. I want to know if it may be something serious.\n\n",
    "posted_time": "Post  by morenitapr » Sun Nov 16, 2008 8:57 pm",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=64455&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p64455"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Leg pain starting from foot up to the thigh",
    "content": "Hello -  While the fact that the problem has been going on for 10 years somewhat undercuts the likelihood that it is serious, the description of the signs and symptoms does suggest that something potentially very serious is going on, and that you may have just been remarkably lucky all this time. It is important that you have this evaluated, even though the duration of the problem may throw clinicians off at first.  Whenever one leg is swollen and there is no history of trauma, there is the potential for a deep vein thrombosis (DVT), a clot deep in the leg, which can eventually break loose and travel to a lung with very serious and potentially lethal results, or, sometimes, to another organ (heart, brain) where the effects could be equally dangerous.  It's possible, due to the long duration of the problem, that you have something else, such as compartment syndrome, but even that can eventually become serious enough that it would require medical intervention.   I hope you'll find a way to have this evaluated, and to at least have some blood tests and an ultrasound of the affected leg. It may be something of a financial hardship, but having a catastrophic medical situation is even worse.   Please follow up with us as needed.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Mon Dec 01, 2008 8:27 pm",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=65040&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p65040"
  },
  {
    "author": "morenitapr  Guest Posts: 2 Joined: Sun Nov 16, 2008 8:16 pm Gender: Female",
    "title": "Re: Leg pain starting from foot up to the thigh",
    "content": "I actually could not take the pain anymore so I did end up going to the emergency room several days ago and the doctor told me I have cellulitis. I'm still not sure what exactly that is and how it happened or even the severity of it but the doctor gave me some antibiotics to drink. He did say it was pretty serious but since I don't even know what that is, I don't know in what kind of danger, if any, I was or if I'm siceptible of getting it again. I did finish them all and feel better but my leg is still hurting quite some (although is significantly less than before). Do you have any suggestions as to what I should do to ease the pain?\n\n",
    "posted_time": "Post  by morenitapr » Mon Dec 01, 2008 8:56 pm",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=65043&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p65043"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Leg pain starting from foot up to the thigh",
    "content": "Hi -  Cellulitis is an infection of the outer layers of tissue (and the servicing blood vessels) over (usually) an extremity. It used to frequently be called \"blood poisoning\" and it can be serious in serveral ways, if not attended to. It can cause necrosis (tissue death) with scarring and loss of use of part of the extremity in very severe cases, can cause sepsis and death in extremely severe and untreated cases, and can make one pretty sick sometimes as well. Most often it's impossible to ignore and gets treated before any permanent damage takes place. It sounds as though, with proper antibiotic therapy, you should be fine, although your doctor may need to look for an underlying cause and correct it.   One of the best ways to help reduce the discomfort is by application of warm (not hot!) moist compresses or to submerge the part in a warm (not hot!) water (or a bath). Oral pain medication is helpful, but shouldn't be used excessively, as one needs to know how the part is doing, which includes monitoring of pain. Once the problem is in remission, if it's still painful, acetaminophen is the safest analgesic for this sort of problem.  Hopefully this is helpful and I'm really glad you went in to have it checked. Due to the long-term nature of the problem and no mention of discoloration, I probably wouldn't have thought to suggest cellulitis, but it makes total sense. Best of luck to you and don't hesitate to follow up with us here.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Tue Dec 02, 2008 12:09 pm",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=65051&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p65051"
  },
  {
    "author": "fishmandaddy  Guest Posts: 1 Joined: Sat Oct 27, 2007 10:45 am",
    "title": "post bone surgery question",
    "content": "Scott Long, Pryor Ok  My son, age 11, had surgery on the bone in his leg (top of the tibia) last week.  The Doctor thought he had an infection in the bone.  When he opened him up he found a hole in the bone and an area that was soft and brown.  He said post-surgery that it did not look like infection and it was being sent to pathology and the microbiology lab for cultures and we would know what it was.  We received the information back from the cultures and they were all negative.  The sample was never sent to pathology, so we will never get back a report on it.  Now the Doctor is saying that he is pretty sure it was an infectious area and he should be fine.  I have some major problems with this.  One is that right after surgery he said it did not look like infection and now that we are not getting the pathology report he says it is infection.  The next thing is if it is infection why wouldn't he treat him with antibiotics.  The referring orthopedist said that is what is done with bone infection.  On e of the main problems we have is my son's grandfather died of cancer at the age of 32.  He had gone to Houston to the cancer treatment center there and they had never seen his type of cancer and could not even say where it originated. We see the Doctor Monday, what should we say to him?  Has anyone heard of this type of circumstance with his bone?\n\n",
    "posted_time": "Post  by fishmandaddy » Sat Oct 27, 2007 10:54 am",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=49576&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p49576"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Fishmandaddy,  This is a difficult situation.  If it were an infection of the bone (termed osteomyelitis) it does need antibiotics.  Typical treatment for osteomyelitis is upwards of 6 weeks of antibiotics to be sure the infection is cleared.  If it isn't an infection, the pathology would have been very nice to see.  It may simply have been a bone cyst that will likely no need any more treatment.  Cancer is less likely given the description of finding a hole in the bone.  Cancers are more commonly solid tumors of the bone.    Follow up with the orthopedic surgeon is important.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sat Oct 27, 2007 4:39 pm",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=49602&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p49602"
  },
  {
    "author": "dorsey_247  Guest Posts: 2 Joined: Sun Jan 14, 2007 1:03 pm",
    "title": "Right leg aches/lump by fibula",
    "content": "My right leg aches constantly, except at night when I'm lying down. It is swollen and it has a lump by the fibula bone, what could this be?\n\n",
    "posted_time": "Post  by dorsey_247 » Tue Jan 16, 2007 6:33 pm",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=37715&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p37715"
  },
  {
    "author": "Dr. Paula Fontaine  Podiatrist Posts: 11 Joined: Wed Jan 24, 2007 4:55 pm",
    "title": "rt leg aches l/lump by fibula",
    "content": "I would suggest consulting an orthopedist or podiatrist so that the leg can be xrayed. A CT scan and/or MRI might also be ordered to better visualize the bones and soft tissues in the area of the lump.  Has the area of the lump been injured recently ? A lump in the soft tissues could be in the skin, in the fat under the skin, or in the muscle and could represent many things such as an infection, a blood clot,  a 'knot' in the muscles , a benign growth in any of the above tissues, or (unlikely but possible) something more ominous. You didn't mention the size of the lump or how long it has been present. Does it move freely when you touch it or does it seem to be adhered to deeper structures?  Again, the best approach is to have a professional look at it and get a thorough history from you- then get xrays and other scans as needed to diagnose. Hope this helps.\n\n",
    "posted_time": "Post  by Dr. Paula Fontaine » Sun Mar 11, 2007 2:29 pm",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=39492&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p39492"
  },
  {
    "author": "creg  Guest Posts: 4 Joined: Fri Dec 22, 2006 12:06 pm",
    "title": "osteomylitis  please help",
    "content": "my father who is 78 has been in hospital for 12 months following surgery for bowel cancer to cut a long story short after complaining of pain at the base of his spine for two months 3 ops later they found an abcess internal at the base of the spine the final op to treat this put him in intencive care in a coma for 9 days his weight went from 11 stone to 5 stone .after 11 months in hospital he is now 8.5 stone and still has a large open wound . 3 months ago he was told the infection had spread to  the bone in the base of his spine. after 3 months of antibiotics an m r i scan showed the infection had spread.i have just met with a plastic and orthopedic surgons who say  it is not   possible to have surgery as it is to dangerous. he has been put back on the same antibiotics as the consultant says they cannot do anything else .he sits in bed chatting to us and writing his christmas cards can anyone help.\n\n",
    "posted_time": "Post  by creg » Fri Dec 22, 2006 12:59 pm",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=36653&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p36653"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Hello  Sorry for the delay in response.  Can you send us the full details of the MRI report?  I need also to know more details about his past medical history specifically the cancer.  Did they check for possible metastatic lesions and oncological consultation was done?  Did they perform a cytological examination for the discharge from the abscess and cultures have been done?  Waiting for the update. Best regards.\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Tue Dec 26, 2006 2:58 pm",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=36768&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p36768"
  },
  {
    "author": "Norabatty  Guest Posts: 1 Joined: Sun Feb 12, 2006 2:51 pm",
    "title": "Bone pain everywhere",
    "content": "Last year I had a constant headache for around 6 months, not severe...just always there. That was diagnosed as tension headache and the doctor said it was probably my sleeping position causing it.   Its now gone but seems to have been replaced with bone pain everywhere from my chest, arms, legs, feet and hands. I seem to have alot of pain around my ribcage and left shoulder blade...infact the pain in general is usually localised to the left side but can sometimes be felt in the right side too.   Doctor doesnt know what it is but has given me dicloflex which I assume is a painkiller? I don't want to mask the pain though, I want to know what is causing it.   Its not severe, its like shooting pains that come on now and again and last for a few minutes before moving somewhere else.   I have recently been diagnosed with anaemia, could this have something to do with it?  Any ideas apretiated.\n\n",
    "posted_time": "Post  by Norabatty » Sun Feb 12, 2006 6:09 pm",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=30551&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p30551"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi Norabatty, The medication dicloflex is a non-steroidal anti-inflammatory drug (NSAID's) and should help decrease pain. Anemia itself would not cause bone pain but would cause symptoms, ie., pallor, shortness of breath, fatigue, etc. Was the etiology of the anemia itself determined? Were there any diagnostic studies, ie., xrays, CT Scan/MRI, bone scan to identify the causative factor or if an underlying pathology is present? Sincerely, Theresa Jones, RN\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Tue Aug 15, 2006 7:16 am",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=33878&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p33878"
  },
  {
    "author": "eh384  Guest Posts: 1 Joined: Fri Jan 27, 2006 8:53 pm Location: home",
    "title": "bone abscess?",
    "content": "I am a 30 y.o male who had a left ulnar nerve transposition, and tricep tendon repair on 12/19/05. Two sutures were placed from the tendon into holes drilled into the olecranon, and tied down. I've been going to PT twice a week for about 3 weeks now. Anyway, last night my therapist noticed a hard, raised lump, approx 4mm x 4mm located just a few centimeters towards the hand, and towards the inside of the arm on the bone. It doesn't hurt, hoever, its not moveable, and feels like it's attached to the bone itself. My wife feels like it has gotten bigger since yesterday. Since they didn't use any screws or nails in my surgery, the only thing I can think of is an infection. Any ideas?\n\n",
    "posted_time": "Post  by eh384 » Fri Jan 27, 2006 9:00 pm",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=29371&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p29371"
  },
  {
    "author": "derek  Guest Posts: 14 Joined: Sun Jan 22, 2006 5:01 am Location: scotland",
    "title": "Re: bone abscess?",
    "content": "eh384 wrote:I am a 30 y. o male who had a left ulnar nerve transposition, and tricep tendon repair on 12/19/05. Two sutures were placed from the tendon into holes drilled into the olecranon, and tied down. I've been going to PT twice a week for about 3 weeks now. Anyway, last night my therapist noticed a hard, raised lump, approx 4mm x 4mm located just a few centimeters towards the hand, and towards the inside of the arm on the bone. It doesn't hurt, hoever, its not moveable, and feels like it's attached to the bone itself. My wife feels like it has gotten bigger since yesterday. Since they didn't use any screws or nails in my surgery, the only thing I can think of is an infection. Any ideas?  Hello  the problem that you speek of could be any number of problems. infections are a good guess, however, the chances are that the infection would be on the bone and moveable. it could just be an inflammation of the bone due to the intense trauma of the strain, or even the drilling of the bone. it could be anything like I said. I would be inclined (from what you stated in your statement) to say that you are suffering from steomyelitis of even a bone abbsess\n\n",
    "posted_time": "Post  by derek » Fri Apr 28, 2006 8:57 am",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=32483&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p32483"
  },
  {
    "author": "SBW3333  Guest Posts: 2 Joined: Thu Feb 09, 2006 3:31 pm",
    "title": "Bone infection?",
    "content": "I am a 33 yr old female. About 3 years ago I started suffering from alot of nuerological problems...Weakness & tingling in leg and arm and face, with really achy joints, and tender spots everywhere but all of this is on the left side only. Went to all kinds of doctors trying to find out the cuase of this. Orthopedic doctor did xrays of couple of joints and found a spot on my tibia just under my left knee. Went to a bone cancer doctor and he did a bone biopsy and called it osteomylitis. said they got 60% out,left 40% in and put me on antibiotics for 8 weeks. My leg is still sluggish, though not as bad, but my joints still ache and the area of surgery is still very tender, with the area around it asleep feeling. Should I be concerned about \"how\" this infection got in there, and if it could possibly have ANYTHING to do with my other symptoms I am still experiencing or just mere coincidence. I was also told my B12 was terribly low and they put me on supplements, but did not tell me why or what was causing it to be so low.\n\n",
    "posted_time": "Post  by SBW3333 » Mon Feb 13, 2006 11:22 am",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=30592&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p30592"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi SBW3333, Osteomyelitis is a bone infection typically caused by an infection in another area of the body, for example bloodstream, trauma resulting in a cellulitis of the area etc.  Do you remember if you experienced anything in particular (infection, trauma) prior to the osteomyelitis? Were blood cultures done to identify the responsible organism? Of course, aside from trauma, infection, etc., one of the risk factors for developing this condition is Diabetes. Now for the B12 deficiency. Some of the signs or symptoms of a B12 deficiency are numbness and tingling (especially of the hands and feet), pallor, fatigue or weakness, shortness of breath, etc. Some causes of this deficiency are related to diet (vegetarian that excludes all meat, fish, eggs and all dairy products), Intestinal malabsorption disorders,  Crohn's disease, or lack of an Intrinsic Factor (responsible for Pernicious anemia). Generally, a Schilling test (labtest) can determine the cause of the B12 deficiency. Depending on the cause, whether it's diet related or due to another reason, indicates the treatment supplement by pill form or B12 injections. I hope this has been somewhat helpful. Sincerely, Theresa Jones, RN\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Tue Feb 14, 2006 7:29 am",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=30646&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p30646"
  },
  {
    "author": "SBW3333  Guest Posts: 2 Joined: Thu Feb 09, 2006 3:31 pm",
    "title": "[no title]",
    "content": "Ms Jones,  Thank you so much for the information. I do not remember having any trauma or infection prior to my diagnosis. As far as the organism, I don't think they ever did; they only classified it as a benign neoplasm. It is a pure mystery. I will talk to my doctor about this schilling test and see if it can be done to determine why my B12 is low. The only weird thing is that it only affects my left side, would this not affect me on both sides? Thanks again for all the information.\n\n",
    "posted_time": "Post  by SBW3333 » Wed Feb 22, 2006 7:11 am",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=31128&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p31128"
  },
  {
    "author": "missyh12  Guest Posts: 5 Joined: Mon Jun 28, 2004 12:28 pm Location: United States",
    "title": "Bone loss in mouth",
    "content": "I have had two dentist tell me that I have 97% bone loss in my mouth,and both say that at my age(33)it is impossible for it to be periodontal disease alone,and that there is some other medical problem that is causing it.All the other doctors that I have been to (including a orthopeadic surgeon)say that if I have no bone loss in any other part of my body its nothing to be concerned about.I've had a bone scan of pelvic area,and my spine(all normal)I happen to agree with the dentist,in that this is not normal,and there is something not dental related  causing it.Is there anyone out there that may have a clue as to what this may be?Is there some rare bone infection,disorder,or disease that doctors may not automatically think of?Thanks for your time!\n\n",
    "posted_time": "Post  by missyh12 » Tue Jun 29, 2004 11:12 am",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3865&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p3865"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Hell again, Like your doctors said most of the time osteoporosis happens in other parts of the body as part of a generalized (systemic) disease process. This has been excluded by the scans you've done. Local bone loss may be due to infection, bone cancer. Both conditions are usually accompanied by pain which is lacking. It really depends on the picture of bone loss. What does the panoramic x-ray show? Is there bone loss all over the mandible? Is it confined to one part only? Some autoimmune diseases such as rheumatoid arthritis have an increased incidence of osteoporosis.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Sat Jul 24, 2004 6:09 pm",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=4239&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p4239"
  },
  {
    "author": "lawrencemd23  Guest Posts: 1 Joined: Wed Nov 23, 2005 9:35 pm Location: waukesha  Contact:   Contact lawrencemd23       Website",
    "title": "[no title]",
    "content": "I don't know if this is the same or not but found advance periodontal disease with a lot of bone loss.  My doctor found that I have diabetes.  I'm told that out of control diabetes makes gum diease much worse and vise virsa.  My doctor only came up with this after a full set labs.  Some other people have told me that things like Gluten Intolerance could play a role but my doctor say he would expect that to cause problems in other areas as well.    Best wishes.\n\n",
    "posted_time": "Post  by lawrencemd23 » Wed Nov 23, 2005 9:44 pm",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=25603&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p25603"
  },
  {
    "author": "will25  Guest Posts: 1 Joined: Fri Oct 14, 2005 8:39 am",
    "title": "Foot \"hard to heal\" infection",
    "content": "Hi to everyone.  I have had last June, a car accident and by this I have broken, like an \"explosion\", my right foot. Following this episode, I have had an hearth attack, and i was been in a cardiologic inthensive therapy for a week. In all this period, my foot was been forgotten by medical equipe, and it has gone to cancrena.  Thanks to an iperbaric therapy, i was able to heal the most of this infection, but a little part still remains.  Now, in october, i gotta have a surgery. but i cant have it until I fix my foot infection problems.  My question is, how I could heal this infection? Where I gotta go to fix my problem? To which doctor? to which specialized centre?  I notice you that I'm from Italy, but I'm preparred to go everywhere in the world to be healed.  Thanks to everyone.\n\n",
    "posted_time": "Post  by will25 » Fri Oct 14, 2005 8:52 am",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=23341&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p23341"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi will25, An orthopedic specialist or podiatrist specializes in these particular bone disorders and should be able to assist you in your endeavor.  Sincerely, Rntdj\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Fri Oct 14, 2005 9:17 am",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=23345&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p23345"
  },
  {
    "author": "Amisha  Guest Posts: 2 Joined: Wed Aug 17, 2005 2:16 am Location: united states",
    "title": "insanely painful big toe....",
    "content": "hi,   i have a very painful big toe. it's red and largely swollen just under the nail. i also have painful bunions on both feet. i know that bunions do cause the big toe to shift outwards and all that. but my question is, why does my big toe get red swollen and painful once in a while?   the pain, very unusually , starts at night, and then continues till early morning, as if something i do in the evening causes it. i have no idea what though! i went to the doctor when it first happened, and they said it looked a \" bruised' .... but there aren't any fractures or anything. do the bunions have anything to do with it?   also, i work out, and after every few months, my big toenail falls off. it grows back without any problem though. but every once in a while i get this intense pain and redness and swelling on the toe.... i'd just like to know what it is, get to the bottom of it once and for all. i take a few painkillers when it hurts... they seem to help. its only once in a while that it hurts though, but when it does hurt, it hurts insanely... help!!!\n\n",
    "posted_time": "Post  by Amisha » Wed Aug 17, 2005 2:29 am",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=18938&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p18938"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi Amisha, Have you been evaluated for Gout? When production of uric acid by the liver is more than the body can excrete in the urine, the uric acid essentially crystallizes and deposits in the spaces of the joints (the big toe) This causes redness, inflammation/swelling, stiffness and pain to such an extent that anything even touching the toe or affected joint causes it is almost intolerable. Labwork to evaluate uric acid levels and joint aspiration to detect crystals will determine if this is actually the condition. Sincerely, Rntdj\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Wed Aug 17, 2005 5:43 am",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=18948&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p18948"
  },
  {
    "author": "Amisha  Guest Posts: 2 Joined: Wed Aug 17, 2005 2:16 am Location: united states",
    "title": "[no title]",
    "content": "hi, thanks for the answer. yes i have been tested for gout and don't have it. what i htink it is, after reading on the internet is, its something called paronychia. i'd love for someone to tell me what cures it!\n\n",
    "posted_time": "Post  by Amisha » Wed Aug 17, 2005 2:28 pm",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=18983&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p18983"
  },
  {
    "author": "JCRamirez  Guest Posts: 1 Joined: Sun May 15, 2005 10:47 am Location: Lakewood, CA",
    "title": "Antibiotic Overdose - Ostiomyalitis - Leg Edema",
    "content": "I was bitten by a feral cat on my right thumb and untreated it advanced to blood poisoning and a bone infection (Ostiomyalitis) . I was hospitalized in October of 2002, and received intravenous antibiotics Vancomycin, Clyndamycin, and Fortaz intravenously for about 6 months (April 2003) through a central line (with 3 pigtails) plumbed into my aorta at the neck.    At 5 months the Vancomycyn made my lymph nodes swell to golf ball size and i was in severe pain.  I was taken off Vancomycin.    Now 3 years later, I have leg edema on both legs, left leg is worse, weeping discolorations in left leg and a dull mild pain in my left leg.  Went to doctor, and he didn't do or say anything about the leg edema.    What should I be doing?  Does this sound like something I should be addressing. Is this a result of Antibiotic Overdose?  I will be 51 years old in July and am in otherwise good physical condition.  I am 5'8\" and weigh 305 lbs.\n\n",
    "posted_time": "Post  by JCRamirez » Sun May 15, 2005 11:11 am",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=13763&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p13763"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi JCRamirez, During treatment with vancomycin special monitoring is usually done to evaluate levels of this antibiotic. Adverse reactions with toxic levels of vancomycin have been associated with hearing loss and toxic effects on the kidneys. I would not find the lymphadenopathy a result of the clindamycin nor the fortaz. Of course I am not saying that this is an impossible side effect of the vancomycin but I would more likely relate the chronic lymphadenopathy to the initial infection. However, when you are re-evaluated by your physician, ask his/her opinion of what is causing your symptoms so that if it is not related to the initial infection or antibiotic treatment  then evaluative studies can be completed to identify the causative factor. Sincerely, Rntdj\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Mon May 16, 2005 5:22 am",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=13802&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p13802"
  },
  {
    "author": "lashonda_b  Guest Posts: 2 Joined: Mon Mar 29, 2004 7:53 pm Location: Baton Rouge, LA",
    "title": "I was diagnoised with hypoplastic of the Foot",
    "content": "I have this crisis. My 3rd toe on my right foot is smaller than the 3rd toe on the left foot. I recently went to a podiatrist and he told me it was a birth defect. So he sent me to a bone specialist and he told me that there was nothing he could do about it since it wasn't causing me pain.He told me I had hypoplastic of my 3rd toe on my right toe. But Is there any type of surgery or specialist I can go to to get both of my toes the same length. Its very embarrasing and can doctors lengthen bones in the foot. I am going on vacation this summer and I have to show off my feet. Is there any help for me? If so please let me know ASAP.\n\n",
    "posted_time": "Post  by lashonda_b » Mon Mar 29, 2004 8:02 pm",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2969&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p2969"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: i was diagnosed with hypoplasia of the foot",
    "content": "Dear Lashonda_b,  i don't think that i have heard of such procedure.  i would also recommend not to have a surgical procedure done when you don't have any complaints as sugical procedures in addition to their own inherent risks, can also lead to lots of complications even if they appear to be minor.  But if you really want your toes to be equal in length, i would recommed making the longer one shorter.  Thank you very much for using our website http://doctorslounge.com   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Tue Mar 30, 2004 1:37 pm",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2970&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p2970"
  },
  {
    "author": "lashonda_b  Guest Posts: 2 Joined: Mon Mar 29, 2004 7:53 pm Location: Baton Rouge, LA",
    "title": "Really?",
    "content": "so doc, i can't even have reconstructive surgery done to my foot, there's nothing that a podiatrist can do besides making my longer 3rd toe look smaller, can they add a little length to my shorter 3rd toe. Also wuldn't it look funny for my 3,4 and pinkie toe to be similar in length.\n\n",
    "posted_time": "Post  by lashonda_b » Wed Mar 31, 2004 5:27 pm",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2980&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p2980"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Really?",
    "content": "Dear Lashonda_b,  i guess you can consult a plastic surgeon about other possibilities but i think that this is not going to be an easy procedure to do as usually reconstructive surgery involves muscle flaps with good dependable arterial supply which is not the case in distal parts of the body such as extremities. In addition there is not enough space for undermining and rotation of the muscle flap in such a narrow space. These procedures are not done by podiatrists, but usually by plastic surgeons and i think that there is a small number of orthopedic surgeons (bone specialists) who can do such procedures.  But i still stand by my first recommendation not to have any unnecessary procedures done.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Thu Apr 01, 2004 12:51 am",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2982&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p2982"
  },
  {
    "author": "Michaelii  Guest Posts: 42 Joined: Fri Apr 22, 2005 12:51 am Location: California",
    "title": "your toes",
    "content": "It is most likely that you will be the ONLY ONE to notice your toes.  No one looks at your feet.  Why are you so obsessed with having an unneeded \\dangerous proceedure done?  I don't mean to be so uncareing. Tell me your thoughts...\n\n",
    "posted_time": "Post  by Michaelii » Sat May 07, 2005 1:00 am",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=13436&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p13436"
  },
  {
    "author": "mamvan  Guest Posts: 9 Joined: Sat Jun 05, 2004 4:25 pm Location: Middletown, Ohio  Contact:   Contact mamvan       Yahoo Messenger",
    "title": "Does anyone know about RSD?",
    "content": "My 17 yr. old daughter has RSD.  She has a splint on made of cast material, she did have a full cast on for almost 3 weeks.  the first month during the waiting for diagnosed She had a splint on.  The Cat Scan showed a possible fracture, The MRI showed not fracture, but to make sure he put a cast on.  Her hand swelled up, and they sawed it down the middle to give it room to expand.  Well Sunday her hand swelled up real big, so my nephew pulled it apart and she pulled her arm out of the cast.  The next day a removeable cast was put on.  It wraps all the way around the thumb, and before the first cast that was all that she could move, now she can not even move it.  She tries real hard to move her fingers, but they will not move, the lady that put on her cast said that she has to make her brain move them.  But they won't, has the brain really stopped moving them, or Has the RSD done something to where she can not move them.  She is in constant pain,  I do not understand why they have not started therapy.  But I am not a doctor, but by the internet, it said that it should be started within the first month, and now it has almost be 2 months since she fell.  Will she be able to use her hand again? I hope someone will answer.   Thanks  Mamvan\n\n",
    "posted_time": "Post  by mamvan » Wed Jun 09, 2004 10:58 pm",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3633&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p3633"
  },
  {
    "author": "Dr. A. Saif  Medical Doctor Posts: 101 Joined: Mon Oct 25, 2004 1:56 pm Location: UK  Contact:   Contact Dr. A. Saif       Yahoo Messenger",
    "title": "[no title]",
    "content": "Hi Mamvan,  Can you give a little more information 1) was there an injury that initiated all this? 2) You suggest that your daughter had a cast on for a month before the diagnosis was made, is this correct? 3) are we looking at a possible scaphoid fracture?  At a guess, I am going to assume your daughter had a suspected scapoid fracture.  This presumably hadn't shown up on the X-rays, but as missing such a fracture can be potentially problematic it is not uncommon for a cast to be applied.  Such a cast would extend to the thumb.  It is unusual for swelling to increase after a month in a cast, so i will guess that this was a new cast applied.  A removable splint is a reasonable measure to take.  Scaphoid fractures can themselves take a long time to heal, and if complicated by RSD, it may be difficult to know whether the pain is coming from the fractute, or form the RSD.  This may be the reason why physio has not been started.  RSD stands for Reflex Sympathetic Dstrophy.  It is often associated with an injury, and the exact cause is not clear.  The features are that of diffuse pain, and often increased sensation of pain to minor contact, perhaps a change in the coloration and temperature, stiffness and change in moisture of the of the hand.  It often occurs after seemingly minor injuries. It is a diagnosis of exclusion i.e. a diagnosis made after all other causes have been ruled out.  Sometimes a bonescan can be used to confirm the diagnosis.  The treatment for this is difficult, but your doctor will be going up the ladder of therapeutic options.  1) in most situations RSD is self limiting.  in other words it often gets better by itself 2) pain killers and interferential physio may be tried.  You can do this yourself if you like.  One thing that can be done, is to take a bucket of warm-hot (not scalding!) water, and a bucket of luke warm water.  Alternate dipping the hand in one then the other. You may find that for a little while everything feels better, and the hand can move more.  Initially the benefis are short-lived.  Try also having a sponge ball that can be squeezed, to get the fingers moving. 3) in some situations the doctor may refer you to a specialist who may recommend a guanethedine block.  this is an injection that blocks the sympathetic nerves in the neck, and this may give some relief.  Your daughter will, I am sure, improve with  little time...let me know how she is getting one.  With kindest regards,  Saif\n\n",
    "posted_time": "Post  by Dr. A. Saif » Tue Oct 26, 2004 1:19 pm",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6100&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p6100"
  },
  {
    "author": "mamvan  Guest Posts: 9 Joined: Sat Jun 05, 2004 4:25 pm Location: Middletown, Ohio  Contact:   Contact mamvan       Yahoo Messenger",
    "title": "[no title]",
    "content": "Hello,     Thank you for your reply, She was sent for the blocks, and they did not work, so the doctor put a catheter in her back, in the plural cavity, it took many injections, but it finally helped.  She is not in alot of pain anymore, and she also was put on 2400 mgs of Neurotin.  That seemed to have helped alot.  She has been in therapy, She feel again on her right hand, it hurt when she did it, but when she got up the next morning, she could move her wrist, and she had no pain.  She still can not move her fingers.  She is able to move her thumb.  She has learned to use her thumb for everything.  Therapy has really helped, if anything a reason for not giving up.  She has a real good outlook in life.  I thank God for that. No one knows why she can not move her fingers though.  She did tell me that today she moved her middle finger a dab, but she could not look at it at the time, she had to really think of only moving her fingers.  Thanks again for the reply Mamvan\n\n",
    "posted_time": "Post  by mamvan » Wed Oct 27, 2004 12:06 am",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6115&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p6115"
  },
  {
    "author": "Dr. A. Saif  Medical Doctor Posts: 101 Joined: Mon Oct 25, 2004 1:56 pm Location: UK  Contact:   Contact Dr. A. Saif       Yahoo Messenger",
    "title": "[no title]",
    "content": "Hi mamvan,  I am glad your daughter is slowly recovering.  It is always difficult to know why some function takes a bit longer to return.  This could be residual feature of the RSD, local fibrosis, or perhaps a side effect of the block.  In all situations, I am sure with time things will improve...be patient, and please take care  Saif\n\n",
    "posted_time": "Post  by Dr. A. Saif » Thu Oct 28, 2004 3:57 pm",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6136&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p6136"
  },
  {
    "author": "mamvan  Guest Posts: 9 Joined: Sat Jun 05, 2004 4:25 pm Location: Middletown, Ohio  Contact:   Contact mamvan       Yahoo Messenger",
    "title": "[no title]",
    "content": "I just want to thank you for replying and your support, it is good to have this forum, It helps people who does not have the gift to be a doctor.   I will keep you informed if there is anything else that comes up.   God Bless You Mamvan\n\n",
    "posted_time": "Post  by mamvan » Thu Oct 28, 2004 9:46 pm",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6155&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p6155"
  },
  {
    "author": "mamvan  Guest Posts: 9 Joined: Sat Jun 05, 2004 4:25 pm Location: Middletown, Ohio  Contact:   Contact mamvan       Yahoo Messenger",
    "title": "Something else",
    "content": "I just thought that I would let you know that they have told me that she may have lupus, I was told that on the day that I was told that I do have lupus.  Her Neurolgist took some blood work on her, since no one had done it, the ANA was elevated, and Vitamin B could not be tested because she did not have enough in her to be tested.  She is now on B complex 100 mg every morning.  And she see Rhematologist on the 7th.  She is going to Cinn. Childrens in Ohio.  Could that have an effect on why her hand is not doing very well.  Also her hand is still going through temp changes.  Will that continue always.  Can she ever get completely healed from RSD.  Or just slowed down.  Not to much pain, it just comes and goes now.  Thanks for the info you have given so. Mamvan\n\n",
    "posted_time": "Post  by mamvan » Sun Dec 05, 2004 1:59 am",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6877&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p6877"
  },
  {
    "author": "jerjonjoe  Guest Posts: 2 Joined: Thu Apr 07, 2005 8:49 pm Location: Everett WA",
    "title": "Rsd",
    "content": "I have been diagnosed with RSD since 1995 bilaterally in my upper extremities.  It started in my wrist with carpul tunnel and them moved up into my elbows, shoulder and neck. I have had so many treatments I just wish they would find something to help me out with the pain. I am going to Swedish Medical Center in Seattle now and they have done 4-5 stell. blocks.  Now that they have worked they are going to do a radio something to block off the nerve permantently.  I have a few questions about this and would like to know your comments. Will I be able to feel my hands after this is done and does this last forever? I was hoeping to get off the meds as much as I can.  I have been on narcotics for 4 years, from a person who did not want to take drugs to begin with.  The other thing  is I have not been able to work since 1995.  I have tried but the pain is just awful at times.  I am young and want to ahve a better life.  Thanks for your help\n\n",
    "posted_time": "Post  by jerjonjoe » Thu Apr 07, 2005 9:08 pm",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=12021&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p12021"
  },
  {
    "author": "mamvan  Guest Posts: 9 Joined: Sat Jun 05, 2004 4:25 pm Location: Middletown, Ohio  Contact:   Contact mamvan       Yahoo Messenger",
    "title": "[no title]",
    "content": "Well I am not for sure about the procedure, they had told my daughter that she would be okay, just no pain.  But she did not have that done, she had something where they put the numing meds in her plural cavity.  They had a catherter in her back for about 4 days and got  treatments twice daily. Then the catherter fell out. But it did what it was suppose to.  It did help the pain.  Everynow and then she has problems especially during the cold.  But she is still having problems moving her fingers, but they think it is mental block.  So we are working on that.  Good Luck with your.  I just thank God that we had a good Doctor, and Had plenty of Prayers.  Will say a prayer for you.  Mamvan\n\n",
    "posted_time": "Post  by mamvan » Wed Apr 20, 2005 9:19 pm",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=12648&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p12648"
  },
  {
    "author": "smiles4ever  Guest Posts: 3 Joined: Wed May 26, 2004 7:49 pm Location: USA",
    "title": "Petrous Apicitis",
    "content": "I had a CT scan done that showed I had petrous apicitis; my doctor told me to see an ENT doctor as soon as possible.  What exacaly is petrous apicitis, and what should I be expecting in regard to treatment?   - Melanie\n\n",
    "posted_time": "Post  by smiles4ever » Wed May 26, 2004 8:07 pm",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3407&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p3407"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "It is an infection of petrous apex (the top of the petrous bone). The petrous bone is a bone in the skull. The petrous portion of the temporal bone lies in a complicated anatomic position and has critical relationships to important neural and vascular structures.  Before the advent of antibiotics in the 1940s, infections of the petrous apex, termed petrous apicitis, commonly progressed to meningitis, brain abscess, cavernous sinus thrombosis, and death. Since the introduction of antibiotics, the prevalence of such serious complications has been drastically reduced.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Sat May 29, 2004 6:32 am",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3449&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p3449"
  },
  {
    "author": "breezygirl64  Guest Posts: 1 Joined: Sun Apr 10, 2005 12:19 pm Location: New York",
    "title": "petrous apicitis",
    "content": "I Just recently had an MRI which concluded that I have a severe sinus infection and Petrous Apicitis.  I had gone to my physcian with complaints of headaches, blurred vision, confusion, and problems with my blood sugar after eating.  I had blood work done which was all within normal limits and went through a 2 hour glucose tolerance test which was also normal, my physcian was stumped as to what was going on with me so she had me go for an MRI of the brain for complaints of headaches and blurred vision.   I was very surprised to hear that I had a severe sinus infection as I wasn't having any sinus problems.  My physcian sat down with me and went over the results of the MRI and had also told me that the infection had spread to the bone and brain. I was reffered to an ENT who said this was very interesting, however since my middle ear had not been infected it was not life threatening and therefor gave me his next avail. appt. which is not until May 2nd. I am beside myself with worry because I have to wait so long to be seen and was wondering if you had gone to an ENT and what you were told.  I am currently on antibiotic's of which I completed today, my symptoms have lightened up a little but I still feel awful and would appreciate any input you have to offer.  _Dawn[/b]\n\n",
    "posted_time": "Post  by breezygirl64 » Sun Apr 10, 2005 5:48 pm",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=12167&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p12167"
  },
  {
    "author": "trudy508",
    "title": "osteomylitis",
    "content": "My husband is recovering from osteomylitis after lower back surgery. Early on when his symptoms & pain were appearant.The dr's took a swab culture of the surgery site it came back normal.How can this be when the infection was obviously there?\n\n",
    "posted_time": "Post  by trudy508 » Thu Jul 10, 2003 7:03 pm",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1103&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p1103"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "Osteomyelitis",
    "content": "Dear Trudy, I am glad to hear that your husband is recovering. Osteomyelits is caused by a bacterial infection to the bones. The bacteria may reach the bone either through direct spread (from a nearby abscess or wound) or via the blood. The most common organism to cause osteomyelitis is staphylococcus aureus. This bacteria NORMALLY lives on the surfaces of the body, including skin. Only when the body's immunity decreases or the organism breaches the skin surface and invades the inner tissues, does infection from these organisms occur. If Staph aureus is the cause of osteomyelitis it is ofcourse in that case not NORMAL and requires therapy. In your husband's case there is the added danger of the organism being Tuberculosis. In that case your doctor could mean that its not TB which ofcourse is a grave concern. Another possibility is that the culture test needed repeating.   Of note is that a culture test never says normal or abnormal. It has to find organisms and sensitivity test tells us what antibiotics are good against this organism. It doesnt tell us that these organisms are the cause of a particular disease but if the organism is found to be abundant in an area where it shouldnt be, and it is known to cause the type of infection the patient is complaining of then it is strongly assumed to be the causative organism.  Best regards.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Fri Jul 11, 2003 5:30 am",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1104&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p1104"
  },
  {
    "author": "SirFergusVon  Guest Posts: 1 Joined: Wed Apr 14, 2004 12:24 pm Location: newcastle",
    "title": "on the topic of osteomylitis",
    "content": "Hello, i'm also glad to here your husband is recoverying. I'm 16 now and for the past few weeks i have been lugging around both a portable I.V and a portable V.A.C. My wound is finally begining to close and i think i may be wining my battle with this terrible disease.  My doctorS have me on cloxacillin, and my question to you doctor is with my leg breaking once but a few months ago and then osteo happening, is my sports career finished?  Thanks [/u]\n\n",
    "posted_time": "Post  by SirFergusVon » Wed Apr 14, 2004 12:30 pm",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3072&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p3072"
  },
  {
    "author": "et0129  Guest Posts: 1 Joined: Mon Dec 20, 2004 6:32 pm Location: Dallas, TX  Contact:   Contact et0129       Yahoo Messenger   AOL",
    "title": "Osteomylitis/Discitis Question",
    "content": "Like the other post, I also experienced a post-surgical infection following a Laminectomy at the L2-L3 disk level.    My Questions:  1. The infection went about 9-10 weeks before being correctly diagnosed.  Does anyone know what kind of permanent damage can occur from this infection.   2. The bacteria was \"enterobacter,\" not staph related.  The Dr. says that this is an airborne virus that could infect anyone.  Is this true?  How would a bug like this enter a surgical site?  Is it as rare as they say?  3. What is the best treatment?  I have been on 3 mo. of IV antibiotics (Tobramycin, Maximpime) and they have kept me rotating on three different oral antibiotics since the infection was diagnosed, Cipro, Tequin, and something that started with a \"B\" (sorry).   4. How will I ever tell if the infection has been cured?   I'd welcome any helpful input.    Thanks,  Erin\n\n",
    "posted_time": "Post  by et0129 » Mon Dec 20, 2004 6:41 pm",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=7208&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p7208"
  },
  {
    "author": "ljtomega  Guest Posts: 1 Joined: Thu Nov 04, 2004 10:13 pm Location: alabama",
    "title": "degenerative joint disease",
    "content": "I was diagnosed with osteocondritis descicans of knees and elbows in 1952 and as a result discharged from military service. Recent exrays of those joints show degenerative joint disease.  Djd also has turned up in shoulders and spine. What is the posibility of a connection between the disease of the knees and shoulders and spine? In other words could the problem with the shoulders have any connection with the problem with the knees?\n\n",
    "posted_time": "Post  by ljtomega » Thu Nov 04, 2004 10:55 pm",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6281&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p6281"
  },
  {
    "author": "Dr. A. Saif  Medical Doctor Posts: 101 Joined: Mon Oct 25, 2004 1:56 pm Location: UK  Contact:   Contact Dr. A. Saif       Yahoo Messenger",
    "title": "[no title]",
    "content": "Hi Justice,  Osteochondritis Dessicans is a condition where a part of the cartilage and bone at the surface of a joint becomes separated from the rest of the joint surface to a greater or lesser extent.  This detached fragment can reattach,  disintegrate, or become a loose body within the joint.  If the latter two happen the joint surface becomes irregular, and therefore functions less well, giving pain, locking, swelling and other symptoms.  OCD tyipcally affects the adolescent or young adult.   Degenerative joint disease encompasses a wide range of diseases that essentially lead to a cycle of damage to the joint surface.  Most often the cause is age related wear and tear of the joint, but it can be secondary to other conditions including OCD.  The degenerative changes in your spine are unlikely to be related to OCD.  OCD typically affects the knee, but can affect other large joints.  The shoulder DJD again is unlikely to be related to OCD if it is of recent onset.    DJD is a common finding in joints on X-rays.  The treatment of these largely depends on the symptoms they cause rather than the X-ray findings.  The aetiology again is often of academic interest,  at your age group I guess I would be more surprised if you didn't have some form of  \"DJD\"  Regards  Saif\n\n",
    "posted_time": "Post  by Dr. A. Saif » Mon Nov 08, 2004 1:42 pm",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6350&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p6350"
  },
  {
    "author": "trudy508  Guest Posts: 1 Joined: Thu Jul 10, 2003 7:14 pm",
    "title": "Can a bone scan detect osteomyelitis?",
    "content": "Can a bone scan detact osteomylitis (streph) in the lower back.I think it's called a Galleon scan?(pardon the spelling).\n\n",
    "posted_time": "Post  by trudy508 » Mon Jul 21, 2003 7:32 pm",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1147&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p1147"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: What can a bone scan detect?",
    "content": "Dear Trudy,  Yes, a bone scan can detect osteomyelitis especially if it has been there for a while.  The best way to detect infection of the vertebrae though if an abcess is suspected is an mri of the spine.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Fri Aug 22, 2003 4:13 pm",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1259&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p1259"
  },
  {
    "author": "Dr. A. Saif  Medical Doctor Posts: 101 Joined: Mon Oct 25, 2004 1:56 pm Location: UK  Contact:   Contact Dr. A. Saif       Yahoo Messenger",
    "title": "[no title]",
    "content": "Hi Trudy,  If I may add, sometimes the the Gallium scan has difficulty distinguishing between bone infection, degenerative disease, and metastatic disease.  All these conditions increase bone turnover, which is what the scan detects.  An MRI is certainly an excellent imaging technique for infection, and certainly abscesses of the spine are best detected this way, as doctor Mokhtar says. Another specific (some might say) technique may be the Indium White Cell labelled scan.  This takes a few white cells from some of a patients blood and attaches a radioactive marker to it.  the white cells are then given back to the patient.  As white cells accumulate at infection areas, these may indicate whether the increase in bone turnover is from and infection or something else.  Regards  Saif\n\n",
    "posted_time": "Post  by Dr. A. Saif » Tue Oct 26, 2004 1:29 pm",
    "category": "Orthopedics",
    "sub_category": "Bone infections",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6101&sid=d3d3a6dc1ab16bdb6b7ab755afdfd946#p6101"
  }
]