[
  {
    "author": "shosh  Guest Posts: 3 Joined: Tue Oct 11, 2005 10:24 pm Location: canada",
    "title": "Swollen Inguinal Node",
    "content": "I am 38 years old white female. 14 Sept /05  I noticed my right inguinal node swollen.  15 Sept /05 I saw my gynecologist.  His diagnosis was a possible cervical infection ( I had pain on the right side of the cervix when examined ) and he prescribed dalacin vaginal cream X7 days. Not noticing improvement, 23 Sept/05 I saw an emergency room doctor. He confirmed it was an inguinal adenopathy ( moveable ),and noticed peasize node in my armpit (which he did not consider significant ). He prescribed Cefadroxil antibiotic bid X 7days,and said the node may never go away ? There has been no significant decrease in the node size. Upon awakening it seems slightly smaller and more diffuse but as the day goes on seems to get larger and more distinct. It is moveable , slightly sensitive to touch if pressed and there is on occasion mild discomfort in that area.How long can a node stay swollen after infection? Does this sound serious? Should it be biopsied : if so when would it be reasonable to do so ? Are there disadvantages to doing a biopsy ? Please answer. I am a mother of 2 boys and I am so worried and losing sleep over this. Thank-you.\n\n",
    "posted_time": "Post  by shosh » Fri Oct 14, 2005 10:16 am",
    "category": "Oncology",
    "sub_category": "Cancer of Unknown Primary",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=23347&sid=e93b5ffd5adc19aa96ec863a0e70cec0#p23347"
  },
  {
    "author": "Dr. A. De la Guerra  Medical Doctor Posts: 70 Joined: Fri Aug 26, 2005 8:00 pm Gender: Male Location: Lima, Peru  Contact:   Contact Dr. A. De la Guerra       Yahoo Messenger",
    "title": "[no title]",
    "content": "Hello Shosh, I don’t have information about the size of your node, however inguinal nodes larger than 1.5 cm should be considered abnormal. By far, the most common cause of lymph node swelling is infection; as a rule, when swelling appears suddenly and is painful, it is usually caused by infection.  Regarding your question about how long can a node stay swollen after infection, frequently the pain might disappear in a couple of days, but, depending on several factors (like type and severity of infection), the node may not return to normal size for several weeks. Most lymph nodes which come up because of a recent infection tend to resolve after a month or so.  Further investigation may be necessary if the node persists for more than 2 months or continues to get larger, feel hard, irregular, or fixed in place.  The possibility that a single enlarged node can be cancer is less than 1%, even less if it’s in the groin.  I don't think you have to worry so much.\n\n",
    "posted_time": "Post  by Dr. A. De la Guerra » Fri Oct 14, 2005 9:22 pm",
    "category": "Oncology",
    "sub_category": "Cancer of Unknown Primary",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=23377&sid=e93b5ffd5adc19aa96ec863a0e70cec0#p23377"
  },
  {
    "author": "shosh  Guest Posts: 3 Joined: Tue Oct 11, 2005 10:24 pm Location: canada",
    "title": "Return of Inguinal Node (?) following biopsy",
    "content": "As follow-up to my original post: I had a biopsy done November 1, 2005 of an inguinal node. The results were negative (ie. inflammatory in nature, approximately 1cm in size as stated by the doctor upon its removal).  Following the surgery I had a hard lump in the area which the surgeon called \"fat necrosis\" and which he said would disappear in 6 weeks and \"all would go back to normal.\"  It has now been 5 months and I still have a small lump in the same area (right groin), moveable although more attached than the original node, and variable in size (approximately 1.5 to 2 cm by 1 cm, smaller upon waking and larger, more distinct as the day goes on).   If the cause of the original node was inflammatory, why would a new node appear?  Is this a result of the surgery or does this mean the original inflammation is still active?  If this is a persistent inflammation, how critical is it that the source be found and how should I go about doing this?  As a note, I did have an ectopic pregnancy in my right fallopian tube 4 years ago with secondary tubal scarring.  Any insight into this matter would be greatly appreciated.  Sincerely, shosh.\n\n",
    "posted_time": "Post  by shosh » Mon Mar 20, 2006 11:10 pm",
    "category": "Oncology",
    "sub_category": "Cancer of Unknown Primary",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=32085&sid=e93b5ffd5adc19aa96ec863a0e70cec0#p32085"
  },
  {
    "author": "Dr. A. De la Guerra  Medical Doctor Posts: 70 Joined: Fri Aug 26, 2005 8:00 pm Gender: Male Location: Lima, Peru  Contact:   Contact Dr. A. De la Guerra       Yahoo Messenger",
    "title": "[no title]",
    "content": "Hello Shosh,  Any condition that cuts down blood flow to a wound has the potential to cause necrosis (tissue death), due to deprived oxygen supply to cells (called ischemia). When this happens in the subcutaneous fat is known as fat necrosis, which is most commonly caused by injure to tissues during surgery. When fat necrosis occurs, death cells clump together within a pseudocapsule (false pouch); then eventually it will melt and reabsorb.  In sum, fat necrosis is the formation of a small area of scar tissue caused by ischemic necrosis of subcutaneous fat with no involvement of the overlying skin. The lesion might appear as a lump, usually very hard and firm. Less often, the lump has some fluid inside (called lipid or oil cysts). Both types are locally circumscribed masses; also both may calcify, becoming harder and mimicking malignant tumors.  Usually fat necrosis soft on its own and is removed over time by the body. The lump disappears after a few weeks, but sometimes takes several months. Some doctors will recommend massages to the lump, others will suggest ultrasound therapy to help it liquefy faster. On occasions, surgical removal is necessary, especially if it becomes infected.  A new lump arising in the same place where surgery was done to remove a benign lymphadenopathy is more likely to be a consequence of the formation of new tissue in the process of wound healing, or due to a minor complication like fat necrosis.  Other complication of lymph node surgery is the formation of lymph or lymphatic cysts, also called lymph-filled cysts, lymphocysts or lymphoceles. After surgical trauma to lymphatic vessels, lymph fluid leaks inside the surgical bed, with the subsequent formation of a cystic mass. Lymphoceles are commonly seen following surgical transection of large amounts of lymphatic tissue, or because of inadequate ligation of lymphatic vessels during lymph node dissection (cancer surgery). Occurrence of lymphoceles after removal of a single lymph node is extremely unusual.  Apparently you have a fat necrosis sequel. If the lump doesn’t cause you any symptoms I think you can wait a few more months to see if it goes away. If it bothers you, check with your surgeon, he will decide what the best way to handle the situation is.  Hope you find the information useful.  Sincerely,  Dr. Alberto de la Guerra.\n\n",
    "posted_time": "Post  by Dr. A. De la Guerra » Mon Mar 27, 2006 10:48 pm",
    "category": "Oncology",
    "sub_category": "Cancer of Unknown Primary",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=32206&sid=e93b5ffd5adc19aa96ec863a0e70cec0#p32206"
  },
  {
    "author": "shosh  Guest Posts: 3 Joined: Tue Oct 11, 2005 10:24 pm Location: canada",
    "title": "Thank you",
    "content": "Dear Dr. De la Guerra,  I cannot thank you enough for having answered me once again.  Your email was so very informative and reassuring.  I realise that you must be very busy and yet you have taken the time to inform me well.  When a patient doesn't fully understand his/her condition it is easy to think of the worst and the psychological stress is often worse than the illness.  So thanks again for all your effort and time - I appreciate it more than words can say.  Thanks a million, Sincerely, Shosh\n\n",
    "posted_time": "Post  by shosh » Sun Apr 09, 2006 12:19 pm",
    "category": "Oncology",
    "sub_category": "Cancer of Unknown Primary",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=32352&sid=e93b5ffd5adc19aa96ec863a0e70cec0#p32352"
  },
  {
    "author": "Dr. A. De la Guerra  Medical Doctor Posts: 70 Joined: Fri Aug 26, 2005 8:00 pm Gender: Male Location: Lima, Peru  Contact:   Contact Dr. A. De la Guerra       Yahoo Messenger",
    "title": "[no title]",
    "content": "Dear Shosh,  I’m glad my answer was helpful. An English proverb says: “worry often gives a small thing a big shadow”.  Thanks for your very kind and grateful words, which inspires and encourages everyone in this forum to continue.  Sincerely,  Dr. Alberto de la Guerra.\n\n",
    "posted_time": "Post  by Dr. A. De la Guerra » Wed Apr 12, 2006 3:52 pm",
    "category": "Oncology",
    "sub_category": "Cancer of Unknown Primary",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=32388&sid=e93b5ffd5adc19aa96ec863a0e70cec0#p32388"
  },
  {
    "author": "newdawn  Guest Posts: 1 Joined: Wed Jul 07, 2010 3:56 am Gender: Male",
    "title": "Re: Swollen Inguinal Node",
    "content": "Dr. De la Guerra,   I came across your post while researching something similar to what Shosh says. I must say it really allayed my fears. I have also been having a similar single node in my right groin swollen. I think it was caused by a chronic eczema i have on my right leg. It was pretty bad recently - and maybe thats what caused it. I am otherwise completely healthy - no recent illnesses. I think I was being more worried than it warranted.  My doctor has done an ultrasound to check for the swelling that suddenly appeard a week back. He says it is probably due to an infection - as all other organs are absolutely fine. Only the right groin lymph node is swollen (and it seems under 2 cm to me)..\n\n",
    "posted_time": "Post  by newdawn » Sun Jul 11, 2010 9:53 pm",
    "category": "Oncology",
    "sub_category": "Cancer of Unknown Primary",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=96800&sid=e93b5ffd5adc19aa96ec863a0e70cec0#p96800"
  },
  {
    "author": "sunshinexo  Guest Posts: 1 Joined: Fri Sep 18, 2009 12:28 pm Gender: Female",
    "title": "blood from ears",
    "content": "My relative has been prognosed with cancer final diagnosis has not been determined yet tests are still being run... although cancer has been found in the kidney, liver and lungs..today after awaking a loud pop was heard in the ear and blood had started to drip out. I'm asking for my own accord. He is at ER still awaiting for a physician.\n\n",
    "posted_time": "Post  by sunshinexo » Fri Sep 18, 2009 12:35 pm",
    "category": "Oncology",
    "sub_category": "Cancer of Unknown Primary",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=82776&sid=e93b5ffd5adc19aa96ec863a0e70cec0#p82776"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: blood from ears",
    "content": "Hi, Normally, i am skeptical about offering rare diagnoses (for the simple reason that common things always occur commonly!). But in this instance, the description of your uncle's symptoms that you have provided, somehow led me to think of a rare diagnosis! -- The 'Glomus Jugulare Tumor'. A type of Chemodectoma, arising from the skull base, at or near the jugular bulb. This has been reported to give rise to a feeling of a loud pulsing in the ear.Intermittent bleeding from the ear is also known. Chemodectomas are benign in 95 per cent of cases. Rarely malignant Chemodectomas do occur and are known to metastasize widely. I hope this information may be of use to you.Best wishes!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Thu Nov 05, 2009 9:09 am",
    "category": "Oncology",
    "sub_category": "Cancer of Unknown Primary",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=85979&sid=e93b5ffd5adc19aa96ec863a0e70cec0#p85979"
  },
  {
    "author": "Niko9  Guest Posts: 1 Joined: Mon Apr 13, 2009 11:34 am Gender: Female",
    "title": "I accdenlty cut off part of my mole can I get cancer?",
    "content": "While I was shaving i accdenlty cut half of my mole of with a razor. It bleed for about 8 minutes and now it's all scabby. I don't want it to be remoed because i like it there. Will it grow back and will i get cancer? I've cut it twice. The first time just barley, this time it's huge. I really don't' want to go to the docotrs either.\n\n",
    "posted_time": "Post  by Niko9 » Mon Apr 13, 2009 11:43 am",
    "category": "Oncology",
    "sub_category": "Cancer of Unknown Primary",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=74103&sid=e93b5ffd5adc19aa96ec863a0e70cec0#p74103"
  },
  {
    "author": "Dr.M.jagesh kamath  Medical Doctor Posts: 1303 Joined: Mon Aug 03, 2009 7:24 am Gender: Male",
    "title": "Re: I accdenlty cut off part of my mole can I get cancer?",
    "content": "It is not that every mole that gets cut becomes melanoma,but in future best to avoid trauma to the mole.Any sudden increase of growth,change of color,irregular border,itching and bleeding are the red flags for evaluation of any mole.Otherwise do not worry over this.\n\n",
    "posted_time": "Post  by Dr.M.jagesh kamath » Sun Aug 09, 2009 8:54 pm",
    "category": "Oncology",
    "sub_category": "Cancer of Unknown Primary",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=81429&sid=e93b5ffd5adc19aa96ec863a0e70cec0#p81429"
  },
  {
    "author": "RandomRoads  Guest Posts: 1 Joined: Wed Jan 21, 2009 8:00 pm Gender: Male",
    "title": "Sunken cheeks?",
    "content": "Maybe I'm in the wrong area of this forum, but...  I have developed sunken cheeks - just within the past week or so.  I would have noticed had it happened earlier.    I've read that sunken cheeks are one of the symptoms of cancer, but I always thought that was for advanced stages.  I am tired all the time, but I've been tired for years.  Aside from blood clots/pulmonary embolism a few years ago, I really haven't been sick in several years.   This past fall I developed an infection from a hangnail, and instead of disappearing right away like it normally does, it got really bad, and it took a good 2-3 weeks to get rid of.  I thought that was odd.  I've had a dull pain in my lower left side that has come & gone for about 8 years now.  The dr's couldnt find anything.  And I figured that after 8 years, if it's still around, it can't be too serious.    A month ago I was very sick for about a week... the flu - first time in 5 years.  But I keep getting more tired, the infection lasted longer than usual, and now my cheeks are noticeably sunken.  What would make that happen so quickly?   Is it something to worry about?\n\n",
    "posted_time": "Post  by RandomRoads » Wed Jan 21, 2009 8:13 pm",
    "category": "Oncology",
    "sub_category": "Cancer of Unknown Primary",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=69301&sid=e93b5ffd5adc19aa96ec863a0e70cec0#p69301"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "Re: Sunken cheeks?",
    "content": "Hi,  Sunken cheeks are not considered a specific symptom/sign of cancer. It can happen with cancer as a manifestation of cachexia. However, what I think would be a more objective way to analyze your situation is to look for any significant weight loss. Rapid, unintended and significant weight loss defined as >10% of body weight in less than 6 months is something that requires immediate medical attention.  It would be difficult for me to help you further without an examination. Assuming your concerns are legitimate I would urge you to seek an appointment with your doctor.  Best regards,\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Fri Mar 20, 2009 1:57 pm",
    "category": "Oncology",
    "sub_category": "Cancer of Unknown Primary",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=71471&sid=e93b5ffd5adc19aa96ec863a0e70cec0#p71471"
  },
  {
    "author": "lll6  Guest Posts: 1 Joined: Sun Nov 16, 2008 9:02 pm Gender: Female",
    "title": "I have an unknown lump in my lower back area..",
    "content": "Im a 17 year old female and I have a solid lump under the skin that I can roll around. Its kind of painful when I apply pressure and its located on my low low low back in the upper area of my \"gluteal cleft\" right by my spine/tailbone. I think there may actually be another one in the same area right next to the first one but its tiny and im not 100% positive..what should I do? is it something bad??\n\n",
    "posted_time": "Post  by lll6 » Sun Nov 16, 2008 9:11 pm",
    "category": "Oncology",
    "sub_category": "Cancer of Unknown Primary",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=64456&sid=e93b5ffd5adc19aa96ec863a0e70cec0#p64456"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "Re: I have an unknown lump in my lower back area..",
    "content": "Hi,  There's really no way to tell without a physical examination. It could be just a bony prominence which is normal and you just noticed it recently.   I would suggest a visit to your doctor to have it checked.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Wed Dec 03, 2008 3:55 am",
    "category": "Oncology",
    "sub_category": "Cancer of Unknown Primary",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=65069&sid=e93b5ffd5adc19aa96ec863a0e70cec0#p65069"
  },
  {
    "author": "COkar  Guest Posts: 1 Joined: Wed Sep 10, 2008 5:37 pm Gender: Male",
    "title": "Patela Nodule",
    "content": "I am writing for my 79 year old father.  He has a nodule below his kneecap shaped like an egg; about half the size of small egg; no pain involved; doctor tried to aspirate 2 times and got nothing; had blood work done and white cell count normal, no fever, rheumatoid arthritus negative; doctor had MRI done - either he or Radiologist says Bursitis How can this be with no pain ever and no fluid in nodule; My dad also has unusual fatigue and no energy for more than 3 months He monitors his blood sugar well, has good blood pressure, had good PSA 4 months ago, no fever\n\n",
    "posted_time": "Post  by COkar » Wed Sep 10, 2008 5:57 pm",
    "category": "Oncology",
    "sub_category": "Cancer of Unknown Primary",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=60255&sid=e93b5ffd5adc19aa96ec863a0e70cec0#p60255"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "Re: Patela Nodule",
    "content": "Hello,  Prepatellar bursitis causes pain and swelling in front of the kneecap during acute phase of inflammation. If the condition is repeated and following recurrent attacks of acute bursitis, thickening of the bursa tissue occurs and folds of bursa tissue are formed and felt as lumps.  MRI is the test of choice and any suspicious signals would direct further investigations. So, I assume that his doctor did not see any malignancy concerning features on your father͗s MRI.  However, considering his personal history of prostate cancer and assuming that this a recent swelling, it is better to  do a new PSA and a bone scan to exclude serious causes like bone metastasis although unlikely if MRI results are very clear and not just suggestive  I advise you to discuss these possibilities with his doctor to be reassured that he has excluded all serious causes for this swelling. You also should observe this swelling and any changes like increase in size should be reported to his doctor.  Hope you find this information useful. Best regards.\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Tue Oct 14, 2008 8:37 pm",
    "category": "Oncology",
    "sub_category": "Cancer of Unknown Primary",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=62180&sid=e93b5ffd5adc19aa96ec863a0e70cec0#p62180"
  },
  {
    "author": "LCampbell  Guest Posts: 1 Joined: Thu Sep 18, 2008 8:28 pm Gender: Female",
    "title": "Lumps in Multiple Body Parts",
    "content": "In April 2008 I found a lump in my breast.  I had just finished nursing my second child and wasn't overly concerned, but given my history in 1995 with a breast lump and breast biopsy, I wanted to see my doctor.  My doctor advised a mammogram and ultrasound, which I had.  They saw the lump and believed it to be \"fatty tissue\" and said that it should go away with my next couple menstral cycles.  The lump remains present and unchanged.  In January 2007, I began getting similar, but smaller \"cysts\" on my labia.  My doctor tested me twice for HSV and determined that the test was negative.  Now that I have sporadically had those lumps on my labia, the doctor believes that various glands are becomming blocked.  He said the only way to manage this would be to excise the gland.    This week, I have had numerous lumps to pop up.  One is in the tip of my tounge, one is under my tounge on the roof of my mouth, one on the back of my ear lobe and one on my labia.  They are all a little painful, especially the tounge!  I feel like my doctor thinks I'm being dramatic about the discomfort and I don't want to appear to be a complainer, but I think that 4 \"cycsts\" in one week is a little extreme.  Are these related to my immune system?  Could this be due to stress?  I do have some work related stress and two small children, but these health issues are sending me further into worry.  Thanks for your feedback!\n\n",
    "posted_time": "Post  by LCampbell » Thu Sep 18, 2008 8:42 pm",
    "category": "Oncology",
    "sub_category": "Cancer of Unknown Primary",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=60947&sid=e93b5ffd5adc19aa96ec863a0e70cec0#p60947"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "Re: Lumps in Multiple Body Parts",
    "content": "Hello, Breast lump appears to be unrelated to other lumps in your body, so we are going to discuss each separately.   Regarding the recently developed breast lump that was confirmed by mammography and US, close follow up and serial radiological examination is essential considering your past history of breast lump and biopsy. So, I advise you to follow up with your doctor for proper clinical examination, evaluating the need of pathological examination of this lump.   Regarding lumps developed on the external genitalia, it sounds to be Bartholin's abscess or cyst. Bartholin's glands are glands in the vaginal lips that once infected become swollen and painful. In some occasions following infection blockage in their main duct occurs, and a cyst develops. Cysts are felt as a painless swelling. Bacterial infection is the common cause and is treated with antibiotics.   Herpes virus infection exclusion is essential and since you have been tested negative twice its possibility became remote. Tests for herepes infection include viral culture (still the diagnostic test of choice for HSV skin infections) and blood tests (serological testing for AB is commonly used). PCR analysis is not routinely done and is used for more serious types of infections (e.g. suspected CNS infection). Tumors in this part of the body (benign or cancerous) are extremely rare.  Regarding lesions developed in oral cavity and ears, infectious causes should be first excluded including viral, bacterial and fungal (remote) causes.  Herpes simplex is more likely to give symptoms similar to yours and it is true they develop following periods of stress.   Genital herpes is caused by a different type of the same virus that causes gingivostomatitis, recurrent herpes simplex virus infection can occur on the tongue. HPV should be in mind although your presentation is not typically for HPV infection and its sequels but being positive for HPV, it is of consideration. Cancer in the tongue usually develops as a painless bump on one side of the tongue.  Other possible causes include bacterial infections, immune system problem or an allergy.   Possible causes can be determined after careful history taking and examination. Please follow up with your doctor and discuss with him these causes in your next visit.  Please keep us updated. Best regards.\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Thu Oct 09, 2008 9:40 am",
    "category": "Oncology",
    "sub_category": "Cancer of Unknown Primary",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=62007&sid=e93b5ffd5adc19aa96ec863a0e70cec0#p62007"
  },
  {
    "author": "drew0076  Guest Posts: 1 Joined: Thu Sep 04, 2008 9:21 pm Gender: Male",
    "title": "Lump on inner thigh",
    "content": "I am a 32 year old male that noticed a small marble sized lump close to where my thigh meets my groin.  (it is located on my thigh side) I noticed this lump about 2 weeks ago and have been watching it.  It appears to have grown enough to notice a size difference.  It is not painful.  any suggestions? I did see that a 25 year old male had two lumps on the inner thigh, but I do not believe that we are discussing the same issue.\n\n",
    "posted_time": "Post  by drew0076 » Thu Sep 04, 2008 9:27 pm",
    "category": "Oncology",
    "sub_category": "Cancer of Unknown Primary",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=59881&sid=e93b5ffd5adc19aa96ec863a0e70cec0#p59881"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "Re: Lump on inner thigh",
    "content": "Hello, It is probably a lymph node (inguinal) as it occurs in a lymph node region. Inguinal nodes are usually considered abnormal when larger than 1.5 cm.  Common causes of enlargement include infections in the area drained by this lymph node like the leg or foot, genitourinary or the lower part of the abdominal wall. Following recovery from infection or inflammation nodes regress in size but never to their normal size thus remain palpable.  Clinical examination is essential to define the characters of this swelling and the need for further evaluation by investigations. So, I advise you to follow up with your doctor.  Please keep us updated. Best regards.\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Sun Oct 05, 2008 8:51 pm",
    "category": "Oncology",
    "sub_category": "Cancer of Unknown Primary",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=61885&sid=e93b5ffd5adc19aa96ec863a0e70cec0#p61885"
  },
  {
    "author": "jmcman13  Guest Posts: 3 Joined: Mon Sep 15, 2008 3:20 pm Gender: Male",
    "title": "pea-size bump on inner forearm",
    "content": "Today I noticed a pea-sized hard bump under my skin on my inner forearm. It doesnt move with the skin, and it doesnt hurt. I saw my family doctor today and she said its nothing to be worried about. But I am still concerned, being that I have never had anything like this before. Should I see someone else? She said more than likely it is a fatty tumor, or a possible bump from an injury? Any help is appreciated. I am only 26 and very concerned. Thank you all again.\n\n",
    "posted_time": "Post  by jmcman13 » Mon Sep 15, 2008 3:37 pm",
    "category": "Oncology",
    "sub_category": "Cancer of Unknown Primary",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=60571&sid=e93b5ffd5adc19aa96ec863a0e70cec0#p60571"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "Re: pea-size bump on inner forearm",
    "content": "Hello,  From your description it sounds to be a benign superficial skin lump like sebaceous cyst or lipoma that arises from fat cells in the subcutaneous tissues.   Clinical examination is essential for the initial evaluation of any lump and I assume that your doctor did not find any warning sign that mandate further investigations.   I advise you to follow up with your doctor and to inform her of any change in the character of this swelling like increase in its size, redness, pain, or changes in its consistency.  Please keep us updated. Best regards.\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Thu Oct 02, 2008 4:25 pm",
    "category": "Oncology",
    "sub_category": "Cancer of Unknown Primary",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=61758&sid=e93b5ffd5adc19aa96ec863a0e70cec0#p61758"
  },
  {
    "author": "RainieB  Guest Posts: 4 Joined: Wed Mar 12, 2008 1:51 pm Gender: Female",
    "title": "Head lump?",
    "content": "Hello, I was rubbing the back of my head yesterday and noticed the back left side of my head has a hard lump, kind of bone-like.   The other side has the same thing, but is not as pronounced.  Is this something to worry about?  Do certain brain tumors or other cancers manafest here?  Thank you!\n\n",
    "posted_time": "Post  by RainieB » Fri Apr 18, 2008 11:49 am",
    "category": "Oncology",
    "sub_category": "Cancer of Unknown Primary",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=58133&sid=e93b5ffd5adc19aa96ec863a0e70cec0#p58133"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Head lump?",
    "content": "Hello -  Our  skulls are far from symetrical, and they all have lumps  and bumps (which is what lead to the old-time and quite bogus \"science\" of phrenology -- the  \"reading\" of head bumps). What you describe, so long as it is not consistently painful to the touch, is absolutely normal. Oh, and brain tumors  don't cause lumps on the head -- they are strictly inside,which is a big part of the problem, since their confinement inside the skull causes pressure on the brain.   So it sounds like your head is absolutely normal! Good news.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Thu Jul 31, 2008 10:47 pm",
    "category": "Oncology",
    "sub_category": "Cancer of Unknown Primary",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=59085&sid=e93b5ffd5adc19aa96ec863a0e70cec0#p59085"
  },
  {
    "author": "nuknuk11  Guest Posts: 1 Joined: Fri Mar 21, 2008 3:01 pm Gender: Female",
    "title": "Recurrence of Cancer after Extensive Radiation therapy?",
    "content": "Hi...I'll try to make this as brief as possible while also including all pertinent information... first my question...Should I seek a second opinion? Now I'll quickly list past history and recent history... 1995-metastatic adenocarcinoma of cervix with multiple mets to lypmh nodes.  was treated with 6 wks external beam radiation from chest to pelvis and four surgeries which included multiple lypmh node dissection and 3 intra-cessium radiation implant surgeries...  2005- started having unintended weight loss was given multiple tests i.e. colonoscopy/CT scans with no significant findings other than significant narrowing of sigmoid colon (perhaps due to extensive radiation)  2006-2007 weight loss continued... my normal weight has always been around 115lbs but it has dropped to 92lbs at lowest, currently, I'm at 98lbs. Last January (2007) during routine blood test it was noted that I had an elevated blood calcium level (13.5).  As a result of bloodwork my doctor ordered another CT scan and a PET Scan.  The only findings on this most recent CT/PET were... \"glucose metabolism mapping to the region of the pyloric canal..also demonstrating thickening\"  Subsequently, my GI doc  performed endoscopy and found duodenal ulcerations and was treated with antibiotics for H-Pylori (May 2007) and again in Oct 2007.   March 2008... About two weeks ago I woke up with pain in upper epigastric area and it has not yet gone away.  The pain is not excruciating, but is quite bothersome.  It definitely is worse if I move around and is most aleviated while either sitting still or leaning forward.  I have had waves of nausea and vomited only once.  But the nausea is constant, Ifeel like I'm dizzy most of the time and have not had any of my usual energy....very tired.     I visited the doctor yesterday and he has ordered more blood work as well as a sonagram of my gallbladder.    As a cancer survivor my paranoid mind sometimes gets the best of me. While all tests that I've had have not indicated any return of cancer, which is the best news!    However, I cannot help finding myself in some moments weak with worry, second guessing doctors, knowing that I don't \"feel like myself\" and haven't for some time.  Thank you in advance for reading my lengthy narrative and I really appreciate any feedback or additional insights you may have to offer...\n\n",
    "posted_time": "Post  by nuknuk11 » Fri Mar 21, 2008 4:43 pm",
    "category": "Oncology",
    "sub_category": "Cancer of Unknown Primary",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=56594&sid=e93b5ffd5adc19aa96ec863a0e70cec0#p56594"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "Re: Recurrence of Cancer after Extensive Radiation therapy?",
    "content": "Hello there,  I hope you are feeling better by now and that the results of your investigations have all turned out good.  I completely understand the reason for your anxiety and it is normal for someone who has gone through the dreadful experience of dealing with cancer and its management.  It would be very unlikely for the cancer to recur so late after it was treated. Especially given that cervical cancer is curable in its limited stages. Another factor is the negative CT/PET which again makes it very unlikely that you do have a cancer. Nothing can be excluded however, I encourage you to continue pursuing the investigations that your doctor ordered. Please keep us updated.  Best regards,\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Thu May 29, 2008 8:16 am",
    "category": "Oncology",
    "sub_category": "Cancer of Unknown Primary",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=58421&sid=e93b5ffd5adc19aa96ec863a0e70cec0#p58421"
  },
  {
    "author": "murphy1982  Guest Posts: 12 Joined: Mon Aug 06, 2007 7:58 pm",
    "title": "I have found two lumps in my upper thigh",
    "content": "My name is mike Im 25 yearsold male, I recently was rubbing my upper thigh the top of it to be precise and discovered a lump about the size of my pinky nail I instantly panicked and started examining the rest of my leg in doing so I discovered one more about 2inches above the other one but this one is about the size of my thumb nail there is absoultly no pain associated with either one and they don't seem to move there is also no history of cancer in my family at this age anyway Im ocd and very worried should I be worried or does it sound like something else by what ive explained to you, also I will not be insured untill october and am I ok to wait untill then to have them examined\n\n",
    "posted_time": "Post  by murphy1982 » Sun Sep 02, 2007 4:17 pm",
    "category": "Oncology",
    "sub_category": "Cancer of Unknown Primary",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=47226&sid=e93b5ffd5adc19aa96ec863a0e70cec0#p47226"
  },
  {
    "author": "Debbie Miller, RN  Nurse Posts: 4746 Joined: Mon Apr 16, 2007 2:41 pm Gender: Female Location: USA",
    "title": "[no title]",
    "content": "It does not sound like anything that I would consider an emergency.  Your October appointment should be fine unless you start to develop other concerning symptoms.  Of the skin cancers, melanoma is the most concerning and this does not sound like melanoma.  It would be impossible for me to say what it actually is but probably not critical time-wise.\n\n",
    "posted_time": "Post  by Debbie Miller, RN » Tue Sep 04, 2007 4:15 pm",
    "category": "Oncology",
    "sub_category": "Cancer of Unknown Primary",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=47361&sid=e93b5ffd5adc19aa96ec863a0e70cec0#p47361"
  },
  {
    "author": "alice123  Guest Posts: 1 Joined: Sat Mar 08, 2008 9:53 am Gender: Female",
    "title": "lump on the trapezius",
    "content": "I am 53 female for about 6 months my right hand gets tingly when I hold my arm in certain positions and at night it completly sleeps. I was rubbing my back and on the right side on my upper trapezius muscle I felt a hard lump about an inch in size could this cause my hand feel this way? What are some of the things it could be?\n\n",
    "posted_time": "Post  by alice123 » Sat Mar 08, 2008 10:32 am",
    "category": "Oncology",
    "sub_category": "Cancer of Unknown Primary",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=55402&sid=e93b5ffd5adc19aa96ec863a0e70cec0#p55402"
  },
  {
    "author": "murphy1982  Guest Posts: 12 Joined: Mon Aug 06, 2007 7:58 pm",
    "title": "Sorry debbie I didnt specify they are located under the skin",
    "content": "I appreciate the response but I should have better specified they are located under the skin and now I have located a third one.\n\n",
    "posted_time": "Post  by murphy1982 » Wed Sep 05, 2007 7:11 pm",
    "category": "Oncology",
    "sub_category": "Cancer of Unknown Primary",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=47398&sid=e93b5ffd5adc19aa96ec863a0e70cec0#p47398"
  },
  {
    "author": "Debbie Miller, RN  Nurse Posts: 4746 Joined: Mon Apr 16, 2007 2:41 pm Gender: Female Location: USA",
    "title": "[no title]",
    "content": "No problem, but I still doubt you need to worry about getting into the doctor any sooner than planned.  At least I wouldn't be overly alarmed.\n\n",
    "posted_time": "Post  by Debbie Miller, RN » Thu Sep 06, 2007 5:45 pm",
    "category": "Oncology",
    "sub_category": "Cancer of Unknown Primary",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=47433&sid=e93b5ffd5adc19aa96ec863a0e70cec0#p47433"
  },
  {
    "author": "jill  Guest Posts: 59 Joined: Tue Dec 28, 2004 2:36 pm Location: Maryland",
    "title": "no known primary location",
    "content": "my aunt had a brain tumor which was successfully removed.  when they did the surgery, the doctors said it was cancerous and was not the primary site. she has had a history of breast cancer twice and skin cancer once. the doctors checked her thoroughly in the areas they expected to find it, but found nothing. yet they are postive, this is not the primary location. I do not know the type of cancer and as far as I know, neither do they.     She is being treated with chemo and radiation. Are there ever any chances of survival without knowing the primary site?  i realize the type has alot to do with the answer, but she is responding well so far. i am wondering if it is possible it might conitinue. Thank you very much for your time.   before the cancer, she was in excellent health, 65ish female, survived cancer 3 times already and was in full remission for over 15 years. eats very well, mostly fresh veggies. sorry, i don't know the rest of her history.\n\n",
    "posted_time": "Post  by jill » Thu Dec 28, 2006 11:19 pm",
    "category": "Oncology",
    "sub_category": "Cancer of Unknown Primary",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=36912&sid=e93b5ffd5adc19aa96ec863a0e70cec0#p36912"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Hello,  It will be more helpful if you can send more details about the investigations done to search for the primary tumor e.g. scans, tumor markers, of utmost importance the pathological details for the excised tumor mass etc.  Brain metastases of unknown primary origin are commonly seen of a primary lung cancer, while breast cancer, colon carcinoma, and melanoma are followed in frequency.  She has a history of both breast and melanoma cancer which as mentioned before could be a source for metastatic brain lesions. Multiple lesions are seen in brain metastases of both lung and melanoma cancers.  Although the prognosis is generally poor, therapeutic options are individualized and considerations like the general, neurologic status, number and location of brain metastases, and of utmost importance the tumor sensitivity to radiation and chemotherapy.   Treatment options of surgically resectable brain lesions become safer, less invasive, and more effective than many years ago.   A better survival is expected in patients with resectable tumors.  Hope this information is useful. Best regards. Keep us updated.\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Fri Dec 29, 2006 5:02 pm",
    "category": "Oncology",
    "sub_category": "Cancer of Unknown Primary",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=36937&sid=e93b5ffd5adc19aa96ec863a0e70cec0#p36937"
  },
  {
    "author": "raciere  Guest Posts: 2 Joined: Sat Aug 13, 2005 10:13 am Location: seattle",
    "title": "lump in lower neck, high bilirubin",
    "content": "Hello,   i have a visible and palpable mass in the lower portion of my neck (just slightly above the breastbone area)... it is slightly larger on the right side than on the left, but it exists on both sides.  i do notice that it is slightly awkward to swallow.    a general practice doctor examined it and said that the mass was a bit lower than the thyroid, and he was not sure what the lump was.  we did blood tests and my t-4 and t-5 thyroid tests came back normal.  my white blood cell count was also normal.  however... my bilirubin is high.  i am not jaundiced.    is it possible that the mass in the neck and the high bilirubin are somehow connected?  i thought bilirubin was connected to the liver/gallbaldder...   i have an ultrasound scheduled, but in this interim waiting period i would appreciate any input as to what could be going on.  thanks.\n\n",
    "posted_time": "Post  by raciere » Sat Aug 13, 2005 10:24 am",
    "category": "Oncology",
    "sub_category": "Cancer of Unknown Primary",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=18727&sid=e93b5ffd5adc19aa96ec863a0e70cec0#p18727"
  },
  {
    "author": "raciere  Guest Posts: 2 Joined: Sat Aug 13, 2005 10:13 am Location: seattle",
    "title": "[no title]",
    "content": "It has been a while since I posted the original query... but long story short, i was diagnosed with thyroid cancer (papillary), had surgery (complete thyroidectomy), and then massive RAI.  cancer seems to be in remission.  as for the billirubin... sometimes its high, sometimes its low... still a bit of a mystery, but apparently not a major concern.\n\n",
    "posted_time": "Post  by raciere » Tue Oct 31, 2006 10:49 pm",
    "category": "Oncology",
    "sub_category": "Cancer of Unknown Primary",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=35028&sid=e93b5ffd5adc19aa96ec863a0e70cec0#p35028"
  },
  {
    "author": "benji13  Guest Posts: 1 Joined: Mon Oct 31, 2005 6:23 am Location: Malta",
    "title": "CUP Squamous Cell Carcinoma",
    "content": "My 35 year old wife has been diagnosed with metatistic Squamous Cell from an unknown primary last January after noticing a swelling in her tight. She has gone through 4 sessions of Chemotherapy and also two sessions of radiotherapy in her naval region. After the above treatment, the lumps in her stomach went down.  In August she started complaining from a back ache, and a subsequent scan showed that the lumps were back. She has started chemo again but the pain in her back is becoming worse. Docters told us it is caused by the enlarged lymph nodes. Does this mean that the cancer has moved to the lymph nodes? Her virchow's node is enlarged. What does this mean?  I know it is a very tough case, and the prognosis are not so good but I would like to understand things better.  Thanks\n\n",
    "posted_time": "Post  by benji13 » Mon Oct 31, 2005 8:41 am",
    "category": "Oncology",
    "sub_category": "Cancer of Unknown Primary",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=24373&sid=e93b5ffd5adc19aa96ec863a0e70cec0#p24373"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Hello,  Squamous cell cancer represents 10% of light microscopic diagnoses in patients with unknown primary cancer.  It would have been more helpful if you can inform us with the Results of all the investigations that have been done like, CT Scan, MRI, Any lab work or marker studies.  According to the history you have given, the disease was a disseminated one, (metastatic ) at the initial presentation.  After she has completed her 4 cycles of chemotherapy and the local RT another evaluation by the same Imaging technique used at presentation should be done. The aim of this evaluation is to assess the treatment response, the disease status, and subsequently further management. It is possible also to find out the primary lesion later, which would help in specific management.  The appearance of new lesions in other lymph nodes whether abdominal or supraclavicular node within few month would mean that she did not respond well to the regimen used and she needs another line of therapy.\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Sat Aug 26, 2006 5:15 pm",
    "category": "Oncology",
    "sub_category": "Cancer of Unknown Primary",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=33935&sid=e93b5ffd5adc19aa96ec863a0e70cec0#p33935"
  },
  {
    "author": "HappyMommy  Guest Posts: 1 Joined: Fri Aug 19, 2005 1:42 pm Location: USA",
    "title": "What are these pea sized lumps?",
    "content": "I have found several hard and movable pea sized lumps over the past 6 months.  I did have my family doc look at them and he said after feeling it for a second they were lipomas.  However he said lipomas are always present and never hurt.  These come and go, mostly during my period and I do have pain.  The most pain comes right before I find one.  The area gets sore and then it feels like a pulling apart of the skin and then there it is...a small pea.  I have one above my belly button.  I got one above my gallbladder and one over my stomach after having an ultrasound.  Then I got one in my arm pit.  Then during my period I got two of them side by side above my breast in the chest area (where your straps would fall on a swim suit).  I want to believe lipoma because they are nothing to worry about but I don't seem to follow the lipoma rules.  I did have my skin doc look at them too but she had no idea.  So please give a chronic worrier some new info or maybe the type of doctor I should see about these.  Thank you!!\n\n",
    "posted_time": "Post  by HappyMommy » Fri Aug 19, 2005 1:55 pm",
    "category": "Oncology",
    "sub_category": "Cancer of Unknown Primary",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=19092&sid=e93b5ffd5adc19aa96ec863a0e70cec0#p19092"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Dear HappyMommy,  Clinical examination is essential for the initial evaluation of any lump. If these lesions are though to be lipomas, then the condition could be of Familial Multiple Lipomas. When a of groups of fat cells in the subcutaneous tissues  grow spontaneously forming fatty lumps under the skin, the condition is known as lipoma.   The condition is benign. This condition is thought to be of genetic factor.  Patients with this disease present with multiple small fatty subcutaneous nodules which are usually painless. Their number and distribution is different, mainly on the arms, forearms, legs and trunk but may be also in the neck, face and buttocks.   There different variables of the disease like Adiposis Dolorosa when there is a large painful lipomatous lesion. These lesions can be easily diagnosed clinically. US can help in the diagnosis.  If these lesions are suspicious NFAC can confirm the diagnosis or excisional biopsy.  The disease seldom needs treatment, surgical removal is recommended only for large lesions causing problems.  Hope you find this information useful. Best regards,\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Mon Aug 07, 2006 5:42 pm",
    "category": "Oncology",
    "sub_category": "Cancer of Unknown Primary",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=33736&sid=e93b5ffd5adc19aa96ec863a0e70cec0#p33736"
  },
  {
    "author": "hushi  Guest Posts: 1 Joined: Thu Jun 30, 2005 11:35 am Location: the Unite States",
    "title": "lymph node enlarge above pubic",
    "content": "I find enlarged lymph node above right pubic area one year ago. That time, I had  a UTI. My OB doctor said that it is OK. But it always there and recently it  grows ( at beginning, about .5cm, now about 1cm in diameter). It bother me alot now, you know, both emotionally and physically. I feel uncomfortable when I breath or sneeze because I can feel pressure or referral pain at right side pelvic area. Can you tell me which organ will drain to right pubic lymph node, rectum, ovary or bladder?  What kind of specialist I need see? I am scary. Thanks for answer my question.\n\n",
    "posted_time": "Post  by hushi » Thu Jun 30, 2005 2:52 pm",
    "category": "Oncology",
    "sub_category": "Cancer of Unknown Primary",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=16088&sid=e93b5ffd5adc19aa96ec863a0e70cec0#p16088"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Hello,  The inguinal lymph nodes are situated in the crease between the leg and pelvis (more on the outside of that crease, ie, laterally).   They drain the penis, scrotum, vulva, vagina, perineum, gluteal region, lower abdominal wall, lower anal canal.  Common causes of enlargement include infections of the leg or foot, STDs (eg, herpes simplex virus, gonococcal infection, syphilis, chancroid, granuloma inguinale, lymphogranuloma venereum), lymphoma, pelvic malignancy, bubonic plague.  Nodes are generally considered to be normal if they are up to 1 cm in diameter; however, some authors suggest that inguinal nodes larger than 1.5 cm should be considered abnormal.  If it is painful or tender this indicate infection or inflammation.   The pain you feel while you cough or sneeze means that there is irritation of the peritoneum due to inflammation of any pelvic organ whether GI or Gynecological commonly seen in appendicitis.  Hope you find this information useful.  Do not forget that, here is no replacement to a direct clinical examination. Only by complete history and physical examination, the correct diagnosis can be reached.   Best regards,\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Mon Aug 07, 2006 3:39 pm",
    "category": "Oncology",
    "sub_category": "Cancer of Unknown Primary",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=33732&sid=e93b5ffd5adc19aa96ec863a0e70cec0#p33732"
  },
  {
    "author": "DT0619  Guest Posts: 3 Joined: Tue Nov 15, 2005 10:26 pm Location: Valley Stream",
    "title": "High Calcium level",
    "content": "I have just gotten my tests results back, and i went to get a copy of my lab tests before i see the doctor on friday. On my Comprehensive Metabolic Panel,  I have a high calcim level (11.0 mg/DL), high Albumin (5.2 g/DL), AST (49/U/L) and ALT (80 U/L). On my CBC test, my lymphocytes (Absolute) was high. The level was 4529 Cells/mcL. The figures circled, (Which i assume are the ones he will be speaking to me about) is the calcium level and the AST and ALT level. I have been reading the causes of hypercalcemia, and the symptoms i have that correlate to it is exessive thirst and urination, recurrent headaches, and i have back pains, pains in my forearms, and my calf hurts when i drive. I'm 22 years old, and i am fairly nervous. And by the way, my feet are darker than the rest of my body. does this make a difference in any of this. I didn't tell my doc that. should i? Hopefully Thanksgiving will bring me some cheer. Hope someone will be able to help. Have a happy holiday to everyone readign this!\n\n",
    "posted_time": "Post  by DT0619 » Wed Nov 23, 2005 9:46 pm",
    "category": "Oncology",
    "sub_category": "Cancer of Unknown Primary",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=25604&sid=e93b5ffd5adc19aa96ec863a0e70cec0#p25604"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Hello,  I have read your other posts and your hormone profile is very suggestive of Cushing's syndrome, although your dexamethasone suppression test was normal  as I understood.  The blood tests for your hormones should be repeated during periods of less stress as cortisol is a stress induced hormone. If it returns back to normal then other possibilities like poly cystic ovary syndrome PCOS should be excluded.  Females with PCOS experience any of the following symptoms:  - Menstrual irregularity or absence of menstruation,  - Irregular vaginal bleeding,  Due to inadequate progesterone. - Fertility problems  - Increased growth of hair Acne, oily skin, or dandruff  Due to excessive production of androgen (testosterone and DHEAS) - Osteoprotic changes results in bony aches and high serum calcium level. - Pelvic pain  - Obesity  - High Cholesterol  - High blood pressure    -functional hypothyrodism Type 2 Diabetes  Pelvic  US is used in the diagnosis. In this case high cortisol and prolactin could be also due to related stressful conditions.  If your hormonal profile still shows high levels of cortisol, prolactin I advise you to have an MRI or CT to rule out pituitary tumors.  Follow up with your doctor is essential, you can discuss with him these possibilities.   Keep us updated,  Best regards,\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Mon Aug 07, 2006 3:23 pm",
    "category": "Oncology",
    "sub_category": "Cancer of Unknown Primary",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=33731&sid=e93b5ffd5adc19aa96ec863a0e70cec0#p33731"
  },
  {
    "author": "jteasley  Guest Posts: 3 Joined: Mon Aug 09, 2004 12:52 pm Location: Winston-Salem",
    "title": "New CUP Diagnosis",
    "content": "I have been diagnosed with a CUP. I have had surgery and the reccommended course of treatment is radiation therapy. However, when pressed my radiation doctor hedges on radiation being absolutely required. Here is some of his comments to me.  Thanks for you questions and I do appreciate how overwhelming this must be. I did speak to the pathologist. Apparently the pathology was not labeled properly and so nodal counts which are usually done on neck dissections were not done. One node was involved with cancer and there was no extracapsular spread. The size was 3.5 x 5.0 cm on the CT scan which means it is a stage N2a. Your base of tongue biopsy also shows dysplasia which is suggestive  of an underlying malignancy in the base of tongue.  Most people in the country would recommend treatment unless the node was under 3 cm. It is difficult to find information to tell us what the rate of developing a cancer in the throat is but one paper said that it was 44% in patients who only had neck dissection compared with 8% for those who had radiation. We will be presenting your films, slides, and history tomorrow at our tumor board. I will certainly call you after that to let you know what was said.  There is no way to tell whether radiation improves survival because as I said many patients have other medical problems. My feeling is that you are young, healthy and generally in better health than many patients with this diagnosis. You apparently have only one node involved. The survival rate that is often quoted is for patients who present with all forms of neck disease.   My question is due to the side effects of radiation, some not so pleasant, what is the down side to doing nothing but having frequent checkups over the next two years or so.\n\n",
    "posted_time": "Post  by jteasley » Tue Aug 17, 2004 3:32 pm",
    "category": "Oncology",
    "sub_category": "Cancer of Unknown Primary",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=4603&sid=e93b5ffd5adc19aa96ec863a0e70cec0#p4603"
  },
  {
    "author": "Dr. Jeffrey Gordon  Medical Doctor Posts: 127 Joined: Sun Jan 05, 2003 5:22 pm",
    "title": "CUP",
    "content": "My apologies for the delay in your getting a response to your question.  There has been a backlog of questions here at The lounge.  We are endeavoring to respond to all questions, including old ones.  As more of us are responding to questions, we hope to be able to respond to new questions in a timely manner.  I hope that you will visit The Lounge again and that you next experience here will be better than your last.  Your situation is not straight foward and there is not particular right or wrong answers to it.  The upside of treatment is that it could well be of benefit in treating the cancer, especially if there is not much cancer present.  The downside of therapy is that you could have various side effects without much benefit.  The upside of monitoring the situation closely is that treatment could be offered at a time that it is more strongly indicated (and thus the risks of treatment are outweighed by the benefits).  The downside of monitoring the situation is that an opportunity to treat the cancer may be missed or that doing treatment later may be less effective than doing treatment up front because there has been more time for cancer to grow and to spread.  Could you let us know what has developed?  Jeffrey A. Gordon,  M.D.\n\n",
    "posted_time": "Post  by Dr. Jeffrey Gordon » Sun Mar 06, 2005 7:14 pm",
    "category": "Oncology",
    "sub_category": "Cancer of Unknown Primary",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=10480&sid=e93b5ffd5adc19aa96ec863a0e70cec0#p10480"
  },
  {
    "author": "Pdogs08  Guest Posts: 1 Joined: Tue Aug 16, 2005 6:03 pm Location: Northeast Ohio  Contact:   Contact Pdogs08       AOL",
    "title": "HELP - DO I HAVE CANCER",
    "content": "I need your help : fast - please, i'M 16 YEARS OLD, MALE, NO HISTORY OF CANCER IN ME..........  Lately (the past few months) I've been getting an increasing amount of diarehha. It starts off with stomach pains, then the diarehha comes, then its usually okay. This happens, it seems, when I eat certain foods. The diarehha on a scale from 1 to 10, (10 being the worst) is commonly between a 4 and 7. I hope this is just irretable bowel syndrome, but if it is, its minor.  Also, lately, I've been getting a few off and on spells where I feel slighltly weak, and very slightly dizzy. It also seems like i get rather shaky and sweaty with these. These are only off and on about, oh, 1-3 times per week. Maybe this is just in my head, maybe not.  I've mentioned this to my mom, and she dowplayed it, saying its just what im eating if anything, and shes not reallu up to much at all for taking me to the doctors.  What do you think I have, and what do I think I should do. Thanks for the nice replies.\n\n",
    "posted_time": "Post  by Pdogs08 » Tue Aug 16, 2005 6:08 pm",
    "category": "Oncology",
    "sub_category": "Cancer of Unknown Primary",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=18908&sid=e93b5ffd5adc19aa96ec863a0e70cec0#p18908"
  },
  {
    "author": "legioncat  Guest Posts: 2 Joined: Wed Aug 03, 2005 5:11 am Location: Valdosta, Ga.",
    "title": "Worried about lower back pain",
    "content": "I have had lower back pain for 1 and 1/2 weeks. At times it moves around on my side and down toward my lower abdoman. I went to the emrgency room. They checked my urine and said that it was OK. They gave me pain pills for a muscle relaxer. This AM, I woke up in pain feeling very hot and nausiated, and very thirsty. Does this sound like anything that you might be aware of? The medication sheet that I recieved said that tumors could cause back pain. Just wondering what your thoughts are. thanking you in advance.\n\n",
    "posted_time": "Post  by legioncat » Wed Aug 03, 2005 5:27 am",
    "category": "Oncology",
    "sub_category": "Cancer of Unknown Primary",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=18009&sid=e93b5ffd5adc19aa96ec863a0e70cec0#p18009"
  },
  {
    "author": "legioncat  Guest Posts: 2 Joined: Wed Aug 03, 2005 5:11 am Location: Valdosta, Ga.",
    "title": "Re: Worried about lower back pain",
    "content": "legioncat wrote:I have had lower back pain for 1 and 1/2 weeks. At times it moves around on my side and down toward my lower abdoman. I went to the emrgency room. They checked my urine and said that it was OK. They gave me pain pills for a muscle relaxer. This AM, I woke up in pain feeling very hot and nausiated, and very thirsty. Does this sound like anything that you might be aware of? The medication sheet that I recieved said that tumors could cause back pain. Just wondering what your thoughts are. thanking you in advance.\n\n",
    "posted_time": "Post  by legioncat » Wed Aug 03, 2005 7:04 am",
    "category": "Oncology",
    "sub_category": "Cancer of Unknown Primary",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=18012&sid=e93b5ffd5adc19aa96ec863a0e70cec0#p18012"
  },
  {
    "author": "ctri  Guest Posts: 2 Joined: Mon Jul 18, 2005 9:44 pm Location: Massachusetts",
    "title": "Swollen Lymph Node in Neck--7 months",
    "content": "Hello!  I have had a swollen lymph node on the side of my neck for 7 months. (32 years old). It started in January with a flu which was later diagnosed as a sinus infection.  Since then all my glands have gone down to normal size except the one located in the right side of my neck.  I have seen my primary care physician and an ear nose and throat specialist. My blood work has come back normal and a cat scan of the neck showed no other lymph nodes enlarged in that area.  A cat scratch fever test was performed ( I have two cats), but came back false/positive. My primary care doctor and the ear nose and throat doctor have told me not to worry about it. I don't have any other symptoms except for occasional tiredness, but not to a degree that keeps me from performing my daily activities and occassional ear ache.    At times, the lymph node will become large or small. I'm curious to know why this is and what my next step should be-- biopsy?  My doctor feels that it's not appropriate to do another round of tests because I have no other symptoms.  I'm concerned if I let it go, it may become a larger problem. 10 years ago, I damaged my ear drum scuba diving.  I still have my wisdom teeth. Could any of these things be related to my swollen lymph node?  Any insight you can offer is greatly appreciated.\n\n",
    "posted_time": "Post  by ctri » Mon Jul 18, 2005 10:07 pm",
    "category": "Oncology",
    "sub_category": "Cancer of Unknown Primary",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=17042&sid=e93b5ffd5adc19aa96ec863a0e70cec0#p17042"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Hi Ctri, I agree with your doctor. There is probably no need to worry about this. Lymph nodes enlarge when they fight infection. That is actually their primary function. Some lymph nodes never regress to normal size. I think you should only worry about it if you start complaining of other symptoms or its starts growing larger. A biopsy in a neck lymph node is not recommended and in cases suspicious of cancer a fine needle aspiration is recommended to reach a diagnosis.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Mon Jul 18, 2005 11:55 pm",
    "category": "Oncology",
    "sub_category": "Cancer of Unknown Primary",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=17045&sid=e93b5ffd5adc19aa96ec863a0e70cec0#p17045"
  },
  {
    "author": "Michaelii  Guest Posts: 42 Joined: Fri Apr 22, 2005 12:51 am Location: California",
    "title": "Squamous Cell Carcinoma | New Diagnosis | Unknown Primary",
    "content": "The FNA lab just called and said the samples were positive for Squamous Cell Carcinoma in the node.   So, now I'm guessing we don't know the primary...    Also, the sore on my toungue is more concerning now too.   If it is, and or somewhere else is the primary, I don't know what to do?!?!?   My scapula is killing me too, lot's of pain, (about a 3 or 4) intermittantly. I hope and pray it's not in my lungs, that would mean VERY LOW chance of long term survival as far as I can tell!   I've never used tobacco, but what is going on?   PLEASE, PLEASE, PLEASE give me any advice...   The Dr's up here are horrible, distant, uncareing and just plain stupid.   They all dismissed me as being nuts for months while I could have been agressively treating this!   I don't want to die!!!!! PLEASE HELP!!!!!!!\n\n",
    "posted_time": "Post  by Michaelii » Wed Jun 08, 2005 8:42 pm",
    "category": "Oncology",
    "sub_category": "Cancer of Unknown Primary",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=14837&sid=e93b5ffd5adc19aa96ec863a0e70cec0#p14837"
  },
  {
    "author": "Michaelii  Guest Posts: 42 Joined: Fri Apr 22, 2005 12:51 am Location: California",
    "title": "Likely Primary...",
    "content": "Looks like the primary is most likely in a tonsil.  Also, I saw lots of white spiderweb looking stuff on my xray with a white dot, so I am afriad it's met'd to my lung  Plus I've been having lung pains.  God help me.\n\n",
    "posted_time": "Post  by Michaelii » Sun Jun 12, 2005 12:16 am",
    "category": "Oncology",
    "sub_category": "Cancer of Unknown Primary",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=14983&sid=e93b5ffd5adc19aa96ec863a0e70cec0#p14983"
  }
]