[
  {
    "author": "JoycieU  Guest Posts: 1 Joined: Wed Sep 03, 2008 5:22 am Gender: Female",
    "title": "Stomach Carcinoid Tumor with 20-30 polyps",
    "content": "Recently I had an EGD due to many years of GERD and the Carcinoid Tumor was found in my Gastric Body (stomach) and was removed during the EGD.  I was confirmed as a Carcinoid Tumor (Neuroendocrine Tumor).  I went in 10 days later an had another EGD and this time he removed a large stomach polyp and piopsy of other stomach locations.  I'm scheduled to meet with an Oncologist next week.  My question is: What is the recommendation for treatment when there are 20 to 30 stomach polyps in which there was a cancerous tumor?  Should I be concerned about having so many stomach polyps?  Any advice would be appreciated. Thank you\n\n",
    "posted_time": "Post  by JoycieU » Wed Sep 03, 2008 5:40 am",
    "category": "Oncology",
    "sub_category": "Carcinoid Tumor",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=59755&sid=afbb0fa2e11c9f2c9a99259a80338dc5#p59755"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "Re: Stomach Carcinoid Tumor with 20-30 polyps",
    "content": "Hello,  Carcinoid tumors arise from cells known as Argentaffin cells in the gut and the respiratory tract. The appendix is the commonest site to be involved (although accidentally discovered in most of cases) followed by the small intestine.   Various hormones are secreted from these cells like serotonin, histamine, somatostatin and gastrin.  They cause symptoms of flushing, abdominal cramps and diarrhea the so called Carcinoid Syndrome only if they reach the systemic circulation. Since most of these hormones are metabolized in the liver before bypassing the portal (hepatic) circulation into the systemic circulation, they seldom cause symptoms.   Symptoms occur when there is liver metastasis (commonest cause in case of small intestinal disease) or when the tumor can directly reach the systemic circulation (e.g. respiratory tract disease). Involvement of the transverse, descending colon or the rectum seldom cause symptoms.  Initial work up include Octreoscan, a scan that can identify all cells producing somatostatin thus map tumor cells in different parts in the body. Upper Endoscopy, lower Endoscopy or bronchoscopy is used to identify the primary site accordingly. Gastrin hormone should also be evaluated in cases of gastric Carcinoid and if found to be high, B12 level should be determined.  Treatment of non metastatic gastric Carcinoid include resection (endoscopic if <2cm and surgical if >2cm) and biopsy from adjacent gastric mucosa, observation or Octreotide for patients with high gastrin secreting tumors. Those who have normal gastrin level are treated with radical tumor resection and lymph node resection.  Patients are then followed up with gastroscopy every 6 month for three years then annually.  Regarding the multiple polyps that were found in the stomach, pathological results are important to define the possible underlying causes and the best approach.  In some cases, gastric carcinoid presents in the form of multiple polyps and in association with atrophic gastritis and/or sustained hypergastrinemia.   Carcinoid tumors associated with multiple endocrine neoplasms (MEN1) involve mainly the stomach and the upper small intestine. Lesions can also be in the form of multiple polyps. MEN1 is an autosomal dominant disease that affects mainly the pituitary gland, the pancreas and the parathyroid glands. Based on your family history this should be kept in mind although you did not specify the specific type of tumor they had.  The most common type of gastric polyps is hyperplastic polyps located mainly in the antrum and are multiple. Chronic inflammation (e.g. GERD) and Helicobacter pylori infection are thought to be involved in the pathogenesis of this condition. Most physicians consider resection of all polyps of the stomach, and surveillance is the standard of care. Risk of cancer development in the adjacent mucosa is<2%.   Other types of polyps that develop in the stomach are the adenomatous polyps and those associated with familial adenomatous polyposis and are less likely to be the cause. Both need life time surveillance as they carry greater risk for malignant changes.  Hope you find this information useful. Please keep us updated.\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Fri Oct 10, 2008 12:52 pm",
    "category": "Oncology",
    "sub_category": "Carcinoid Tumor",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=62053&sid=afbb0fa2e11c9f2c9a99259a80338dc5#p62053"
  },
  {
    "author": "jlarder  Guest Posts: 3 Joined: Sun Apr 15, 2007 2:26 am Location: UK",
    "title": "Chemoembolisation",
    "content": "My wife aged 76 With Carcinoid Syndrome has recently had a chemembolisation on tumors on her Liver.She developed an infection(Peritinitus) and was in intensive care for 14 days, she is now out on an ordinary hospital ward. She has had an external drain from the chemical  destroyed part of her liver draining bile for the last 3 weeks, this bile now appears to have change to an emulsified tissue, I wondered if tis was normal and all in line for recovery. Very grateful for any relevant information.  Thanks   John Larder\n\n",
    "posted_time": "Post  by jlarder » Sun Nov 04, 2007 3:10 am",
    "category": "Oncology",
    "sub_category": "Carcinoid Tumor",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=49853&sid=afbb0fa2e11c9f2c9a99259a80338dc5#p49853"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi John,  My experience with these types of drains is limited so please keep this in mind when reading this.  From the few patients I have had with a bile drain the fluid keeps its dark green liquid look.    If it is looking more emulsified it may be due to some lipids in the bile or some debris from the embolization.  Unfortunately I really can't give you a good explanation for this.  My best advise would be to talk with her doctor about this.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Mon Nov 05, 2007 11:31 pm",
    "category": "Oncology",
    "sub_category": "Carcinoid Tumor",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=49938&sid=afbb0fa2e11c9f2c9a99259a80338dc5#p49938"
  },
  {
    "author": "jlarder  Guest Posts: 3 Joined: Sun Apr 15, 2007 2:26 am Location: UK",
    "title": "Carcinoid Syndrome",
    "content": "Anyone with any knowledge of  Liver Metastis spreading to the Bones. from carcinoid syndrome. Please details of and where pains occur plus what steps are taken to reduce pains and further spreading. Any advice pertaining to the above gratefully received  Thanks JL   Age 76 , Female, Had Syndrome for 11 years. medication Sandostatin Lar 30  mg monthly plus 2 x 150 mcgs daily  Tumors stable from May 1996 to April 2006 then commenced to grow, embolisation now being considered.\n\n",
    "posted_time": "Post  by jlarder » Mon Sep 03, 2007 12:32 pm",
    "category": "Oncology",
    "sub_category": "Carcinoid Tumor",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=47286&sid=afbb0fa2e11c9f2c9a99259a80338dc5#p47286"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Jlarder,  I am not particularly familiar with this syndrome but wanted to give you at least some information.  Bone pain from metastatic disease can be very severe and difficult to treat.  The area of the pain depends on where the bone is affected.  Commonly, cancers that spread to the bone will spread to the spinal column but other bone involvement is also possible.    Follow up with an oncologist is important.  Best wishes.  Sorry I cannot be of more help.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Fri Oct 19, 2007 8:04 pm",
    "category": "Oncology",
    "sub_category": "Carcinoid Tumor",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=49134&sid=afbb0fa2e11c9f2c9a99259a80338dc5#p49134"
  },
  {
    "author": "jlarder  Guest Posts: 3 Joined: Sun Apr 15, 2007 2:26 am Location: UK",
    "title": "Flatulence with Carcinoid Syndrome",
    "content": "I suffer from the above and have flatulence on  a fairly regular basis. This in Public particulary on Public Transport can be very embarrassing. Is there any medication which can take effect on this, or probably a diet be recommended to ofset this problem I await your comments.  Many Thanks  Joan Larder\n\n",
    "posted_time": "Post  by jlarder » Tue Apr 17, 2007 12:24 pm",
    "category": "Oncology",
    "sub_category": "Carcinoid Tumor",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=40910&sid=afbb0fa2e11c9f2c9a99259a80338dc5#p40910"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "I am not entirely familiar with carcinoid syndrome.  I would suggest you talk with a nutritionist or GI specialist about what type of diet is best for your condition.  You may want to look into a low residue diet.  This is often recommended for GI inflammatory syndromes.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Mon Apr 23, 2007 11:49 pm",
    "category": "Oncology",
    "sub_category": "Carcinoid Tumor",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=41302&sid=afbb0fa2e11c9f2c9a99259a80338dc5#p41302"
  },
  {
    "author": "Downunder  Guest Posts: 1 Joined: Tue Dec 20, 2005 7:11 am Location: Sydney,Australia",
    "title": "False CS Indicators??",
    "content": "Thanks for this site in a wilderness of Carcinoid Syndrome (CS) experts. The net has become a close friend!  My wife (58 yrs) had, by all accounts, a Carcinoid Syndrome-Red flush breast to face, Severe splitting headache & nausea. There was excessive diarrhea some 4 hours later, then 5 hours later passed out vomiting and diarrhea. BP during this episode was 164/94 & 75BPM.  After one well read Doctor picked CS, a 24 hour urine test (1 week after collapse) produced “201” 5-HIAA (Normal <40). A leaking right ventricle has also been identified.   A CT scan of the abdomen with contrast was carried out- NAD.  With this obviously scary diagnosis she demanded another 24 hr urine test. This was done 4 weeks later producing a result of “15” 5-HIAA (Normal <40) A full blood test, liver function resulted NORMAL. The only indications would be pain in the right abdomen at time various and a feeling of warmth in the face occasionally, but never that RED colour.  Questions – Can one have a Syndrome and a high 5-HIAA, reading which then RETURNS TO NORMAL?  – Or is this a result of the fluctuations that are spoken about?  – There seems to be a bit of confusion about the frequency and scale of real fluctuations of 5-HIAA levels. What is considered a dangerous or conclusive level? – Will a third urine test be conclusive? If so how soon should it be carried out? – Is this the best test to confirm one does NOT have CS or should one use upper & lower scopes or go straight to the OctreoScan (yet that seems to only be an 85% hit)?  Thank you again for your efforts on this sight.\n\n",
    "posted_time": "Post  by Downunder » Tue Dec 20, 2005 8:56 am",
    "category": "Oncology",
    "sub_category": "Carcinoid Tumor",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=27009&sid=afbb0fa2e11c9f2c9a99259a80338dc5#p27009"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Dear Downunder,  Signs and symptoms of carcinoid tumors vary greatly, depending on the location, size, and existence of metastasis. Some cases are asymptomatic and diagnosed accidentally during endoscopic examination.  Early symptoms of carcinoid tumors, (mainly midgut with metastasis), include cutaneous flushing, of the head and neck, a profuse and often colicky diarrhea, wheezy chest, and symptoms of valvular heart lesion.  Patients who have flushing without a large tumor or metastasis are difficult to be diagnosed.  Imaging studies, endoscopy, and increased urinary 5-HIAA can always help to reach the diagnosis.  CT is more helpful for large tumors or metastatic lesions in lymph nodes and the liver. Endoscopy and endoscopic US have replaced the need for Barium enema and barium follow-through with X-ray. Radionuclide scan like OctreoScan are of great help as these substances are taken by the carcinoid cells and make them easily seen by imaging. Although detection of urinary 5-HIAA is the single best screening method for carcinoid tumors, it is not always a reliable test, and the measurement of other blood peptides like serotonin,  chromogranin A, Substance P SP are important in such cases.   The urine 5-HIAA test may be strongly influenced by special diet and drugs. This is due to the fact that serotonin is elevated after the intake of certain foods like bananas, avocados, pineapple in addition to some medications. Other drugs are known to decrease the level of 5-HIAA as well. Thus,The patient must be on a special diet before and during the urine collection for  the 5HIAA test.    Worth noting that, in many studies, non specific elevation of the levels of 5HIAA were found in cases of diarrhea due to irritable bowel syndrome, microscopic colitis, inflammatory bowel disease, laxative abuse, or pancreatic insufficiency and other unexplained cases of diarrhea. In another study patients with appendicitis showed also nonspecific elevated level of this hormone.  I advise you to take an appointment with a consultant for complete examination and further investigation.  Best regards,\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Fri Jul 14, 2006 10:30 am",
    "category": "Oncology",
    "sub_category": "Carcinoid Tumor",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=33407&sid=afbb0fa2e11c9f2c9a99259a80338dc5#p33407"
  },
  {
    "author": "ntschon  Guest Posts: 1 Joined: Sun Oct 16, 2005 11:44 am Location: canada",
    "title": "Second opinion on radiation for carcinoid",
    "content": "I had two lobes removed in June for typical carcinoid tumour, by a renowned surgeon in Montreal.  Afterward, I was told I required no further treatment aside for x-ray follow up of the region of the surgery.  A letter my doctor wrote to my attending physician says my margins are clear.  When I recovered more, I requested to be seen by an oncologist to ensure that I had no other growths and to run the three important carcinoid markers, 5HIAA, Chromogranin, and Octreoscan.  My new oncologist told me that since my tumour was typical, and since it was in the lung these tests were not necessary.  He is not a carcinoid specialist, and this information seems to oppose what carcinoid specialists are saying in the resources I have found.  The oncologist is also telling me, that my margins are positive, and that I should have had radiation long before this.  He  has scheduled it in 2 weeks. I have been told by carcinoid patients that radiation isn't very effective.  Also, how could the surgeon not have seen in my pathology that margins were positive?\n\n",
    "posted_time": "Post  by ntschon » Sun Oct 16, 2005 11:53 am",
    "category": "Oncology",
    "sub_category": "Carcinoid Tumor",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=23454&sid=afbb0fa2e11c9f2c9a99259a80338dc5#p23454"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Dear ntschon,  In general pulmonary carcinoid tumors rarely produce 5-hydroxyindoleacetic acid (5-HIAA). Thus, urinary 5-HIAA excretion is not a routine preoperative test in symptomatic patients.  My main concern is the results of the pathological examination and your further management.  The results of your pathology is conflicting according to the opinion of the two consultant you have visited.   It is of utmost importance the detailed results of the pathological examination. Prognosis and further management are different according to the pathological details.  The primary curative approach in the management of carciond tumors of primary lung origin is complete surgical removal using different surgical techniques.  Carcinoid tumors of the lung carry better prognosis than other types of lung  cancer. The overall 5-year survival rate is of 78-95% and the 10-year survival rate is of 77-90%.  Moreover, typical carcinoid tumors show better prognosis than the atypical forms. The incidence of Lymph node metastases is very low and lymphadenctomy is not needed in the surgical resection for many cases.  The 10 years survival after surgical resection of the primary lesion with adequate margin  are > 90% for patients with stage I disease and 60% for patients with stage II disease.  There is no role of RT and chemotherapy in the treatment of localized disease.  The role of chemotherapy and or radiotherapy is palliative in metastatic cases. Radiotherapy is sometimes considered in unelectable carcinoids of the lung or for local control measures.  My advice to you is: You have to check with the pathologist the results of your pathological examination to reach definitive diagnosis. Then contact your surgeon who has done the previous operation. Inform him with all these details and discuss with him the possibility of re-excision.  Best regards,\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Fri Jul 14, 2006 9:43 am",
    "category": "Oncology",
    "sub_category": "Carcinoid Tumor",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=33406&sid=afbb0fa2e11c9f2c9a99259a80338dc5#p33406"
  },
  {
    "author": "wellwisher  Guest Posts: 1 Joined: Fri Jan 27, 2006 8:40 am Location: Arkansas",
    "title": "Long-term phentermine use and carcinoid",
    "content": "Age 43 Female Past Diagnoses & Surgeries - gastrointestinal stromal tumor - resected 9/03; hysterectomy, carcinoid tumor in appendix -resected 1/04 No family history of cancer Current Rxs - singulair; wellbutrin XL; zyrtec; vivelle dot; proventil as needed; phentermine  Four years ago, \"Turn off the Hunger Switch\" by Dr. Paul Rivas convinced me his recommended therapy of phentermine was the answer to my problems and that long-term use wasn't a problem.  I've been taking phentermine ever since.  I've been having symptoms again similar to what I experienced when I had the carcinoid tumor -- flushing on face & neck, raynauds in my fingers and toes, abdominal pains.  Could a carcinoid tumor be caused by long-term phentermine use?  Thank you for any info you can offer.\n\n",
    "posted_time": "Post  by wellwisher » Fri Jan 27, 2006 9:24 am",
    "category": "Oncology",
    "sub_category": "Carcinoid Tumor",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=29338&sid=afbb0fa2e11c9f2c9a99259a80338dc5#p29338"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi wellwisher, The use of phentermine is recommended only on a short term basis (not long term). There has been documented associations in regards to heart/valve disorders as well as carcinoid syndrome/tumors. I would question the long term prescribed use of this particular medication. Sincerely, Theresa Jones, RN\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Thu Jul 13, 2006 7:33 am",
    "category": "Oncology",
    "sub_category": "Carcinoid Tumor",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=33384&sid=afbb0fa2e11c9f2c9a99259a80338dc5#p33384"
  },
  {
    "author": "Katherine  Guest Posts: 1 Joined: Tue Feb 08, 2005 2:27 am Location: Calgary",
    "title": "Help me Please",
    "content": "This will probably be a long post but I am not sure what else to do but seek help in a place like this. I have been sick for about three years. I have Hashimotos and have lived with fibromyalgia for almost 10 years. I take no drugs for my fybro and have a high tolernace for pain. I have four children and am a busy wife and mother. I work full time.My husband is a class 1 driver so is gone all week. Three years ago a pain started in my right side. It was intermitant and I just put up with it for a while. It got quite annoying so I trotte off to the doc who sent me to the hospital where after a couple of days they decided to out my appendix. Voila that pain felt much better . Three weeks later the doc called me I had a 2mm carcinoid tumor in the appendix. they were surprised because at the hospital I had no fever or elevated blood count no symptoms beyond unbearble pain. After they took it out and found the tumor and a gummed up scarred appendix from many infections they kinda thought it was funny I had no pervious signs. about two months later pain started in my left side and started having problems going to bathroom have horrible bout s af diareah and sometimes constipation. They tested everything , cat scan xray blood tests, bone scans. Nothing. everything is fine. months went by. I am getting tired all the time, they check thyroid oh its just hashimotos you will feel better in a few months. I take my pills and months later still feeling bad. Get a bad flu throwing up and end up in hospital twice dyhydrated with horrible watery diareah. They send me for all the tests again colonoscopy, endoscopy, xrays . Surgeon says no looks good. I get these weird flushes sometimes. My face feels lie it is burning and getts all red. I am soooo exausted all the time. Tired of them testing me and saying nope  nothing. I am not crazey. I am fed up. Afraid to go back to docs because they are tired of me saying I am sick still. Pain in left side by ribs wrapps around to back. Always around everyday. A dull ache makes it hard to sleep. Bowels sometimes are weird color a yellow and a couple of times almost white and they are all broken up and float I don't get it at all. can someone shed light on me or am I just a hopeless cause I am getting depressed over this.\n\n",
    "posted_time": "Post  by Katherine » Tue Feb 08, 2005 2:57 am",
    "category": "Oncology",
    "sub_category": "Carcinoid Tumor",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=9054&sid=afbb0fa2e11c9f2c9a99259a80338dc5#p9054"
  },
  {
    "author": "Dr. Shank  Medical Doctor Posts: 40 Joined: Mon Sep 05, 2005 3:46 pm Location: 715 W. North St., Lima, OH   45801, USA",
    "title": "[no title]",
    "content": "Dear Katherine:  Thank you for your detailed post.  That makes my job a lot easier and my reply a lot shorter.  You did not mention, however, whether your carcinoid was benign or malignant.  Since you have given an almost textbook description of carcinoid syndrome, I believe that it was malignant.  If the primary tumor was in your appendix, even having the symptoms that you describe would be virtually diagnostic of metastases.  The blood from that area drains to the liver, which is usually able to breakdown the highly active hormones and hormone-like substances that may be produced by a carcinoid tumor.  Symptoms from a tumor originating in structures derived from the embryonic hindgut usually mean that the tumor has spread to the liver itself or to tissues that do not drain into the liver.  The first thing you must have is an endocrinologist, which you are obviously have not had.  Endocrinologists are the experts in endocrine cancers, like carcinoids (and in Hashimoto's, for that matter).  You can find an endocrinologist near you by searching the website of the American Association of Clinical Endocrinologists (http://www.aace.com).  The next thing you need is testing for a long list of chemicals that could be produced by a carcinoid tumor, with an emphasis on those that might explain your symptoms and physical findings.  The primary reason for this is to identify the products of your tumor to use as markers of your disease activity.  The other reason is that drugs are available to block the effects of many of the products of carcinoid tumors.  The endocrinologist will know how to do all this.  The third thing that you will need is an octreotide scan.  Nearly all carcinoid tumors have receptors for somatostatin.  Octreotide (Sandostatin) is a synthetic version of somatostatin.  A radioactive tag attached  to the octreotide molecule will tend to accumulate at the site(s) of carcinoid tumors.  While this is the best test for locating carcinoids, unfortunately, most carcinoid tumors are too small to show up by this or other imaging.  CT, MRI, ultrasound, and PET scanning have virtually no role.  If tumor can be identified, it may be surgically resectable.  That may reduce your symptoms and extend your life, but it will not be curative for metastatic carcinoid.  Next, you will need to be treated with octreotide.  It can be given in a long-acting form (LAR), usually once a month.  Octreotide reduces the production of these chemical substances by carcinoid tumors and usually tends to shrink the tumors, or at least slow their growth, and it prolongs life.   It seems to be more effective than the other synthetic versions of somatostatin.  Massive doses are sometimes required.  Interferon has been reported to work with octreotide. Octreotide can be used to selectively carry powerful radioactive substances to the tumor cells (such as with Indium-111-octreotide).  [131I]-metaiodobenzylguanidine (131I-MIBG) is commonly used in the diagnosis of other types of hormone-secreting tumors, but some benefit has been reported with using it in high doses for carcinoid tumors.  Conventional chemotherapy is not very effective. Conventional radiation therapy may give partial temporary relief for local symptoms.  Thiazoladinediones are drugs that are most commonly used to treat diabetes.  Two of them are available: rosiglitazone (Avandia) and pioglitazone (ACTOS).  Both of them have been shown to have very favorable effects on abnormal cell growths, including some tumors and even cancers.  There is one report that pioglitazone reduced the growth and caused a special type of cell death called apoptosis (analogous to suicide) in carcinoid cells grown in the laboratory. Since the thiazoladinediones are extremely safe, they would be well worth a try. I would consider using more than the doses that are recommended for diabetes.  Treatment will need to be lifelong. The primary goal should be to control the production of the chemicals by the carcinoid or to block their effects.  Finally, you will have to be monitored for endocrine, digestive, and nutritional deficiencies that can occur with long-term octreotide therapy.  I am concerned about the pain under your left ribs and around to your back.  It suggests either that your carcinoid is producing large quantities of gastrin, which would stimulate stomach acid secretion and could cause intractable ulcers, or that you may have a relatively large tumor in your pancreas.  Metastases to bone, while not common, would also fit your discription.  The \"wierd\" yellow or white floating stools are harder to fit in.  They suggest that you either have some sort of biliary obstruction or that you are malabsorbing fat.  You could also have these changes if the carcinoid caused food to move through your bowels too quickly for fat to be broken down and absorbed or for bile to be converted by bacterial to the pigment that usually gives stool its brown color.  The comments made to you about your Hashimoto's disease show a disturbing lack of knowledge about the condition.  I suspect that your treatment for the hypothyroidism has likewise been suboptimal.  This may be contributing to our extreme fatigue and your fibromyalgia symptoms.  Fibromyalgia is being increasingly understood as a neuropathy.  In other words, the symptoms are due to abnormal nerve functioning.  Treatment with the same drugs that help to control other types of neuropathies, such as various diabetic neuropathies, can greatly reduce the symptoms, although I find that fibromyalgia patients are usually able to tolerate only very low doses and very slow titration of these drugs.  I hope that this is helpful.\n\n",
    "posted_time": "Post  by Dr. Shank » Sat Sep 24, 2005 6:52 pm",
    "category": "Oncology",
    "sub_category": "Carcinoid Tumor",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=21536&sid=afbb0fa2e11c9f2c9a99259a80338dc5#p21536"
  },
  {
    "author": "sdiamon  Guest Posts: 2 Joined: Mon Jan 24, 2005 2:27 pm Location: Winnipeg, MB Canada",
    "title": "Diagnosis and treatment of Carcinoid tumor",
    "content": "Hello, I'm not sure if you can help me, but I have a number of questions.  My mother recently under went a lobectomy for a 2 cm atypical carcinoid tumor with two affected lymph nodes (also removed). Her doctors, by their own admission, have little experience in carcinoid cancer so we are very nervous about their recommendation to just monitor with CT scans and X-rays. I have read that these cancers are more likely to spread and am also concerned that the previous scans may not have captured other affected cells.  1. Is there any test that can be performed that can better assure us that there are currently no other affected cells? 2. Would a PET scan be effective? 3. What about an Octreoscan? 4. Is there a difference between the two scans? 5. What is the best recommendation to detect for future monitoring?  Thank you for your time. Stacy\n\n",
    "posted_time": "Post  by sdiamon » Mon Jan 24, 2005 4:18 pm",
    "category": "Oncology",
    "sub_category": "Carcinoid Tumor",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8519&sid=afbb0fa2e11c9f2c9a99259a80338dc5#p8519"
  },
  {
    "author": "Dr. Jeffrey Gordon  Medical Doctor Posts: 127 Joined: Sun Jan 05, 2003 5:22 pm",
    "title": "Carcinoid",
    "content": "Thanks for posting your question here at The Lounge.  There are different types, so tyo speak, of carcinoid tumor.  The type that is called typical tends to be indolent, whereas the the type that is atypical can be more aggressive in its behavior.  Carcioid tumors can spread and in your Mother's case, would have spread from someplace, porbably the bowel, to the liver.  There may be others sites of carcinoid in the liver or elsewhere that are too small (i.e.- microscopic) to detect by imaging studies.  PET Scan does not have an indication in carcinoid tumors.  Octreotide scan can at times be helpful, but there can be false psotivie findings that arte not carcinoid.  Even if the octreotide scan is \"clean\", then there still can be carcinoid tumor around that is too small to be detected.  Various blood tests can be done, including chromogranin A, serotonin and histamine.  A 24-hour urine collection can be tested for 5-HIAA and metanephrines.  These blood and urine tests, along with scans, can be used for monitoring purposes.  If the blood and urine tets indicate activity of the carcinoid tumor, then one could consider monthly injections of Octretide to dampen down the production of what the carcinoid is making (the various substances made by the carcinoid could prove harmful over time) and sometimes to overall quiet down the carcinoid tumor.  Various chemotherapy drugs have been tried, but can prove toxic and of a limited benefit.  Perhaps it would be a good idea to consider the opinion of a cancer specialist whom has dealt with and treated carcinoid tumors.\n\n",
    "posted_time": "Post  by Dr. Jeffrey Gordon » Tue Mar 01, 2005 11:02 am",
    "category": "Oncology",
    "sub_category": "Carcinoid Tumor",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=10142&sid=afbb0fa2e11c9f2c9a99259a80338dc5#p10142"
  },
  {
    "author": "sdiamon  Guest Posts: 2 Joined: Mon Jan 24, 2005 2:27 pm Location: Winnipeg, MB Canada",
    "title": "Re: Carcinoid",
    "content": "Dr. Gordon, thank you for your informative response.  We are trying to consult with a carcinoid specialist, but that is proving to be very difficult.  There is no one in Manitoba and since her doctors feel that the surgery was all that is necessary, they are not being too helpful in examining any further treatment other than follow up scans and xrays.  I just wanted to make sure I understand a few things: it sounds like you're saying that the lung tumor she had would have originated from elsewhere and so she most likely still has carcinoid in her body  eventhough her tumor and affected lymph nodes were removed, and she has no symptoms of carcinoid syndrome.  But there are tests that can detect any further carcinoid, and if more carcinoid is found there are drugs that can be useful?  Thank you again,  Stacy\n\n",
    "posted_time": "Post  by sdiamon » Thu Mar 03, 2005 10:57 am",
    "category": "Oncology",
    "sub_category": "Carcinoid Tumor",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=10299&sid=afbb0fa2e11c9f2c9a99259a80338dc5#p10299"
  },
  {
    "author": "Dr. Shank  Medical Doctor Posts: 40 Joined: Mon Sep 05, 2005 3:46 pm Location: 715 W. North St., Lima, OH   45801, USA",
    "title": "[no title]",
    "content": "Dear  sdiamon:  I would like to add to the comments that Dr. Gordon made.  Surgery can only be considered curative for benign carcinoids.  The fact that your mother's tumor had spread to her lymph nodes proves that it was malignant. You are right to be nervous.   Watching and waiting would not be acceptable in her case.  As Dr. Gordon suggested, carcinoids produce any of a bewildering array of hormones and hormone-like substances. Even though the tumors are usually too small to be imaged, they may make enormous quantities of these powerful chemicals. It is usually the chemicals that they produce, rather than the size or location of the tumors, that cause problems.  If carcinoid was suspected before her surgery, these chemicals should have been measured before the surgery, so that her physicians would know which carcinoid markers to follow after the surgery.  It may still be possible for the pathologists to perform special tests on the surgical specimen for some of the common products of carcinoid tumors.  Ttreatment of malignant carcinoid is lifelong. As Dr. Gordon mentioned, conventional chemotherapy is not very effective.  However, almost all carcinoid tumors have receptors for somatostatin, a hormone that reduces the production of these chemical substances by carcinoid tumors and usually tends to shrink the tumors, or at least slow their growth. Octreotide (Sandostatin) is a synthetic version of somatostatin that can be given in a long-acting form (LAR), usually once a month. It seems to be more effective than the other synthetic versions of somatostatin.  With a malignant carcinoid, I personally would not wait for a return of symptoms or a rise in chemical marker levels, before starting treatment with octrotide.  The literature suggests that early or prolonged treatment with octreotide does not lead to any greater loss of efficacy than occurs with  delaying treatment, but delaying treatment does lead to a greater tumor burden, worse symptoms from the carcinoid products, and probably shortened survival.  CT, like PET, is of virtually no value in diagnosing or monitoring carcinoids. The same is true of MRI.  Octreotide scans are the best for locating carcinoids, but they fail to identify the vast majority of carcinoid tumors and metastases.  While it is true that most carcinoids that are recognized during life originate in the pancreas or parts of the intestinal tract that were derived from the \"hindgut\" of the embryo, but the majority that are found at autopsy are located in structures, such as the lungs, that were derived from the embyronic \"foregut.\" They may arise anywhere, however.  Endocrinologists are the endocrine cancer specialists.  They have much more training and experience in dealing with endocrine tumors than oncologists do.  The American Association of Clinical Endocrinologists (http://www.AACE.com) lists two endocrinologists in Manitoba:   David Hirsh Wiseman, MD, FRCP(C), 790 Sherbrook, Winnipeg, Manitoba, R3A 1M3, 204-788-5737, and Vincent C. Woo, MD, 425 St. Mary Ave., Winnipeg, Manitoba, R3ON2, 204-957-3218.  The surgeons have finished their job.  Do not let them stand in the way of your mother seeing an endocrinologist.\n\n",
    "posted_time": "Post  by Dr. Shank » Fri Sep 23, 2005 11:32 pm",
    "category": "Oncology",
    "sub_category": "Carcinoid Tumor",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=21487&sid=afbb0fa2e11c9f2c9a99259a80338dc5#p21487"
  },
  {
    "author": "johnandmarla  Guest Posts: 1 Joined: Mon Mar 07, 2005 12:23 am Location: OREGON",
    "title": "When Sandostatin doesn't work",
    "content": "My wife has been treated for carcinoid cancer for the last 18+ months. The primary tumor has not been located, and the only place it seems to have spread is her bones. She has gone thru many radiation treatments She has tried sandostatin alone and with interferon. Chemo seemed to work for a while between trying sandostatin alone and mixed. She is going thru another round of chemo. Her doctor is excellent and very scientific about his approach. He is very much concerned for her quality of life. I see so much about chemo not being effective for this type cancer. Is there any other treatment?\n\n",
    "posted_time": "Post  by johnandmarla » Mon Mar 07, 2005 12:40 am",
    "category": "Oncology",
    "sub_category": "Carcinoid Tumor",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=10505&sid=afbb0fa2e11c9f2c9a99259a80338dc5#p10505"
  },
  {
    "author": "Dr. Shank  Medical Doctor Posts: 40 Joined: Mon Sep 05, 2005 3:46 pm Location: 715 W. North St., Lima, OH   45801, USA",
    "title": "[no title]",
    "content": "Dear johnandmaria:  You say that your wife was diagnosed with carcinoid cancer that has spread to her bones.  How was this carcinoid diagnosed?  How is the response to therapy being determined?  That information could hold important clues for her treatment.  As you may know, carcinoid tumors are usually not malignant, but they produce any of a large variety of hormones and hormone-like substances.  They are usually very small, but they may make enormous quantities of these powerful chemicals.  With rare exceptions, carcinoids can only be detected by the chemicals that they produce.  Likewise, it is the chemicals that they produce, rather than their size or their location, that usually cause problems.  .  Most carcinoids that are recognized during life originate in the pancreas or parts of the intestinal tract that were derived from the \"hindgut\" of the embryo.  In that case, the the blood draining from them goes through the liver, which is usually able to remove the substances secreted by the carcinoid.  This has led to the widespread, but mistaken, belief that carcinoid tumors only cause symptoms when they have metastasize to the liver or beyond.  Metastases to the bones are well-described, but uncommon.  When they do occur, the chemicals produced by the carcinoid tumors bypass the liver.  From your description, surgery is not an option for your wife's carcinoid.  As you mentioned, conventional chemotherapy is not very effective.  Conventional radiation therapy may give partial temporary relief for local symptoms.  However, almost all carcinoid tumors have receptors for somatostatin, a hormone that reduces the production of these chemical substances by carcinoid tumors and usually tends to shrink the tumors, or at least slow their growth.  Octreotide (Sandostatin) is a synthetic version of somatostatin that can be given in a long-acting form (LAR), usually 10 to 30 mg once a month.  It seems to be more effective than the other synthetic versions of somatostatin.  From your description, I suspect that one of the diagnostic tools has been an octreotide scan, which would imply that the tumor has high levels of somatostatin receptors.  On occasion, massive quantities of octreotide may be needed to control the tumor (I have one patient who requires 20 mg of Sandostatin LAR every 7 days, and gets into severe distress if the dose is delayed just 1 day.).  Interferon has been reported to work with octreotide.  Octreotide can be used to selectively carry radioactive substances to the tumor cells (such as with Indium-111-octreotide).  Strontium-89 has been reported to give relief of bone pain.  High dose chemotherapy plushigh dose radiation therapy, followed by transplantation of a patient's own blood forming cells has been described. [131I]-metaiodobenzylguanidine (131I-MIBG) is commonly used in the diagnosis of other types of hormone-secreting tumors, but some benefit has been reported with using it in high doses for carcinoid tumors.  Except for those few cases in which the tumor can be located and surgically removed completely, treatment is lifelong.  The primary goal of treatment should be to control the production of the chemicals by the carcinoid or to block their effects--tumor effects, rather than tumor size.  Depending upon what the tumor is producing, many drugs can be used to block the effects of the chemicals that are produced.  Unfortunately, without knowing what your wife's carcinoid is producing, I cannot make suggestions for blocking medications. However, many carcinoids produce large quantities of prostaglandins, which may be responsible for (among other things) bone pain; if, as I suspect, your wife is experiencing bone pain from her metastases, I would suggest using non-steroidal anti-inflammatory drugs, which are likely to be far more effective than narcotics.   I would not give up on octreotide, unless she is unable to tolerate gradually increasing to extremey high levels or does not respond even to them.  Thiazoladinediones are drugs that are most commonly used to treat diabetes.  Two of them are available:  rosiglitazone (Avandia) and pioglitazone (ACTOS).  Both of them have been shown to have very favorable effects on abnormal cell growths, including some tumors and even cancers.  There is one report that pioglitazone reduced the growth and caused a special type of cell death called apoptosis (analogous to suicide) in carcinoid cells grown in the laboratory.  Since the thiazoladinediones are extremely safe, they would be well worth a try.  I would consider using more than the doses that are recommended for diabetes.  Apparently, your wife is seeing oncologists.  Endocrinologists have more training in dealing with endocrine tumors than oncologists do.  I would suggest that your wife see an endocrinologist with extensive experience in treating carcinoid syndrome (and in diagnosing and treating the little-known endocrine and nutritional side effects of long-term octreotide therapy).  I hope that this is helpful.\n\n",
    "posted_time": "Post  by Dr. Shank » Thu Sep 22, 2005 10:10 pm",
    "category": "Oncology",
    "sub_category": "Carcinoid Tumor",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=21397&sid=afbb0fa2e11c9f2c9a99259a80338dc5#p21397"
  },
  {
    "author": "bakhteria  Guest Posts: 2 Joined: Sat Feb 05, 2005 7:33 am Location: Virginia  Contact:   Contact bakhteria       Yahoo Messenger",
    "title": "Carcinoid tumors diagnosis",
    "content": "Thank you for reading my post. Any help you can give is appreciated.  Recently I was diagnoised with Central Serous Chorioretnopathy, which is an eye disorder caused by excess cortisol. Most people either get it because of use of inhalers or cushing syndrom. My Dr. tried to find the cause and dismissed the effects having been caused by my excessive flonase use for the two weeks prior to this problem (sinus infection).  The results of my (24 hr urine) tests came back elavated: Cortisol = 22.1 (max limit = 21.0) HIAA = 7.1 (max = 6.0) VMA Creatinine (24hr. urine) = 4.55 (max = 2.5) He was especially alarmed at the VMA level as it was elevated from 18 months ago from 1.9. thyroid, cholerstoral, cbs, liver functions were all with in normal.  He said the above tests and my ongoing abdominal pain and irregular heartbeat, poor sleep, and anxiety may all be caused by the hormone production of this tumor. He sent me for a contrast CT scan and they were not able to identify a Carcinoid Tumor.  What other tests are there aside from ct scan? Is octreoscan any better at detecting this stuff? If the tumor can not be detected by scan,  what does it mean? Are there blood tests? Can ther be another explaination for three seperate 24 hr urine tests to be elavated? You response is greatly appreciated.\n\n",
    "posted_time": "Post  by bakhteria » Sat Feb 05, 2005 7:58 am",
    "category": "Oncology",
    "sub_category": "Carcinoid Tumor",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8943&sid=afbb0fa2e11c9f2c9a99259a80338dc5#p8943"
  },
  {
    "author": "Dr. Jeffrey Gordon  Medical Doctor Posts: 127 Joined: Sun Jan 05, 2003 5:22 pm",
    "title": "Carcinoid",
    "content": "Thanks for posting your question here at The Lounge.  Carcinoid tumor is not the only process or disease that can cause production of various biologically active substances or hormones in the body.  I am not an Endocrinologist, so I cannot speak fully to the cortisol issue.  Usually carcinoid tumors are not known to be big producers of cortisol, although it is possible.  Cortisol can be produced in various non-malignant diseases.  Various cancers could produce it as part of a so-called paraneoplastic process, which means that a cancer is producing a substance that causes a problem.  A pheochromocytoma can produce cortisol.  Carcinoid tumors can be difficult to find on conventional CAT scan imaging.  My experience with Octreotide scans has been mixed, with various false positive findings beeing identified on the scan.  It can be helpful at times in identifying sites of carcinoid tumor.  even if the Octreotide scan is \"clean\", there still could be a carcioid tumor that is too small for the scan to detect.  Various bloo tets can be done to investigate the cortisol issue.  That should be part of an endocrinology evaluation.  A blood test that can be leevated in upwards of 80% of carcioid cases is chromogranin- A.  Urine when collected for 24 hours can be tested for various metanephrines and 5-HIAA.  The blood can also be tested for serotonin and histamine.  If you haven't seen an Endocrinologist yet, then perhpas that may be a good evaluation to get.\n\n",
    "posted_time": "Post  by Dr. Jeffrey Gordon » Tue Mar 01, 2005 10:55 am",
    "category": "Oncology",
    "sub_category": "Carcinoid Tumor",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=10141&sid=afbb0fa2e11c9f2c9a99259a80338dc5#p10141"
  },
  {
    "author": "shubeini  Guest Posts: 1 Joined: Wed Nov 05, 2003 3:10 pm Location: Missouri",
    "title": "What is the newest method to treat carciniod Tumor?",
    "content": "My aunt had carcinoid tumor about 3 years ago, and now tumor has spreaded to other parts of her body # bone.  Does anyone here know the most up-to-date method to treat a patient like her or where can I find such information?  Thank you very much.\n\n",
    "posted_time": "Post  by shubeini » Wed Nov 05, 2003 3:21 pm",
    "category": "Oncology",
    "sub_category": "Carcinoid Tumor",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1564&sid=afbb0fa2e11c9f2c9a99259a80338dc5#p1564"
  },
  {
    "author": "Dr. Jeffrey Gordon  Medical Doctor Posts: 127 Joined: Sun Jan 05, 2003 5:22 pm",
    "title": "Carcinoid",
    "content": "Carcinoid tumors, when arising in the abdomen, often times have spread, but may well be too small to detect on imaging scans.  A carcinoid tumor may produce various substances that can cause symtoms and problems referred to as the carcinoid syndrome (skin flushing, itchiness, fatigue, breathing difficulties, heart problems, diarrhea, to name some of the more common problems).  A medication called octreotide can be used to control the carcinoid syndrome and it can also slow down the growth and activity of the carcinoid tumor.  Chemotherapy in general has limitations in controlling the tumor.  Chemotherapy can be toxic and older people do not tolerate the chemotherapy as well as those who are young.  There are various clinical studies being done to investigate new drugs and the use of biologic medications.\n\n",
    "posted_time": "Post  by Dr. Jeffrey Gordon » Fri Nov 14, 2003 1:09 pm",
    "category": "Oncology",
    "sub_category": "Carcinoid Tumor",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1652&sid=afbb0fa2e11c9f2c9a99259a80338dc5#p1652"
  }
]