[
  {
    "author": "mykittenlovesme  Guest Posts: 3 Joined: Sat Dec 19, 2009 9:59 am Gender: Female",
    "title": "Cardiomyopahy with Inappropriate Sinus Tachycardia",
    "content": "37 years old and Diagnosed with Non-Ischemic Dilated Cardiomyopathy in 2004, as well as IST. Cardiomyopathy currently controlled with medication with LVEF of 50-55%. Several months ago I had an \"attack\" of some sort. Extreme chest pain, pounding heart, couldn't breath, had to lie down. Thought I was having a heart attached. Lasted about 5 minutes and then suddenly gone. I was extremely fatigued afterward, but I haven't had this type of episode since. I advised my cardiologist, but there had been no change in my echo (other than now I have trace regurgitation in all 4 valves where before it was only 2 of them - and a slight 5-10% reduction in the LVEF) so he didn't seem concerned.   My arrhythmia seemed under control until recently, minor chest pains, palpitations and dizziness. A check of my blood pressure last night showed normal, but with a resting heart rate of 109. I know this is not extremely high (before it was 150+) but I would assume my medications would better be controlling the rate. I have never seen an electrophysiologist but am considering that I should. I have had 2 cardiologist now, both have ever seemed concerned about my persistent chest pains and dizziness and fatigue. I'm beginning to wonder if I have some sort of arrhythmia that is just sporadic enough so that it doesn't show on the echo or ekg. Is this possible?   I am not sure what my question is, other than I am frustrated and feel I am not being heard. Any advice you can provide would be greatly appreciated. Thank you.\n\n",
    "posted_time": "Post  by mykittenlovesme » Sat Dec 19, 2009 10:24 am",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=89404&sid=25da02581b95345afb1e922540cf451d#p89404"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Cardiomyopahy with Inappropriate Sinus Tachycardia",
    "content": "Hi there -- Your symptoms are pretty vague and somewhat at odds with the cardiology findings generally. This doesn't mean they aren't real, only that they are odd. You may well have (and may have had prior to the cardiomyopathy) dysautonomia (an imbalance of the autonomic nervous system) which has been aggravated by either the cardiomyopathy and/or medications. The medications, by the way, are totally appropriate to your condition and seem to be working well.  While I don't generally lecture smokers, who know full well what the price of the habit is, I am obligated to point out that with the condition you have you are placing a dangerous additional burden on a weakened heart. Imagine how much better it might be working if you weren't doing that. Okay, end of lecture, if that's what it was. :)  The chest pains don't sound like they are heart related, palpitations are normal even in the heart-healthy population, and the tachycardia you have now is likely reflex tachycardia which is trying to help offset the loss of output from your heart. The tachycardia isn't near extreme enough to warrant an EP study just now, especially since the cause is fairly evident. It is worth noting, however, that despite all these things your LVEF of 50-55% is actually within normal limits and so quite good. Again, imagine what it might be were you not a smoker.   While the chest pains, dizziness and fatigue all sound as though they may be related to mitral valve prolapse syndrome and/or to the obvious dilated cardiomyopathy, they are also something that should be followed within the context of your present illness. You're doing quite well with it overall, but I understand your feeling of not being heard. To be fair to the doctors you're seeing, they've done everything right, and if they cannot find a cause for these symptoms above and beyond what's already known, the best thing you can do is to assume anxiety plays a role,as they do fit the profile of an anxious patient. And, for the third and final time, they could be worsened (as everything always is) by smoking. Again, I don't usually bang this drum all that much, but you have a very significant problem and this is not helping it at all.   You'll need to be followed, obviously, but other than that everything appears to be getting done medically. If you need to discuss the symptoms at some length, this is a good place to do it, and if you could go into any more depth as to what may help set them off it might be helpful. Also, was there an illness, pregnancy, trauma or anything else known to have caused the cardiomyopathy? Is it considered idiopathic (without known cause)? All this information might be helpful in sorting out your symptoms.   Hope this is helpful. Please follow up with us here and keep us updated. Good luck to you.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Thu Dec 24, 2009 1:23 am",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=89797&sid=25da02581b95345afb1e922540cf451d#p89797"
  },
  {
    "author": "mykittenlovesme  Guest Posts: 3 Joined: Sat Dec 19, 2009 9:59 am Gender: Female",
    "title": "Re: Cardiomyopahy with Inappropriate Sinus Tachycardia",
    "content": "Thank you so much for your reply. My cardiomyopathy was attributed to a strep infection, although there was never a definitive finding. I had become \"well\" enough at one point, that my doc allowed me to come off my meds. 2 months in, I got the flu and low and behold my EF went to about 40%. We decided we couldn't tell if it was the flu or the fact that my heart had become worsened by just the lack of medication. Either way, I'll probably never be off of them again. I'll elaborate on my systems: out of breath with minimum exertion and I get extremely hot. I have considered maybe I am perimenopausal and this may could also be the issue (extreme night sweats as well). Minimal exertion being putting clothes in the washer or making up my bed. I get so hot I usually have to shed a shirt (like just now). Along with that I am very fatigued and could sleep much longer than a mother of an 8 year old should. The fatigue seems to be never ending. I have recently gained about 6 pounds for no reason and I have headaches very frequently. My hands also noticeably shake. Recently I had blood work done because of my B12 deficiency and the doctor found that my red blood cells are irregularly shaped even though my deficiency has been remedied with shots and daily supplements. The red blood cell shape along with hemocrit has been abnormal before even without the B12, but no one has ever seemed concerned. I also suffer bouts of diarrhea. I know none of this sounds like it's heart related, which is why I didn't describe before. My husband thinks I am a hypocondriac, however it's all present most every day, I've just tried to learn to live with it. YES, I will be quitting smoking and beginning regular exercise after the holidays. I have my date set. Again, thanks for your response and I'm sorry you were answering me at such wee hours of the morning on Christmas Eve.\n\n",
    "posted_time": "Post  by mykittenlovesme » Thu Dec 24, 2009 9:52 am",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=89812&sid=25da02581b95345afb1e922540cf451d#p89812"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Cardiomyopahy with Inappropriate Sinus Tachycardia",
    "content": "You are very welcome, and thank you for your concern about my answering late on Christmas Eve. I find that remarkable, and really appreciate your observant nature. I'd gotten everything done that needed doing but was by then pretty energized, so took a look here and from the heading of your post alone was drawn in. Now we have some more information which could actually change the whole picture!   First, you are not a hypochondriac. There is a lot going on and it's serious enough to warrant a lot more sympathy than that. Having cardiomyopathy, whether it's permanent or not, is nothing to take lightly. But the cause may be more clear now, because you undoutedly have suffered chronic/intermittent anemia. You mention it was discovered your red cells are irregularly shaped. There are many potential causes of this, but in most instances it will cause anemia because the irregular cells either die off prematurely or are removed from circulation by the spleen and kidneys (or both happens), resulting in a lower red cell count (RBC). This, in turn, could show up not only as B-12 insufficiency but can have a marked effect on the functioning of the heart, with cardiomyopathy as a significant sign. While it is rare for streptococcus (or any bacteria) to cause cardiomyopathy, it can cause myocarditis, an inflammation of the heart muscle. This, in turn, could cause or contribute to cardiomyopathy, (which is most often caused by viral infection). There could be several things going on at once, since this violates no rule and some of those things could overlap. For instance, you might be perimenopausal (some of the symptoms are suggestive of it) but you're still fairly young for that. It's not impossible and should be explored, but also certain types of constitutional anemia (aside from simple iron-deficiency anemia due to malnutrition or chronic bleeding) can cause those same symptoms, as can several chronic infections, especially Epstein-Barr virus (mono). This also, in turn, affects the blood cells, so could cause cardiomyopathy (usually reversible over time). These things need to be explored and excluded, because it seems this condition came on fairly suddenly for no apparent reason -- except that you had a B-12 deficiency before, and we now also know you have some irregularly shaped red cells which, again, can be associated with a number of forms of anemia, some quite insidious. The profound fatigue sounds like a corollary of congestive heart failure (CHF) secondary to cardiomyopathy which, in turn, could be caused by a chronic borderline anemia. It gets potentially pretty complicated. However, it also sounds more hopeful now there are more clues. Also, the moderate weight gain, for no reason, would be consistent with fluid retention such as we see with mild CHF. In short there is a lot here to look at and it seems the dots have not been connected thoroughly, medically, yet. This may yet be a solvable problem, especially if the RBC shape issue can be clarified, to see if there is an arcane type of anemia-causing disease at work that could be treated. This could well be at the bottom of everything else.   Meanwhile you need to get as much rest as you can, not push yourself beyond your limits, live at your own pace, and make it clear to those close to you there is a serious medical condition which accounts for your inability to keep up the pace expected of you. It's not terrible, but it's certainly nothing anyone would want to have to deal with.   Thanks so much for the follow up information. Good luck with your smoking cessation program, and as for the exercise, this is a great idea, but remember at all times to listen to your body and not push beyond your capacity. And rest!   I'm going to do some more research into possible blood disorders and if you can get any more specific information on the RBC shapes that would be a big help. Asking may also get you doctor to thinking, as it's clear not all the questions have been answered nor even asked yet.  Please stay in touch and I hope your holidays have been really good. Take care.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Fri Jan 01, 2010 9:23 pm",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=90480&sid=25da02581b95345afb1e922540cf451d#p90480"
  },
  {
    "author": "mykittenlovesme  Guest Posts: 3 Joined: Sat Dec 19, 2009 9:59 am Gender: Female",
    "title": "Re: Cardiomyopahy with Inappropriate Sinus Tachycardia",
    "content": "Thank you for your reply. I haven't been able to track down any more information regarding my red blood cells, however I will be having another blood draw next week. I did discover that on a separate blood draw, my potassium level was 5.4 and chloride was 106. Both of which I understand is above normal ranges. Also an MRI from several years ago revealed a possible demylenating disorder, however a neurologist dismissed it, even though at the time I had uncontrollable twitching and loss of balance along with severe migraines and blurred vision/color changes in my right eye. Those symptoms have not returned, however, when I have migraines they always settle in my right eye. They have become more frequent and now last 2 day instead of just one. I'll keep you posted of my next labs. I've decided to enlist the help of a different PCP that practices within the Vanderbilt Group here in Nashville. Maybe having all of my medical records in one place, which will be a first for me, will be helpful in determining what could be going on. I so appreciate you, as from what I understand this is a voluntary commitment for you. Your dedication will certainly be of benefit to your career...just be sure you take some time off from time to time, OK?\n\n",
    "posted_time": "Post  by mykittenlovesme » Tue Jan 19, 2010 8:58 pm",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=90726&sid=25da02581b95345afb1e922540cf451d#p90726"
  },
  {
    "author": "MHellman1027  Guest Posts: 1 Joined: Thu Nov 12, 2009 8:05 pm Gender: Female",
    "title": "Cardiomyopathy and Pregnancy",
    "content": "I am a 32 year old gravida 1 para 1.  I was diagnosed with Cardiomyopathy during my pregnancy in 2002 at the age of 24.  It was found that my cardiomyopathy was chemotherapy induced from treatment of Rhabdomyosarcoma in 1985.  My EF prior to delivery was 32%.  After a year of medical management it had improved to 42%, however it was suggested that I avoid further pregnancies and as a result I underwent an elective tubal ligation.  I have since been divorced and remarried and my husband and I are considering attempting to have a child together.  My most recent Echo (Dec '08) showed an EF of 45%, which has been the case for the last 5-6 years without medication.  I understand that I would first have to undergo a reversal of my tubal ligation, but would like to know if it would be safe to proceed?  I would not go thru the procedure and or become pregnant if the risks outweighed the benefits but would like to know nonetheless.  I thank you for your time and any information or advice you could give would be greatly appreciated.\n\n",
    "posted_time": "Post  by MHellman1027 » Thu Nov 12, 2009 8:30 pm",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=86779&sid=25da02581b95345afb1e922540cf451d#p86779"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Cardiomyopathy and Pregnancy",
    "content": "Hi there -- First, good news on the EF, which is near normal now. That's a really big improvemet. The lower-than-normal EF, by itself, would not necessarily make pregnancy -- especially delivery -- more dangerous to you, but the context of it is what matters. You did have cardiomyopathy, it seems to be correcting nicely, and is certainly a lot better than it was during your first childbirth. This is very encouraging, but of course only your cardiologist can give you the full green light, having full access to your records and therefore full knowlege of the details. On the face of it I would think this would be an easier pregnancy and delivery than the first one, but I hesitate to trump your doctor's insight and real-time involvement. The best I can do is say it would seem more promising than the first time around, and you seem do have done remarkably well with that. The tubal ligation reversal might actually pose more of a risk than carrying a baby to term, but again, on the face of it this seems not unreasobable. And again, that is only my speculation from a distance. It should not be construed as a green light to go ahead with either. You'll need to be followed by a cardiologist during all this should it be considered okay to try it. The odds, as they stand right now, would favor a safe and successful procedure and presumably a safe (for you as well as baby) pregnancy. I hope that's the case, but my opinion counts for very little in this instance except informed conversation.  Good luck to you with this. Please follow up with us here as needed and keep us updated.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Sun Nov 29, 2009 8:46 pm",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=87785&sid=25da02581b95345afb1e922540cf451d#p87785"
  },
  {
    "author": "Kisa87  Guest Posts: 6 Joined: Tue Mar 31, 2009 2:03 pm Gender: Female",
    "title": "Hypertrophic Cardiomyopathy",
    "content": "Hi my name is Nicole and I have some questions about HCM. Can HCM be missed or looked over on an echocardiogram, if the technician is not specifically looking for it? Or is it a condition that would be obvious and call attention to itself on an echo image? Also would abnormailites show up on an EKG if this condition was present? I have been diagnosed with inappropriate sinus tachycardia and mild mitral valve prolapse along with panic attacks and I was told these things can mimic HCM, especially the pains and shortness of breath/exercise intolerance associated with IST and MVP.  I was in the ER today because of a HR of 170, which went down in the ambulance to 112, then back up to 170 then slowly back down to normal. I also have been experiencing mild chest pains on my left side that come and go over the past few days. They have a burning and tight feel to them. I am currently taking toprol 50 mg a day. The ER doctor dismissed this as chest wall pain due to palpitations. Is this reasonable to assume? Should I get a second echocardiogram just to be safe? I felt like i wasn't taken very seriously. Thank you for your time.\n\n",
    "posted_time": "Post  by Kisa87 » Fri May 01, 2009 8:17 pm",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=76591&sid=25da02581b95345afb1e922540cf451d#p76591"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Hypertrophic Cardiomyopathy",
    "content": "Hi Nicole --  Thanks for an intelligent question and for bringing your concerns here. While it is possible for very HCM to be overlooked, it is almost never actually missed, because the measurements of the structures and the chambers will tell the story, whether it is slight or pronounced. It is a very clear phenomenon and diagnosis is based upon those measurements. Now then: the symptoms of HCM are partially as you interpret them, but there's more to it than that. For one thing, exercise intolerance is often not seen with HCM, except after the fact. Many athletes have this problem (an exaggeration of \"athlete's heart\") and are able to perform at amazing levels. It is the cool down period where trouble starts, and it can be profound. Also, rapid heart rate is not a hallmark of HCM, while it is usually seen with both MVP and panic disorder, which also tend to go hand-in-hand. So not only do you not have an echocardiographic confirmation of HCM but you don't have the symptology associated with it. The pain in your left chest,while no doubt chest wall inflammation-caused, is not due to palpitations, but due to some inflammatory process, quite possibly due to faulty breathing patterns  which are often seen in people with anxiety/panic problems and, of course, MVP. The pain associated with HCM is different, and occurs either on initial exertion or post exercise. It's just a whole different animal. I'm telling you all these trivialities simply to hopefully convince you there's no reason (including family history, which is also often a factor in HCM) to even remotely suspect you have this more serious problem.  However, you have heard of it (or you wouldn't have wondered about it) and it's natural, especailly among inteligent but anxious people, to worry about these possibilities. I'm here to tell you it's already been ruled out. In order to have symptoms you'd at the very least have to have measurable (and significant) echocardiographic evidence. It's not there. Be glad. You've got your hands full with MVP. Oh, also yes, there would be distinctve EKG changes peculiar to HCM. There are changes often with MVP, too,but they are not distinctive and are very nonspecific when seen at all. Just one more avenue by which you can rule out HCM. It's not there.  I hope this is helpful. I know how difficult it can be to separate out the possible from the proven, especially with given the special focus on these things brought out by anxiety. Trust me on this.   Good luck to you, and if I've left any loose ends hanging out, don't hesitate to ask about them, or at least point them out. My interest is in preventing your from becoming burdened with a concern you don't need to deal with. I know how scary these things can be. Again, trust me on  that.   Good luck to you and really, please  do follow up with us here as needed. This  is important to me, because I want you (and everyone who crosses my path here) to enjoy the best possible quality of life. MVP is enough of a challenge, even though  it's essentially benign and harmless. Good luck to you and please do stay in touch.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Tue May 12, 2009 10:05 pm",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=77919&sid=25da02581b95345afb1e922540cf451d#p77919"
  },
  {
    "author": "Kisa87  Guest Posts: 6 Joined: Tue Mar 31, 2009 2:03 pm Gender: Female",
    "title": "Re: Hypertrophic Cardiomyopathy",
    "content": "Thank you for such a reassuring and informative reply. I know it's just the nature of anxiety to pick one of the worst things you could have and then fixate on it. I do realize that with no family history of HCM and a clean echo that this is obviously not what I have. Thanks again!\n\n",
    "posted_time": "Post  by Kisa87 » Tue Jun 02, 2009 11:13 am",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=80338&sid=25da02581b95345afb1e922540cf451d#p80338"
  },
  {
    "author": "Kisa87  Guest Posts: 6 Joined: Tue Mar 31, 2009 2:03 pm Gender: Female",
    "title": "Re: Hypertrophic Cardiomyopathy",
    "content": "Hello, I had a follow up question. On my echocardiogram, it is stated that Left Ventricle:....\" The Doppler derived early diastolic deceleration time is prolonged at 268 msec\" It then says the overall diastolic pattern is one of normal relaxation and filling pressures.  What does the prolonged deceleration time mean and is it significant? Thanks so much Nicole\n\n",
    "posted_time": "Post  by Kisa87 » Mon Oct 05, 2009 9:12 pm",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=83462&sid=25da02581b95345afb1e922540cf451d#p83462"
  },
  {
    "author": ":hatinglife:  Guest Posts: 3 Joined: Sun Aug 19, 2007 7:41 am",
    "title": "Pain And Things i don't know about :(",
    "content": "My name is jihane habre, 32, female and my son, peter, 14, has been getting pain around his chest and under his armpit area and sometimes just around his back. at the end of may 2007 he had an operation to remove his spleen after falling down the stairs and rupturing it. but since a month ago, hes been getting those sharp pains that come for a second and go. i took him to hospital and i asked the doctor what it could be. he had blood tests and x-rays but there was nothing wrong! the doctor said it could be a bit of air stuck inside him which will be easily absorbed in a while. he's still getting those pains now after a month but they're weak.  from the operation, He's on anti-biotics phenoxymethylpenicilin for 18 months. also now Hes been given buccastem to stop nausea because in the past few days, Hes been feeling sick and Hes not had much sleep and He doesnt have the appetite to eat and every time he gets out of bed or up from the sofa, he gets dizzy for about 3 seconds and he comes back to reality. he just walked up the stairs slowly and when he got there, his heart was beating fast! this wasnt happening before! just these couple of days its happening. i took him to the opticians and they said he cant see long distances so he will be wearing glasses starting from next tuesday! Can anyone help to tell me the problem every time i see him hes crying thinking that theres no point living anymore :(\n\n",
    "posted_time": "Post  by :hatinglife: » Sun Aug 19, 2007 7:51 am",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=46550&sid=25da02581b95345afb1e922540cf451d#p46550"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi :hatinglife:,  I think there is more than one thing going on here.  His vision problem is probably completely unrelated.  His chest pain sounds like it may be a condition called pleurisy or pericardial catch syndrome.  Both conditions can be painful but are harmless.  Probably, they are variations of the same thing where the lining of the lungs gets a bit inflamed and causes pain when it moves.  Deep breathing usually makes the pain worse.  With Pericardial Catch syndrome it is occasionally described as if something is caught that causes pain then gives way and the pain resolves.  These can be treated with anti-inflammatory medications.  His doctor can recommend a proper treatment regimen for him.  The more recent issues of poor appetite, dizziness, and rapid heart rate sound to me like he has an infection (viral or bacterial) and is getting dehydrated.  I would recommend he see his doctor soon to be checked out.  With the removed spleen he is at increased risk of certain bacterial infections, although the penicillin should help prevent this.  Follow up with his doctor is very important.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Fri Sep 07, 2007 3:04 pm",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=47471&sid=25da02581b95345afb1e922540cf451d#p47471"
  },
  {
    "author": ":hatinglife:  Guest Posts: 3 Joined: Sun Aug 19, 2007 7:41 am",
    "title": "Reply",
    "content": "Hi doctor chan lowe, thanks for your reply. I took peter, my son, to the doctors today to receive the results of the ECG. the doctor said the results were perfect and that nothing's wrong with peters heart. He said the reason for those pains on his left and right chest is because his organs or liver or kidney are sticking to the inside of him because of the blood that was left from the splenectomy. He said that the wall of his inside is sticking to the organs. He did say its harmless but can hurt a lot. He said as my son grows older, the sticking will get looser. Dr.Lowe, is he correct? My doctor also said that peter can have another operation so that the surgeon can burn off the sticking but i don't want peter to go through something like that again. Is there any other way peter can live without the pain? Please reply a.s.a.p, Jihane.\n\n",
    "posted_time": "Post  by :hatinglife: » Thu Nov 01, 2007 9:53 am",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=49782&sid=25da02581b95345afb1e922540cf451d#p49782"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi again,  Thanks for the update.  I'm less familiar with post surgical complications; however, following abdominal surgery adhesions can occur.  They typically are not painful.    If the bleeding is the issue this blood should reabsorb and the pain should resolve.  I'm not familiar with this taking months to occur.  I would recommend you talk with your son's surgeon to get their opinion.  Unfortunately, I am not familiar enough with surgical issues to give you a definite answer on this.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Thu Nov 01, 2007 11:48 pm",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=49807&sid=25da02581b95345afb1e922540cf451d#p49807"
  },
  {
    "author": ":hatinglife:  Guest Posts: 3 Joined: Sun Aug 19, 2007 7:41 am",
    "title": "Urinating",
    "content": "Hello Dr.Lowe its me jihane, again. Peter's pains arent really bothering him anymore, hes beginning to forget about them and just get on with life. though something else concerns me. Peter's bladder isnt as strong as it was before the operation. He cannot hold urine as much as before. at night he sometimes urinates in his pants, then wakes up and visits the toilet and changes his pants. And after he urinates, there is a little extra leak of urine in his pants. while and after the operation, peter had a tube going through his penis to his bladder, could this have been the case? Could this be a problem in the near future for peter? what adive, if any would you give him? Thanks, jihane.\n\n",
    "posted_time": "Post  by :hatinglife: » Mon Nov 26, 2007 10:45 am",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50849&sid=25da02581b95345afb1e922540cf451d#p50849"
  },
  {
    "author": "lcgyy  Guest Posts: 1 Joined: Mon Mar 30, 2009 1:50 am Gender: Female",
    "title": "Re: Pain And Things i don't know about :(",
    "content": "Entourage said in court papers that he suffered a concussion, a ruptured eardrum, a burst blood  vessel in his eye and a torn rotator cuff in the July 2005 scuffle with Iverson's security detail. The  altercation occurred when the basketball star's entourage attempted to take over the bar's VIP section, according to court papers. No criminal  charges were filed.   Piven, the Emmy-friendly star of  Entourage,exited the production in December, 10 weeks early, citing health  concerns related to mercury poisoning, which Entourage said he got from eating fish. In the statement, the producers  noted that Entourage have requested \"a wide range of  relevant information\" from Entourage about his \"alleged illness,\" including \"medical records and documentation of Mr. Piven's  activities both during and after the run of the show.\" They also  proposed that all information supplied be \"subject to a strict confidentiality agreement.\" Blige recently guest-starred on Entourage    The L Word is the intimate story about the lives and loves of a group of lesbian friends living in Los Angeles. The show has received a lot of praise for its brilliant storylines and its portrayal of the lesbian community. The L Word is created and executive produced by Ilene Chaiken  who also... Charlie is a well-to-do bachelor with a house at the beach, a Jaguar in the front, and an easy way with women. His casual Malibu lifestyle is interrupted when his tightly wound brother Alan, who's facing a divorce, and his son Jake, come to live with him. Together, these two and a half men confront the challenges of growing up; finally. Complicating matters are the brothers'...  NCIS Spinoff Casts CSI Alumna, Two Others The ensemble for CBS' planned NCIS spinoff continues to flesh out. Not long after it was reported that Chris O'Donnell and LL Cool J are circling two lead roles, three other characters have been cast. Louise Lombard, who played CSI'sSofia Curtis for three seasons, has landed what is considered the series' female lead: Clara, a former major in the military police turned investigator. The Hollywood Reporter also reports that Peter Cambor (Notes from the Underbelly) will play Nate, a quick-witted operational psychologist. Just asNCISwas born of a JAG episode, this latest offshoot will kick off as an episode of NCIS.\n\n",
    "posted_time": "Post  by lcgyy » Mon Mar 30, 2009 2:09 am",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=72406&sid=25da02581b95345afb1e922540cf451d#p72406"
  },
  {
    "author": "munchmissie  Guest Posts: 1 Joined: Sat Jan 17, 2009 3:28 pm Gender: Female",
    "title": "Hypotrophic Obstructive Cardiomyopathy and pain in Right arm",
    "content": "Was diagnosed with H.O.C.M 3 years ago, check ups every year have been fine and on no medication for this condition, but for the past couple of days i  been having pain in whole of right arm, with numbness and pins and needles in fingers and hand area. Have trouble holding a fork to eat, or opening doors etc. Could these be related and what do you suggest i do, Cant get to the doctors till monday.\n\n",
    "posted_time": "Post  by munchmissie » Sat Jan 17, 2009 3:50 pm",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=68742&sid=25da02581b95345afb1e922540cf451d#p68742"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Hypotrophic Obstructive Cardiomyopathy and pain in Right arm",
    "content": "Hi there -   While you are prudent to be concerned, what you describe sounds more like a nerve impingement than heart-related. The weakness and loss of some strength and coordination make it sound like  a cervical or thoracic outlet pinch most likely. I would certainly still follow up with the doctor anyway, just to be certain there's no atypical heart presentation, but it really does sound like a neuromuscular problem based on the features.   Hope this is helpful. Good luck to you and please do follow up with us.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Sun Jan 18, 2009 10:51 pm",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=68918&sid=25da02581b95345afb1e922540cf451d#p68918"
  },
  {
    "author": "tony42  Guest Posts: 1 Joined: Sun Dec 28, 2008 11:56 pm Gender: Male",
    "title": "Dead Sea Salt  /heart disease - cardiomyopathy",
    "content": "This might sound like a silly question but i have cardiomyapaty. I have been told to watch my salt intake . But i take soaking baths using Dead Seas Salts, is that the same as eating table salt ? I know its good for the skin but is that salt entering my body and increasing my salt intake? Is that the same as eating food with salt in it? Should someone with heart disease avoid baths with Dead Sea Salt ?\n\n",
    "posted_time": "Post  by tony42 » Mon Dec 29, 2008 12:10 am",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=66204&sid=25da02581b95345afb1e922540cf451d#p66204"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Dead Sea Salt  /heart disease - cardiomyopathy",
    "content": "Hi there -  Taking baths in salts shouldn't make any difference to the body's serum and cellular salt balance. While we can sweat out a fair amount of salt, we're unable to absorb (omsotically) much at all. It might be smart to shower off after bathing in any sort of salts, but you'd probably do that anyway. At any rate, no, no problem here.   Hope this is helpful. Good luck to you.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Mon Dec 29, 2008 10:03 pm",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=66327&sid=25da02581b95345afb1e922540cf451d#p66327"
  },
  {
    "author": "LeeJones110  Guest Posts: 1 Joined: Tue Sep 23, 2008 9:37 am Gender: Male",
    "title": "chest pains and dizzy",
    "content": "Hi, im 26 and ive been getting pains in my chest which feels like a sharp stabbing pain when i try to breathe in, so it feels like i can only do short breaths, if i try to hold a long inhale the pain gets worse the more i breath in. ive had this problem on and off since the age of 16, at that age i thought nothing of it. usualy happens once a month.   Yesterday at work it happened whilst i was on thre phone and i had to hang up, my main worry is that ive started to feel dizzy now, like going off balance, light headed and i don't know if its linked. ive been to my gp and was told just to come back if it gets worse, that was about 5 year ago, so i have no idea what it is. was just wondering if u had any ideas before i go to my local doctor.   jusr a note, im sat down typing this and i feel dizzy again, it comes and then goes...  thanks  Lee\n\n",
    "posted_time": "Post  by LeeJones110 » Wed Sep 24, 2008 8:36 am",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=61358&sid=25da02581b95345afb1e922540cf451d#p61358"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: chest pains and dizzy",
    "content": "Hello -  Given your description of the symptoms, I think your problem isn't heart-related at all. Pain on breathing in is almost never associated with heart issues (the only exception is pericarditis, an inflammation of the sac surrounding the heart, which can, in fact, cause pain on inspiration at times, but this is almost always an acute problem which wouldn't last for years nor occur on a monthly basis). What I think  you may have is costochondritis, which is an inflammation of the connective tissue between your ribs where they attach to the sternum. It could be something else even less serious than that, but it's a very common cause of the sort of symptom you describe. It is not serious at all, and usually responds to non-steroidal anti-inflammatory agents such as Advil or Aleve.   Why, then, would you feel lightheaded with this happening? I have a theory, and of course it is only that, certainly not a medical opinion, and that is that the lightheadedness may be caused by hyperventilation (most people don't realize they are doing it), and that this is either a result of the pain caused by  breathing (which would cause you to want to try and breathe  more deeply or perhaps do a lot of sighing respiration). In fact, anxious people often engage in this sort of faulty breathing, and that can, in its turn, cause irritation of the costochondral cartilage between the ribs. It can also cause pulling of muscles in the chest wall, which can cause the  same sorts of symptoms and  respond to the same medications.   I can't be certain this is the cause of your symptoms,  but I can at least reassure you that pain on inspiration pretty much rules out a heart problem. I hope that is helpful. Please follow up with us as necessary.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Tue Sep 30, 2008 10:55 pm",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=61667&sid=25da02581b95345afb1e922540cf451d#p61667"
  },
  {
    "author": "MYFREEBIRD77  Guest Posts: 1 Joined: Sun Aug 31, 2008 5:56 pm Gender: Male",
    "title": "\"Slightly Enlarged Heart\"",
    "content": "I'am a 44 white male. Very overweight 300lbs. 5'11  About 3 years ago I had a AF attack and ended up in the E.R. The E.R. sent me home after hours in the E.R. after my heart went back to normal. I was strongly advised to seek out a Cardio which I did. The Cardio doctor did a complete work up and found the following: 1. High blood pressure ( which I apparently had for years...never saw a doctor). 2. \"Slighty\" enlarged heart...which he said was reversable 3. Very obese 300lbs at 5'11 inches 4. Chronic \"skipped beats\" due to LVH The doctor concluded: All my symptoms are \"weight related\" Put on BP meds for  reducing enlargement, skipped beats and lower BP. also lose weight and exercise. My question is does the weight related diagnosis seem logical? He says my skipped beats will go away when I lose the weight. BUT they seem to be getting worse!! I have lost 30lbs so far. Thanks\n\n",
    "posted_time": "Post  by MYFREEBIRD77 » Sun Aug 31, 2008 6:13 pm",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=59630&sid=25da02581b95345afb1e922540cf451d#p59630"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: \"Slightly Enlarged Heart\"",
    "content": "Hello -  First, congratulations on your excellent weight loss progress! It is very impressive and hopefully will inspire others passing through here.  Second, yes, the weight-related diagnosis does make sense, although during times of metabolic change such as you will be undergoing for some time, premature heartbeats are often more frequent even though, again, it is logical (and usual as well) to attribute them to obesity. Once things are more in balance you are likely to see a reduction in them, but for the time being they may well be more frequent. So long as there is no left ventricular dysfunction despite the enlargement, there is little reason to be concerned. The real problem is that they are so common in general that it's difficult to tell when a given condition is causing them. You can have premature heartbeats while in perfect health and fitness as well as illness and non-fitness.   Again, congratulations on your excellent progress. Hopefully this reply is helpful. Keep up the good work.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Wed Sep 03, 2008 12:19 am",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=59747&sid=25da02581b95345afb1e922540cf451d#p59747"
  },
  {
    "author": "stanlottman  Guest Posts: 1 Joined: Tue Aug 26, 2008 7:27 am Gender: Male",
    "title": "Hypertophic  cardiomyopathy",
    "content": "I have been diagnosis with Hypertophic  cardiomyopathy and recommended to go for septal myectomy.I would like to know if there is  possibility of the heart muscle to grow or thicken again and have to go for the surgery again in the future\n\n",
    "posted_time": "Post  by stanlottman » Tue Aug 26, 2008 7:42 am",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=59306&sid=25da02581b95345afb1e922540cf451d#p59306"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Hypertophic  cardiomyopathy",
    "content": "Hello -  While  there is a very small but discrete finding on long-term follow-up of some recurrence of hypertrophy (usually not in the  septum but in the free wall), it is extremely rare, and the surgery has a high rate of effectiveness which far outweighs the tiny risk of recurrence of the problem.  I hope you find this helpful. Best of luck to you. Please stay in touch with us here.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Fri Aug 29, 2008 11:02 pm",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=59548&sid=25da02581b95345afb1e922540cf451d#p59548"
  },
  {
    "author": "ananta  Guest Posts: 1 Joined: Sun Jan 06, 2008 11:58 am",
    "title": "Post Viral DCM",
    "content": "Dear Doctor! I am concerned with the 6 yrs cousin who admitted first time 10 days before.His summary are LVEF:20-25%   Dilated LV= 4.7/4.3 cm  Chest:B/L creps + CVS: S1S2 PSM + P/A: Soft, nonlends no organomeya, pulses alternan 116 Bpm but it was 200 Bpm 3 days before, BP 94/60,Spo2 off o2 91%, Ecg= atrial rhythm and his doctor didnt said more than Post Viral DCM. I would like to know wht is Post vIral means. Will he be healed with medication? how long will it take to recover? or do we have to transplant. Is this a non curable disease? can he live like a normal life? I appreciate your time.         -> Ananta\n\n",
    "posted_time": "Post  by ananta » Sun Jan 06, 2008 1:16 pm",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=52817&sid=25da02581b95345afb1e922540cf451d#p52817"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "Re: Post Viral DCM",
    "content": "Hi Ananta,  Viruses are a well known cause of cardiomyopathy, particularly dilated cardiomyopathy.  There are several viruses that can cause an acute infection of the heart.  In these cases, the patient often presents very ill fairly quickly.  In other situations, the damage is not directly from the virus, per se.  In these cases, the acute infection passes and the damage occurs to the heart after the infection.  Often, this happens because the body forms an antibody or some other immune response to fight off the infection that, unfortunately, also attacks the heart.  Post viral dilated cardiomyopathy is probably one of the most, if not the most, common cause of dilated cardiomyopathy in children.  The outcomes of these cases are very, very varied.  Some cases will recover completely with very little treatment. At the other end of the spectrum, some children go on to need heart transplants.  Many children will need medications to help relieve the heart of some of the work it is doing.  Medications to help the heart squeeze stronger or medicines to help relieve the pressure the heart is beating against can help reduce the work of the heart.  In mild cases, oral medicines may be enough.  In other cases, IV medicines may be needed.  My best advise is to stay in close contact with the cardiologists and doctors involved in your cousins care to see how his heart is doing.  A recent study done in 2006 showed that of 184 children with dilated cardiomyopathy of uncertain etiology (most supsected to be viral) 72% at one year and 63% at five years were alive and without transplant.  Keep in mind that some of these cases may not have been from a viral cause so the correlation is not perfect but overall I think the study shows that while there is a chance of needing heart transplant, many of these children recover without needing one.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Thu Jan 10, 2008 11:16 pm",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=53081&sid=25da02581b95345afb1e922540cf451d#p53081"
  },
  {
    "author": "linds2860  Guest Posts: 1 Joined: Mon Nov 12, 2007 7:09 pm",
    "title": "candidate for treatment?",
    "content": "Hello. I am asking this question on behalf of my mom. She is 53 and was adopted so we don't know her family history. This is kind of long so bear with me. She had no medical conditions prior to this.   June 2005- my mom was diagnosed with stage 2 breast cancer. She had a partial masectomy and some lymph nodes in her armpit area were removed. She underwent radiation and chemo and seemed to be cancer-free when it was all said and done.  During and after this period of time, she was also going through menopause and had severe hot flashes that were actually interfering with daily activities. She was told not to take anything for them, even over the counter things, because they could affect her cancer treatments (I found that breast cancer feeds on estrogen, but hot flash meds increase your estrogen, so it's a catch-22). She had to get dentures because the chemo made her teeth brittle. She put on a significant amount of weight. She was diagnosed with some kind of nerve disorder or syndrome that made her legs swell and be very painful.  Summer 2007- Mom had a surgery to reduce her other breast in order to regain symmetry, This resulted in a horrible infection that actually was a flesh-eating bacteria. Antibiotics seemed to help it heal and it is better now. Then she was diagnosed with a blood clot in her leg but the pain went away with blood thinners.   October 2007- Mom was diagnosed with stage 4 colon cancer. They did surgery to remove the tumor blockage but the doctors said there was too much cancer to cut it all out. It had spread to her liver and both lungs. The doctors said chemo is an option for a prologing of life but they do not anticipate it curing the cancer. While in the hospital recovering from her surgery, mom was diagnosed with cardiomyopathy. The doctors said it is not worth intervening because it is not painful and she is not a good candidate for a pacemaker or anything like that. They say she will die of heart failure before the cancer gets her.  Here are my questions:  I want her to go to a cancer treatment facility and see what they can offer. She is currently getting all her information and treatment at a little hospital in her hometown. The doctors say the liver is not salvagable but she and I are the same blood type so I could give her half of mine. She could also live on one and a half or just one lung. Do you think this is wise? Also, if she were able to get rid of the cancer at this facility, THEN would she be a good candidate for treatment for the cardiomypathy? Even if she can't beat this cancer, why won't they try to deal with the cardiomyopathy to give her as long of life as possible?\n\n",
    "posted_time": "Post  by linds2860 » Mon Nov 12, 2007 7:27 pm",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50236&sid=25da02581b95345afb1e922540cf451d#p50236"
  },
  {
    "author": "Debbie Miller, RN  Nurse Posts: 4746 Joined: Mon Apr 16, 2007 2:41 pm Gender: Female Location: USA",
    "title": "[no title]",
    "content": "Hello, First I would like to commend you on your devotion to your mother.  She is fortunate to have a daughter who cares so much.  I don't know how much we will be able to help you here.  I will give a few of my thoughts.  It would be impossible to say for surewhat the rationale is that make the doctors feel that there is no intervention for the cardiomyopathy.  There are various varieties of cardiomyopahty and treatments vary.  Often the first-line treatment is medication.  Surgical treatment is typically only done if medication does not sufficiently improve the condition.  It would be wise to meet with the doctors and explain the questions that still remain.  Even if they feel they explained it, we all know that it takes repetition for us to remember complex information, especially when received during a stressful time such as illness.    Your mothers doctors are also the ones best qualified to determine the cancer treatments.  Even though you are at a smaller hospital, with computers these days, even small hospitals link into information pools where standards of treatment are spelled out.  This allows cancer specialists' information to be accessible to all doctors, no matter where they are located.  So, ask the doctors about this.  One consideration they are probably making is regarding quality of life.  It may be a kinder, gentler way for her to go from the heart problem than waiting until the cancer eventually gets her.  This can be a long and painful death.  Nobody wants that.  So, while they can make her as comfortable as possible, the difference in her life span may not be worth it when other issues such as what kind of life she faces for that extra time are concerned.    Nobody wants to lose their loved ones and children tend to want their parents to take any treatment possible to keep them there longer.  But, it is important to be sure you have all the facts, risks and benefits and that this is your mom's wish; not just yours.  Again, this is totally understandable, but I just caution you to be sure you have all the information before you conclude that this is not the best course of treatment.  Good luck to both of you and your family.\n\n",
    "posted_time": "Post  by Debbie Miller, RN » Fri Nov 16, 2007 1:37 pm",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50420&sid=25da02581b95345afb1e922540cf451d#p50420"
  },
  {
    "author": "ddavey  Guest Posts: 9 Joined: Wed Mar 09, 2005 7:20 am Location: michigan",
    "title": "mild cardiomyopathy",
    "content": "what determines mild, moderate and severe dilated cardiomyopathy?   my daughter is 2yrs into diagnosis of idiopathic dilated cardiomyopathy.   i had hoped that repairing an anuerysmal bulge near the mitral aortic junction would improve her condition    her ef is 35%  unchanged in 2yrs despite 50mgs of coreg, 2.5 vasotec and 25 inspra      i have been told after getting a second opinion at Uof Mich that repairing or replacing the mitral valve would not improve her condition, and her med regimen is the best course   she is 22yrs old and mentally impaired     how long can she remain \"stable\"  on meds?   i am concerned about the future\n\n",
    "posted_time": "Post  by ddavey » Wed Apr 18, 2007 1:35 pm",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=40954&sid=25da02581b95345afb1e922540cf451d#p40954"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Cardiomyopathies can vary significantly in their course.  Most of this is determined by the underlying cause which is not always able to be found.  Potential causes include viruses, genectic conditions such as muscular dystrophies, and autoimmune attacks among many other possible etiologies.  Mild, moderate, and severe are determined by the degree of reduction in the ejection fraction.  I suspect that the best course for your daughter will be to stay on the medications and continue to follow her heart.  With only mild cardiomyopathy it is unlikely that any more aggressive intervetion will be needed.  Her cardiomyopathy may progress or may heal depending on the underlying cause (however, give not change in two years resolution is probably a little less likely).    Continued follow up with her cardiologist is important.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Tue Apr 24, 2007 4:30 pm",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=41349&sid=25da02581b95345afb1e922540cf451d#p41349"
  },
  {
    "author": "endc12  Guest Posts: 3 Joined: Sat Mar 10, 2007 2:42 pm",
    "title": "MUGA",
    "content": "Which test is more accurate to measure EF (effective fraction)? Is it echocardiogram, angiogram or MUGA ?  The reason I ask is, I was diagnosed with idiopathic dilated cardiomyopathy last January 2006 and I am largely asymptomatic up to this day – no symptoms of fatigue, swelling, or shortness of breath associated with CHF. I’m currently taking Coreg 25 mg & Lisinopril 20 mg (2x a day). Lately, my cardiologist suggested an ICD (implantable cardio defibrillator). So, I asked myself, “Is my heart failing?” I then asked the cardiologist my concerns about ICD such as the recall, drawbacks and advantages. I also asked about my EF’s since I have 3 tests previously done on me: two echocardiograms and one angiogram. The first echo was done on 11/2005 and my EF was 13%. The second echo was performed on 12/2006, EF was increased to 24%. There was an improvement but not remarkable said my cardiologist. I then inquired about my angiogram that was done on 01/2006 after my first echo. No blockages was found, EF was 35%.    I then asked why the difference EF results between the two methods. Is there a more accurate way to do EF testing? My cardiologist then suggested a MUGA test and prescribed additional medication, Spironolactone (a diuretic) 20 mg a day. While waiting for the medical insurance approval for the MUGA test, I have some questions to ask myself or if I may say entertain myself :  Being asymptomatic with no major issues yet and with questionable EF, is it wise to consider right now an ICD procedure?  Should the MUGA results be my ultimate guide to have the ICD?  Is my cardiomyopathy reversible? Should I expect the worst?\n\n",
    "posted_time": "Post  by endc12 » Thu Mar 22, 2007 3:38 pm",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=39783&sid=25da02581b95345afb1e922540cf451d#p39783"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "All three methods (echocardiogram, MUGA and angiogram) can estimate ejection fractions (EF).  Technically echocardiograms measure shortening fractions as they look at the squeeze of the heart walls rather than the actual amount of blood leaving the ventricle.  For simplicity sake, we can assume they are the same (not competely accurate but close enough).    Angiograms provide an accurate measurement of EF but require a heart catheterization to perform.  MUGA scan are a nuclear medicine exam in which red blood cells are labeled with a radioactive tracer.  The radioactivity can then be very accurately measured and a picture taken of it.  This produces a highly accurate measurement of the EF with the added benefit of not requiring a cardiac catheterization.  The MUGA does have some down sides for looking at other heart structures with with regards to EF it is quite good.  The echo is really fairly dependent on who is operating the ultrasound machine.  It can be helpful in following long term progress as well because it is easy to do, rapid and essentially has no dangers.  When ejection fractions fall very low the heart is really not pumping blood adequately.  At this point, the risk of rhythm problems increases.  It is likely that this is the reason for the ICD.  If there is any question as to what your EF really is I would recommend considering the MUGA.  Cardiomyopathies may improve, or they may not.  This is really entirely dependent on the underlying cause.  With idiopathic cardiomyopathy in adults there are several risk factors that contribute to lower likelihood of recovery including older age, male sex, and severe congestive heart failure.  Those with mild cardiomyopathy are more likely to recover than those with severe cardiomyopathy.  I hope this helps a little.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Thu Mar 22, 2007 6:39 pm",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=39785&sid=25da02581b95345afb1e922540cf451d#p39785"
  },
  {
    "author": "endc12  Guest Posts: 3 Joined: Sat Mar 10, 2007 2:42 pm",
    "title": "Ejection Fraction",
    "content": "Is there a mathematical approach to estimate the ejection fraction using your blood pressure readings, i.e, (diastolic less systolic) divided by diastolic multiplied by some fudge factor. I believe this will be an invaluable tool to get get a quick assessment of your heart ejection fraction. This is just a thought . Of course, you still need to see your doctor.\n\n",
    "posted_time": "Post  by endc12 » Thu Mar 15, 2007 10:28 am",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=39622&sid=25da02581b95345afb1e922540cf451d#p39622"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "I am not aware of any such function.  It would be an interesting thing to determine.  Although it may be a complex equation, theoretically it seems as if one would be able to find such a calculation.  It is possible that this exists and I don't know about it.  I wasn't able to find it when I researched it.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Thu Mar 15, 2007 4:54 pm",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=39628&sid=25da02581b95345afb1e922540cf451d#p39628"
  },
  {
    "author": "endc12  Guest Posts: 3 Joined: Sat Mar 10, 2007 2:42 pm",
    "title": "Cardiomyopathy - ICD question",
    "content": "I’m 42 years old male. Last January 2006, I was diagnosed with dilated cardiomyopathy with 35% EF. Currently I’m taking 25 mg Coreg and 20 mg Lisinopril twice a day. About a month ago, I had some palpitation, had an abnormal EKG and the attending physician sent me home and said check with your cardiologist. A week later I saw my cardiologist. He then recommended to see the Electrophysiologist about ICD (implantable cardio defibrillator) for consultation. The doctor asked about my medical history and told me that as of now it’s an “elective” – it’s beneficial but not urgent. Should I go for it? My wife said yes but I’m somewhat hesitant. I feel good. I walk at least 45 minutes a day and once in a while I lift weightsto build some muscles. In addition, I read some recalls about the ICD device. Please advice.\n\n",
    "posted_time": "Post  by endc12 » Mon Mar 12, 2007 9:02 am",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=39526&sid=25da02581b95345afb1e922540cf451d#p39526"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Cardiomyopathy - icd question",
    "content": "Dear endc12,  The indications of having an icd placed are getting wider every day.  i am sure that your electrophysiologist went over the benefits of having the icd placed and the drawbacks.  If your electrophysiologist does not think you need it emergently, this means that there is no absolute indication to put it right away.  Since the main concern is abnormal heart rhythm, there are some tests that can be done to see whether or not a particular patient is prone to have such abnormal rhythms and hence needs an icd placed. These include holter monitors, heart event monitors, signal averaged ekg and even going all the way to having an invasive electrophysiological study done.  You might want to discuss this with your electrophysiologist.  Thank you very much for using our website http://doctorslounge.com and I hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Mon Mar 12, 2007 11:04 am",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=39531&sid=25da02581b95345afb1e922540cf451d#p39531"
  },
  {
    "author": "hairjax  Guest Posts: 1 Joined: Fri Jan 05, 2007 8:18 am Location: florida",
    "title": "abnormal presentation cardiomyopathy postpartum vs viral",
    "content": "37y f dx w/ pp cardiomyopathy after year long f/u w/ cardiologist referred by pulmonary after c/o sob fatigue.  told abn presentation ef 45%- pos pregnancy test 2 wks post dx w/ meds- 7 yrs later postpartum baby and mom fine-have had no sx-this past march syncopal epi-muga results show ef 29%-i had been walking 3 miles a night over the previous 6 mos.  no problelm-ep dr placed aicd, placed on coreg-over the past three years have had transient fatigue-acute, increased muscle cramps/spasms in large muscles also under L breast above ribs. cramps bad enough that when i stand on the floor in the mornings the spasms begin.  i cant help but think there is some connection w/ the cardiomyopathy dx drs say this ways an extremely abn presentation 7 yrs ago low limits of normal on ef and persistent arrythmia-any thoughts or md referral for rare diseases-no family hx of sudden death but positive for heart disease.  any help will be greatly appreciated.  i am a nurse of 16 yrs and have had a hard time getting any of my specialists to connect the dots of sx-they are concerned with the problems at hand- now have had increased weight gain from 120 to 145 over the past year and am fatigued\n\n",
    "posted_time": "Post  by hairjax » Fri Jan 05, 2007 8:39 am",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=37295&sid=25da02581b95345afb1e922540cf451d#p37295"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "[no title]",
    "content": "Hello hairjax - You've given us a really perplexing picture, and it definitely is an unusual presentation. Frankly, unless one of the MDs here has any other idea to offer, I'm thinking, given the muscle  cramps, that you may have some underlying metabolic derangement and that may be related to the cardiomyopathy.  Perhaps a consult with an endocrinologist? Frankly I'm short on ideas beyond that.  Good luck to you and do stay in touch.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Thu Feb 15, 2007 9:52 pm",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=38753&sid=25da02581b95345afb1e922540cf451d#p38753"
  },
  {
    "author": "ddavey  Guest Posts: 9 Joined: Wed Mar 09, 2005 7:20 am Location: michigan",
    "title": "inspra and ejection fraction",
    "content": "Hello again my daughter is now 21, diagnosed with dilated cardiomyopathy in march of 05.  her ef then was 35%.  i have posted her last echo results on another forum.  after seeing her cardio last week, and reviewing her cardiac mri and tee, he has added inspra to the 50 mgs of coreg and 2.5 mgs 2x day of  vasotec, her ef on latest tests was still only 35%.  her mitral valve regurg has increased, from mild to moderate.  she has what is called an anuerysmal bulge near the mitral-aortic junction, tee and cardiac mri showed blood flow within it.  this abnormality has been present since birth.   at some point i believe the valve will need to replaced, as the leakage is increasing.  is she considered stable even though her ef has not improved in spite of meds?  i don't want to see her become less stable and then have to repair or replace this valve.  thank you   ddavey\n\n",
    "posted_time": "Post  by ddavey » Thu Jan 04, 2007 8:52 am",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=37208&sid=25da02581b95345afb1e922540cf451d#p37208"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "[no title]",
    "content": "Hi ddavey - \"Stable\" needs some clarification in this context, as an EF of 35 would be considered by some to be a  reason to call the patient unstable. However, since it has not gotten lower, technically she remains stable. How well she is able to function is also going to be a factor in whether or not she is labeled \"stable.\" If she can get through her day without severe symptoms and her EF hasn't decreased then she is holding her ground, although one would have hoped the additional medication might have caused the EF to go up some, but at the same time the mitral regurg has increased also, which is probably why the number is only the same.   Replacing the valve will likely have the most marked effect on EF, and this may involve a repair of the aneurismal bulge at the same time. All this could serve to \"tighten\" the left heart function and improve the picture dramatically, but the doctors undoubtedly have given this due consideration.   Please keep us updated. Good luck to you.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Thu Jan 04, 2007 11:21 pm",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=37279&sid=25da02581b95345afb1e922540cf451d#p37279"
  },
  {
    "author": "Besttop568  Guest Posts: 1 Joined: Tue Feb 14, 2006 1:40 pm",
    "title": "Dilated Cardiomyopathy",
    "content": "My question is regarding my sister's health.  She is currently 27 years old.  In Oct 04 she had a few strokes.  After a few months she was diagnosed with a hole in her heart.  In April of 05, she had open heart surgery to repair the hole.  In June 05 she had another stroke and was immediately rushed to the hospital.  They diagnosed her there with Cardiomyopathy.  She is my half sister (on our father's side we have no history of this disease and I know her maternal grandfather died of heart failure his heart was the size of a child's at death in his 50's) Anyway, she refused to hear the diagnosis and checked herself out against medical advice.  They had told her that her heart was working at 45% of it's normal volume.  They had tried to put her on some kind of steriod which she refused.  I know she's currently taking Cumadin and Liptor.  Her family DR diagnosed her with high cholestrol and said she didn't have Cardiomyopathy even though the cardiologist at the hospital said she did.  She continues to smoke and drink heavily.  Without treatment what kind of prognosis does she have?  What kind of information can I give her regarding this disease?  Is a family Doctor able to go against the diagnosis of a specialist?\n\n",
    "posted_time": "Post  by Besttop568 » Tue Feb 14, 2006 1:59 pm",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=30671&sid=25da02581b95345afb1e922540cf451d#p30671"
  },
  {
    "author": "PACU*RN  Guest Posts: 5 Joined: Sun Jan 29, 2006 4:46 pm Location: Denver, CO",
    "title": "[no title]",
    "content": "Q: Without treatment what kind of prognosis does she have?   A: Only a cardiologist (preferably the one who diagnosed her with the cardiomyopathy) could speak to that.  The prognosis of someone her age may be entirely different than someone much older with the disease.  Q: What kind of information can I give her regarding this disease?   A:  You said \"she refused to hear the diagnosis and checked herself out against medical advice.\"  This indicates that your sister is unwilling or unable to hear this information at this time.  Anger and denial, atleast initially, are common in patients in her age group with heart disease.  The only one who can provide her accurate disease specific information is her cardiologist.  To give her information that may or may not be true about her condition would only lead to confusion and frustration on her part.  I would merely encourage her to go back to her cardiologist if she is having symptoms.  Q: Is a family Doctor able to go against the diagnosis of a specialist?  A:  You would have to be more specific to your question of \"go against\".  If you mean disagree with a diagnosis of cardiomyopathy made by her cardiologist, I would say probably not unless a follow-up catheterization and other exams revealed otherwise.  This type of interpretation and heart disease management is best left to a cardiologist, not a family practice physician.  Karen Marshall RN\n\n",
    "posted_time": "Post  by PACU*RN » Sun Feb 19, 2006 10:42 am",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=30971&sid=25da02581b95345afb1e922540cf451d#p30971"
  },
  {
    "author": "Rembie  Guest Posts: 1 Joined: Tue Apr 19, 2005 3:41 pm Location: Blackpool",
    "title": "Cardiomyopathy",
    "content": "Dear Doctor,  In Dec I was diaganosed with Dilated Cardiomyopathy caused by Alcohol, I had had symptoms for 6 months or so but doctors hadnt picked it up. In Dec after coughing up large amounts of blood I went to A & E  my heart was beating at 230 bpm I was given ameodrome and subsequently my heart stopped. After many tests they diaganosed me and said chances of my recovery were slim. Micarculously I made a good recovery and 5 months down the line I have neither drank or smoked atall and have eaten super healthy walking about 3 miles a day. I was just wandering now to the future I can never speak or hear from anyone with my condition and don't know what recover is like. I feel wonderful but can I make a full recover if I take away the initial problem (alcohol). Also I had suffered from AF for a year or so when my heart was shoked backed this was cured, however at the end of Feb it returned, can this be a normal part of my recovery and could this go away on its own as my heart gets stronger, why would this return if I am recovering. At present I have no symptoms at all other than AF.  Thank you  Tony\n\n",
    "posted_time": "Post  by Rembie » Tue Apr 19, 2005 4:07 pm",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=12583&sid=25da02581b95345afb1e922540cf451d#p12583"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Cardiomyopathy",
    "content": "Dear Tony,  In cases of alcoholic cardiomyopathy, there is a very strong probability of cure within 6 months of complete abstinence.  In cases of dilated cardiomyopathy, atrial fibrillation is usually caused by an enlarged left atrium. If the left atrium is dilated, it is usually not easy to keep the patient out of atrial fibrillation.  Continue to take the medications and i recommend that you be followed up by a cardiologist (if you are not followed up by a cardiologist already).   Quit alcohol for good and continue to take your medications and after 6 months if your ejection fraction has come to normal, it is unwise, if your cardiologist thinks so to start weaning you off of the medications that you take for the heart failure and see the effect of weaning the medications on your symptoms and ejection fraction and go from there.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.  Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Wed Apr 27, 2005 8:38 pm",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=13050&sid=25da02581b95345afb1e922540cf451d#p13050"
  },
  {
    "author": "cwooda  Guest Posts: 1 Joined: Sat Apr 16, 2005 3:55 pm Location: Tacoma, wa.",
    "title": "Dilated nonischemic cadiomyopathy",
    "content": "I was diagnosed with dilated nonischemic cadiomyopathy Sept. 19th. 2003. My ejection fraction was15%. I started taken furosimide, losinipril , and six and a half mg. of croeg twice a day.  When I first was diagnosed, I was with Group health. My cardiologist told me that he wants me to eventualy reach a dose of coreg 50mg. twice a day. Then said I will see you in six months. He also said as far as he is concerned I will never return to work again. I said B.S.. Since Group Health seemed to give up on me, I took it upon myself to manage my own care. I started increasing the coreg on my own. It took me nine months to reach 50mg. twice a day. This wasn't easy. I had reactions to the coreg, for my body  was trying to adjust to the levels so quickly. After six months of self medicating myself, my ejection fraction was 30%, and after a year my ejction fraction was45%. I will be taking my next echo in may. I am shooting for 60%, a full heart function, but will settle for th upper 50's.  They say that my condition is idiopathic. I don't believe this. I don't think anyone cares to find out. It is easier to through a blanket diagnosis on me and say thats all they can do.  I believe that my problem stems from an accident 15 years ago. I spent five weeks in Haborview hosptal in 1990, where I had a basil skull fracture, I lost my carotid artery, I was diagnosed with Horner's syndrome. Now my Horner's sydrome was so bad that. I was told I would never be able to speak louder than a whisper for my volcalcords were parallysed, and they told me that I would have to have a gasturac feeding tube for the rest of my life, sorry about my spelling. The doctors don't believe me when I say I think my heart condition stems from the neurological dissorder. I also think that a contributing factor for my improvement is that a year ago I started using THC to help my recovery. I was told by a friend in the medicla field, he told me that it would help increase my heart rate, which it did. I think with the combination of THC and the Coreg my heart was able to bounce back and give my heart the ability to recover. My new Cardiologists does admit that he and every other Doctor don't have an explanation for my recovery. I would like to now if there are any studies on this or is it just a quincedence.                                                   Thank you for your time.\n\n",
    "posted_time": "Post  by cwooda » Sat Apr 16, 2005 4:40 pm",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=12432&sid=25da02581b95345afb1e922540cf451d#p12432"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: i have a clue",
    "content": "Dear cwooda,  Do you mean medical marijuana by thc?  If you were discovered to have dilated cardiomyopathy and had a coronary angiogram that was normal, then most probably you have idiopathic dilated cardiomyopathy.  i think you have done a wonderful job by adjusting your coreg but you have to be under medical supervision nonetheless.  Beta blockers were found to increase the ejection fraction of the patient with dilated cardiomyopathy but it takes a while for this achievement to happen and careful adjustment of the medications. Using lisinopril (and medications of the same group) with beta blockers is the hallmark of treatment in heart failure. Other medications that are used and are believed to be very helpful that you are not taking is called spironolactone. Other measures include pacemaker implantation (a mode of therapy known as resynchronization therapy) if you have specific conduction abnormalities and abnormal contraction pattern (but this is most commonly found in ischemic cases). The ultimate cure is by heart transplantation but in your case i think you are making very good progress that you don't need this modality of treatment for the time being.  There was mention of medical marijuana that it helps in vascular conditions, but i have not read the studies.  When it comes to the connection between your accident that happened 15 years ago and your current heart condition, i can not comment because i can not tell whether or not there is a relation. As for Horner's syndrome, i don't think that it can cause heart failure.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.  Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Wed Apr 27, 2005 8:00 pm",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=13049&sid=25da02581b95345afb1e922540cf451d#p13049"
  },
  {
    "author": "ddavey  Guest Posts: 9 Joined: Wed Mar 09, 2005 7:20 am Location: michigan",
    "title": "Stable cardiomyopathy",
    "content": "what are the chances of a 19yr old female with a previously diagnosed mitral valve deformity with regurgitation keeping stable cardiomyopathy with meds? what does the heart function percentage need to be to keep her stable.   any answers or info on dilated idiopathic cardiomyopathy would be greatly appeciated, as my mentally impaired daughter was just recently diagnosed.\n\n",
    "posted_time": "Post  by ddavey » Sun Mar 20, 2005 7:49 am",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=11130&sid=25da02581b95345afb1e922540cf451d#p11130"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Cardiomyopathy",
    "content": "Dear ddavey,  The natural history of idiopathic dilated cardiomyopathy has not been well established yet. The prognosis depends on the patient's condition at initial presentation but still it differs from patient to patient.  With the medications that you mentioned, vasotec and coreg, it has been proven in clinical trials that the mortality rate decreases and that the left ventricular ejection fraction actually improves.  With coreg, the heart rate might be decreased, so it will have to be monitored, but if your daughter was in the hospital and was started on the medications there and her heart rate was monitored and there were no problems, this means that the coreg effect on the heart rate was observed and if she was taking a dose higher than tolerated, it would have been decreased, in addition, when a patient is in the hospital, the heart rate is usually less than it is usually on the outside due to reduced activity and bed rest. Once the patient is home, activity increases and heart rate actually increase and most of the time, there are no problems with bradycardia (low heart rate).  Same goes for vasotec and the blood pressure.  It is of course very commendable to monitor your daughter's heart rate and blood pressure at home but don't turn it into an obsession. Once (or twice a day maximum) is more than enough.  If your daughter starts to suffer from shortness of breath, palpitations, dizziness, near fainting, a call to her doctor has to be made to be seen.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.  Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Tue Apr 19, 2005 7:19 pm",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=12590&sid=25da02581b95345afb1e922540cf451d#p12590"
  },
  {
    "author": "ddavey  Guest Posts: 9 Joined: Wed Mar 09, 2005 7:20 am Location: michigan",
    "title": "cardiomyopathy",
    "content": "thank you very much for your reply.  her coreg has been increased and it is taking some time to get used to the side effects, her dizziness has increased and she had one trip to the er for shortness of breath, but there was no sign of any fluid in her lungs. it has been difficult to tell what is from her heart and what is a problem from the meds, but we are getting there.   thanks again\n\n",
    "posted_time": "Post  by ddavey » Tue Apr 19, 2005 9:21 pm",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=12597&sid=25da02581b95345afb1e922540cf451d#p12597"
  },
  {
    "author": "Kmedusa8  Guest Posts: 1 Joined: Sun Jan 23, 2005 7:06 pm Location: Boynton Beach, FL",
    "title": "Neck pain coupled with dizziness.",
    "content": "Hi. My questions relate to a pain in the back of the left side of my neck.  The pain is dull and moves in an upward motion, beginning at a parallel position to the brain stem and ending right above where I can feel my skull begin.   I've had this pain for a few months.  Starting a month ago, I have been dizzy along with the pain.  I initially gave the credit to congestion, but it won't dissipate, if that's what it is.  The dizziness comes and goes, but it is consistent enough to have me concerned, especially when coupled with this neck pain. Do you have an idea of what could be causing both the dizziness and the pain?  Do my symptoms warrant a doctor's visit?  Do I have, as a patient, the right to request an MRI?  I'm a little paranoid over all of this. Thank you sincerely for any response and advise you can offer.  I just found this site tonight and think it is a godsend.  Although I feel extremely lucky to have health insurance, going to an actual in-the-flesh doctor can be more stress-inducing than being ill.  I sure do miss the compassionate medicine I once remember receiving.   Anyway, thanks again. Sincerely, KAKH\n\n",
    "posted_time": "Post  by Kmedusa8 » Sun Jan 23, 2005 7:41 pm",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8459&sid=25da02581b95345afb1e922540cf451d#p8459"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Neck pain coupled with dizziness",
    "content": "Dear Kakh,  Neck pain and dizziness can be related. Arteries carrying blood to the posterior part of the brain actually run in the vertebrae of the cervical spine. If a patient has severe arthritis of the neck with osteophytes formation (bone appendages caused by arthritis), these osteophytes can impinge on the space occupied by the blood vessels and the blood supply to the posterior part of the brain is affected and this might result in a feeling of vertigo and dizziness.  i don't think that this is the reason in your case because of your young age as this condition is most commonly seen in the elderly population.  This pain could be related to your work if you carry heavy objects on your shoulder for prolonged periods or drag heavy objects behind you or if you sit on the computer for very long hours and sit in an unhealthy fashion.  As a patient, you can ask for an mri and if the doctor thinks it is indicated or warranted, it can be done. You can discuss this with your doctor.  Regarding the dizziness, it can be caused by ear problems especially if it is accompanied by tinnitus (ringing in the ears) and it can continue to linger for quite a long period of time. Have you tried any medication for it? And if yes, did it make your symptoms better?  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.  Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Fri Feb 11, 2005 9:50 pm",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=9284&sid=25da02581b95345afb1e922540cf451d#p9284"
  },
  {
    "author": "jliterski  Guest Posts: 1 Joined: Sat Nov 20, 2004 10:32 am Location: Florida",
    "title": "Abcessed tooth and cardio myopathy",
    "content": "My husband has cardio myopathy and is taking medication for congestive heart failure.    He has developed what appears to be an abcessed tooth.  His entire left side of his face is swollen.  The soonest I can get him into the dentist is Tuesday morning and it is Saturday morning.    Is it safe to wait that long?  Is there anything I can do for him until his appointment?\n\n",
    "posted_time": "Post  by jliterski » Sat Nov 20, 2004 10:36 am",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6561&sid=25da02581b95345afb1e922540cf451d#p6561"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Abcessed tooth and cardio myopathy",
    "content": "Dear jliterski,  Your husband has to receive antibiotics as fast as possible. If you have a problem in getting antibiotics, the best way is to go to the emergency room.  i don't think that there will be an increased risk to your husband's heart in terms of infection unless there are diseased valves in your husband's heart.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Sat Nov 20, 2004 1:04 pm",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6564&sid=25da02581b95345afb1e922540cf451d#p6564"
  },
  {
    "author": "Ed  Guest Posts: 2 Joined: Sat Aug 02, 2003 8:57 pm Location: Ocala, Fl.",
    "title": "Idiopathic Cardiomyopathy",
    "content": "Please advise of recent advances or accepted treatment of Idiopathic Cardiomyopathy.   I am a white male, 48 years old, 6'2\", 205 lbs, and reasonably active.    Additionally, my hands and/or feet  have recently begun swelling if I have performed a task that puts considerable pressure on them.    Swelling will generally persist for 12 to 18 hours.  I do not have swelling of my feet or hands otherwise.          Examples: using a hammer - fingers on right hand will swell; Squatting with my weight on balls of feet -  bottom of one or both feet will swell for.   Thanks in advance for your responses.............\n\n",
    "posted_time": "Post  by Ed » Sat Aug 02, 2003 9:24 pm",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1182&sid=25da02581b95345afb1e922540cf451d#p1182"
  },
  {
    "author": "sisohel  Guest Posts: 26 Joined: Tue Mar 18, 2003 10:46 am Location: Dhaka Bangladesh  Contact:   Contact sisohel       Website   Yahoo Messenger",
    "title": "Idiopathic Cardiomyopathy",
    "content": "Dear Ed,                Thank you for using our website. You didn't mention for how long you have been diagnosed as Ididopathic Cardiomyopathy and what medications you are taking.   As you know Idiopathic Cardiomyopathy is diseases of the muscle of the heart where no specific cause have been found and the treatment is also symptomatic. Recently many different clinical trials have shown some drugs to be benefitial to the patient. That again depends on which type Idiopathic cardiomyopathy you are having and your sympotms.  Please provide me with detailed information and I will try to give you some more information.  Best Regards,\n\n",
    "posted_time": "Post  by sisohel » Sun Aug 03, 2003 2:22 pm",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1184&sid=25da02581b95345afb1e922540cf451d#p1184"
  },
  {
    "author": "Ed  Guest Posts: 2 Joined: Sat Aug 02, 2003 8:57 pm Location: Ocala, Fl.",
    "title": "[no title]",
    "content": "Dr.Shariful Islam Sohel,   Thank you for your response.  I will provide further information as you request.   48  year old white male 6'2\" 205 lbs.   No chest pain,      Resting blood pressure currently approx  125/78   Diagnosed  Idiopathic Cardiomyopathy  Oct. 2002 EF = 26% from echo and cath...no ischemia,  mild to moderate decreased LV systolic function (from cath)   Lipid Panel : all in normal  CBC: all normal  No Previous_surgeries:  Current_medications: 1 asprin 1 Mavik   2mg 1 Coreg   6.25 mg 1 Spironolactone  25 mg 1 Celebrex 200 mg   Family_history: Father.....deceased .... PSP Mother....quad bypass  .\n\n",
    "posted_time": "Post  by Ed » Sun Aug 03, 2003 4:12 pm",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1185&sid=25da02581b95345afb1e922540cf451d#p1185"
  },
  {
    "author": "sisohel  Guest Posts: 26 Joined: Tue Mar 18, 2003 10:46 am Location: Dhaka Bangladesh  Contact:   Contact sisohel       Website   Yahoo Messenger",
    "title": "Re: Idiopathic Cardiomyopathy",
    "content": "Idiopathic Dilated Cardiomyopathy (IDC)   Idiopathic dilated cardiomyopathy (IDC) is a disease of unknown cause that results in an enlarged heart that does not pump properly. It is the most common reason people get heart transplants. The fact that it occurs so often, the mystery of its cause, and the lack of a long-term effective treatment other than heart transplant make IDC a problem for both the people who have it and their health care providers.  Most people with IDC are between 20 and 50 years old when they first see a health care provider for their disease. Blacks and men have a higher risk of developing IDC than whites and women.  IDC causes the heart chambers to dilate (expand). The heart itself may become very large, and the heart muscle gets thinner. The pumping of the heart gets weaker, and the circulation slows.  IDC results in a heart that is too weak to circulate the blood properly. The most common problem is congestive heart failure. The symptoms are shortness of breath with physical activity, waking from sleep at night short of breath, and swelling of the legs or ankles due to retention of fluids.  With poor circulation, blood clots may form in the heart, break off, and float in the bloodstream. These clots can clog the flow of blood in an artery. The loss of blood can cause damage to a kidney, an arm or a leg, and even cause a stroke. People with IDC often have abnormal heart rhythms that may result in sudden death.  Considering Treatment : Your health care provider will consider all of the other causes that act like IDC and will treat them, if possible. Drinking too much alcohol may cause a weakened heart muscle. Treatment may be as simple as for you to stop drinking alcohol. On the other hand, alcohol causes these symptoms only rarely.  Treatment is directed at controlling congestive heart failure. You may take medicines that make your heart muscle pump more effectively. You may also take diuretics  to help reduce swelling in your legs and arms. Your health care provider may suggest that you reduce your physical activity and the amount of salt you eat.  Drugs called beta blockers are frequently used to treat IDC. Over the course of several months, they may improve heart function. Your health care provider may prescribe a drug called a vasodilator. These drugs make the blood vessels open up. The increased size of the blood vessels allows more blood to flow through them. This lowers blood pressure slightly and lessens the workload of the heart. Vasodilators usually reduce symptoms and decrease the chances that you will need to be treated for congestive heart failure in a hospital. Anticoagulants help to keep the blood from clotting and prevent artery blockages and strokes.Treatment of heart rhythm problems in IDC may be important. Sometimes a device called an implantable cardioverter-defibrillator (ICD) is needed to treat abnormal heart rhythms.  Treatment with combinations of drugs helps to significantly improve the outlook. Cardiac transplantation is an option for those who have severe symptoms that are not responding to medicines.            I think this should provide all answers to your query. Thanks,\n\n",
    "posted_time": "Post  by sisohel » Mon Aug 04, 2003 3:17 pm",
    "category": "Cardiology",
    "sub_category": "Cardiomyopathy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1188&sid=25da02581b95345afb1e922540cf451d#p1188"
  }
]