[
  {
    "author": "Emt  Guest Posts: 1 Joined: Mon Nov 02, 2009 8:45 am Gender: Male",
    "title": "CPR equipment question",
    "content": "Hello, I would be very grateful if you could help me.  I am doing a study of CPR equipment design (equipment used by paramedics on patients who have suffered heart failure).  I was wondering if you could help me identify the age of the equipment used in photograph below. Is this modern CPR equipment used by paramedics today, or do you think this particular CPR equipment is of an older, more dated design (possibly in common use a number of years ago)? I ask this because I am trying to determine whether this particular CPR equipment is up-to-date and still in use or if it has now been replaced with an improved design.  (I strongly apologize for the poor quality of the photo - it is the very best available of this particular equipment. I have labelled it to maximise clarity and context). If you could try to take a look and give me your general impression, I would be VERY appreciative.    I am sorry that this is such an unusual question. I cannot stress how incredibly important finding the answer is to me. Any help or information you could provide would be hugely appreciated. I am unsure who/where else to ask. I am very new to the forum so hope I am posting in the correct place. Please let me know if you feel my question would be better suited elsewhere.  Thank you very much,  Kind Regards,\n\n",
    "posted_time": "Post  by Emt » Mon Nov 02, 2009 9:09 am",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=85626&sid=101911dee3782d939b296465968fd9c9#p85626"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: CPR equipment question",
    "content": "Hello -- Having worked in the field (\"field\" meaning street as opposed to my time spent in indoor clinical settings) for over 30 years before going indoors, I can pretty well identify for you what's in the photo, and it is current equipment. However, before I go into the full description I'd like to clarify something: Heart failure is not a condition which, in itself, calls for CPR, although if severe it may require oxygen (O2) therapy. By \"heart failure\" I suspect you mean cardiac arrest, a stoppage of heart action, usually sudden and often unexpected.   Okay then: What I see is a patient in full code mode, having been intubated by EMS personnel, which is why the mouthpiece of the \"mask\" looks odd. It's not a mask at this point but a shield held in place with a strap, and through which the endotrachial tube passes. The rest is a bag mask with hand-squeezed pump, self-filling ventilation bag, and O2 tubing connected to the plenum chamber of the bag mask/tube connection. There also appears to be an IV in place but not running as yet, although this may be something else, since it's on the border of the cut photo. Further, one paramedic is performing chest compressions while the other squeezes the bag of the bag mask (also known as an ambu bag). There appear to be defibrillator pads in place as well as heart monitor electrodes. This is all normal paramedical equipment commonly used in a full code situation to attempt to resuscitate a patient in cardiac (or, rarely, respiratory only) arrest. It's all current and kosher.  I hope this helps. This was the best possible place to post this question. Good luck to you. Any further questions, please follow up with us here.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Thu Nov 12, 2009 11:30 pm",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=86793&sid=101911dee3782d939b296465968fd9c9#p86793"
  },
  {
    "author": "jrw1  Guest Posts: 2 Joined: Tue Apr 21, 2009 7:24 am Gender: Female",
    "title": "Is 7 stents too many?",
    "content": "My family and I are distraught with anguish at the moment - My Brother is just 49yrs old and was admitted to Hospital - he had an a mild heart attack, he was kept in on a heart monitor and given some intrevenious drug to think the blood along with warfarin (injection in  the tummy)... They were unable to give him an angiogram due to waiting list being full but they kept him in.  He had several minor attacks each day until on Friday (day 5 of his stay)  when the consultant was present he had a more severe attack the consultant sent him urgently  in an ambulance to Bristol Royal Infirmary where they gave him the angiogram and angioplasty (is that correct?)  they inserted 2 stents and the following day they sent him back to GWH.  He has not improved and had other attacks whereby they took him to the procedure theatre in Swindon and inserted more stents??He has had 3 procedures and  I think we are up to 5 or 6  stents now? is this usual?  I cant find the information I am looking for  but it seems to me to be extreme.  My brother was sent home a day after another mild heart attack he was sent home and told to stay in bed for a couple of days .  He has been home for 3 weeks but is tired and not well he is also  having pain almost daily.   He was told to call an ambulance if pain got bad - today he had another bad attack and as I write this is in the ambulance going back to the  GWH procedure room; not sure what they are doing ? But it sounds like they are going to insert another stent??(stent  7!!)  It seems to me that the stents can not be working, we are so worried my mother and sisters are in turmoil we lost our father to a heart attack which is making this all much more worrying.  Is there an alternative procedure maybe a bypass and if so why do you think  they are not doing this?\n\n",
    "posted_time": "Post  by jrw1 » Tue Apr 21, 2009 7:32 am",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=75250&sid=101911dee3782d939b296465968fd9c9#p75250"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Is 7 stents too many?",
    "content": "Hello --  While seven stents is not unheard of, and theoretically is a reasonable approach, by the time that many have been used (or considered) it usually is time to just go in and do a cornonary artery bypass (however many are needed, usually a minimum of three). What's happening most likely is that your brother has extensive plaque buildup in his arteries (several at least) and when a stent opens up one ruptured plaque another segment collapses just downstream, requiring another stent, which is pushed throught he  previous one  then opened up. There is a theoretical limit to how much of this can be done, and at 49 your brother already has significant cornonary artery disease, so my guess would be there is a bypass surgery in his near future. I personally feel this is often the more useful approach,  as it lasts longer and places less hardware in the way where it can actually attract more plaque sometimes. When multiple stents are failing to stem the problem, CABG makes perfect sense even though it's more complicated in terms of the patient's comfort and has a much longer recovery time. It's basically getting all new plumbing, and while there is so much apparent disease, it would benefit your brother for some time, even if he later requires additional stents placed inside those bypass grafts. I know that may sound odd, but it's done quite often,  and since it's taken him 49 years to reach this point in the disease process, it may well take that long to get there again, which would be a pretty long time.   I hope this helps answer your questions, and please follow up with us here as needed and by all means  update us on your brother's  situation when you know more. Good luck to you and especially to him.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Fri Apr 24, 2009 9:50 pm",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=75737&sid=101911dee3782d939b296465968fd9c9#p75737"
  },
  {
    "author": "jrw1  Guest Posts: 2 Joined: Tue Apr 21, 2009 7:24 am Gender: Female",
    "title": "Re: Is 7 stents too many?",
    "content": "Dr Kenynon  your reply has answered many questions thank you so much for taking the time to answer our concerns.  I will let you know the progress. Thanks again\n\n",
    "posted_time": "Post  by jrw1 » Sat Apr 25, 2009 2:01 am",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=75754&sid=101911dee3782d939b296465968fd9c9#p75754"
  },
  {
    "author": "Shuckapeafarms  Guest Posts: 1 Joined: Fri Jan 09, 2009 1:36 pm Gender: Male",
    "title": "Is bypass surgery better than stenting?",
    "content": "I was diagnosed in July 2005 with CAD. I had a catherization which showed four blockages that included a 95% LAD, 80% LAD branch, and 2 60% Circumflex. The 95% LAD was stented, the 80% could not be stented, nor were the two circumflex stented. In November 2008 I suffered a mild heart attack. Again I was catherized which now showed 95% blockage in the Circumflex, 95% Coronary, two other blockages with one in the coronary and the other in the circumflex. The two 95% blockages were stented. One of the other two required stenting but was left unstented so to allow for scheduled neck surgery. While hospitalized for the heart attack my cath site began to bleed more than anticipated. The nurse summoned for a doctor who happened to be one from the cardiac surgery team. While dealing with my bleeding and I assume after reading my chart, the doctor asked me why I was fooloing around with the stents instead of getting the problem corrected properly with bypass? My general cardiologist had told me in the pass if we find more than 3 blockages you are off to the OR for bypass. However, that has never been the case for me. When I confronted him with my latest development and the surgical doctors suggestion my cardiologist replied \"It just depends on whether you ask a cardiologist or a cardiac surgeon what you need\"! I find that answer to be appauling and have since changed cardiologist! It gave me the impression money speaks over life and health! Getting to my question, is bypass the best route to go and if so, can a bypassed vessel be bypassed again and again as required? My previous cardiologist told me a bypass is a one shot deal while stents can be restented. My uncle had three bypass surgeries over 20 years but I do not know if they were on the same or different vessels. Thank you very much for any insight you may lend. I'm not sure whether to continue with a cardiologist or see a cardiac surgeon. My concern is my health and longevity and not the cost or who can make the most money off my dilemna!\n\n",
    "posted_time": "Post  by Shuckapeafarms » Fri Jan 09, 2009 2:03 pm",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=67589&sid=101911dee3782d939b296465968fd9c9#p67589"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Is bypass surgery better than stenting?",
    "content": "Hello -  First, in absolute terms CABG is preferable to stenting, since if the  patient is prone to restenosis he will have that happen in either case, and a CABG can be stented or re-bypassed depending upon what seems more appropriate to an individual patient at a given moment. However, I have to agree with you the comment made by the first cardiologist regarding it depending upon whether you ask a cardiologist or a CT surgeon was not any kind of an answer and is very misleading.   While stents work fine for some people, it is generally true that three or more vessels at 50-70&% stenosis (depending on the standard of a given center or doctor) will be bypassed, there are doctors (no doubt like  your cynical cardiologist) who would rather perform as many PTCAs as possible. This isn't necessarily a favor to the patient.   Much of the ability to re-bypass a previously bypassed artery depends upon anatomy, as there is a huge variation in how these things develop from birth. Some people can be re-bypassed multiple times while a very few have anomalous arteries that can't be bypassed or stented,  but even then usually there is the potential to \"get\" most of them done, and the remaining one has a better chance, then, of developing collateral bloodflow (making its own bypass, in essence).   So I would concur with the CT surgeon who questioned why you were having so many stenting procedures. Eventually this becomes self-defeating. And again, in absolute terms, CABG is definitely superior to stenting, all other things being equal in the equation (multi-vessel disease, repeat restenosis, etc.). I'd at least look into it.  Hope this is helpful. Best of luck to you with this. Please follow up with us as needed.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Sat Jan 10, 2009 10:19 pm",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=67821&sid=101911dee3782d939b296465968fd9c9#p67821"
  },
  {
    "author": "jensenholmes  Guest Posts: 2 Joined: Thu Sep 25, 2008 2:52 pm Gender: Female",
    "title": "Dr recommends a pacemaker for my bradycardia",
    "content": "I'm 45 and an avid walker/hiker since 2001.  I typically do 20+ miles per week over the course of 5-6 days.  Slow heart rates run in my family but no one has ever had a pacemaker -- but they are not as active as I am.  They are low 60's but I am 46 while sitting up in the dr's office.  I am scheduled for a Holtzer to see how low I go in my sleep.  I have had a stress test this past week and I maxed out at about 120 bpm going full tilt.  The main way this is affecting my life is that I do get weak/dizzy if I get up from being sedantary and, say, go up the stairs in my house.  At the top of the stairs I am dizzy/muscles ache and I have to stop for a minute to recoup.  I can live with this.  But worse is that I am becoming more limited in my hiking.  For some years I have had bouts where I will get faint/nauseous/clammy when climbing uphill and I have to stop and put my head between my knees.  But these were intermittent and if I rested for a bit and I could go on and finish the hike.  Recently it's become more severe because I moved to a hotter climate.  If it is over, say 83 degrees out, and there is uphill, I get these crash symtoms.  And I don't 'recover'.  I feel better, get up, start again, and 20 steps later I'm back on the ground.  I have had difficulty getting off the trail a few times in the past two months.  My cardiologist recommends a pacemaker.  This seems extreme to me, and I'd like to get a second opinion.  I really want to continue to be active.  But on the other hand, I want to make sure I understand the medical risks of a pacemaker.  And will it really be able to significantly improve my exercise capacity?  Thanks for your advise.\n\n",
    "posted_time": "Post  by jensenholmes » Thu Sep 25, 2008 3:16 pm",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=61460&sid=101911dee3782d939b296465968fd9c9#p61460"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Dr recommends a pacemaker for my bradycardia",
    "content": "Hello -  Generally a pacemaker is required only if there is an actual block of the impulse from the sinus node where the heartbeat originates, and the lower chambers, the ventricles. It's rare for the sinus node to simply go slow at all times except in cases of sick sinus syndrome (SSS) where the heart goes alternately too slow and too fast/irregular. There  is also a sinus node disease in which the node slowly deteriorates, but it is awfully rare to simply run too slow to function. If you had a 3rd degree (complete) heart block your rate would be in the 30s or perhaps even slower, and you wouldn't be able to do much at all. However, this is an  unusual presentation of sinus bradycardia.   If it were me, I would want to make the decision based upon whether or not the problem were either a) progressive and/or b) life-threatening. Rates in the 40s are often seen in athletes (runners, swimmers), and some of them suffer, seemingly coincidentally, from cardioneurogenic syncope, an inability of the whole hemodynamic system, to keep the blood pressure up high enough to prevent occasional fainting. There are other, similar malfunctions within that system that can cause pressures to drop inappropriately, and it honestly seems to me that, absent an EKG to look at, you probably are having more problem with producing enough cardiac output, rather than the rate being too slow. This is probably a controversial issue, as a heart which will  speed up to help compensate for a drop in blood pressure is the rule, and obviously yours is capable of getting into the 120s,  at least, so it does respond.   What is sometimes done in cases like this is a minor surgical procedure called a vagotomy -- oddly something that used to be done for people with stomach ulcers but now considered \"barbaric\" for that purpose. The vagus nerve, which is one side of the autonomic nervous system's heart rate control mechanism, is then disabled (the breaks are off) and the heart tends to beat a little faster than normal rather than a little slower than normal. It isn't a reversible thing, but if there is no other pathology, such as a block  in the electrical pathway, then this could be considered as an alternative to a pacemaker.   Don't get me wrong: I have nothing against pacemakers, but in a heart that's got its own, working electrical system, it does become somewhat problematic. I don't now that it's \"extreme\", and  it might well improve your overall performance, but first I think hemodynamic control issues,  such as cardioneurogenic syncope or at least incompetence, or baroreceptor failure (which is also often corrected using a device a lot like a pacemaker) should be ruled in or out first. The holter monitor will yield a certain amount of useful information, such as if your rate becomes dangerously slow during sleep.   You may simply be vagatonic (vagus nerve dominant) where some people are sympathomimetic (sympathetic nerve dominant and the rate faster than normal).  There are probably other fixes to consider, assuming you don't suffer from any sort of heart block.  I'd  love to be able to see a copy of your EKG.   I hope this is helpful. If your doctor feels a pacemaker is the right solution, I would at least seek a second opinion. He may be right, but it seems as though more exploration should be done first.  Best of luck to you. Please stay in touch with us.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Thu Oct 02, 2008 7:52 pm",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=61762&sid=101911dee3782d939b296465968fd9c9#p61762"
  },
  {
    "author": "jensenholmes  Guest Posts: 2 Joined: Thu Sep 25, 2008 2:52 pm Gender: Female",
    "title": "Re: Dr recommends a pacemaker for my bradycardia",
    "content": "Thanks for your reply.  It seems that you are right on the money.  After looking at all my test results, my cardiologist has decided that my heart rate is not so low that she recommends a pace maker after all.  My Holtzer showed my rate mostly in the 50's during the day and only dropping to the mid 40's in my sleep.  My heart responded well to the stress test other than the fact that it might have gotten to 150 in another person as opposed to high 120's and I didn't get to 85%.  So she cannot explain my continued bouts of syncope.  I did have low blood pressure on my most recent visit -- 100/70.  She recommended that I eat a lot of salt and specifically a V8 a half hour before hiking to see if it helps.  I'm recalling that my syncope has been particularly bad on a few occasions when I was on a diet (= low sodium).  It's also much much worse when it's hot, which might also be blood pressure related.  I'm to see an electro-rhythm specialist in Nov to see if he has further ideas on the faintiness.  One other oddity was that the chamber of my heart that goes to the lungs had double pressure, which she said is sort of the opposite problem than 'low blood pressure' and would generally indicate asthma or some other reason why the lungs aren't able to process the blood normally.  It's a very real and very debilitating problem so hopefully the specialist can help figure it out.  Your suggestions sounds very possible, esp the cardioneurogenic syncope.  I'll take them with me.\n\n",
    "posted_time": "Post  by jensenholmes » Mon Oct 06, 2008 9:35 am",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=61898&sid=101911dee3782d939b296465968fd9c9#p61898"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Dr recommends a pacemaker for my bradycardia",
    "content": "Hello again -  Good news! I'm glad to hear this. You're apparently a vagatonic type, and you may have some neurocardiogenic issue, which is usually not  a big problem (and is manageable). An electrophysiologist is the exact right specialist for this sort of thing, and may be able to pin down more precisely the focus of the syncopal episodes so they can be prevented.   Salt is a very important thing in situations like this, so that's a good general suggestion. It can really make a difference in people whose pressure runs on the low side, and in those cases actually can safely be used to help bring things up to normal. Hopefully that will help.  Please stay in touch and let us know how things go with the EP specialist. Thanks for the update.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Mon Oct 06, 2008 8:54 pm",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=61925&sid=101911dee3782d939b296465968fd9c9#p61925"
  },
  {
    "author": "babs16662  Guest Posts: 1 Joined: Tue Sep 09, 2008 8:45 pm Gender: Female",
    "title": "How many stents can be placed inside each other?",
    "content": "My husband has four cardiac stents, two are butted up against each other with two stents inside them butted against each other.  He is scheduled to have a cardiac cath next Wednesday.  If his current stents are blocked again, is it possible to put another stent inside the ones already in place  or would a bypass have to be performed?\n\n",
    "posted_time": "Post  by babs16662 » Tue Sep 09, 2008 8:57 pm",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=60190&sid=101911dee3782d939b296465968fd9c9#p60190"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: How many stents can be placed inside each other?",
    "content": "Hello -  While  it is impossible to say without having all the facts and images to evaluate, it would seem likely that if there is now further obstruction, bypass surgery would be indicated. However, if there is only one vessel involved, bypass is rarely pursued; rotoblade procedures are becoming less common and probably wouldn't apply in this case, so I guess the best answer is that if the blood supply provided by this artery must be improved, bypass surgery would be the most likely option.   I hope this  is helpful. Best of luck to you and to your husband.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Wed Sep 10, 2008 10:43 pm",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=60288&sid=101911dee3782d939b296465968fd9c9#p60288"
  },
  {
    "author": "mysei  Guest Posts: 2 Joined: Fri Apr 04, 2008 9:41 am Gender: Male",
    "title": "4 years after robotic bypass surgery - still pain",
    "content": "I had robotic bypass surgery four years ago.  To this day, I still have pain in my chest from the surgery.  My left nipple is very sore to the touch, with the pain varying from day to day.  It was numb immediately after surgery but has gradually regained sensation - but painful sensation.  On the right side, the area across the chest is painful, especially when I take a deep breath.  Same thing -- was numb initially then gained sensation and can be painful.  Dr. said it was nerves impacted during surgery.  Have tried Neurontin(?), Lidocaine patches, muscle relaxers, vicodin, etc.  Had chest x-rays.  Nothing showing.  Two questions:  Have you heard of this before?  I thought there would be less pain for the robotic surgery but now wish I would have had the normal \"zipper\" surgery.  Any other ideas on what might help stop the pain?\n\n",
    "posted_time": "Post  by mysei » Fri Apr 04, 2008 10:01 am",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=57622&sid=101911dee3782d939b296465968fd9c9#p57622"
  },
  {
    "author": "Dr. A. Madia  Medical Doctor Posts: 207 Joined: Fri Jan 06, 2006 6:50 am Gender: Male Location: India",
    "title": "Re: 4 years after robotic bypass surgery - still pain",
    "content": "Hi,  Robotic bypass, though less traumatic, does has some nerve injury and your doctor is right that this could be the cause. In fact we have seen often patients having soreness, numbness or some other vague complaints on their chest after a bypass surgery.   We generally treat this with some Vit B 12, or its later version methylcobalamin and in resitsant cases with gabapentin.  By the way are you on  cardiac drugs called Spironolactone or Digitalis? because both of these have a side effect of sore and swollen nipples.  Apurva\n\n",
    "posted_time": "Post  by Dr. A. Madia » Wed Apr 09, 2008 10:46 pm",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=57911&sid=101911dee3782d939b296465968fd9c9#p57911"
  },
  {
    "author": "mysei  Guest Posts: 2 Joined: Fri Apr 04, 2008 9:41 am Gender: Male",
    "title": "Re: 4 years after robotic bypass surgery - still pain",
    "content": "Thanks for the reply.  What dosage of the B12 do you recommend?  Is regular B12 okay or should it be the methylcobalamin you recommended?\n\n",
    "posted_time": "Post  by mysei » Wed Apr 16, 2008 9:22 pm",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=58121&sid=101911dee3782d939b296465968fd9c9#p58121"
  },
  {
    "author": "ElaineK5  Guest Posts: 2 Joined: Mon Mar 31, 2008 11:11 pm Gender: Female",
    "title": "Dual Chamber Pace Maker",
    "content": "I am a personal trainer with a new client who has a dual chamber pace maker.  When I put her on a bike for 3 minutes to watch her heart rate it went from 90 to 192.  Most of my unfit beginners will only go to about 120 doing this same test.  Her respiration was fine and she felt fine.  I sent her for physician’s approval before working with her.   Her doctor said “obviously this trainer has never worked with anyone with a dual chamber pace maker before”.  He also went on to say that it was perfectly normal for her heart rate to be that high until she becomes more fit.   This goes against everything I have learned as a trainer.  I want to tell this client to get a second opinion, but want to make sure my thinking is sound.  I have done some research on the web, but have found nothing specific enough. thanks for your help.\n\n",
    "posted_time": "Post  by ElaineK5 » Mon Mar 31, 2008 11:40 pm",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=57383&sid=101911dee3782d939b296465968fd9c9#p57383"
  },
  {
    "author": "Dr. A. Madia  Medical Doctor Posts: 207 Joined: Fri Jan 06, 2006 6:50 am Gender: Male Location: India",
    "title": "Re: Dual Chamber Pace Maker",
    "content": "Hi Elaine K,  What is the age of your client? Because in younger patients the upper heart rate set IS in the range of 170-190 so as to enable them to carry out vigorous physical activity. Dual chmbar pacing is all about this variable heart rate as against the older single chamber pace maker where heart rate cannot go beyond a fixed ventricular rate set in the pacemaker.   When a person exercises, the physiological mechanism will cause the sinus rate in the atria to rise. In dual chamber pace maker the lead in the atria will sense this and allow the ventricular lead to stimulate the ventricle at this rate subject to the upper limit programmed in the device.  I hope this is helpful.   Apurva\n\n",
    "posted_time": "Post  by Dr. A. Madia » Fri Apr 04, 2008 3:41 am",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=57609&sid=101911dee3782d939b296465968fd9c9#p57609"
  },
  {
    "author": "ElaineK5  Guest Posts: 2 Joined: Mon Mar 31, 2008 11:11 pm Gender: Female",
    "title": "Re: Dual Chamber Pace Maker",
    "content": "Thanks for your response.    My client is 47 years old.  The trouble is that she was not exerting herself at the time that her HR went up to 191.  She had only been riding the bike  on 0 resistance for 3 minutes -- she wasn't even breathing hard.  thanks\n\n",
    "posted_time": "Post  by ElaineK5 » Sat Apr 05, 2008 1:53 am",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=57670&sid=101911dee3782d939b296465968fd9c9#p57670"
  },
  {
    "author": "Dr. A. Madia  Medical Doctor Posts: 207 Joined: Fri Jan 06, 2006 6:50 am Gender: Male Location: India",
    "title": "Re: Dual Chamber Pace Maker",
    "content": "In that case your client does need her pacemaker to be checked by an electrophysiologist.  Apurva\n\n",
    "posted_time": "Post  by Dr. A. Madia » Sat Apr 05, 2008 7:13 am",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=57677&sid=101911dee3782d939b296465968fd9c9#p57677"
  },
  {
    "author": "comguy4  Guest Posts: 1 Joined: Fri Jan 04, 2008 10:12 pm",
    "title": "When Do You Remove A Stent?",
    "content": "I have an interesting question.  After having a heart attack, and a stent has been implanted, when is a proper time to actually remove it from the clogged artery?\n\n",
    "posted_time": "Post  by comguy4 » Fri Jan 04, 2008 10:17 pm",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=52724&sid=101911dee3782d939b296465968fd9c9#p52724"
  },
  {
    "author": "Dr. A. Madia  Medical Doctor Posts: 207 Joined: Fri Jan 06, 2006 6:50 am Gender: Male Location: India",
    "title": "Re: When Do You Remove A Stent?",
    "content": "Hi,  Stent is a mesh like structure, it is put inside the coronary artery in a place where there was a blockage and which was dilated open by a balloon. Placing a stent there will will act as a scaffold and will prevent the opened blockage from collapsing back and cause a re-stenosis.  The mesh like metal filaments of the stent get gradually covered by the cell lining of the artery. [Endothelization]. This is actually the goal, and is quite beneficial as the foriegn body element of the stent then will not be exposed to the blood clotting components and thus will prevent a thrombosis.  So form this it is quite obvious that a stent placed in a coronary artery can never be removed.  However, a new category of stents are in the offing, called 'Biodegradable Stent'. As the name implies, the stent is of such a material that it gets 'metabolised' and gets absorbed after a certain period of time. This occures well after the stent has served its purpose and Endothelisation has occured.  Apurva\n\n",
    "posted_time": "Post  by Dr. A. Madia » Tue Mar 04, 2008 12:35 am",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=54986&sid=101911dee3782d939b296465968fd9c9#p54986"
  },
  {
    "author": "Betablockade  Guest Posts: 1 Joined: Sun Dec 09, 2007 9:05 am",
    "title": "Short runs of V-Tach...Too much Beta blocker?",
    "content": "Hello and thank you for the time that you take for us! I am a 47y/o male in good health. I was placed on a beta blocker for PSVT two years ago. I used to go a couple of years in between episodes of PSVT in the past (years ago), but in the last 3 years, I have had several flare ups of PSVT. Hench the script for Toprol-XL 50mgs BID. It seems to almost completely stop the PSVT, but still have a few PACs & PVCs. I recently had a FULL cardiac workup, including treadmill. All was normal. My question is this: (1) I weighed 273 lbs at 6.0'  I have lost 35 lbs since starting the Toprol in Dec.2005. Could the Toprol-XL dose be too much for me now? My 24 hr. Holter showed a low HR of 43, and a high of 115 (which was after a 2 mile power walk) I cannot get my HR up past that. It also showed a 5 beat run of V-Tach (which was a new event to me, and I could feel the difference) Also about 163 assorted ectopic beats. My MD was not concerned at all. (2) Can too much Beta blocker cause ta run of V-tach? Dr.Mokhtar stated in one thread that hypothyroidism induced bradycardia can cause V-tach, as the ventricles try to take over the role of the AV or pacemaker. Could this be my problem? I plan to wean down on the Toprol. I am at a total of 75 mgs per day now, but still have a resting HR of 58-60. I guess losing weight warrants a dosage reduction? Also, I notice an icrease in my PACs & PVCs when I have excessive gas or indigestion. Is there a link? Perhaps a vagus nerve irritation causing more palps? I have read that there is definately a link, but would still like your input. Thanks again for your time. I greatly appreciate it!\n\n",
    "posted_time": "Post  by Betablockade » Sun Dec 09, 2007 10:06 am",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=51397&sid=101911dee3782d939b296465968fd9c9#p51397"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "Re: Short runs of V-Tach..",
    "content": "Hi Betablockade,  Extended release metoprolol (Toprol XL) is a commonly used beta-blocker used for many different cardiac issues.  100mg/day is a mid-level dose for most needs.  With adult dosing, dose is generally not based on weight; however, large changes in weight can cause an increased effect of medications even though they aren't dosed based on weight.  It may very well be that now your dose is too high and your heart rate is being held too low.  If the heart rate is too low, the ventricles may try to take over and subsequently may induce a run of ventricular tachycardia.  Regarding the connection between indigestion and PVC's, I'm less familiar with this area but it certainly could be that the vagus nerve is being irritated causing some cardiac effect.  When reducing your beta-blocker dose be sure to do this under the direction of your cardiologist.  Basically, since you are on it for PSVT the goal should be to get the lowest dose possible that still controls your PSVT while minimizing side effects such as heart rate suppression.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sun Jan 20, 2008 9:47 pm",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=53286&sid=101911dee3782d939b296465968fd9c9#p53286"
  },
  {
    "author": "Rigbee",
    "title": "PICVA (Percutaneous In-Situ Coronary Venous Arterialization)",
    "content": "I am intested in any new developments in the availability of Percutaneous In-Situ Coronary Venous Arterialization (PICVA) in the U.S. My mother, who is facing a second, highly invasive bypass operation has been described as \"a perfect candidate\" for this procedure.\n\n",
    "posted_time": "Post  by Rigbee » Sat Dec 28, 2002 6:58 am",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=76&sid=101911dee3782d939b296465968fd9c9#p76"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Percutaneous in-situ coronary venous arterialization (PICVA) is gaining alot of attention recently. Especially after its initial success in saving the life of a patient suffering from cardiac infarction who was not candidate for CABG. However, as successful and promising as everything may seem it is way to early to decide whether it shows a survival benefit over traditional CABG.   Pros and Cons:  ==============  First of all this procedure has only been used on one human being in Germany and was done almost one year ago. However, it has been tested on pigs and has showed a survival benefit over CABG.   Secondly, the technique uses the coronary veins which are rarely diseased as opposed to other percutaneous techniques which use the saphenous vein or other arterial conduits that are the seat of plaques.   Lastly, the technique and devices used are still under development.   Candidates for PICVA:  =====================   Patients who can potentially benefit from the procedure include those who are candidates for various types of laser-based transmyocardial laser revascularization procedures; re-do CABG patients; patients with chronic total occlusions; and patients who are candidates for gene therapy.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Tue Nov 01, 2005 4:23 pm",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=24442&sid=101911dee3782d939b296465968fd9c9#p24442"
  },
  {
    "author": "mischellelawler  Guest Posts: 1 Joined: Thu Apr 07, 2005 4:57 pm Location: home",
    "title": "Cardiac Catherization",
    "content": "Can someone please tell me what it means when they ask if you have had a prior PCI?\n\n",
    "posted_time": "Post  by mischellelawler » Thu Apr 07, 2005 4:59 pm",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=11997&sid=101911dee3782d939b296465968fd9c9#p11997"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi mischellelawler, PCI (Percutaneous Coronary Intervention)  is a procedure that once the catheter is in place using a balloon that's attached to the tip of the catheter, is inflated compressing the plaque and dilates the diameter of the blood vessel. Many times a coronary stent is placed in the blood vessel to help prevent the recurrence of blockage. The balloon is then deflated and removed along with the catheter. So in short it means stent placement/balloon therapy for previous blockages. I hope this makes sense. Sincerely, Rntdj\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Fri Apr 08, 2005 7:08 am",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=12038&sid=101911dee3782d939b296465968fd9c9#p12038"
  },
  {
    "author": "mysticwmn  Guest Posts: 1 Joined: Sat Mar 26, 2005 10:54 am Location: illinois",
    "title": "Aorta bypass",
    "content": "I have been told I have to have a bypass in the tummy area in the aorta do to blockage. Can not do a stent, it to blocked.  Also there is blockage in the top of legs and in chest area for the arms and neck. The blood from the brain is now going into my right arm.  They are talking a couple major surgerys with the first a bypass. they are going to cut my tummy all the way down, cut both hips in front and from crotch to ankle on the leg. This is just the first one. They are hoping my heart is strong enough for this.   I have been checking on other things that my be done. I have come across this stuff to clean the aorta and vains called EDTA (ethylene - diamine - tetra - acetate - acid ) I was wondering if you have heard of this and if you feel it is something that could work.                                                        Thank you for your time\n\n",
    "posted_time": "Post  by mysticwmn » Sat Mar 26, 2005 11:18 am",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=11386&sid=101911dee3782d939b296465968fd9c9#p11386"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Aorta bypass",
    "content": "Dear Mysticwmn,  i am not aware of any studies out there where EDTA was used for chelation of extensive aortic vascular disease.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.  Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Sat Mar 26, 2005 2:10 pm",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=11397&sid=101911dee3782d939b296465968fd9c9#p11397"
  },
  {
    "author": "nlu2  Guest Posts: 2 Joined: Fri Jan 28, 2005 8:58 am Location: Menard, Montana",
    "title": "Use of Phytosterol in place of toprol or vytorin",
    "content": "I would like to use Phytosterol in place of toprol or vytorin. I would like to use up my bottle of Cholesterol Blocker.\n\n",
    "posted_time": "Post  by nlu2 » Fri Jan 28, 2005 9:05 am",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8665&sid=101911dee3782d939b296465968fd9c9#p8665"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Use of phytosterol in place of toprol or vytorin",
    "content": "Dear nlu2,  Please, don't stop the toprol for whatever reason except after consulting with your doctor first. Toprol is for control of blood pressure and for coronary disease. Sudden cessation of toprol can lead to detremental side effects.  As regards to phytosterols, these are plant products that can be used to decrease ldl cholesterol in addition to other cholesterol lowering medications. The problem is that to achieve an adequate response, you have to take quite a big amount which might end up in you gaining weight. You can discuss this option with your doctor as well.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.  Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Fri Feb 11, 2005 9:25 pm",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=9282&sid=101911dee3782d939b296465968fd9c9#p9282"
  },
  {
    "author": "kb9umb  Guest Posts: 2 Joined: Tue Jan 18, 2005 10:05 am Location: Illinois",
    "title": "Feeling pacemaker",
    "content": "Hello,  I had a pacemaker put in 12/2004. I can feel the pacemaker working when my heart rate slows down. IAt first it seemd like the pacemaker was only working about 5% of the time. Now it eems like the pacemaker is working most of the time except when I stand up or am walking. This scares me because of my malignant melanoma. I was wondering if I should be concerned because of it working most of the time now ? By the way I had it installed because of bradycardia and there was no sign of MM in the heart. Also I had a PE and was on heparin to get rid of the PE.                                                                                   Thanks kb9umb\n\n",
    "posted_time": "Post  by kb9umb » Tue Jan 18, 2005 10:11 am",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8271&sid=101911dee3782d939b296465968fd9c9#p8271"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Feeling pacemaker",
    "content": "Dear kb9umb,  i don't think that there is anything to worry about. The pace maker is programmed to work at a certain rate, let's say 60, when it senses that your heart rate is less than 60, it starts working. As long as your heart rate is above that number, it does not work.  This means that the pace maker is working fine.  i think you should be up for a pacemaker check soon, please, mention this to your doctor if it is bothering you.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.  Yasser Mokhtar, M.D..\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Wed Jan 19, 2005 1:20 pm",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8327&sid=101911dee3782d939b296465968fd9c9#p8327"
  },
  {
    "author": "elby1781  Guest Posts: 1 Joined: Wed Aug 25, 2004 3:57 pm Location: NC",
    "title": "Excercise and EF Improvement?",
    "content": "I'm 22, Male and relatively healthy, but I do have mild aortic insufficiency and mild dialation of my left ventricle.  I'm 6'1\", 220, and quite fit.  Given my EF of 72 is the mild dialtion of left ventricle a problem?  Will it be in the future?  Also, I'm training for a bike race at the moment and I am curious to know, does excercise increase EF and stroke volume?  Does it increase VO2 Max?  Thanks very much.  Trey\n\n",
    "posted_time": "Post  by elby1781 » Wed Aug 25, 2004 4:16 pm",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=4853&sid=101911dee3782d939b296465968fd9c9#p4853"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Excercise and ef improvement?",
    "content": "Dear Trey,  Exercise increases stroke volume but not really that much. By the time the cardiac output reaches half its maximum, the stroke volume usually reaches its limits. Ejection fraction is also increased by exercise.  Your oxygen consumption can be increased if you exercise on regular basis for at least 20 minutes per day at a heart rate that is upto 85% of your maximum predicted heart rate for your age.  Before starting any exercise program and especially since you have a medical condition, you have to tell your doctor about this and make sure that he approves of it.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Mon Sep 06, 2004 7:12 pm",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5136&sid=101911dee3782d939b296465968fd9c9#p5136"
  },
  {
    "author": "jazsax  Guest Posts: 1 Joined: Thu Jul 29, 2004 4:09 pm Location: United States",
    "title": "Question about 'post stent implant' medications.",
    "content": "I've been taking Toprol, Plavix, Altace and Lipitor (along with a baby aspirin) since a stent implant 4 months ago.  Within the last week, I've had symptoms of being light-headed (not quite dizzy) and tingling in my extremities.  My GP is sure it is a reaction to one or more of the drugs.  A couple of people I know who also have stent implants immediately said \"it's the drugs\" when I mentioned the symptoms.  My cardiologist - who I've been very satisfied with - doesn't seem to agree or want to look at it from that angle.  From what I've heard and read, reactions to some of these drugs is not uncommon, even after months with no problems.  Do I just have unusual friends or is my cardiologist being hard-headed for some reason?  My GP suggests stopping some or all of the meds for a few days to see if the symptoms go away.  If so, he wants to add the meds back in one at a time every 4-5 days.  My cardiologist empatically says \"NO\".  Any opinions on this?  Thanks\n\n",
    "posted_time": "Post  by jazsax » Thu Jul 29, 2004 4:25 pm",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=4278&sid=101911dee3782d939b296465968fd9c9#p4278"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Question about 'post stent implant' medications",
    "content": "Dear Jazsax,  Tough call. i guess you are between the rock and the hard place.  i guess the answer depends on the answers to the following questions.  What was done to determine that these symptoms are secondary to side effects of the medications? Dizziness can be caused by anemia for example, have you had a blood count for example? What was your blood pressure? Was it on the lowish side? Toprol and altace can cause low blood pressure  Which is going to cause more serious problems, the side effects of the medications or stopping the medications? Do you know that the rate of stent occlusion is higher if you stop taking plavix?   Are the side effects of the medications bearable? Can you lead a nearly normal life even though you are having those side effects?  i guess if you can lead a near normal life with those side effects and they are not pausing any threats to your life in any manner, and knowing that those medications are essential to the patency of the stent, i would recommend to go with your cardiologist opinion.  Have you discussed taking lower doses of the medications instead of stopping them all together like lowering the dose of toprol and/or altace and see what this will do to the symptoms. How about stop taking the baby aspirin till your cardiologist decides to stop the plavix. You can go with this idea to your cardiologist and see what he thinks if you have not already discussed this with him and he refused.  You have to take the decision yourself, you have to weigh the benefit versus the harm and decide for yourself and then inform your doctor of your decision and you will have to take responsibility for your choice.  But above all, never stop any heart medication (or any medication for that matter) unless you talk to the doctor who started you on that medication.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Sun Aug 01, 2004 9:55 pm",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=4327&sid=101911dee3782d939b296465968fd9c9#p4327"
  },
  {
    "author": "Dee Holtzinger  Guest Posts: 1 Joined: Wed May 19, 2004 12:53 pm Location: Fort Wayne, IN",
    "title": "Idiopathic Ventricular Tachycardia",
    "content": "A few months ago I was experiencing a slight heaviness in my chest and then almost immediately a very fast heart rhythm and then it felt like blood rushing to my head.  I dealt with this for a while as it didn;t happen a lot or for very long duration.  However, several weeks ago it was happening daily and for hours at a time. I went to the ER and all tests, EKG. bloodwork, etc was fine. I was sent home with a Holter moniter which when read caused the hospital to call me and tell me I needed to be in the hospital. In the hospital another EKG was done, an Echo and blood work.  Everything was fine but they did have the \"record\" from the Holter. A stress test was done and immediately after getting off the treadmill my heart went into the VT.  It took some time for them to get it settled down, having to use 2 shots of lidocaine to bring back normal rhythm. The cardiologist said I have Idiopathic Ventricular Tachycardia as my heart was normal and strong but for an unknown reason it was producing these fast rhythms.  He suggested either medication or an EP study to induce the fast rhythm and then a catheter ablation. A week later I returned to the hospital for this procedure and to my regret the cardiologist was not able to bring out the VT.  He said medication was the next option. He also said another EP study could be done.  I do not want to take the meds as I do not like the side effects.  To date I am not on the meds.  Since having the EP study my heart has \"settled\" a good bit.  So much so, that the last few days it has not done this at all. I would like very much to have another EP study and get this fixed.  If the cardiologist had difficulty bringing out the VT when it was \"active\", how much more difficult will it be for him to bring it out when it is in an \"inactive\" state.  Does that really matter if it is active or not?  I have heard the ablations can trigger other areas of the heart to do the same thing?  Would I be better to leave it well enough alone?  As long as I can cope without the meds, is that a safe thing to do.  Would being on medication (calcium channel blockers) make it difficult for him to bring out the VT?  I was so depressed the first time when he was unable to bring it out that I am not sure I want to go through that again.  Help?????\n\n",
    "posted_time": "Post  by Dee Holtzinger » Wed May 19, 2004 1:20 pm",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3340&sid=101911dee3782d939b296465968fd9c9#p3340"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Idiopathic ventricular tachycardia",
    "content": "Dear Dee,  Hope you have been doing fine lately.  Idiopathic ventricular tachycardia means that your heart does not have any structural abnormality. You have not mentioned whether this was done or not but i think if you had an ep study, you must have had a coronary angiography as well.  The best way to go was an ep study and you already had one. For the time being, personally, if you are not complaining of recurrent attacks of ventricular tachycardia and you are not on any medications, i would just do nothing.   Is there a risk in waiting? Every thing has its own risks of course. Is there a risk in doing another ep study? Yes. Is there a risk in taking medications? Yes.  You will have to talk to your cardiologist about the risks and the benefits of each and all the options and then decide for yourself what is the next step that you want to do.  One thing i wanted to mention. Have you had your tsh checked lately and how was it? If your tsh is low, this means that you are getting too much synthroid and this could be the cause of your tachycardia. And if it is high, this can mean that you are not getting enough thyroid medication and sometimes people who don't get enough thyroid medication will develop low heart rate (bradycardia) and this as odd as it may sound can cause ventricular tachycardia as the ventricle tries to take over the job of the pacemaker of the heart.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Thu Jun 24, 2004 6:20 pm",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3823&sid=101911dee3782d939b296465968fd9c9#p3823"
  },
  {
    "author": "jacslady  Guest Posts: 1 Joined: Tue Apr 13, 2004 8:20 am Location: Birmingham, AL",
    "title": "PICVA",
    "content": "The latest entry on this topic dates a year ago.  Have there been any new developments? Is this procedure being used at all in the U.S.?  What would constitute candidacy for this procedure?  From the research I have done, I have ascertained that the only patients considered for this procedure were those for whom \"standard\" bypass procedure was not an option.  It would seem logical, because of the minimum of physical trauma involved in this procedure, that it would be considered for ANY bypass candidate.  Would this procedure be viable for multiple bypasses?  My husband is facing the recommendation by his cardiologist of bypass surgery.  We have an appointment scheduled with the cardiac surgeons to discuss his condition and whatever options may be available.  I would like to be able to go into that appointment at least able to ask intelligent questions.  We are in Birmingham, AL where the UAB Hospital system has one of the best reputations for cardiac care in the country.  Is there even a remote possibility that this PICVA procedure can be considered at this hospital?  Thank you for whatever information you can supply.\n\n",
    "posted_time": "Post  by jacslady » Tue Apr 13, 2004 8:30 am",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3066&sid=101911dee3782d939b296465968fd9c9#p3066"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: picva",
    "content": "Dear Jacslady,  i think that there is a clinical trial going on currently.  i know that there are sites in the united states participating in this trial, but i don't know for sure which ones.  i think it is still going to be a while before picva becomes a widespread procedure.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Wed Apr 21, 2004 7:00 pm",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3141&sid=101911dee3782d939b296465968fd9c9#p3141"
  },
  {
    "author": "shrtstuf121  Guest Posts: 2 Joined: Tue Feb 10, 2004 12:34 pm Location: georgia  Contact:   Contact shrtstuf121       AOL",
    "title": "Pacemaker pain",
    "content": "I am 30 years old and recently had a pacemaker pocket revision for erosion. I have since had alot of pain in the armpit and left arm. The pacemaker itself is palpable in the armpit. I brought this to the surgeon's attention who told me it would be fine. I have had a second opinion since then where it was determined that it was pressing on the brachial plexus and needed to be moved. One MD said it was out of his scope and the second would not do it out of loyalty to the original MD, whom he trained under. Where do I go from here? I don't know how to even begin trying to find a MD to fix this. Also, can the pressure on the nerves really eventually cause permanent nerve damage in that arm like they have been telling me? Please help...I am in pain and out of options.\n\n",
    "posted_time": "Post  by shrtstuf121 » Tue Feb 10, 2004 12:43 pm",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2465&sid=101911dee3782d939b296465968fd9c9#p2465"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Pacemaker pain",
    "content": "Dear Shorty,  How recent have you had the revision of your pacemaker and what was eroded?  If your pacemaker revision has been very recent, there could some blood still in the area and this blood could be irritating the nerves rather than the nerves being compressed.  If this pain does not improve and you are worried about the brachial plexus nerves (which actually are not in the arm pit but they are present in the neck), you can ask your doctor to be referred to a neurologist (a nerve specialist) who can do a nerve study which will show whether the nerves are compressed or not and if so is there any damage and then if the nerves are compressed and/or on their way to be damaged, i guess this will compelling for your surgeon to revise the pacemaker once more.  If this is not going to be compelling enough, i guess you can go somewhere else for a second opinion.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Tue Feb 10, 2004 1:52 pm",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2466&sid=101911dee3782d939b296465968fd9c9#p2466"
  },
  {
    "author": "shrtstuf121  Guest Posts: 2 Joined: Tue Feb 10, 2004 12:34 pm Location: georgia  Contact:   Contact shrtstuf121       AOL",
    "title": "[no title]",
    "content": "I guess I should have been more specific, the nerves that branch from the brachial plexus deep in the armpit that supply nerve activity to the arm is what is affected. I had the procedure done on November 7th 2003. The erosion was the skin on  the chest where the pacemaker was beginning to protrude. Thank you for your response.\n\n",
    "posted_time": "Post  by shrtstuf121 » Tue Feb 10, 2004 5:29 pm",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2468&sid=101911dee3782d939b296465968fd9c9#p2468"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "[no title]",
    "content": "Dear Shorty,  Thank you very much for the update.  Why not try the other side of the chest? Why did your surgeon go for the armpit?   i guess it is too late for that question. However, i think, that if the pain continues and gets worse, that you should be seen by a neurologist and have the nerve conduction study done to make sure that the nerves are not getting compressed and damaged.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Wed Feb 11, 2004 2:27 pm",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2475&sid=101911dee3782d939b296465968fd9c9#p2475"
  },
  {
    "author": "Ahmed El-Feky  Guest Posts: 1 Joined: Thu May 22, 2003 9:39 am",
    "title": "Antihypetensive drug",
    "content": "Dear sir    I'm an egyptian and I'm now in UK.   In Egypt my doctor gave me an antihypertensive drug and I used to take it one tablet every day and if i don't take it one day my  blood pressure increases and now in U.k, the drug finished and i would ask you about if can I find an antihypertensive drug in uk has the same reactive ingredients of my drug.   My drug information:   Name:  CONCOR 5 PLUS  COMPOSITION:  ONE FILM- COATED TABLET CONTAINS 5 MG BISOPROLOL FUMARATE  (2:1) AND 12.5 MG HYDROCHLOROTHIAZIDE  PRODUCER :    Merck KGaA, Darmstadt,Germany  SINCERELY, AHMED AL-FEKY\n\n",
    "posted_time": "Post  by Ahmed El-Feky » Thu May 22, 2003 9:42 am",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=781&sid=101911dee3782d939b296465968fd9c9#p781"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "Cardicor",
    "content": "Dear Ahmed, You are warned not to make the change all by yourself. You should be always under the supervision of a doctor especially if you are planning a long stay.  That said There is no exact equivalent as regards the composition of the combination drug Concor Plus. It is composed of two drugs. The first Bisoprolol Fumarate is actually a beta blocker. The second is Hydrocholorothiazide is a diuretic (helps high blood pressure by expelling salt from the kidneys).  In the Uk Merck produces Cardicor 5mg (scored light yellow) the drug costs 8.56 pounds sterling and contains 28 tablets.  The only drug in the UK that combines the above two is Monozide. Monozide however combines them in a different dosage. The Bisoprolol is 10 mg not 5mg as in Concor Plus. While, the Hydrochlorothiazide is 6.25mg not 12.5 as in Concor Plus. The best way to get around this is to combine Cardicor 5 mg with a hydrochlorothiazide. I am sorry i couldnt find a hydrochlorothiazide listed in the UK's BNF.  So you must consult with a doctor in the Uk and you may need dosage adjustment given the many differing factors diet change, mode of life, weather which all affect blood pressure and the level of salt in the body.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Thu May 22, 2003 1:38 pm",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=784&sid=101911dee3782d939b296465968fd9c9#p784"
  },
  {
    "author": "J. Schied",
    "title": "PICVA",
    "content": "I would appreciate any updates as to when PICVA might be available in the United States. I see no new information since the summer of 2001. Is there any place one could register or volunteer is an \"experimental patient?\n\n",
    "posted_time": "Post  by J. Schied » Sun Feb 09, 2003 10:38 pm",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=322&sid=101911dee3782d939b296465968fd9c9#p322"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: PICVA",
    "content": "Dear J.,   Thank you very much for choosing our website.   PICVA is a fairly new procedure. The first case that was done, was done in Germany, in 1999 and there was a cardiologist from Harvard Dr. Stephen Oesterle on the team.   The system in the US is a little bit slow on new things as you might be aware. The same German institute and a few others in Germany did start a limited study on patients to see how it goes.   When the PICVA starts in the US, i would say that one of the first places that will begin clinical trials in it would be Harvard affiliated hospitals like Mass. General Hospital where this US cardiologist work i guess.   You are not the only person who asked this question and about when the PICVA will be available in the US, but i can not really answer this question now. Although Dr. Oesterle said that the US studies are expected to begin by the wnd of this year.   This is a link to the circulation issue where Dr. Oesterle talks about this.   Click here!  Once more, thank you very much for choosing our website and if you still have any questions don't hesitate to ask them right away.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Sun Feb 09, 2003 10:40 pm",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=323&sid=101911dee3782d939b296465968fd9c9#p323"
  },
  {
    "author": "DonaldG",
    "title": "Pacemaker for slow heart rate & stomach discomfort?",
    "content": "My mother is 79 and has diabetes amongst other problems. She says that when her stomach hurts her heart rate slows down, she breaks out in a sweat and she starts feeling bad. She is on numerous medications.   Her doctor recommended putting in a pacemaker and gave her no real reason for it. Can someone tell me how a pacemaker might help and what might be causing her heart rate to slow down when her stomach hurts?   Thanks!!!\n\n",
    "posted_time": "Post  by DonaldG » Sat Dec 28, 2002 4:07 am",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=51&sid=101911dee3782d939b296465968fd9c9#p51"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Pacemakers",
    "content": "Dear Donald,   Thank you very much for using our website.   From what you described it looks that your mother is suffering from a vasovagal episode.   When a person suffers from severe pain, one of the nerves of our body (called vagus) take over and cause the symptoms that your mother describe and the most prominent of them are usually sweating, feeling that your heart is beating slowly, dizziness and some people even lose consciousness.   The reason for the abdominal pain that your mother has should be looked for as abdominal pain could be a symptom of coronary disease and one of the sypmtoms also is slow heart beats.   About a pacemaker, you did not mention whether an Ekg was done to your mother or not or a 24 hours holter monitor, whether she lost consciousness or had seizures or feels fatigued all the time or feels dizzy, etc...   Absoulte indication to put a pacemaker is that if your mother had symptoms like the ones that i mentionned above and in the same time of having these sysmptoms it was proved that she had a very slow heart rate.   ONce more thank you very much for using our website http://doctorslounge.com and hope that this helps.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Sun Feb 09, 2003 5:47 pm",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=263&sid=101911dee3782d939b296465968fd9c9#p263"
  },
  {
    "author": "Sanstress",
    "title": "Coronary Bypass - Complications in leg after vein removal",
    "content": "After bypass my leg which had the vein removed has remained swollen and continues to rretain fluid. the circulation is so hampered that there is now many large discolored spots. This is after 3 years. Is there any thing that can be done? Now my foot is beginning to become very painful and weak.\n\n",
    "posted_time": "Post  by Sanstress » Sat Dec 28, 2002 6:19 am",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=64&sid=101911dee3782d939b296465968fd9c9#p64"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Coronary bypass",
    "content": "Dear Santress,   Thank you very much for using our website.   After taking the veins from your leg to use for the bypass surgery, the fluid that is usually drained by the veins is vey sluggish to be drained by other available means in the body.   Although, swelling of the feet is not a life threatening situation, however, having fluid in your leg can some times has its complications and drawbacks.   The best thing to do is to wear elastic stockings. First of all, make sure that you do not have any fluids in your feet and then start wearing these stockings every morning before you get out of bed. It is very annoying to some people but it is the best thing to do.   Some people will be given diuretics (water pills) to decrease this edema as well per their doctors.   Now, let me remind you that this swelling of the leg might also has other causes so before attributing this edema to the absence of the veins of your leg, you have to see your doctor and make sure it is not due to any thing else and then decide whether you want to go with the elastic stockings or not.   Once more, thank you very much for using our website http://doctorslounge.com   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Sun Feb 09, 2003 5:45 pm",
    "category": "Cardiology",
    "sub_category": "Cardiology Treatment Modalities",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=262&sid=101911dee3782d939b296465968fd9c9#p262"
  }
]