[
  {
    "author": "Adila  Guest Posts: 2 Joined: Sun Jun 06, 2010 3:50 pm Gender: Female",
    "title": "Weight Loss...should I be worried?",
    "content": "Dear Doctor, I am a patient of stage 2-b cervical carcinoma. Its been almost a year since my diagnosis and I subsequently have gone though chemo (5 cycles), radiation (25 sessions) and brechy (twice) therapies. However, since a few weeks back i developed this nasty cough (with slight fever) which induced me to go to a pulmonologist who thankfully allied my fears regarding pneumonia but alarmed me by noticing that I had lost about 10 kgs during the last 3 months or so. I feel fine albeit very lethargic and some times week and have recently developed a stiff shoulder however my appetite is more or less the same. Doctor, my cancer follow up is due in mid July, sholud i take an early appointment or simply stick to an enhanced protein/carb diet? Do I have Cachexia? I currently weigh 71 kg...down from 80 kgs in March. Please advice.  Regards,  Adila\n\n",
    "posted_time": "Post  by Adila » Sun Jun 06, 2010 4:16 pm",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=93368&sid=ab52de81f30c500181267c914cc131fe#p93368"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "Re: Weight Loss...should I be worried?",
    "content": "Dear Adel, Involuntary loss of 10 kgs in 3 months is clinically significant weight loss, as your doctor alluded to. There are so many causes of weight loss and cancer is one of them especially with your past history and your age. However, there are several bits of good news in your post. First, you have a clear lung scan and second you don't have a loss of appetite which usually accompanies cancer.   There are so many causes for involuntary weight loss that it would be difficult to give you a clear recommendation without a thorough history and physical exam. Even that is sometimes not enough leaving the doctor clueless.   Several questions - are you still losing weight? Second, did you get a recent blood count check? Has it shown any abnormalities? What about kidney and liver function tests? These tests along with a physical exam / medical history would be a minimal screening panel for your complaint.   If these weren't done and if you continue to lose weight, I would try to get an earlier appointment and voice these concerns. Please remember your physician is in a much better situation than I am to decide on the best course of action, and you certainly seem to be in good hands.  Please let me know.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Mon Jun 14, 2010 2:46 am",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=94062&sid=ab52de81f30c500181267c914cc131fe#p94062"
  },
  {
    "author": "Adila  Guest Posts: 2 Joined: Sun Jun 06, 2010 3:50 pm Gender: Female",
    "title": "Re: Weight Loss...should I be worried?",
    "content": "Dear Dr.,   Thankyou for your prompt reply and for allying my fears a bit. Fortunately I have already had a recent blood picture done along with multiple kidney and liver tests. All the things seem within range except for my ESR which was recorded at 38 in my case. On my pulmonologist's advice I have started to have a 10-injection course of vitamin B-12 injections (Bevidox). The Doctor thinks that my pallor is due to significant vit. B-12 deficiency. Meanwhile I have also gone on an intensive eating diet (my goal is to up my weight till 75 kg). Thankfully I have had no problems doing any of the above mentioned things. The pulmonologist has also advised another blood picture test in a month's time. However, I still remain cluessless as to why I have lost so much weight in the first place. Please advise if my treatment is on the right track and if this is sufficient to lower my ESR?  Regards,  Adila\n\n",
    "posted_time": "Post  by Adila » Tue Jun 15, 2010 9:32 am",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=94173&sid=ab52de81f30c500181267c914cc131fe#p94173"
  },
  {
    "author": "eve1  Guest Posts: 1 Joined: Sun Jun 20, 2010 6:38 pm Gender: Female",
    "title": "[no title]",
    "content": "Hi My mom is 48 years old fit woman but for last 2 weeks she has stop eating.She can't eat anything expect liquids.We have done all the tests and all the results is fine..when she tries to eat it seems the food don't go down...but there is no problem in her throat....she lost 2 stones in 2 week and she is always sleepy.Pls help me doctor to spot the problem. thx\n\n",
    "posted_time": "Post  by eve1 » Sun Jun 20, 2010 7:12 pm",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=94695&sid=ab52de81f30c500181267c914cc131fe#p94695"
  },
  {
    "author": "billy123  Guest Posts: 1 Joined: Wed Jun 09, 2010 4:16 pm Gender: Female",
    "title": "I had CIN 3 and now have haematuria, groin and flank pain",
    "content": "I had excision of cervix and some further tissue removed 3 weeks ago after very heavy menstrual and intermenstrual bleeding for 2 months and an abnormal pap smear. I still don't know the pap smear result status as my operation happened within 2 days of seeing the consultant. I have severe groin pain, left flank pain and swelling around my left kidney (which is duplex with 2 totally seperate ureters)  and haematuria (all present for 2/3 months and worsening). I had a cystoscopy last week which showed no bladder cancer. I  am going for an MRI, but have no date yet. I have had no other tests or examinations. I feel tired and nauseus most of the time. I have almost constant abdominal swelling, and some ankle swelling. I have no urinary tract infection. I'm also having quite bad episodes of sweating. Do you think I should be asking for any other tests? I feel as though I have been left alone and I am a little concerned that things seem to be being investigated slowly.\n\n",
    "posted_time": "Post  by billy123 » Wed Jun 09, 2010 4:44 pm",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=93663&sid=ab52de81f30c500181267c914cc131fe#p93663"
  },
  {
    "author": "miss p  Guest Posts: 1 Joined: Sun Mar 29, 2009 6:15 am Gender: Female",
    "title": "I HAVE CIN 3 WHAT WILL HAPPEN?",
    "content": "Hi, I'm 25 and just been diagnosed with CIN 3 after my first pap smear. I have a test booked in for 2 weeks. I will be having a biopsy and i just wanted to know how long it will take to get the results? Also what is the likely hood i have cancer? Any other information about treatment would be appreciated. Many Thanks :)\n\n",
    "posted_time": "Post  by miss p » Sun Mar 29, 2009 6:27 am",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=72299&sid=ab52de81f30c500181267c914cc131fe#p72299"
  },
  {
    "author": "SallyJ  Guest Posts: 18 Joined: Thu Aug 05, 2004 9:35 am Location: PA",
    "title": "Re: I HAVE CIN 3 WHAT WILL HAPPEN?",
    "content": "I tested positive for ASCUS on my pap, so I had a colposcopy done.  During my colp I had one biopsy taken.  At the end of my appointment I asked the gynecologist when I should expect results, and she said in 2-3 weeks; however, I got a call yesterday (exactly one week after my colp) that the results were in and I went to the office to discuss them this morning.  I hope this helps with the timing question.  Good luck with everything!\n\n",
    "posted_time": "Post  by SallyJ » Wed Feb 24, 2010 7:03 pm",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=91897&sid=ab52de81f30c500181267c914cc131fe#p91897"
  },
  {
    "author": "likeable2  Guest Posts: 1 Joined: Fri Sep 11, 2009 3:24 am Gender: Female",
    "title": "hpv vaccine",
    "content": "Can you have sex whilst in the middle of your 3 cervical cancer jabs?\n\n",
    "posted_time": "Post  by likeable2 » Fri Sep 11, 2009 3:37 am",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=82454&sid=ab52de81f30c500181267c914cc131fe#p82454"
  },
  {
    "author": "Dr.M.jagesh kamath  Medical Doctor Posts: 1303 Joined: Mon Aug 03, 2009 7:24 am Gender: Male",
    "title": "Re: hpv vaccine",
    "content": "Hello,Protected sex is a must despite Hpv vaccination course The vaccine course is no contra indication sex but it is worthwhile remembering that it would not protect against all types of HPV but then most of it.Also there are other STDs which could get transmitted,and thus safe sex has to be pracised despite getting the vaccine.Since the vaccine does not contain viral particles you will not transmit any disease relating to the vaccine.Condom usage by partner would be ideal during this period of vaccination.There is little data about vaccine during pregnancy though it is generally considered safe.Quadrivalent vaccine is not recommended during pregnancy however due to lack of data.\n\n",
    "posted_time": "Post  by Dr.M.jagesh kamath » Wed Oct 28, 2009 3:24 am",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=85059&sid=ab52de81f30c500181267c914cc131fe#p85059"
  },
  {
    "author": "Dr.M.jagesh kamath  Medical Doctor Posts: 1303 Joined: Mon Aug 03, 2009 7:24 am Gender: Male",
    "title": "Re: hpv vaccine",
    "content": "Hello,In continuation with the above, initiation of vaccine series is delayed until after completion of pregnancy.So you should be careful about the same.So I feel abstinence would be an ideal setting during vaccine.Do consult your health care provider for more details.Cheers.\n\n",
    "posted_time": "Post  by Dr.M.jagesh kamath » Wed Oct 28, 2009 4:40 am",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=85062&sid=ab52de81f30c500181267c914cc131fe#p85062"
  },
  {
    "author": "forgettgravityy  Guest Posts: 1 Joined: Wed Dec 16, 2009 4:28 pm Gender: Female",
    "title": "Re: hpv vaccine",
    "content": "I'm on the oral contraceptive pill and i've just had the vaccine, am I able to have sex with my boyfriend without a condom or do I need one?\n\n",
    "posted_time": "Post  by forgettgravityy » Wed Dec 16, 2009 4:30 pm",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=89207&sid=ab52de81f30c500181267c914cc131fe#p89207"
  },
  {
    "author": "girl-19  Guest Posts: 2 Joined: Wed Dec 23, 2009 7:17 am Gender: Female",
    "title": "Re: hpv vaccine",
    "content": "I don't want to sound silly, but I am currently waiting for the alst part of the vaccine and have been in to cervical cancer; can you get cervical cancer from unprotected sex?\n\n",
    "posted_time": "Post  by girl-19 » Wed Dec 23, 2009 7:27 am",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=89741&sid=ab52de81f30c500181267c914cc131fe#p89741"
  },
  {
    "author": "Dr.M.jagesh kamath  Medical Doctor Posts: 1303 Joined: Mon Aug 03, 2009 7:24 am Gender: Male",
    "title": "Re: hpv vaccine",
    "content": "Hello,It all depends whether you are having monogamous relationship with an uninfected partner.Even after post vaccine standard precautions need to be taken up and oral contraceptive would not offer the protection that a condom would offer against STDs.Best wishes.\n\n",
    "posted_time": "Post  by Dr.M.jagesh kamath » Sun Jan 03, 2010 10:54 am",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=90521&sid=ab52de81f30c500181267c914cc131fe#p90521"
  },
  {
    "author": "karbear40  Guest Posts: 1 Joined: Mon Sep 10, 2007 1:26 am",
    "title": "cervical cancer",
    "content": "Hello, i'm 40 yrs old. I just had a pap smears which came out adnormal. I have to have a biopsy in a couple of weeks. I've been spotting between my periods, which my periods are alot heavier now, also been bleeding a little after sex. My question is do i have cervical cancer and what stage do you think it's in? I just want a straight up honest answer. Please tell me something......\n\n",
    "posted_time": "Post  by karbear40 » Mon Sep 10, 2007 2:06 am",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=47657&sid=ab52de81f30c500181267c914cc131fe#p47657"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Karbear40,  At this point the most we can say from this information is it is possible.  I cannot tell you you do or do not have cervical cancer.  The biopsy will be needed to answer this question.    Sorry I can't be of more help at this point.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Mon Sep 10, 2007 6:44 pm",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=47678&sid=ab52de81f30c500181267c914cc131fe#p47678"
  },
  {
    "author": "yanet0583  Guest Posts: 1 Joined: Tue Dec 22, 2009 11:58 pm Gender: Female",
    "title": "Re: cervical cancer",
    "content": "hi I need your help my god mother has been diagnose Cervical Cancer, she has a big tumor and  the doctors are going to give her chemotherapy but because she live in Cuba there are no medications to give her for pain or vomiting, so I need to know what kind of analgesic, antibiotic, antiemetic she need to take so that I can buy it here and send it to her. Also she needs a gel for dryness or bern feeling.\n\n",
    "posted_time": "Post  by yanet0583 » Wed Dec 23, 2009 12:11 am",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=89717&sid=ab52de81f30c500181267c914cc131fe#p89717"
  },
  {
    "author": "health2010  Guest Posts: 1 Joined: Mon Dec 07, 2009 1:04 am Gender: Male",
    "title": "Cervical cancer Stage III A",
    "content": "My mother is 70 years old and she was diagnosed for Cervical Cancer Stage IIIA. She took radiotherapy but she can not take chemotherapy because of her weight. She is 36kgs.  Now she has serious back pain and she can not sleep the whole night.  What can we do to help her?\n\n",
    "posted_time": "Post  by health2010 » Mon Dec 07, 2009 1:10 am",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=88325&sid=ab52de81f30c500181267c914cc131fe#p88325"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: Cervical cancer Stage III A",
    "content": "Hi,  Invasive cervical cancer accounts for about 6% of all cancers that afflict women in the United States. Stage IIIA (involves lower third of vagina but, not the pelvic side wall) by the criteria of the International Federation of Gynecology and Obstetrics (FIGO), accounts for less than 2% of all cervical cancer cases.  Over 90% of cervical carcinomas are squamous cell carcinomas. About 5-9%  start in glandular tissue (adenocarcinoma). Adenocarcinomas are more difficult to diagnose, but the treatment is as for squamous cell carcinomas and the survival rates, stage for stage, are similar.   There are several types of adenocarcinoma. Approximately 60% are the endocervical cell type, 10% each are of endometrioid and clear cell carcinomas, and 20% are adenosquamous carcinomas.  There are two rare types of cervical carcinoma known as small cell carcinoma and cervical sarcoma. Both have a poor prognosis.I am not aware of which histologic type of tumor your mother suffers from.  Management of stage IIIA patients is by a combination of radiotherapy and chemotherapy.The radiation therapy treatment program includes intracavitary and vaginal brachytherapy plus external beam radiation therapy, with a strong emphasis on individualized treatment.Your mother obviously,did not have chemotherapy.   As your mother now has low back pain,several possibilities ought to be considered before one can formulate a treatment plan, - re-staging to ascertain the current stage (if it has climbed to stageIIIB by involving the pelvic side wall or has distant mets).If indeed it has progressed, ureteric obstruction/hydronephrosis can occur and may help to explain the back pain- - tumors can involve the pelvic nerves & thus cause back pain. - secondaries in bone also need to be excluded (although infrequent).  The most frequent site of metastasis is the vertebral column, particularly the lumbar & thoracic spine, followed by the pelvic bones.Management of painful bony mets is usually by radiotherapy and chemotherapy.  Pain management would depend upon first finding out what is presumably causing her pain and generally a team approach is needed in management of cancer pain. Best wishes!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Tue Dec 22, 2009 8:02 pm",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=89691&sid=ab52de81f30c500181267c914cc131fe#p89691"
  },
  {
    "author": "leesy85  Guest Posts: 2 Joined: Fri Oct 16, 2009 10:35 am Gender: Female",
    "title": "Lumps on cervix and bleeding.",
    "content": "I have recently noticed a few small lumps and one large hard lump on my cervix. They are sore and I am having a lot of irregular bleeding. I was raped a few years ago and had a miscarriage last year. Since this I have bled during and after sex, I had a papsmear and it was normal.  Should I be worried about these lumps?\n\n",
    "posted_time": "Post  by leesy85 » Fri Oct 16, 2009 10:46 am",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=84023&sid=ab52de81f30c500181267c914cc131fe#p84023"
  },
  {
    "author": "heartncrossbones  Guest Posts: 1 Joined: Wed Nov 12, 2008 4:20 pm Gender: Female",
    "title": "Abnormal cervical cells run in family- should I be worried?",
    "content": "I have a constant fear of doctors- and an even worse fear of cancer. Unfortunately, cervical cell abnormalities run in my family. I am 18 years old, sexually active (it has been 9 months since I first became active), and my mom has no idea. As you can suspect I don't want to tell her about my sexual activity, though it has been with only one man, and that man my boyfriend and possibly husband in the next few years (she doesn't think we should be together).  My periods are regular, though as I get older the bleeding increases- and if I have sex during my period the cycle seems to start all over. It usually lasts about 4 days and I have no spotting in between the cycles. My mother and aunt had abnormal cervical cells when they were in their twenties- my mother's faded away on their own but my aunt had to have pieces of her cervix removed. Nothing has caused me to fear I have cancer except for my paranoia about being sexually active and developing cancer and not knowing it.   I am afraid to ask my mom right now to help me schedule an appointment with an OB/GYN, since I do not have one at present I don't really know how to go about getting one without some assistance from my mom. Would it be ok to wait a year until I am comfortable doing this on my own before going to get a pap smear or should I do it ASAP.\n\n",
    "posted_time": "Post  by heartncrossbones » Wed Nov 12, 2008 4:41 pm",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=64057&sid=ab52de81f30c500181267c914cc131fe#p64057"
  },
  {
    "author": "Vanna0407  Guest Posts: 2 Joined: Fri Nov 07, 2008 6:18 pm Gender: Female",
    "title": "Re: Abnormal cervical cells run in family- should I be worried?",
    "content": "You should have an annual with a pap if you are sexual active.  There are plenty of clinics that would offer these  services at a dicounted price, or your primary care can usually perform them.  Your mother does not need to know about anything considering your age, but if you do tell her it will make being responsible a lot easier with her help.\n\n",
    "posted_time": "Post  by Vanna0407 » Sat Nov 15, 2008 10:19 am",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=64353&sid=ab52de81f30c500181267c914cc131fe#p64353"
  },
  {
    "author": "butterflykiss3s03103  Guest Posts: 4 Joined: Wed Sep 16, 2009 8:09 pm Gender: Female",
    "title": "Re: Abnormal cervical cells run in family- should I be worried?",
    "content": "It is very important to get pap smears done at least once a year. If you are afraid of your mother finding out, Im not sure if there is one in your area but there is a clinic called \"planned parenthood\", which is a free and confidential office where you can be seen if you are concerned. I hope this helps and good luck to you\n\n",
    "posted_time": "Post  by butterflykiss3s03103 » Fri Sep 18, 2009 2:28 pm",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=82785&sid=ab52de81f30c500181267c914cc131fe#p82785"
  },
  {
    "author": "mpeterson1105  Guest Posts: 1 Joined: Mon Jan 12, 2009 9:40 pm Gender: Female",
    "title": "uterus enlarged and fibroids, and thickening of the lining",
    "content": "Hi, I went to my gyno last week and they did an ultrasound on my uterus, and they found a fibroid, an enlarged uterus and thickening of the lining, they have yet to get back with me about what to do at this point.  Is there anything for me to worry about?  I am 42 years old, and I have had 2 children.\n\n",
    "posted_time": "Post  by mpeterson1105 » Mon Jan 12, 2009 9:47 pm",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=68086&sid=ab52de81f30c500181267c914cc131fe#p68086"
  },
  {
    "author": "Debbie Miller, RN  Nurse Posts: 4746 Joined: Mon Apr 16, 2007 2:41 pm Gender: Female Location: USA",
    "title": "Re: uterus enlarged and fibroids, and thickening of the lining",
    "content": "Hello, Most likely cancer is not the problem. These changes often occur during the perimenopause period, which can last several years prior to the actual menopause.  There are treatment options, both hormonal, minimally invasive such as D & C or ablation for the uterine lining (diagnostic and treatment) and surgery for the fibroids if they are large and causing problems -bleeding, pain, etc.  Sometimes hysterectomy is recommended but not necessarily.  I'm sure your doctor will explain your treatment possibilities along with risks and benefits so be prepared to ask lots of questions to make the right decision for you.  Best wishes.\n\n",
    "posted_time": "Post  by Debbie Miller, RN » Fri Jan 16, 2009 11:39 am",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=68583&sid=ab52de81f30c500181267c914cc131fe#p68583"
  },
  {
    "author": "gurlnGa  Guest Posts: 2 Joined: Thu Nov 13, 2008 3:47 pm Gender: Female",
    "title": "I think i may have cervical cancer could my symptoms be it?",
    "content": "Iam 21 and married i have been having irregular periods. I have a lot of lower back pain and sometimes feel faint or dizzy like i am goin to pass out. I sometimes feel like i have to throw up but I don't. I also get sharp stabbing pains in my side, chest, and lower abdomen. Before my last period which came later than i thought it would, i had a lot of vaginal discharge. now i am experiencing bleeding during sexual intercourse and after i clean up i do not bleed again. Cancers of all kinds run in my family could i have symptoms of any?\n\n",
    "posted_time": "Post  by gurlnGa » Thu Nov 13, 2008 4:04 pm",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=64173&sid=ab52de81f30c500181267c914cc131fe#p64173"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "Re: I think i may have cervical cancer could my symptoms be it?",
    "content": "Hello, Bleeding after sex is not considered normal and may be caused by vaginal dryness or more serious causes like: Infection and inflammation of the cervix (cervicitis) Sexually transmitted diseases Other infections and pelvic inflammatory disease Benign tumors of the uterus or cancer in the cervix or the uterus. Cancer cervix is more commonly seen in females infected with HP virus and with history of multiple sexual partners.  Direct clinical examination is essential. Please keep us updated.\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Thu Nov 20, 2008 6:16 pm",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=64713&sid=ab52de81f30c500181267c914cc131fe#p64713"
  },
  {
    "author": "jackiebunny  Guest Posts: 1 Joined: Fri Nov 07, 2008 10:18 am Gender: Female",
    "title": "can the hpv of cervical cancer cause oral cancer",
    "content": "my spouse has given me hpv and i developed precervical changes requiring conization and the leep. five paps have returned normal. i am still with him and we have oral sex and unprotected intercourse.since he is the carrier but i also now have the virus, can i develop oral cancer? what about if we had anal sex in the past, can it cause cancer there? can he get cancer of the penis? my gynecologist said i have the high risk hpv because of my precervical cancer.\n\n",
    "posted_time": "Post  by jackiebunny » Fri Nov 07, 2008 10:33 am",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=63452&sid=ab52de81f30c500181267c914cc131fe#p63452"
  },
  {
    "author": "Debbie Miller, RN  Nurse Posts: 4746 Joined: Mon Apr 16, 2007 2:41 pm Gender: Female Location: USA",
    "title": "Re: can the hpv of cervical cancer cause oral cancer",
    "content": "Hello, Since cancers can appear in many places of the body, it is possible there could be an increased risk of oral cancers with this type of exposure to HPV.  There are also many forms of the human papillomavirus and some are more common causes of cancer than others so there are many variables here.  You should discuss this with your doctor so you can do whatever screening tests are indicated for early detection of problems.   Best wishes.\n\n",
    "posted_time": "Post  by Debbie Miller, RN » Fri Nov 07, 2008 1:35 pm",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=63467&sid=ab52de81f30c500181267c914cc131fe#p63467"
  },
  {
    "author": "prlopez  Guest Posts: 2 Joined: Wed Aug 27, 2008 3:10 pm Gender: Female",
    "title": "intestinal pain/ lower back pain/ low grade fever",
    "content": "Last week (Wednesday) I woke up with cramping in my stomach. Didn't hestiate - took Pepto. Worse the next day. The syptoms were exatly like those last year when I suffered from Yersinia - bacterial infection from food poisioning. Doctor that treated me last year gave an extra prescipt for Cipro. Started that last Friday.  Seemed to be getting better. Still had pains, but were getting more bearable. Today pains were back - pains from the navel down to what would be like ovarian cramps. My lower back started feeling sore. My stomach is bloated a little. Low grade fever now - 99.2 (I usually am 98.0). Brief history: Hysterectomy 10 years ago due to severe endometriosis. He left both ovaries. Told me after surgery, couldn't get all of endemetriosis because there was some on my rectal tube. Two years ago, I was diagnosed with cysts on my ovary - nothing new I seem to always get them. The two weeks prior to this cramping in intestines, I could have sworn had another cyst because the pain was the same as always. So question....what's up with all of this stuff. Ready to get back to normal. Thanks\n\n",
    "posted_time": "Post  by prlopez » Wed Aug 27, 2008 3:38 pm",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=59387&sid=ab52de81f30c500181267c914cc131fe#p59387"
  },
  {
    "author": "prlopez  Guest Posts: 2 Joined: Wed Aug 27, 2008 3:10 pm Gender: Female",
    "title": "Re: intestinal pain/ lower back pain/ low grade fever",
    "content": "Please post: this IS NOT CERVICAL CANCER!!!!!!! Please use the term cancer not so loosely! I have been diagnosed with UTI - urinary tract infection. Please make sure you post this so that other patients searching for an answer do not see CANCER!!!!! Several nights with worry thanks to your forum of \"cervical cancer\".\n\n",
    "posted_time": "Post  by prlopez » Thu Sep 04, 2008 7:28 pm",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=59878&sid=ab52de81f30c500181267c914cc131fe#p59878"
  },
  {
    "author": "jdoie2411  Guest Posts: 1 Joined: Wed Mar 05, 2008 10:30 pm Gender: Female",
    "title": "cervical cancer needle",
    "content": "ive had my first cervical cancer needle and not long after i got it done i started to spot bleed around the time of my period ive had many test done including paps test blood test, utra sounds and the one where you get the camera to look in side you they all came back negative  could this be coursed by the needle i did have cn1 (the first stage of cervical cancer) but that cleared up after having my only baby.\n\n",
    "posted_time": "Post  by jdoie2411 » Wed Mar 05, 2008 10:43 pm",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=55180&sid=ab52de81f30c500181267c914cc131fe#p55180"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "Re: cervical cancer needle",
    "content": "Hello,  Sorry for the delay. I have looked up the adverse reactions for Gardasil (HPV vaccine) and could not find anything to indicate that your problem is caused by the needle. I am happy that your results came out negative. If this problem has been resolved kindly update this topic for the benefit of our other guests.  Best regards,\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Sat May 31, 2008 3:57 am",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=58435&sid=ab52de81f30c500181267c914cc131fe#p58435"
  },
  {
    "author": "jerrilynne  Guest Posts: 1 Joined: Mon Mar 24, 2008 3:21 pm Gender: Female",
    "title": "cigarettes and oral sex",
    "content": "Please would like to know if a man is a heavy smoker and he performs oral sex on me. can he cause any type of infection?  meeshka99\n\n",
    "posted_time": "Post  by jerrilynne » Mon Mar 24, 2008 3:31 pm",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=56796&sid=ab52de81f30c500181267c914cc131fe#p56796"
  },
  {
    "author": "Debbie Miller, RN  Nurse Posts: 4746 Joined: Mon Apr 16, 2007 2:41 pm Gender: Female Location: USA",
    "title": "Re: cigarettes and oral sex",
    "content": "Hello, Oral sex may increase your cancer risk (relatively uncommon head and neck cancers) and smoking (by you or from second-hand exposure) increases your risk much further, but I know of no evidence that receiving oral sex from a smoker will increase your chances for health problems beyond this.    Best wishes.\n\n",
    "posted_time": "Post  by Debbie Miller, RN » Tue Mar 25, 2008 6:33 pm",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=56886&sid=ab52de81f30c500181267c914cc131fe#p56886"
  },
  {
    "author": "mimi81  Guest Posts: 1 Joined: Sun Nov 11, 2007 6:25 am",
    "title": "Is the a sign of cervical cancer?",
    "content": "I am a 26 year old female & have only one child.  I haven't had any sexual intercourse for over a year & haven't had a papsmear in over 4 years.  As a young lady, my menstruation has been irregular, it would only occur every 6 months and usually lasts about 5 days to a week.  After I gave birth to my 4year old, my menstruation has changed dramatically.  It would occur about every 2 months & lasts about 2-3 weeks sometimes a whole month.  For the past months, my menstruation has occured every month, lasts about 2 weeks & then 2 weeks later occur again for another 2 weeks.  I haven't been seen by a doctor since the day I gave birth to my daughter.  Please help.  Is this a sign of cervical cancer?\n\n",
    "posted_time": "Post  by mimi81 » Sun Nov 11, 2007 6:46 am",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50054&sid=ab52de81f30c500181267c914cc131fe#p50054"
  },
  {
    "author": "Sandy Tracy RN  Nurse Posts: 60 Joined: Wed Nov 07, 2007 6:57 pm",
    "title": "[no title]",
    "content": "Hello Mimi81,  There can be many reasons for irregular periods.  I encourage you to make an appointment with your doctor.  A pelvic exam should be performed every year.    Early cervical cancer usually produces no signs or symptoms.  Irregular bleeding is a sign of cervical cancer, but it also is a sign of other issues.  Since your period has always been irregular there may be a medical reason for this.  I encourage you to find an OBGYN that you are comfortable with so you can discuss these issues. There are alot of young people that are hesitant to get proper care because of fear or embarassment.  Do not let these issues stand in the way of taking care of yourself.  Good Luck and let us know if we can be of further assistance. Sandy RN\n\n",
    "posted_time": "Post  by Sandy Tracy RN » Sun Nov 11, 2007 10:13 am",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50066&sid=ab52de81f30c500181267c914cc131fe#p50066"
  },
  {
    "author": "funnyfem33  Guest Posts: 2 Joined: Sat Oct 27, 2007 3:42 pm",
    "title": "Follow-up abnormal pap",
    "content": "Age 45, fem, Have had two abnormal pap, mild dysplasia diagnosed after biopsy.  No history of cancer, HPV positive.  I had a cervical biopsy which came back ok, then a vaginal stain/biopsy which showed mild dysplasia.  My doctor wanted to do laser surgery, second doctor wants to do a DandC for diagnostic purposes.  Are these interventions too extreme or is one of them preferable.  Thanks\n\n",
    "posted_time": "Post  by funnyfem33 » Sat Oct 27, 2007 3:47 pm",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=49596&sid=ab52de81f30c500181267c914cc131fe#p49596"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Funnyfem33,  The initial cervical biopsy may have missed the effected area.  With two abnormal pap smears and the subsequent biopsy showing mild dysplasia it seems reasonable to be a little more agressive in treatment.  The problem is that with mild dysplasia no one can say if or when the dysplasia will progress.  The concern would be that it will ultimately progress to cervical cancer.  So, I suspect your doctors are wanting to treat this aggressively to try to prevent it from becoming cancer.  As to which procedure is appropriate, I am unable to recommend one over the other.  My specific knowledge of this issue is too limited to say with confidence.  Follow up with your gynecologist is important.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sat Nov 03, 2007 4:20 pm",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=49836&sid=ab52de81f30c500181267c914cc131fe#p49836"
  },
  {
    "author": "marthella  Guest Posts: 1 Joined: Mon Sep 03, 2007 12:50 am",
    "title": "elevated Ca125 bloodwork but no ovaries",
    "content": "I am female; just turned 60. Had total hysterectomy (inc. ovaries) at age 41 because of cervical ca.,endometriosis,fibroid tumor & ovarian cysts) Nine wks ago, I was hospitalized for 6 wks-4 of them in cardiac intensive care unit w/ pericarditis that came out of nowhere (woke up & couldn't breathe). I also was in atrial fib (which I have had for 2 yrs but take cardizem& flecanide to control) My bp was 80/50; heart rate 185. Remained that way for 5 days. Heart naturally converted to sinus rhythm on its own right before drs. did cardioversion. I did not have a pericardial tap. The fluid eventually reabsorped-was given no antibiotics, just heart meds & heparin. Had numerous blood tests for bacterial infection-all neg. Rheumatoid arthrologist tested me for lupus, arthritis, immune diseases-all neg. I was discharged on oxygen (still had pulse ox of 82 w/out it) & came home. I had a fever while in hospital of 102 but before discharge it was 99.something every day. After 4 days at home, fever back to 101 & breathing very labored. I went to ER and was told I now had pleural effusions both lungs and atelectasis both lungs-readmitted to hospital. Kept another 2 1/2 wks. Lung fluid removed-neg for Ca cells or any bacterial infection-cloudy, straw fluid w/ high inflammatory, wbc count. My blood work came back very anemic(8.5), Ca125 of 126 and C reactive protein of 156. I was given iron IV and procrit and anemia went away. Once all fluid gone from rt lung and most gone from left-I was discharged. fever was gone. Still no diag. other than some virus probably??? Have been home 3 wks now and for last 5 days, fever is back but not constant. goes from 99.4-101, usually at night, not during the day (although sometimes daytime too, but some days, no fever at all) Feel much better on days I don't have fever but still have pleurisy pain only recently (in conjunction with the return of the fever), the pain is worse. It started left front (which was the worse lung) under breast and now is on right side worse than left. Hurts even on shallow inspiration. I had mammogram last wk that was neg-slightly enlged lymph node under rt arm pit.Slightly enlged mediastinal lymp nodes on chest x-rays.CT scans done in hospital showed nodules on thyroid, liver cyst, complex splenic cyst and slight splenomegaly, adrenal adenoma. I went to endocrinologist who feels nothing need be done about adrenal adenoma or thyroid. I am constipated and & have had bowel changes but could be due to hospitalization. I just don't feel good and don't know where to turn-afraid to even complain because I don't want to be back in hospital again.four days ago, had follow-up exam w/ internist who I did tell about fever and pain. She did EKG & compared it to copy of last hospital EKG-she said it was abnormal and thought maybe I was getting pericarditis again but ultrasound done that day showed no fluid. Any thoughts??\n\n",
    "posted_time": "Post  by marthella » Mon Sep 03, 2007 12:24 pm",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=47285&sid=ab52de81f30c500181267c914cc131fe#p47285"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Marthella,  Your symptoms, except perhaps the elevated CA-125, all fit well with systemic lupus erythematosus.  You may want to see your rheumatologist again and be re-evaluated for this.  Sometimes the antibody tests do not become positive for a little while.  In reviewing the literature some I found that things such as pleural effusions can cause an elevated CA-125.  It may be that your level is elevated due to the pericarditis or pleural effusions.  With your history of gynecological issues it may still be a wise idea to talk with your oncologist and see if anything should be pursued from this standpoint.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sat Oct 06, 2007 1:53 pm",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=48728&sid=ab52de81f30c500181267c914cc131fe#p48728"
  },
  {
    "author": "TexasT  Guest Posts: 1 Joined: Sun Sep 23, 2007 10:27 pm",
    "title": "Gardasil for 10 year old?",
    "content": "My daughter is 10 years old and i have a question that i can't seem to find an answer for anywhere.  I do not want her to have the vaccine yet because i want to wait for more results from the research they are currently doing. Can you tell me how long after you get the vaccine that it begins to protect you? Does it take a week to start protecting? A month? A year?   Thanks~  [/b]\n\n",
    "posted_time": "Post  by TexasT » Sun Sep 23, 2007 10:36 pm",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=48205&sid=ab52de81f30c500181267c914cc131fe#p48205"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi TexasT,  I don't know that that question has been directly answered.  With most vaccines it takes about 4-6 weeks to get a good immune response from the IgG antibodies that give lasting immunity.  I would not expect this vaccine to be different.  The Gardasil vaccine has been approved for girls aged 9-26.  The CDC has a good page summarizing all the available research and recommendations for the vaccine found here for those interested.  The vaccine is very effective.  In one study it was 100T effective at preventing cervical cancer.  I would recommend your daughter receive the vaccine; however, it is important that you are comfortable with it.  She is very unlikely to acquire HPV in the upcoming years and the vaccine can be given then if you choose.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sun Sep 23, 2007 10:56 pm",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=48208&sid=ab52de81f30c500181267c914cc131fe#p48208"
  },
  {
    "author": "babygirl1987  Guest Posts: 2 Joined: Wed May 16, 2007 7:09 am",
    "title": "history of pre-cancer cells",
    "content": "Hello i am a 20 year old female. for the fast 5 years i have had every pap test come back abnormal..i have gone to see specialst to have these cells removeed numerous amount of times..well when i got pregnant they couldnt remove them and i missed my appoinment after the baby was born and i havet been able to get back in for 2 years..now everytime i have intercourse it hurts my cervix really bad!! and the pain in my lower abdomine never stops..it has even mad it hard for me to go pee...and i constantly have back pain(lower back). im not sure what i should do because where i live it tAKES SO LONG TO GET INTO A DOCTOR HERE ABOUT IT..DO YOU HAVE ANY SUGGESTIONS ON WHAT IT COULD BE OR WHAT I SHOUD DO ABOUT THIS PROBLEM???THANK YOU SO MUCH\n\n",
    "posted_time": "Post  by babygirl1987 » Wed May 16, 2007 7:43 am",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=42569&sid=ab52de81f30c500181267c914cc131fe#p42569"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "There are a few possibilities.  The most concerning would be, as I'm sure you've suspected, cervical cancer.  Given your previous pap smear results this must be evaluated for.  I would strongly urge you to see a doctor as soon as possible.  While emergency rooms really should not be substituted for a primary care doctor, if it is going to be months before you can see your regular doctor I would recommend that you be seen in the urgent care.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Thu May 17, 2007 1:13 pm",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=42642&sid=ab52de81f30c500181267c914cc131fe#p42642"
  },
  {
    "author": "Mazie  Guest Posts: 1 Joined: Sat Aug 18, 2007 8:06 pm",
    "title": "Pain in vagina",
    "content": "45 F Had surgery on vagina to remove a cancer spot. Hysto. I have been exercising on the treadmill I get pain in that area after exercising. Now I have to go back for another test pap smear is adnormal again. they think I might need estrogen..so they sent the speicment out should I be sorried\n\n",
    "posted_time": "Post  by Mazie » Sat Aug 18, 2007 8:16 pm",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=46515&sid=ab52de81f30c500181267c914cc131fe#p46515"
  },
  {
    "author": "taz  Guest Posts: 9 Joined: Mon Jul 09, 2007 4:45 pm",
    "title": "Bloating and pain in lower back and left rib cage",
    "content": "I am a 39 yr old female.  I just started taking metformin 2 weeks ago.  I have had bloating for a few months now along with a pain that comes and goes on my left side by rib cage.  My lower back is now starting to hurt/burn on and off.  Used to have diarhea and now constipated.  Saw Gastro doctor 2 weeks ago for pain and he advised to take 3 advil and use heating pad.  It worked for a while but now it is back.  I went to GYN today and had a pelvic ultrasound which they said all was normal.  I am not sure what is going on.  Feel like I am losing my mind.  Family history with diabetes.  Have had kidney stones in the past and had surgery but this doesn't feel the same\n\n",
    "posted_time": "Post  by taz » Mon Jul 09, 2007 8:14 pm",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=44477&sid=ab52de81f30c500181267c914cc131fe#p44477"
  },
  {
    "author": "Debbie Miller, RN  Nurse Posts: 4746 Joined: Mon Apr 16, 2007 2:41 pm Gender: Female Location: USA",
    "title": "[no title]",
    "content": "I think this posting would be better in a different forum because it is not likely cervical cancer.  The first thing that comes to my mind is irritable bowel syndrome.  This can cause symptoms you describe.  Of course many other conditions could as well.  I would advise you to continue to follow up with your doctor until you find a satisfactory answer.  It looks like you have done well getting the pelvic ultrasound to rule out related issues.  But, stay with it until you find relief.  Perhaps start with your gastroenterologist to inform him/her of your gynecological exam findings and to inform that the pain relief measures were only temporary.  Do you get any relief with anti-gas or acid relieving medication such as simethicone (Gas-X for example) or Mylanta liquid?  Good luck with this and please let us know what you learn.\n\n",
    "posted_time": "Post  by Debbie Miller, RN » Wed Jul 18, 2007 8:11 am",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=44783&sid=ab52de81f30c500181267c914cc131fe#p44783"
  },
  {
    "author": "monkey1  Guest Posts: 1 Joined: Thu Apr 26, 2007 8:32 am",
    "title": "hpv and getting pregnant",
    "content": "I am a 31-year old woman who has recently been diagnosed with HPV.  My doctor told me that I don't have to do anything to treat it right now but should be monitored every few months.  She told me that it was okay for my husband and me to continue trying to get pregnant, but I've noticed that after sex I get cramps and feel pain, sometimes for days.  We are having sex often now as we are trying to get pregnant, but I'm worried that I may be exacerbating HPV.  What should I do?\n\n",
    "posted_time": "Post  by monkey1 » Thu Apr 26, 2007 11:00 am",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=41472&sid=ab52de81f30c500181267c914cc131fe#p41472"
  },
  {
    "author": "Debbie Miller, RN  Nurse Posts: 4746 Joined: Mon Apr 16, 2007 2:41 pm Gender: Female Location: USA",
    "title": "[no title]",
    "content": "I would not expect these symptoms from HPV.  I can't say that I have an answer for it but I don't think you are at risk for exacerbating the condition by having sex frequently.  I think your doctor is correct that you should be fine to continue as  you are in attempting pregnancy.  Good luck.\n\n",
    "posted_time": "Post  by Debbie Miller, RN » Tue May 08, 2007 5:27 pm",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=42138&sid=ab52de81f30c500181267c914cc131fe#p42138"
  },
  {
    "author": "beara101  Guest Posts: 1 Joined: Fri Apr 13, 2007 4:27 pm",
    "title": "pcos",
    "content": "I am a 20 year old female and my doctor told me i have pcos two years ago. The result of my ultrasound showed that both my ovaries were quite large and both cotain a few small follicles. There is also an echogenic nodule in the right ovary which they said could be a dermoid cyst. I currently take birth control pills to regulate my mentstrual cycle. I have recently become sexually active and have always experienced pain during sex. What is the cause of this and what can be done to avoid this pain?  Thank-you.\n\n",
    "posted_time": "Post  by beara101 » Fri Apr 13, 2007 4:44 pm",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=40720&sid=ab52de81f30c500181267c914cc131fe#p40720"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Pain during intercourse is most commonly due to some muscle spasms.  This may or may not be associated with your PCOS.    Be sure to use plenty of lubrication as this will decrease friction and should help with pain.  Also, anxiety contributes to muscle spasms so try to relax as much as you can.    If these things don't help I would recommend that you see your gynecologist for an examination to be sure there is nothing else that may be causing your pain.  You can also discuss treatment options.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sat Apr 21, 2007 12:57 am",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=41115&sid=ab52de81f30c500181267c914cc131fe#p41115"
  },
  {
    "author": "jennmeeker  Guest Posts: 1 Joined: Mon Apr 02, 2007 9:49 am",
    "title": "Abnormal Bleeding, Pap not readable, miscarriage",
    "content": "Hello,   I am 35 and in the middle of a miscarriage. I started bleeding between periods about a year ago. My PCP did a pap last year and there was too much blood in the sample to read it and put me on birth control. I went to an GYN in September and he did a uterine biopsy in October. It came out negitive. I continued to bleed between cycles. I became pg in January. When I went in to the OB office (different doc as mine was on vac) to verifiy m/c last week he stated the one side of my cervix was red. Could this be an indication of possible cervical cancer?\n\n",
    "posted_time": "Post  by jennmeeker » Mon Apr 02, 2007 9:58 am",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=40370&sid=ab52de81f30c500181267c914cc131fe#p40370"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "It's a little difficult to say for sure whether or not this redness may represent cancer.  It may also be an area of irritation or changes related to the fluctuating hormones from pregnancy/miscarraige.    You should have a pap smear to look for any abnormal cells that may be an indication of cancerous changes.  Follow-up with your gynecologist will be important.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Thu Apr 12, 2007 1:02 pm",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=40656&sid=ab52de81f30c500181267c914cc131fe#p40656"
  },
  {
    "author": "clairebear9898  Guest Posts: 30 Joined: Fri Dec 23, 2005 1:19 pm Location: Georgia",
    "title": "hpv vaccine",
    "content": "I'm an 18 year old female who is not sexually active. Can someone give me more info about the new HPV vaccine? If I'm not having sex, and won't until I am married, do I need to get it?\n\n",
    "posted_time": "Post  by clairebear9898 » Fri Jan 05, 2007 10:59 pm",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=37340&sid=ab52de81f30c500181267c914cc131fe#p37340"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Hello,  The FDA has licensed the HPV vaccine to be safe and effective.   The HPV vaccine is given to 11-12 year-old girls, and women younger than 26 years old who have not completed the vaccine series.    It is used to prevent genital warts and cervical/vaginal cancers caused by certain types of HPV in girls and young women.  The efficacy of the vaccine is said to last for five years or more.   Best regards.\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Sat Jan 06, 2007 7:30 pm",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=37396&sid=ab52de81f30c500181267c914cc131fe#p37396"
  },
  {
    "author": "CarlyAnne1  Guest Posts: 3 Joined: Tue Mar 29, 2005 3:28 pm Location: Binghamton, NY  Contact:   Contact CarlyAnne1       Yahoo Messenger   AOL",
    "title": "Severe Cercial Displasia/Possible Carcinoma in Situ",
    "content": "I'm a 26 year old female HPV positive.  I've been having abnormal paps since 1997.  I've been through several LEEPS/Cones.  My latest pap came back severe cervical displasia with possible carcinoma in situ.  What I want to know is, why can't they clear this up?   Now I could possibly have cancer things just keep getting worse as the years go by.  I just keep having surgeries and nothing helps.  What should I do?  Is there something else I haven't tried?\n\n",
    "posted_time": "Post  by CarlyAnne1 » Thu Oct 05, 2006 12:05 pm",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=34314&sid=ab52de81f30c500181267c914cc131fe#p34314"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi CarlyAnne1, I am sure having repeated procedures can be very frustrating and even discouraging. It you consider from the point of view that this actually has helped because had you not had the procedures done in a timely manner rather than the results being severe cervical dysplasia with possible carcinoma in situ they may have very well been invasive cervical carcinoma. Good luck and our best wishes. Sincerely, Theresa Jones, RN\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Sun Nov 19, 2006 8:29 am",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=35343&sid=ab52de81f30c500181267c914cc131fe#p35343"
  },
  {
    "author": "auguriesofinnocence  Guest Posts: 1 Joined: Mon Jan 30, 2006 10:01 pm Location: California",
    "title": "calcified adnexal mass",
    "content": "39 y/o black female, hx leiomyomatous uterus (multi-fibroids), hx myomectomy 2003, fibroids still present. CT scan results: Enlarged right adnexal mass (elliptial lesion) with calcified septa demonstrated...separated from the uterus.  It measures 5.7x2.7x6.0 cm in AP, transverse and CC dimension.   What does this mean...calcified septa?  Can this be cancerous?  Should I have a biopsy or will I be wasting oncologist time/dollars?\n\n",
    "posted_time": "Post  by auguriesofinnocence » Mon Jan 30, 2006 10:18 pm",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=29579&sid=ab52de81f30c500181267c914cc131fe#p29579"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi auguriesofinnocence, My apologies for the delayed reply. A calcified septa may indicate a hardened or calicifed wall/partition. In relationship to, for example serous tumor with calicifications, this would be a concerning finding. Although CT scans are excellent diagnostic tests the only true way to ascertain a differential diagnosis between a malignant verses benign disorder is through biopsy. It certainly would not be a waste of time to identify the causative factor. I hope you have had this procedure completed. Sincerely, Theresa Jones, RN\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Tue Feb 28, 2006 6:42 am",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=31498&sid=ab52de81f30c500181267c914cc131fe#p31498"
  },
  {
    "author": "debbiec_33  Guest Posts: 1 Joined: Fri Apr 23, 2004 6:21 am Location: N.J.  Contact:   Contact debbiec_33       Yahoo Messenger",
    "title": "Lumps in vagina",
    "content": "I had  cervical cancer about 4 years ago...i recenntly dicovered 2 lumps ..one ...almost inside my vagina...one on vulva...they are both pea sized...i was checking the one on vulva to see if it got bigger and squeezed it a little bit and it popped...really thick blood came out of it...not like blood when you get cut ..or period blood ...sticky...I don't have insurance ...so I'm seeking info...before i spend $100 on Doc visit.\n\n",
    "posted_time": "Post  by debbiec_33 » Fri Apr 23, 2004 6:27 am",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3164&sid=ab52de81f30c500181267c914cc131fe#p3164"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Lumps in vagina",
    "content": "Dear Debbiec_33,  With your history of cervical cancer, i would strongly urge you not to take any chances and go see your cancer doctor as soon as possible to rule out the possibility of recurrence.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Fri Apr 23, 2004 4:12 pm",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3168&sid=ab52de81f30c500181267c914cc131fe#p3168"
  },
  {
    "author": "dea  Guest Posts: 1 Joined: Wed Jan 26, 2005 12:38 am Location: Ontario, Canada",
    "title": "Same as above",
    "content": "recently I noticed some changed in my vagina area. The skin has turned from a healthy pink to a paler shade, almost white. I once heard this could be a sign of something wrong. I decided to investigate and discovered atleast one bump inside my vagina. It's large (size of a nickle), and rather deep. I wouldn't be able to see it, or really even feel it, because of it's depth.  I'm nervous. I don't think it is an STD as I have been in a relationship with one person for over a year, and it is just recent. He doesn't have any visable bumps or lumps either. Clearly I need to make an oppintment with my doctor, but I'm wondering what the possibilities are, and what I should book my appointment for, I mean what exactly do I say to the receptionist. I am overdue for a physical.\n\n",
    "posted_time": "Post  by dea » Wed Jan 26, 2005 12:51 am",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8581&sid=ab52de81f30c500181267c914cc131fe#p8581"
  },
  {
    "author": "Racheal6  Guest Posts: 1 Joined: Fri Dec 02, 2005 11:25 am Location: dronfield",
    "title": "lump in vagina",
    "content": "I have recently found a lump in my vagina, i am very worried.  It is a hard lump and is very painful to touch! it hurts slightly when i cough too.  I have been to my doctor and she said it is not cancerous and is most probably a cyst.  I am very worreid tho should i be?\n\n",
    "posted_time": "Post  by Racheal6 » Fri Dec 02, 2005 11:30 am",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=26048&sid=ab52de81f30c500181267c914cc131fe#p26048"
  },
  {
    "author": "teebaby313  Guest Posts: 1 Joined: Sat Aug 27, 2005 7:27 pm Location: detroit  Contact:   Contact teebaby313       Yahoo Messenger",
    "title": "ABNOMAL PAP",
    "content": "I HAVE BEEN HAVING ABNOMAL PAPS FROM 1997 TILL NOW  I AM HPV POSTIVE I HAVE BEEN SO WORRIED THAT EVERY TIME I GET THE PAP DONE AND THE DOCTOR TELL ME THAT I NEED MORE TESTS I FLIP OUT AND NEVER GO BACK I HAVE 4 KID I AM 27 COULD I HAVE CERVICAL CANCER\n\n",
    "posted_time": "Post  by teebaby313 » Sun Oct 09, 2005 1:04 am",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=22877&sid=ab52de81f30c500181267c914cc131fe#p22877"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi teebaby313, If you have been having abnormal pap smear results then it is very unwise for you not to have follow-ups completed. Cancer is treatable especially when identified in the early stages. Why continue risking allowing this to develop into something serious? Let me ask you this, if one of your loved ones or children were essentially ignoring what could possibly turn into a serious illness, what would your response be to them? I am very strongly suggesting you have the follow up evaluations recommended.  Sincerely, Rntdj\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Sun Oct 09, 2005 8:14 am",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=22895&sid=ab52de81f30c500181267c914cc131fe#p22895"
  },
  {
    "author": "mellycat  Guest Posts: 4 Joined: Wed Sep 14, 2005 10:06 am Location: ontario canada",
    "title": "LSIL etc. Please advise",
    "content": "For nearly 2 years I have had pelvic pain during menstrual cycles and when not menstruating. I saw a gynecologist in early 2004 when I suddenly stopped menstruating (I am 30yrs old, have had reg. cycles since starting at age 9) for many months. I was given medication to being my cycle, then bled for 28 days and was given meds to stop my cycle. Some concern existed that my increasing weight (obese) could be causing hormone imbalances etc and affecting my cycle. In July 2004 I underwent gastric bypass surgery (Roux-n-y) and gall bladder removal. I had normal cycles from July 2004-January 2005 (while taking birth control pills). Still I had consistent pelvic pain even when no menstruating. In February 2005 when I once again missed a period I learned that I was pregnant. My new 1ounce stomache was not absorbing the birth control pill properly. I was in rapid weight loss stage and deep in a state of ketosis and it was deemed far too dangerous to carry on with the pregnancy and I had no ch oice but to terminate the pregnancy in February 2005. I had a normal cycle in March and April 2005, although the pelvic pain persisted. I also began getting vaginal discharge and spotting in between cycles. Discharge was often thick and mucousy (as with discharge during ovulation) however had a period of time where it was thick, sticky and black in appearance. By April 2005 I began bleeding heavily, huge clots (dozens daily), extended cycles (2-3 weeks), followed by mild spotting for a few days, perhaps a day or two of no blood and then back to the heavy bleeding/clots etc. I underwent a endoscopy/biopsy/d&c along with cervical cauterization (for severe erosion). I was told before surgery I had a \"nabothian cyst\" however on exam after surgery by another doctor, this \"lesion\" is still there. (I thought that since nabothian cysts were mucuos/puss filled that by cauterizing the area a nabothian cyst would rupture?). My endometrial biopsy showed no cancer. We have ruled out PCOS, I have no ovarian cysts or polyps etc. The lab reports suggest \"possible Anovulation\". (Is that not just a term given for problematic bleeding? Is it not usually secondary to something else which would be the main cause?). A few weeks after the surgery I also had a PAP come back with LSIL. I am still abnormally bleeding and unable to take birth control pills due to malabsorption. I cannot take Depo shots as I have negative side effects from it. So I am bleeding awfully and in pain the majority of the time. I am told I must wait 3 months for a repeat PAP test before anything else will be considered. I am questioning my doctors decision to go ahead and wait 3 months for further investigation. Based soley on one test result of LSIL I can see it is normal protocol. However throwing in the pain, abnormal bleeding (hormone levels testing fine btw), cervical erosion, and doubts (well MY doubts) that this \"nabothian cyst\" could perhaps indeed NOT be a nabothian cyst (thus my question about cauterization eliminating this type of cyst), would it not be more sensible to go ahead with a colposcopy or some such other test and bypass the 3 month wait for further PAP testing (which then takes 6-8 weeks for results)??? I should note that my mother has had several laser treatments for HSIL that persist in coming back. This was when she herself was in her 30's. Unfortunatly I have no way to know if those treatments were successful or if they came back and are cancerous now as she refuses anymore medical treatments and refuses even PAP tests.   Thank you in advance for any advice.\n\n",
    "posted_time": "Post  by mellycat » Sun Sep 18, 2005 11:10 pm",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=21006&sid=ab52de81f30c500181267c914cc131fe#p21006"
  },
  {
    "author": "Nurse4you  Guest Posts: 22 Joined: Thu Oct 06, 2005 10:13 pm Location: USA",
    "title": "LSIL findings on PAP",
    "content": "Dear Mellycat- In your post, you indicated that you had underwent a endoscopy/biopsy/d&c along with cervical cauterization (for severe erosion). Do you know the PAP results that initiated your physician to perform this? There are two things that I would like for you to consider. First, having gone through gastric bypass surgery, it is possible that your body may not be receiving proper nutrients, and thinks it is in \"starvation mode, as evidenced be ketosis. This is one factor that may cause abnormal periods. Stress and illness may also play a a role.  Second, LSIL results on a PAP can sometimes be caused by the Human Papilloma Virus (HPV). This is the most common STD, and there are MANY strains, not all of which cause outward clinical symptoms (genital warts). Many individuals contract this virus and don't even know it! According to clinical studies, this is the cause in approximately 80-95% of abnormal PAP smears.  It is very important to continue the cycle of repeat PAP's every three months. Although at times LSIL will regress without treatment, at times it can also progress to HSIL (High Grade Squamous Intraepithelial Lesion).  Cervical cancer is said to be one of the slowest growing cancers, but that is not always the case.  If by some chance you need to have a LEEP or LASER ssurgery again, the cervix will need time to heal before another PAP is performed, otherwise you may get abnormal results due to still being in the healing process.  I hope this helps, and good luck!\n\n",
    "posted_time": "Post  by Nurse4you » Thu Oct 06, 2005 10:38 pm",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=22704&sid=ab52de81f30c500181267c914cc131fe#p22704"
  },
  {
    "author": "nikkim  Guest Posts: 1 Joined: Mon Jul 18, 2005 5:15 pm Location: canada",
    "title": "mild-moderate dysplasia",
    "content": "Hi, I had my daughter 1 year ago and when I went in for my 6 week check my pap came back saying I had moderate dysplasia. I then went in for a colposcopy and it came back mild. Since then I had another colp. and the colp as well as the biopsy came back mild. I was suppose to go back in June but there so busy they couldn't get me in until late August. We had decided that we wanted to have another baby close together. My doctor said if we can wait until August but if not he said that this should not stop us. That I could be a woman that fluctuates with it not progressing. My concern is that I wanted to become pregnant so bad and now that I am 2months I am having doubts and am scared to death of this affecting my baby or me. Is this normal? Should i be worried? Please give me some advise that might make me calm down. Thanks Scared and concerned\n\n",
    "posted_time": "Post  by nikkim » Tue Jul 19, 2005 12:16 am",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=17046&sid=ab52de81f30c500181267c914cc131fe#p17046"
  },
  {
    "author": "babygirl23  Guest Posts: 3 Joined: Fri Sep 09, 2005 10:51 pm Location: pa",
    "title": "[no title]",
    "content": "hi im a 23 and i also have the same thing by the time the doctors got me in for treatment it was already to late i was already pregant it will not harm you child you are caring but there is a possablity of the diplaish to get worse mine had i hope this helps and the best to you and your family and gl having another baby if you havent already\n\n",
    "posted_time": "Post  by babygirl23 » Sat Sep 10, 2005 9:57 am",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=20272&sid=ab52de81f30c500181267c914cc131fe#p20272"
  },
  {
    "author": "rayneonme  Guest Posts: 2 Joined: Thu Aug 25, 2005 9:32 am Location: Shepperton",
    "title": "Help me.  I'm scared",
    "content": "I've had a small lump on the outside of the lip of my vagina for about 3 years now.  Its rather unusual and about the size of a baby fingernail.  In the last 4 months or so there are days when I can feel a larger lump underneath it.  Today it has blown up to such a degree that it feels painful.  Is this cancer?  I'm scared.  I'm only 23 and have never had any problems like this before.\n\n",
    "posted_time": "Post  by rayneonme » Thu Aug 25, 2005 10:00 am",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=19434&sid=ab52de81f30c500181267c914cc131fe#p19434"
  },
  {
    "author": "rayneonme  Guest Posts: 2 Joined: Thu Aug 25, 2005 9:32 am Location: Shepperton",
    "title": "[no title]",
    "content": "Its getting bigger!  Today it is the size of a golf ball.  It feels like a solid lump.  It is near the corner of my thigh, so it hurts when I sit down or walk.  Everything rubs against it.  I can't stop worrying about it and I am unlikely to see a doctor before next Tuesday.  Help!\n\n",
    "posted_time": "Post  by rayneonme » Fri Aug 26, 2005 7:43 am",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=19484&sid=ab52de81f30c500181267c914cc131fe#p19484"
  },
  {
    "author": "rmmsdfh  Guest Posts: 1 Joined: Mon Mar 07, 2005 9:33 pm Location: Los Angeles",
    "title": "stage 1 cervical cancer",
    "content": "i'll spare you all the details, but basically my obgyn called me today and told me that my pap smear was abnormal and that i was \"in stage 1\". i know that stage 1means stage 1 of cervical cancer because i had problems when i was 15 (i'm 33 now), but i didn't know that this could be determined from a pap smear alone. i had the pap smear in september 2005, and haven't been back to the dr since, so they haven't done any other examinations or a biopsy.  i'm going to go see another dr as soon as i can (not going back to this particular dr because it was very upsetting that she waited 5 months to tell me this!), but i was wondering if it can be determined that i'm at stage 1 of cervical cancer from a pap smear alone? and, if i have been in stage 1 since september, does this mean that i have progressed beyond that by now?  thanks for your time!\n\n",
    "posted_time": "Post  by rmmsdfh » Mon Mar 07, 2005 9:54 pm",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=10541&sid=ab52de81f30c500181267c914cc131fe#p10541"
  },
  {
    "author": "Gracie  Guest Posts: 20 Joined: Wed Jun 29, 2005 10:53 am",
    "title": "[no title]",
    "content": "I didnt think that they could determine how bad cervical cancer is with just a pap smear. I had an abnormal pap last year, and they called me in  first for a second pap to make sure the test was correct, then, they did a colposcopy to see how bad the cells were, then they scheduled the surgery to remove and biopsy the bad cells.  The colposcopy told the doctors how bad and how much of my cervix was affected. A pap test cannot tell them that, although, im not sure if a pap smear could tell the doctors how bad it is, or what stage, but I guess it is possible.\n\n",
    "posted_time": "Post  by Gracie » Thu Aug 11, 2005 12:15 pm",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=18583&sid=ab52de81f30c500181267c914cc131fe#p18583"
  },
  {
    "author": "aximilli92a  Guest Posts: 9 Joined: Thu May 26, 2005 1:44 am Location: connecticut  Contact:   Contact aximilli92a       AOL",
    "title": "Cervical cancer causes?",
    "content": "I had a visit with a new gynecologist and when she was taking my history I mentioned that 2 close relatives have had cervical cancer and she replied that it wasn't relevant because all cervical cancer is caused by STD's. I know that cervical cancer has been linked to STD's but previous doctors have said it was also linked to smoking and other factors. Is the idea that all cervical cancer STD related a common school of thought now?\n\n",
    "posted_time": "Post  by aximilli92a » Tue Jul 05, 2005 1:05 am",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=16296&sid=ab52de81f30c500181267c914cc131fe#p16296"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi aximilli92a, Although a link between STD's and cervical cancer has been established there are other risk factors for developing cervical cancer, DES exposure, (Diethylstilbestrol, a drug that used to be used to prevent miscarriages) and smoking. So in answer to your question no \"all cervical cancer\" is not caused by STD's. Sincerely, Rntdj\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Tue Jul 05, 2005 4:25 am",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=16301&sid=ab52de81f30c500181267c914cc131fe#p16301"
  },
  {
    "author": "aximilli92a  Guest Posts: 9 Joined: Thu May 26, 2005 1:44 am Location: connecticut  Contact:   Contact aximilli92a       AOL",
    "title": "[no title]",
    "content": "Thank you for the speedy reply. Should I be concerned that my gynecologist believes this or perhaps request to switch doctors?\n\n",
    "posted_time": "Post  by aximilli92a » Tue Jul 05, 2005 1:28 pm",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=16326&sid=ab52de81f30c500181267c914cc131fe#p16326"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi aximilli92a, I would not find it necessary nor would I advise you to change physicians. She has most likely encountered a much higher incidence of cervical cancer linked to STD's particularly  HPV (Human Papilloma Virus) than any other cause which may have influenced her views. Sincerely, Rntdj\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Wed Jul 06, 2005 4:38 am",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=16382&sid=ab52de81f30c500181267c914cc131fe#p16382"
  },
  {
    "author": "EvilZebras  Guest Posts: 4 Joined: Wed Mar 30, 2005 3:11 am Location: Georgia  Contact:   Contact EvilZebras       Yahoo Messenger   AOL",
    "title": "I have a Lump INSIDE my vagina!!",
    "content": "I have a lump inside my vagina and i don't know what to do .....I am 16 and im terrified of doctors and i don't wat to tell my mom because she blows everything out of perportion.  i don't know what it is eithier sometimes you can feel it in there then other times it isnt there at all!!!!  Please help me!!\n\n",
    "posted_time": "Post  by EvilZebras » Wed Mar 30, 2005 3:26 am",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=11592&sid=ab52de81f30c500181267c914cc131fe#p11592"
  },
  {
    "author": "aximilli92a  Guest Posts: 9 Joined: Thu May 26, 2005 1:44 am Location: connecticut  Contact:   Contact aximilli92a       AOL",
    "title": "[no title]",
    "content": "Can you describe the area the lump is in and what it feels like? It may be perfectly normal. Contrary to what most young people think a vagina is not a perfectly smooth passage. You may be feeling your cervix.\n\n",
    "posted_time": "Post  by aximilli92a » Tue Jul 05, 2005 1:01 am",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=16295&sid=ab52de81f30c500181267c914cc131fe#p16295"
  },
  {
    "author": "Jennifer R.N.  Guest Posts: 40 Joined: Tue Jul 05, 2005 10:07 pm Location: Michigan",
    "title": "How far up into your vagina is the lump?",
    "content": "There are glands at the outer region of a womans vagina called Barthelin (sp?) glands which can and do become impacted. I had this happen after having my first son. I was trying to Nurse and couldn't sit on one side. I had to kind of lean to the other side. I thought it was because of my big old tear and sutures I had but at my 6 week post-parum check-up I learned it was an impacted barthelin cyst. She lanced it and it was all better. She did say though that once you get one they are more likely to reoccur. Mine never di...thank goodness...LOL. I would have it looked at. It may be something that simple. Good luck.\n\n",
    "posted_time": "Post  by Jennifer R.N. » Tue Jul 05, 2005 11:22 pm",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=16363&sid=ab52de81f30c500181267c914cc131fe#p16363"
  },
  {
    "author": "dz_blond  Guest Posts: 1 Joined: Fri Jun 17, 2005 4:01 am Location: Australia  Contact:   Contact dz_blond       Yahoo Messenger",
    "title": "Abnormal Pap",
    "content": "I've had an abnormal pap for 10 years and have been tested for both high and low HPV, with negative results.  They've done biopsies and nothing else is done.  I haven't had a pap in two years because I get tired of hearing this news.  What else can cause this?\n\n",
    "posted_time": "Post  by dz_blond » Fri Jun 17, 2005 4:07 am",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=15267&sid=ab52de81f30c500181267c914cc131fe#p15267"
  },
  {
    "author": "Shannon Morgan, CMA  Medical Assistant Posts: 530 Joined: Fri May 06, 2005 6:28 pm Location: Dallas, Texas. USA.",
    "title": "[no title]",
    "content": "Have you had a colposcopy?  That's a sample of tissue from the cervix for testing and biopsy.  If so, when was the last one?  How old are you?  Post menopausal?  If so, try estrogen cream (prescription, not \"natural\").  It does not carry the risk of oral estrogen.  About 80% of postmenopausal women revert to normal in 6 months to a year.\n\n",
    "posted_time": "Post  by Shannon Morgan, CMA » Fri Jun 17, 2005 9:52 am",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=15275&sid=ab52de81f30c500181267c914cc131fe#p15275"
  },
  {
    "author": "smellslikecinnamon  Guest Posts: 1 Joined: Tue May 10, 2005 2:42 pm Location: San Francisco",
    "title": "How fast can Cervical Cancer generate/show symptoms?",
    "content": "My girlfriend has recently informed me that she has cervical cancer. We are in a long distance relationship, and have not been sexually active together at all.  Apparently the cancer derives most commonly from sexual intercourse, and without it simply sounding like I'm questioning her faithfulness,   I'm wondering, IF she contracted the cancer sexually, how long after intercourse would it take to become detectable.  I've known her for 7 months, and she informed me about 3 weeks ago. She is 21, and I don't know of any other infections, diseases, illnesses, etc.  I'd sincerely appreciate any professional opinions. Thank you.\n\n",
    "posted_time": "Post  by smellslikecinnamon » Tue May 10, 2005 3:00 pm",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=13567&sid=ab52de81f30c500181267c914cc131fe#p13567"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi smellslikecinnamon, Although a sexually transmitted virus (HPV) has been linked to cervical cancer, there are other causes. A woman can be infected with this virus for a long time and because of the bodies immune system the virus is sometimes not even apparent. Here are some weblinks regarding cervical cancer if you would like to view them. Link1  Link2  Link3  on this one, type in the search box cervical cancer for a wealth of information. I hope this information is helpful. Sincerely, Rntdj\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Wed May 11, 2005 9:29 am",
    "category": "Oncology",
    "sub_category": "Cervical Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=13605&sid=ab52de81f30c500181267c914cc131fe#p13605"
  }
]