[
  {
    "author": "kashika  Guest Posts: 1 Joined: Sat Oct 31, 2009 5:37 pm Gender: Female",
    "title": "\"cheotherapy suggested when suffering from hepatitis c?\"",
    "content": "my grandmother is suffering from hepatitis c,liver cehrossis and lymphoma(has been recently detected).Is there any treatment for such a patient?should we start chemotherapy at this stage?Will chemotheraphy activate the hepatitis c virus??please suggest a treatment for the same as soon as possible.\n\n",
    "posted_time": "Post  by kashika » Sun Nov 01, 2009 7:51 am",
    "category": "Oncology",
    "sub_category": "Chemotherapy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=85483&sid=6805cdcbb680755881e5cfc3fc8356e2#p85483"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: \"cheotherapy suggested when suffering from hepatitis c?\"",
    "content": "Hi, Hepatitis B virus (HBV) reactivation has been observed as a frequent complication in inactive HBV carriers at time of chemotherapy or post-chemotherapy. This is a severe complication frequently seen in  patients with  lymphomas.(Lamivudine have efficacy to treat the patients once the clinical disease is apparent. Lamivudine prophylaxis beginning before chemotherapy and until at least for 6 months after the end of chemotherapy is recommended for all HBV carriers).  It appears that effects of cancer chemotherapy in patients with HBV infections has been better studied and more well known than in HCV infections.   Some studies have observed that Hepatitis C virus (HCV) infection (which often goes undiagnosed in asymptomatic carriers), may become clinically relevant during periods of immunosuppression or severe illness. There have been some reports showing the significance of HCV infection in patients being treated with chemotherapy.  Some researchers have found that chemotherapy dose delays or  need for dose reductions occurred in those with Hepatitis C:  Liver disease affects cancer chemotherapy by - Poor drug metabolism and   – myelosuppression, leading to poorer outcomes.  The current treatment standard for Hepatitis C (interferon and ribavirin combination therapy) is also known to initiate myelosuppression. With decreases in bone marrow activity, recovery becomes a huge challenge.  Experts in this field have suggested that more integration between the fields of hepatology and oncology will be necessary in the management of such patients - thus improving outcomes. Best wishes!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Wed Nov 18, 2009 7:11 pm",
    "category": "Oncology",
    "sub_category": "Chemotherapy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=87302&sid=6805cdcbb680755881e5cfc3fc8356e2#p87302"
  },
  {
    "author": "lakexpert  Guest Posts: 1 Joined: Mon Nov 12, 2007 1:26 pm Location: algeria",
    "title": "chronic coxite -on- SPA",
    "content": "1-21YEARS 2- M 3-COULD YOU PLEASE ADVISE ME FOR THE APPROPRIATE TREATMENT ACCORDING TO MY SPECIAL CASE. I'M SUFFERING FROM RHEUMATIC PAIN IN THE AREA OF THE PELVIS AND PARTICULARY ON THE LEFT HIP SINCE I WAS 12 YEARS OLD. REFERENCE TO THE CONTACTED DOCTORS AND MEDICAL ANALYSIS,RADIOSCOPY THAT I HAVE DONE SHOW :-COXITE CHRONIQUE - ON- SPA(spondilo arthrite onculozant). i'm leaving in algeria .tel number xxxxxxxxxx (edited by moderator for safety reasons).  BEST REGARDS\n\n",
    "posted_time": "Post  by lakexpert » Tue Nov 13, 2007 10:05 am",
    "category": "Oncology",
    "sub_category": "Chemotherapy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50291&sid=6805cdcbb680755881e5cfc3fc8356e2#p50291"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "Re: chronic coxite -on- SPA",
    "content": "Hello Lakexpert,  In general, non-steroidal anti inflammatory medications (such as ibuprofen and naproxen).  The class of non-steroidals known as COX 2 inhibitor (such as celebrex, vioxx, etc.) are reported to have less side effects, including less GI irritation.  These medications are often useful in arthritis type illnesses.  More specific treatment depends on the underlying cause of your pain.  You may want to see a rheumatologist for further evaluation if you are able.  This way you can get recommendations for a specific treatment plan that is taylored to your situation.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sun Jan 27, 2008 10:34 pm",
    "category": "Oncology",
    "sub_category": "Chemotherapy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=53409&sid=6805cdcbb680755881e5cfc3fc8356e2#p53409"
  },
  {
    "author": "Dr. A. Rajput  Medical Doctor Posts: 74 Joined: Fri Apr 11, 2003 10:16 pm Gender: Male Location: India  Contact:   Contact Dr. A. Rajput       Yahoo Messenger",
    "title": "Management guidelines of hyperglycemia during chemotherapy",
    "content": "Are there any standard guidelines for management of hyperglycemia during chemotherapy apart from management with short acting insulin?  Thank You.\n\n",
    "posted_time": "Post  by Dr. A. Rajput » Mon Dec 10, 2007 12:36 pm",
    "category": "Oncology",
    "sub_category": "Chemotherapy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=51494&sid=6805cdcbb680755881e5cfc3fc8356e2#p51494"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hello A_medico,  I'm less familiar with chemotherapy specifics but in general, better control of blood sugars has been shown to correlate with better outcomes in almost all instances where it has been studied.  If medicines other than insulin are used (such as metformin or one of the multiple other meds), it will be important to check for interactions with the medicines and the chemotherapeutic agents.  Management with insulin will follow standard blood sugar protocols.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Mon Dec 10, 2007 9:17 pm",
    "category": "Oncology",
    "sub_category": "Chemotherapy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=51540&sid=6805cdcbb680755881e5cfc3fc8356e2#p51540"
  },
  {
    "author": "Godsgal  Guest Posts: 2 Joined: Wed May 30, 2007 1:48 pm",
    "title": "Does CellCept cross the blood brain barrier?",
    "content": "I have Neuromyelitis Optica / Devics Disease and I am taking CellCept currently.  This is following 6 treatments of Cytoxin last year.  Does CellCept cross the blood brain barrier, or just act upon the activated immune cells peripherally?  I guess this applies to Imuran / Azathioprine too.  Do you have any resources for this information?  Thank you so much!  Godsgal\n\n",
    "posted_time": "Post  by Godsgal » Wed May 30, 2007 8:50 pm",
    "category": "Oncology",
    "sub_category": "Chemotherapy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=43146&sid=6805cdcbb680755881e5cfc3fc8356e2#p43146"
  },
  {
    "author": "Godsgal  Guest Posts: 2 Joined: Wed May 30, 2007 1:48 pm",
    "title": "[no title]",
    "content": "I guess nobody knows the answer.   Would be good to know if used for diseases involving the CNS - don't you think?  I do know that it was created for organ transplant rejection and designed to work peripherally.\n\n",
    "posted_time": "Post  by Godsgal » Fri Jun 29, 2007 1:03 pm",
    "category": "Oncology",
    "sub_category": "Chemotherapy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=43857&sid=6805cdcbb680755881e5cfc3fc8356e2#p43857"
  },
  {
    "author": "Dr. A. Rajput  Medical Doctor Posts: 74 Joined: Fri Apr 11, 2003 10:16 pm Gender: Male Location: India  Contact:   Contact Dr. A. Rajput       Yahoo Messenger",
    "title": "[no title]",
    "content": "Does CellCept cross the blood brain barrier, or just act upon the activated immune cells peripherally?   CellCept doesn't cross blood brain barrier.   CellCept is an immunosuppressant. It inhibits lymphocyte (B and T) proliferation and antibody production. This results the suppression of immune system and reduces the production of antibodies attacking the receptor sites in the nervous system.\n\n",
    "posted_time": "Post  by Dr. A. Rajput » Tue Jul 03, 2007 2:35 am",
    "category": "Oncology",
    "sub_category": "Chemotherapy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=43891&sid=6805cdcbb680755881e5cfc3fc8356e2#p43891"
  },
  {
    "author": "magik25  Guest Posts: 2 Joined: Thu Jan 04, 2007 7:51 pm",
    "title": "Is Marijuana a good idea from chemo-related nausea?",
    "content": "Iam a 25 year old female from Canada who was diagnosed with Invasive Ductal Carcinoma (1.3 cm, Grade 1, Node Negative, ER+ PR+) in September 2006. I underwent a modified radical mastectomy and sentinal node biopsy in September. No family history of breast cancer and no other cancers in the immediate family. I began chemotherapy November 17th, 2006: 4 cycles of Adriamycin and Cytoxin every 3 weeks.   During the 1st treatment I was prescribed Zofran and Stemetil for nausea. Nausea and Vomiting persisted for 4 days and on the 4th day I took a reaction to the Stemetil (muscle spasms of the jaw and clenching teeth). During the second treatment I was again prescribed Zofran and Ativan in addition and was told to take Gravol with Ativan as needed. The nausea and vomiting were worse this time and I ended up in hospital with extreme dehydration. My oncologist then told me that many people find that Cannabis a very effect relief from nausea. He said that he could prescribe the pill form of marijuana, but he said it doesn't work as well as the inhaled form of the drug. I decided not to use it in fear of taking some other reaction.  As I enter my 3rd treatment, I am now being prescribed Zofran and Decadron. The doctors tell me this is the last option. I am wondering what you think of marijuana use as a form of anti-emetic. I am also wondering if marijuana could possibly interact with any of the above drugs I am taking (AC chemo, Zofran, Gravol, Ativan, or Decadron).   Your advice would be appreciated. Thanks.\n\n",
    "posted_time": "Post  by magik25 » Thu Jan 04, 2007 9:40 pm",
    "category": "Oncology",
    "sub_category": "Chemotherapy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=37267&sid=6805cdcbb680755881e5cfc3fc8356e2#p37267"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "All the medications that you are trying are routinely used for nausea related to chemotherapy.  Marijuana can have some antiemetic properties.  I have used a pill form known as marinol with some limited success in the past for my cancer patients.  Nausea from chemotherapy can be very difficult to control.  I would continue to work with your oncologist to find a combination of medications that is helpful for you.  I hope you feel better soon.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Thu Jan 04, 2007 10:33 pm",
    "category": "Oncology",
    "sub_category": "Chemotherapy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=37272&sid=6805cdcbb680755881e5cfc3fc8356e2#p37272"
  },
  {
    "author": "magik25  Guest Posts: 2 Joined: Thu Jan 04, 2007 7:51 pm",
    "title": "[no title]",
    "content": "Thanks for your reply. Can you answer specifically whether marijuana may react with any of the drugs I am currently taking (AC, Zofran, Gravol, Ativan, or Decadron)? Just nervous about trying it out while also on other medications and want to know the risks.  Thanks!\n\n",
    "posted_time": "Post  by magik25 » Fri Jan 05, 2007 10:10 pm",
    "category": "Oncology",
    "sub_category": "Chemotherapy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=37337&sid=6805cdcbb680755881e5cfc3fc8356e2#p37337"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Sorry for the delayed reply.  I didn't see your 2nd post.  I am not aware of interactions; however, there is not good cross reference data for marijuana as it is not a prescribable drug in most places.  I have looked up the interactions between marinol (the pill form of marijuana) for all of the drugs with the exception of Gravol which I am not familiar with.  There are no reported interacttions.  As with all medications, combining any medication should be done with caution and under the the supervision of a physician.  Rare interactions are always possible, even though they are not reported.  Hope this helps.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sun Jan 21, 2007 3:37 pm",
    "category": "Oncology",
    "sub_category": "Chemotherapy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=37823&sid=6805cdcbb680755881e5cfc3fc8356e2#p37823"
  },
  {
    "author": "reianni  Guest Posts: 5 Joined: Sun Feb 19, 2006 11:47 pm",
    "title": "Steroids for cancer treatment?",
    "content": "I just searched my browser about this and some articles stated that certain types of steroids, steroid cortisols? The types of steroids I saw were hydrocortisone, dexamethasone, methylprednisolone and prednisolone.\n\n",
    "posted_time": "Post  by reianni » Fri Mar 03, 2006 4:59 am",
    "category": "Oncology",
    "sub_category": "Chemotherapy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=31658&sid=6805cdcbb680755881e5cfc3fc8356e2#p31658"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi reianni, I am not quite clear on exactly what your question is but if you are asking what the difference is between hydrocortisone and cortisol are then I can tell you that hydrocortisone is a synthetic drug and cortisol is a hormone produced by the body. Sincerely, Theresa Jones, RN\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Fri Mar 03, 2006 7:38 am",
    "category": "Oncology",
    "sub_category": "Chemotherapy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=31661&sid=6805cdcbb680755881e5cfc3fc8356e2#p31661"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "FDA Approves Iressa™ for Treatment of Advanced Lung Cancer",
    "content": "Feel free to discuss iressa here.    Related article: Click here!  Click on the \"postreply\" button below to get started.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Mon May 19, 2003 1:37 pm",
    "category": "Oncology",
    "sub_category": "Chemotherapy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=759&sid=6805cdcbb680755881e5cfc3fc8356e2#p759"
  },
  {
    "author": "R. Zein, Pharm D  Pharmacist Posts: 157 Joined: Tue Jul 12, 2005 9:16 pm Location: USA",
    "title": "[no title]",
    "content": "On September 15, 2005, distribution of gefitinib will be limited under a risk management plan called the Iressa® Access Program. The drug will be available only to patients currently receiving and benefiting from gefitinib, patients who have previously received and benefited from gefitinib, and patients who are either part of a clinical study approved by an investigational review board (IRB) prior to June 17, 2005 or part of a clinical study approved by an IRB after June 17, 2005 that is conducted under an investigational new drug application.    More information is available by calling 1—800—601—8933 or by visiting the manufacturer's website for Iressa®.\n\n",
    "posted_time": "Post  by R. Zein, Pharm D » Wed Sep 07, 2005 9:37 am",
    "category": "Oncology",
    "sub_category": "Chemotherapy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=20087&sid=6805cdcbb680755881e5cfc3fc8356e2#p20087"
  },
  {
    "author": "Legalbee  Guest Posts: 2 Joined: Mon Feb 14, 2005 9:25 pm Location: Canada",
    "title": "Side effects of chemotherapy",
    "content": "I finished 4 treatments of AC chemo in Dec for Breast Cancer following a left side lumpectomy. During my chemo i was throwing up alot.  After my last AC I had a horrendous hand foot reaction where my hands swelled out very badly and peeled multiple layers(im now losing my finger nails). I was put on prednisone 50 mg declining dose for 2 weeks which i finished about the 2nd week of Jan. Immediately after I began to get the following symptoms, horrid salty bitter taste in mouth feeling like fumes , very foamy and thick saliva( i can blow bubbles from my mouth), pain below my sternum and extending to the right side  under right breast in rib area (the pain is sharp and the area is tender), an gaggy feeling(depnding on how i sit), the pain will fluctuate depending on how i sit ie if i put my legs up incresing pressure then it hurts more, i find white stuff around my lips constantly and my mouth is really dry , my nose is running like a tap and white stuff crusts around the opening, I also feel much weaker than i did when i was on the chemo(which is saying alot). I also had small pustules in my vagina but 4 days of diflucan seemed to clear that up. I had blood work taken and my liver functions were slightly elevated altho my gp felt that was as a result of the chemo, prednisone and diflucan. I had an endoscopy which was neg for disease or infection(they thought about yeast at first).I don't have heartburn nor do i have indigestion(altho they've had me on nexium for the past 3 weeks) I don't know where to go from here...I feel like im on a merry go round and am suffering big time\n\n",
    "posted_time": "Post  by Legalbee » Mon Feb 14, 2005 9:40 pm",
    "category": "Oncology",
    "sub_category": "Chemotherapy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=9411&sid=6805cdcbb680755881e5cfc3fc8356e2#p9411"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Dear Legalbee, I am so sorry to hear about your suffering. I would like to know if you had a CBC done recently. Could you please copy the result out here, especially your White cell count and differential count. Best regards,\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Tue Feb 15, 2005 8:00 am",
    "category": "Oncology",
    "sub_category": "Chemotherapy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=9434&sid=6805cdcbb680755881e5cfc3fc8356e2#p9434"
  },
  {
    "author": "Legalbee  Guest Posts: 2 Joined: Mon Feb 14, 2005 9:25 pm Location: Canada",
    "title": "[no title]",
    "content": "I have the lab results from Jan 12 my most recent blood work(and urine samples)...i didnt know which were which so i included them all for u, according to my GP and oncologist altho  the blood counts were low that was to be expected following my last chemo which was only 3 and  1/2 weeks before this blood work was taken? Not sure what differential is...i gave u everything just in case Hemoglobin 121 Hematocrit 0.35 White bloodcell count: 3.8(LO) Red Blood cell count 3.95(LO) MCV 89.1 MCh 30.5 MCHC 343 RDW 19.3(HI) Sedimentation rate(ESR) 6 Platelet 321 Absolute neuts 2.6 (A) Lymph 0.7(LO) (A) Mono 0.4 (A) EOS 0.1 (A) BASO 0.0 RBC No Abnormalities Detected by insrument WBC Leukopenia Platelets No Abnormalities Detected by instrument Vitamin B12(sorry cant make out that one...but it doesnt say hi or low like it does for the others) RBC Folate 840 Colour normal Appearance Turbid Glucose Neg Ketone Neg Blood Trace PH 5.0 Protein Neg Nitrite Neg Leucocyteesterase Neg Glucose Fasting 5.3 Creatine 56 Sodium 141 Potassium 4.2 Chloride 102 Cholestrol 4.61 HDL Cholestrol 1.23 LDL Cholstrol(Claculated) 2.73 Cholestrol/HDL Ratio 3.7 Triglycerides 1.44 Urate 257 Total Bilirubin 5 AST 25 ALT 54(HI) Alkaline Phosphate 67 Magnesium 0.76 CK 29 Calcium 2.33 Phosphate 1.25 Albumin 41 ThyRotropin .86 Ferritin 77     Does this help?\n\n",
    "posted_time": "Post  by Legalbee » Tue Feb 15, 2005 5:14 pm",
    "category": "Oncology",
    "sub_category": "Chemotherapy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=9469&sid=6805cdcbb680755881e5cfc3fc8356e2#p9469"
  },
  {
    "author": "hsmith  Guest Posts: 3 Joined: Wed Aug 04, 2004 2:02 pm",
    "title": "Chemo for stomach cancer",
    "content": "My husband had a gastrectomy (with curative intent) five years ago because of gastroesophageal cancer. Now the cancer has metastasized to his lymph nodes. He has undergone two cycles of chemotherapy with oral 5-FU (Xeloda) and carboplatin. After the first cycle, the enlarged node in his neck, which had been about the size of an olive, was no longer palpable. Since we were told there was only a 50% chance of responding to chemo, this was very good news. But we would like to know if this is very unusual, or if the oncologist just wanted to be over-optimistic. Does this suggest that he may experience a durable remission? Is it possible for the cancer to disappear from the CT scan altogether? Most studies seem to indicate a survival time of only 9 months for people in his situation.\n\n",
    "posted_time": "Post  by hsmith » Wed Aug 04, 2004 2:09 pm",
    "category": "Oncology",
    "sub_category": "Chemotherapy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=4368&sid=6805cdcbb680755881e5cfc3fc8356e2#p4368"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Hello hsmith, I am happy to hear that your husband has responded well to his chemotherapy. It is unusual to get responses of this nature with gastric cancer, but it is not impossible. Current literature points to possible response rates of up to 70% to xeloda in patients who have favorable thymidine phosphorylase (TP) and dihydropyrimidine dehydrogenase (DPD) expression profiles. These enzymes are involved in the metabolism of the xeloda. Patients who TP positive and DPD negative showed the highest response rates. Please refer to this abstract for further information: Click here! It should be noted that a relationship doesnt always exist between response and survival. Many drugs produce durable remissions without affecting the overall survival of the patient. That said however, it is not known if the subset of patients included in the above trial who had the highest response rates had a survival benefit as well or not. Let's hope for the best, baring in mind that the speed and extent of your husband's response looks very promising and is infact an achievement in its own right.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Fri Aug 06, 2004 3:43 am",
    "category": "Oncology",
    "sub_category": "Chemotherapy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=4404&sid=6805cdcbb680755881e5cfc3fc8356e2#p4404"
  },
  {
    "author": "hsmith  Guest Posts: 3 Joined: Wed Aug 04, 2004 2:02 pm",
    "title": "[no title]",
    "content": "Thank you ver much. You mentioned two things that have puzzled me, however. The first is--why does remission not correlate with survival? I have heard this many times, and it is counterintuitive to think that a durable remission would not mean longer survival. Do the patients die of other things? Does the cancer become more aggressive when it returns, and thus wipe out the time gain of the remission? It is sometimes very difficult to made sense out of statistics, when looking at an indivisual case like ours. After all, my husband was not supposed to survive for five years post surgery in the first place, and had been pronounced \"cured\" with a clear CT scan only a few months ago. Second, if tests for enzymes like the one you mentioned can predict response to chemo drugs so well, why are they not used to help select which drugs to use? Is it merely the cost that makes them impractical? I have heard of tests on tumor cells that can show which drugs might be most effective, but our oncologist just dismissed these as useless. Harriet\n\n",
    "posted_time": "Post  by hsmith » Fri Aug 06, 2004 10:57 am",
    "category": "Oncology",
    "sub_category": "Chemotherapy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=4412&sid=6805cdcbb680755881e5cfc3fc8356e2#p4412"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Your question regarding the relation between responses in general and survival is a good one. However, it isn't a question that would be easy to answer. Bare in mind, like you suggestions that alot of the evidence that we use in decision making is based on clinical trials and statistics. These are just what the numbers say. The results of all these clinical trials up till now have not shown an improvement in overall survival in patients receiving these drugs. They have shown varying responses however. Also note, that in designing these trials, investigators are faced with many problems including which patients to include and which to exclude. If one trial includes patients with a better chance of surviving (better prognosis) than another trial that would shift the survival curve and patients in that trial would have a better overall survival. Since it is not completely known till now all that constitutes better prognostic factors we don't always know what to make of the numbers presented to us. All that can be said is that till now the numbers have not shown an improved survival by taking these drugs but have shown variation in responses. As to what happens to patients that have undergone a good response later in the course of their disease. I would have to answer that on a purely emperical basis. Some patient's however, undergo rapid fatal recurrence. Why are these tests not done in all patients? The trial I have referred to above is a phase II trial. Meaning that it is in the second phase of drug testing. This trial needs to be verified by larger Phase III trials in order to be confirmed. Does this mean that the abstract results are not significant? On the contrary they are very significant but we have to be careful at this stage and wait for the verfication trials. Finally, like you said earlier it is very difficult to make sense out of statistics, when looking at an indivisual case. Statistics give you a general idea there are many exceptions that are not explained by them.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Fri Aug 06, 2004 2:20 pm",
    "category": "Oncology",
    "sub_category": "Chemotherapy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=4415&sid=6805cdcbb680755881e5cfc3fc8356e2#p4415"
  },
  {
    "author": "sawmiracle  Guest Posts: 2 Joined: Wed Dec 17, 2003 11:40 pm Location: TX",
    "title": "Post transplant (cardiac) cancer",
    "content": "Seeking info about vocal cord cancer in heart transplant recipient-prognosis, etc. Also would like to know the reality of treatment options of immuno-suppressed patient...if any can truly make a difference.  Hubby is 6 yrs out from transplant, and while no rejction episodes, has had multiple problems; perforated ulcer, replacement of both hips, several broken bones, severe shingles.  He had renal cell carcinoma & nephrectomy 2 yrs before transplant. I can cope & help him do so if I can be as informed as possible.   Very appreciative of information or experience.  !\n\n",
    "posted_time": "Post  by sawmiracle » Thu Dec 18, 2003 12:02 am",
    "category": "Oncology",
    "sub_category": "Chemotherapy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1938&sid=6805cdcbb680755881e5cfc3fc8356e2#p1938"
  },
  {
    "author": "Dr. Jeffrey Gordon  Medical Doctor Posts: 127 Joined: Sun Jan 05, 2003 5:22 pm",
    "title": "[no title]",
    "content": "Sawmiracle,  Thanks for your post to The Doctor's Lounge.  Has the \"cancer\" been biopsied to show it to be malignant?  What is the extent or involvement of your husband's vocal cord cancer?  Is it at the true vocal cord or near to it?  Have the doctors told you the stage of the cancer?  What treatment options have they recommended?  I cannot cite for you the specific incidence of head and neck cancers among patient who have received a solid organ transplnatation.  Independent of other risk factors for various cancers (i.e.- smoking), patients on immunosuppressive therapy after a solid organ trasnplantation are at increased risk for various cancers.  This may be due to the immunosuppressive therapy interfering with the body's immune surveillane which does play a role in eradicating cancerous cells.  Can you post more information about your husband's situation?  Jeff Gordon, M.D.\n\n",
    "posted_time": "Post  by Dr. Jeffrey Gordon » Sat Dec 20, 2003 6:15 pm",
    "category": "Oncology",
    "sub_category": "Chemotherapy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1965&sid=6805cdcbb680755881e5cfc3fc8356e2#p1965"
  },
  {
    "author": "sawmiracle  Guest Posts: 2 Joined: Wed Dec 17, 2003 11:40 pm Location: TX",
    "title": "post transplant cancer",
    "content": "Anxiously awaiting biopsy results (scheduled for 5th of Jan).- but both physicians who viewed throat film say they are almost certain it is cancerous.  They let me watch procedure and film...It is right on the vocal cord and very prominent, although described by them as \"small.\"   He has 10 yr. history of cigarette smoking (pack or less per day) but stopped 7 or 8 yrs ago.  No alcohol usage for over 15 yrs.   First heart attack @ age 46 resulted in quad. bypass-six months later angioplasty on one artery despite strictest of diets.  Cholesterol meds of little help.  Triple bypass @ age 51.  Full arrest six yrs later when I gave CPR 'til paramedics arrived-shocked several times before transporting to nearest hospital, then airlifted to major one.  V-tach 2 days later, then another.  Stroke suffered during full arrest clearing within 10 hours, w/no residual affects.   Two yrs later underwent nephrectomy for very small  renal cell carcinoma in order to get on transplant list.  With new head of transplant team, that hospital later refused to add him.  Seeking others we learned of one in Louisiana & he was put on that one.   To tell you how tough he is...casually ask me to drop him by ER where he was immediately admitted to CICU & at 4:00 am next morning a partial catherization was done.  (They were afraid to do full cath.)  He had only ONE artery open & it was 90% occluded!   Doctors were incredulous that he had walked into ER.   I was told at that point that nothing could be done if that one occluded, and I should call in family. as it was highly likely to do so.  Cardiac assist pump \"installed\" but Drs. stated 3 days was max on it.   We flew thru lightening storm by air ambulance to LA. with perfusionist & other medical staff.   Kept on pump there for 19 days before being weaned off.  Four months later he got new heart, but 11th day after transplant developed perforated ulcer & was rushed back for that surgery. Thus my screen name!   I am a  person of great Faith, and he depends on me to interpret medical jargon, so have tried to learn all I can about prevailing conditions.   Monitor him closely without alarm and help him face what he must with positive outlook by keeping his focus where it will be serve him.   Often make him laugh by telling him I'm afraid he'll be kidnapped for new body parts & scrap metal. SO appreciate it if you will give me the unvarnished truth.\n\n",
    "posted_time": "Post  by sawmiracle » Sat Dec 20, 2003 8:09 pm",
    "category": "Oncology",
    "sub_category": "Chemotherapy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1966&sid=6805cdcbb680755881e5cfc3fc8356e2#p1966"
  },
  {
    "author": "Dr. Jeffrey Gordon  Medical Doctor Posts: 127 Joined: Sun Jan 05, 2003 5:22 pm",
    "title": "Throat cancer",
    "content": "Sawmiracle,  I would wait until the biopsy is obtained.  If indeed the vocal cord finding is malignant, then important questions to ask your husband's physicians are: 1.) what is the extent of involvement of the cancer at the vocal cord, 2.) are any lymph nodes noted to be involved by examination and radiographic studies, 3.) if the lesion is small and no clinically apparent lymph nodes noted, is surgery required or can a non-surgical approach be taken to spare the voice (i.e.- radiotherapy or a combination of the two), 4.) what can his body tolerate with regards to side effects of treatments from heart, kidney, and infection points of view.  Jeff Gordon, M.D.\n\n",
    "posted_time": "Post  by Dr. Jeffrey Gordon » Sun Dec 21, 2003 7:36 pm",
    "category": "Oncology",
    "sub_category": "Chemotherapy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1969&sid=6805cdcbb680755881e5cfc3fc8356e2#p1969"
  },
  {
    "author": "sandeefeet  Guest Posts: 2 Joined: Thu Nov 13, 2003 8:41 am Location: estero",
    "title": "Interferon & Street Drugs",
    "content": "Could you please tell me if there are any risks for someone who is on alpha interpheron chemotherapy being injected daily to the body and the person smokes both crack and marijuana?  This person has just started the chemo interferon and has had major surgery to remove the melanoma from his bottom lip and went through the radiation process for 6 weeks, in which he was doing both crack and marijuana.  Could this be determental to the chemo process?  This person is also drinking beer, does that have any effect and if so what kind of effect would it have towards the cancer and the chemo?  Please let me know any info you may have.  I love this person dearly but I sometimes don't think this person cares about himself.\n\n",
    "posted_time": "Post  by sandeefeet » Thu Nov 13, 2003 8:47 am",
    "category": "Oncology",
    "sub_category": "Chemotherapy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1642&sid=6805cdcbb680755881e5cfc3fc8356e2#p1642"
  },
  {
    "author": "Dr. Jeffrey Gordon  Medical Doctor Posts: 127 Joined: Sun Jan 05, 2003 5:22 pm",
    "title": "Chemotherapy",
    "content": "First, using illegal drugs such as cocaine and marijuana is never a good thing to do.  Second, abuse of alcohol is also never a good thing to do.  Is this person drinking a lot each day or week?  Third, interferon use to treat melanoma caries a lot of risks of side effects.  The use of illegal drugs and alcohol will almost invariable complicate the interferon treatment and will add to the potential risks of interferon treatment.  In my practice, if someone is using ilegal drugs and using alcohol to an excessive amount, then I would have serious problems recommending the use of interferon.  I am not saying that interferon in the case that you describe shoudl be stopped.  rather, if the doctors caring for the patient do not know about the use of illegal drugs and alcohol, then they should know.  Fourth,  the best thing that can be done is to have the patient seek drug and alcohol addicition therapy.\n\n",
    "posted_time": "Post  by Dr. Jeffrey Gordon » Fri Nov 14, 2003 1:27 pm",
    "category": "Oncology",
    "sub_category": "Chemotherapy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1654&sid=6805cdcbb680755881e5cfc3fc8356e2#p1654"
  },
  {
    "author": "sandeefeet  Guest Posts: 2 Joined: Thu Nov 13, 2003 8:41 am Location: estero",
    "title": "[no title]",
    "content": "Yes, he drinks about 5-7 beers like 4 days out of the week, he does the drugs everyday.  He just started the interferon on this past Monday.  His doctors do not know and he will not tell them about the aduse.  He was also started on anti deppresents.  He won't eat and is losing weight so fast it is not even funny.  His family does not know and he will not let me tell them.  I cannot talk to his dr so I am really really lost.  I don't want to see him go like this not after his surgeries and doing radiation,  he has endured so much to give up now.  Thanks for your help it is sincerely appreciated.\n\n",
    "posted_time": "Post  by sandeefeet » Fri Nov 14, 2003 2:05 pm",
    "category": "Oncology",
    "sub_category": "Chemotherapy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1655&sid=6805cdcbb680755881e5cfc3fc8356e2#p1655"
  },
  {
    "author": "Dr. Jeffrey Gordon  Medical Doctor Posts: 127 Joined: Sun Jan 05, 2003 5:22 pm",
    "title": "Interferon",
    "content": "This is a difficult situation because serious problems can arise and if the doctors do not know about the illegal drugs and alcohol use, then they will not be able to do their best to try to avoid and minimize the impact of interferon side effects.  I hope for the best!\n\n",
    "posted_time": "Post  by Dr. Jeffrey Gordon » Sat Nov 15, 2003 3:05 pm",
    "category": "Oncology",
    "sub_category": "Chemotherapy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1671&sid=6805cdcbb680755881e5cfc3fc8356e2#p1671"
  },
  {
    "author": "jpm093  Guest Posts: 1 Joined: Mon Oct 27, 2003 7:21 pm",
    "title": "Questions about chemo",
    "content": "While my mom was in for her treatment, I noticed a sign about perfume, fresh flowers and plants. What effect do these things have on someone taking chemo?\n\n",
    "posted_time": "Post  by jpm093 » Mon Oct 27, 2003 7:37 pm",
    "category": "Oncology",
    "sub_category": "Chemotherapy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1512&sid=6805cdcbb680755881e5cfc3fc8356e2#p1512"
  },
  {
    "author": "Dr. Jeffrey Gordon  Medical Doctor Posts: 127 Joined: Sun Jan 05, 2003 5:22 pm",
    "title": "Chemo",
    "content": "Patricia,  Thanks for posting a question here at The Doctor's Lounge.  Many people have allergies, some severe, and many people also have lung problems (such as asthma).  Perfumes, colognes, flowers, plants, chemicals can cause reactions among these people.  Thus, the reason to limit exposures.  This is not limited to just a Cancer Clinic.  You may see such signs in various areas of a hospital.  Jeff Gordon, M.D.\n\n",
    "posted_time": "Post  by Dr. Jeffrey Gordon » Sat Nov 01, 2003 8:50 am",
    "category": "Oncology",
    "sub_category": "Chemotherapy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1527&sid=6805cdcbb680755881e5cfc3fc8356e2#p1527"
  },
  {
    "author": "Hampton Smythe  Guest Posts: 1 Joined: Fri Oct 10, 2003 8:34 pm Location: California",
    "title": "Nausea w/chemotherapy",
    "content": "I have read about a new nausea medicine on a website called ASCO and wondered if a new drug called palonosetron is really better for chemotherapy that causes nausea. I don't think it is available yet, but wanted to know if I should ask my doctor about it for the future.\n\n",
    "posted_time": "Post  by Hampton Smythe » Fri Oct 10, 2003 8:40 pm",
    "category": "Oncology",
    "sub_category": "Chemotherapy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1419&sid=6805cdcbb680755881e5cfc3fc8356e2#p1419"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Hampton, Aloxi (palonosetron) is a new anti emetic drug which has shown better results in the studies performed. It has been approved by the FDA in August 2003. Have you been vomiting with the anti-emetics you are taking? If so maybe you should ask your doctor for his opinion.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Sat Oct 11, 2003 6:40 pm",
    "category": "Oncology",
    "sub_category": "Chemotherapy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1434&sid=6805cdcbb680755881e5cfc3fc8356e2#p1434"
  },
  {
    "author": "Dr. Jeffrey Gordon  Medical Doctor Posts: 127 Joined: Sun Jan 05, 2003 5:22 pm",
    "title": "Nausea",
    "content": "Palonostetron is the newest addition to the class of anti-emetic drugs called 5-HT3 receptor antagonists.  There are excellent drugs to help minimize or prevent the development of chemotherapy during or immediately after chemotherapy.  Some chemotherapy drugs have a higher risk of causing nausea than others do, so different anti-emetic strategies are used for different types of chemo treatments.  Palonosetron has the longest half-life of the other drugs related to it, so appears to provide a longer level of anti-emetic support.  I have not yet used it since it was approved several months ago.  I would consider it only if current anti-emetic drugs being used during chemo treatments are not working.  If a current anti-emetic drug is working, then there may be no additional benefit to replace it with palonosetron.  If a current anti-emetic drug is not working or only working partially, then consideration for using palonosetron is reasonable.\n\n",
    "posted_time": "Post  by Dr. Jeffrey Gordon » Sun Oct 12, 2003 6:45 pm",
    "category": "Oncology",
    "sub_category": "Chemotherapy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1440&sid=6805cdcbb680755881e5cfc3fc8356e2#p1440"
  },
  {
    "author": "Alan",
    "title": "Chemotherapy and infantil deseases",
    "content": "If a personn is under chimiotherapy, is it possible that she catches a infantil desease she already had?\n\n",
    "posted_time": "Post  by Alan » Tue Jan 28, 2003 10:40 am",
    "category": "Oncology",
    "sub_category": "Chemotherapy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=170&sid=6805cdcbb680755881e5cfc3fc8356e2#p170"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "infantile disease and chemotherapy",
    "content": "Dear Alan,  Please be more specific. What is the name of the disease you want to ask about?\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Tue Jan 28, 2003 7:37 pm",
    "category": "Oncology",
    "sub_category": "Chemotherapy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=175&sid=6805cdcbb680755881e5cfc3fc8356e2#p175"
  },
  {
    "author": "Dr. Jeffrey Gordon  Medical Doctor Posts: 127 Joined: Sun Jan 05, 2003 5:22 pm",
    "title": "[no title]",
    "content": "Alan,  Are you asking about chicken pox?  Anyone who has had chicken pox as a child harbors the virus (varicells zoster virus or VZV, for short) and later in life can get a reactivation of the virus.  This is what causes shingles.  Chemotherapy can bring about a shingles attack if it affects the immune system.  This is not uncommon and sometimes patients are offered drugs to minimize their risks of getting shingles.  If you are concerned about a different childhood infection, then post it here and we will try to answer your question.  Thanks for posting a question!\n\n",
    "posted_time": "Post  by Dr. Jeffrey Gordon » Mon Feb 03, 2003 8:22 pm",
    "category": "Oncology",
    "sub_category": "Chemotherapy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=219&sid=6805cdcbb680755881e5cfc3fc8356e2#p219"
  },
  {
    "author": "Alan",
    "title": "chemotherapy and infantil diseases",
    "content": "Actually, I'd like to know if a person who has a breast cancer and who is under chimiotherapy can develop again an infantil disease(in general) she already had. If it's possible, what is the mecanism in cause (antibody, leucocytes)? Thanks for the answers!\n\n",
    "posted_time": "Post  by Alan » Wed Feb 05, 2003 11:00 am",
    "category": "Oncology",
    "sub_category": "Chemotherapy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=224&sid=6805cdcbb680755881e5cfc3fc8356e2#p224"
  },
  {
    "author": "Dr. Jeffrey Gordon  Medical Doctor Posts: 127 Joined: Sun Jan 05, 2003 5:22 pm",
    "title": "Chemotherapy",
    "content": "Alan,  I am not certain what you mean by \"infantile disease\".  If you are thinking about infections, then various infections that affect children can also affect adults, especially if chemotherapy were to weaken an adult's immune system.  If you are thinking about cancers that affect children, then in general terms, I would say no.  Chemotherapy otherwise doesn't cause any specific disorders to arise that affect only children and not adults.\n\n",
    "posted_time": "Post  by Dr. Jeffrey Gordon » Fri Feb 07, 2003 11:50 am",
    "category": "Oncology",
    "sub_category": "Chemotherapy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=249&sid=6805cdcbb680755881e5cfc3fc8356e2#p249"
  },
  {
    "author": "Alan",
    "title": "Chemotherapy and infantile diseases",
    "content": "No, by infantile diseases I mean diseases like mumps, chicken pox...Actually, I think you've already answered a part of my question in a ancient mail. But what are the mecanisms in cause?\n\n",
    "posted_time": "Post  by Alan » Thu Feb 13, 2003 11:00 am",
    "category": "Oncology",
    "sub_category": "Chemotherapy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=345&sid=6805cdcbb680755881e5cfc3fc8356e2#p345"
  },
  {
    "author": "Guest",
    "title": "shingles",
    "content": "JGordonMD wrote:Alan,  Are you asking about chicken pox?  Anyone who has had chicken pox as a child harbors the virus (varicells zoster virus or VZV, for short) and later in life can get a reactivation of the virus.  This is what causes shingles.  Chemotherapy can bring about a shingles attack if it affects the immune system.  This is not uncommon and sometimes patients are offered drugs to minimize their risks of getting shingles.  If you are concerned about a different childhood infection, then post it here and we will try to answer your question.  Thanks for posting a question!\n\n",
    "posted_time": "Post  by Guest » Mon Jun 16, 2003 10:20 am",
    "category": "Oncology",
    "sub_category": "Chemotherapy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=965&sid=6805cdcbb680755881e5cfc3fc8356e2#p965"
  },
  {
    "author": "drf2002  Guest Posts: 2 Joined: Mon Jun 09, 2003 8:24 am",
    "title": "History of oncological therapy",
    "content": "I am writing a thesis on the history of oncological therapy development and am at a loss to find an oncologist / MD who knows the answer to the following simple?! question :  Since the 60's reference has been made to ara-a ( cytarabine ) and its relative nucleotides in relation to leukemia therapy.  Studies ( eg. LePage et al 1976 ) have also shown similar effects against other cell types eg lymphosarcomas.    Am I wrong in 1/ drawing anything more than the most general conclusion of use in vivo as opposed to in vitro ie no in vivo inference can be directly drawn without in vivo studies? and 2 / would not such testing of multiple cell lines always show up some effect amongst some lines if the compound was already known to be an anti-neoplasic agent?  I'ld be delighted to hear any answers / suggestions  many thanks  R\n\n",
    "posted_time": "Post  by drf2002 » Mon Jun 09, 2003 8:44 am",
    "category": "Oncology",
    "sub_category": "Chemotherapy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=908&sid=6805cdcbb680755881e5cfc3fc8356e2#p908"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "experimental medicine",
    "content": "Hi Drf, To quickly answer your questions:  1. Yes you are right for a drug to become approved for human use it has to have undergone in-vivo studies. It takes 12 years on average for an experimental drug to travel from lab to medicine chest. Only five in 5,000 compounds that enter preclinical testing make it to human testing. One of these five tested in people is approved. As a matter of fact drug approval goes through two main phases: 1. Preclinical phase: invitro studies: Assess safety and biological activity 2. Clinical phase: This phase is further subdivided into 4 phases phase I: Determine safety and dosage phase II: Evaluate effectiveness, look for side effects. phase III: Verify effectiveness, monitor adverse reactions from long-term use.  Additional 2.5 years for review and approval of FDA. phase IV: Additional Post marketing testing required by FDA.  Question2: No not all antineoplastic drugs work in the same manner as a matter of fact many tumors are resistant to most antineoplastics. Another area you may want to research is the area of the multidrug resistance gene (MDR).  Good luck,\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Tue Jun 10, 2003 2:12 am",
    "category": "Oncology",
    "sub_category": "Chemotherapy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=918&sid=6805cdcbb680755881e5cfc3fc8356e2#p918"
  },
  {
    "author": "drf2002  Guest Posts: 2 Joined: Mon Jun 09, 2003 8:24 am",
    "title": "historical question - clarification",
    "content": "Dr Fouad,  thank you for your reply.    Maybe I wasn't clear enough first time around.  Whilst ara-a was well known for use in leukemia, would isolated reports on cell lines from other neoplastic strains, such as LePage's 1976 article linking treatment to a lymphosarcoma cell line, 1/ invariably lead oncologists towards in vivo studies in these other conditions or 2 / is there little inference to be drawn from results seen in isolated cell lines, as within the context of multiple testing some cell lines will always show up positive results.  I suppose my real question is, if one tested 15 adenoca cell lines and one experimental line showed some reaction even though the others didn't, would there be an inititive to attempt in vivo studies with the drug against adenoca's?  I just can't seem to follow the developmental trains from in vitro to in vivo, even though studies in vitro show positive effects, in vivo studies don't seem to mirror which neoplasms are assessed.  I can't find any real correlation!  I hope this makes some more sence  thanks  R\n\n",
    "posted_time": "Post  by drf2002 » Tue Jun 10, 2003 7:58 am",
    "category": "Oncology",
    "sub_category": "Chemotherapy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=920&sid=6805cdcbb680755881e5cfc3fc8356e2#p920"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "Experimental studies",
    "content": "I agree with Dr. Fouad, yes any drug has to go through all these phases before approval. The point is that in the preclinical phase the drug passes from the invitro studies (e.g. cell cultures) to invivo studies in animals. Ofcourse the results of cell lines are not always reflected in invivo studies because of many factors. Eg. cells inside the body in each organ are under the control of many factors that cannot be applied in cell cultures and this is the reason for the contradictory results between in vitro and in vivo.   Now to jump from cell line studies to invivo experimental studies most of your cell line results should draw the same conclusion. From that point you can take it to the next step which involves animal studies before you jump into the clinical phase (humans).\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Tue Jun 10, 2003 4:18 pm",
    "category": "Oncology",
    "sub_category": "Chemotherapy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=922&sid=6805cdcbb680755881e5cfc3fc8356e2#p922"
  },
  {
    "author": "dw-",
    "title": "Desmoplastic small round cell tumor",
    "content": "Hello, I just want to know more about desmoplastic small round cell tumor.\n\n",
    "posted_time": "Post  by dw- » Mon Apr 14, 2003 4:50 am",
    "category": "Oncology",
    "sub_category": "Chemotherapy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=637&sid=6805cdcbb680755881e5cfc3fc8356e2#p637"
  },
  {
    "author": "Dr. Jeffrey Gordon  Medical Doctor Posts: 127 Joined: Sun Jan 05, 2003 5:22 pm",
    "title": "Sarcoma",
    "content": "A desmopladtic small cell tumor usually affects adolescents and adults of young age.  The common part of the body affected is the abdomen and usually surgery is not undertakne since the tumor is located in multiple locations and may well be widespread in the abdomen.  There is a chromosomal finding in this disease: a  translocation between chromosomes # 11 and 22.  This is a distinct translocation form that seen in Ewing's sarcoma.  A diagnosis of a specific type of sarcoma should be done by a trained Pathologist who is versed in the complexities and challenges of sarcomas.  Before calling a sarcoma a desmoplastic small cell tumor, it is imperative that a thorough Pathology analysis be done since sometimes various types of sarcomas look alike.  For my patients with sarcomas, I have a Pathologist at a sarcoma center review the pathology.\n\n",
    "posted_time": "Post  by Dr. Jeffrey Gordon » Fri May 09, 2003 10:49 am",
    "category": "Oncology",
    "sub_category": "Chemotherapy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=713&sid=6805cdcbb680755881e5cfc3fc8356e2#p713"
  },
  {
    "author": "fafa-",
    "title": "Area under the curve",
    "content": "What does the AUC (area under curve) mean for the carboplatin dose calculation?\n\n",
    "posted_time": "Post  by fafa- » Sat Jan 04, 2003 6:32 am",
    "category": "Oncology",
    "sub_category": "Chemotherapy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=91&sid=6805cdcbb680755881e5cfc3fc8356e2#p91"
  },
  {
    "author": "JGordonMD",
    "title": "Re:",
    "content": "Most chemotherapy drugs are dosed based upon body surface area (BSA) using height and weight in a calculation. Some drugs are dosed just based upon weight. For the case of carboplatin, given that it is cleared by the kidneys, a different calculation is used that takes into account a person's intrinsic kidney function (called creatinine clearance). Thus, the area under the curve (AUC) has been developed to better calculate the dose of carboplatin than could be calculated if just BSA were used.\n\n",
    "posted_time": "Post  by JGordonMD » Sat Jan 04, 2003 6:33 am",
    "category": "Oncology",
    "sub_category": "Chemotherapy",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=92&sid=6805cdcbb680755881e5cfc3fc8356e2#p92"
  }
]