[
  {
    "author": "bdedwards87  Guest Posts: 1 Joined: Sun Jul 25, 2010 11:19 pm Gender: Male",
    "title": "Lifespan Of Tetrology of Fallot Patients",
    "content": "I was born in 1987 with four holes in my heart. I had the surgery to repair this condition when I was one year old. I have been wondering lately what the average life span is for somone who has had the surgery.\n\n",
    "posted_time": "Post  by bdedwards87 » Sun Jul 25, 2010 11:25 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=98609&sid=72990874dfb39110b56b9112dca429bc#p98609"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: Lifespan Of Tetrology of Fallot Patients",
    "content": "Hi, The life span for persons who had a successful correction of tetralogy of Fallot is almost the same as any other 'normal' person in the general population.  One long term follow up study involving 814 patients undergoing complete repair at the University of Alabama at Birmingham, survival rates at 1 month and at 1 year, 5 years, and 20 years, were 93%, 93%, 92%, and 87%, respectively. These survival rates were only slightly less than those of an age, race, and sex-matched control population.  (Kirklin JK, Kirklin JW, Blackstone EH, Milano A, Pacifico AD. Effect of transannular patching on outcome after repair of tetralogy of Fallot. Ann Thorac Surg. Dec 1989;48(6):783-91). Presently, the figures are expected to be even better.  In an individual with Down's syndrome (about 30 to 50 percent of all children with Down syndrome are found to have heart defects), following total correction, the life expectancy should be almost the same as persons with Down's syndrome without Fallot's tetralogy (50 to 55 years). Good luck!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Fri Sep 03, 2010 12:49 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=102074&sid=72990874dfb39110b56b9112dca429bc#p102074"
  },
  {
    "author": "D3AN  Guest Posts: 1 Joined: Thu Jan 22, 2009 4:26 am Gender: Male",
    "title": "Why is 1/2 of my muscle missing after PDA surgery",
    "content": "Hi Doctors, I underwent surgery for patent ductus arteriosus as a premature baby. I'm 22 now and half of my pectoral muscle has always been missing where the incision was made. I'm just curious why 1/2 of my muscle is missing. Was it simply not sutured back together? Thanks for any help\n\n",
    "posted_time": "Post  by D3AN » Thu Jan 22, 2009 4:33 am",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=69332&sid=72990874dfb39110b56b9112dca429bc#p69332"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Why is 1/2 of my muscle missing after PDA surgery",
    "content": "Hello -  My best guess is that during the surgery, when the muscle was separated, due to the location of the incision and the small scale of you as a premature infant, some  of the muscle tissue was simply lost outright or to wasting during the healing  process. There is such a huge difference not only in scale but in development between adults and less-than-full-term babies that it would be rather  surprising if this hadn't happened.   I hope this answers your question adequately. Good luck to you.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Tue Feb 03, 2009 1:14 am",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=70445&sid=72990874dfb39110b56b9112dca429bc#p70445"
  },
  {
    "author": "premedpedcard  Guest Posts: 1 Joined: Tue Jun 22, 2010 10:31 pm Gender: Male",
    "title": "Re: Why is 1/2 of my muscle missing after PDA surgery",
    "content": "Something else to think about would be if the nerve that innervates that particular muscle was severed during surgery. That could lead to the atrophy of that muscle group.\n\n",
    "posted_time": "Post  by premedpedcard » Tue Jun 22, 2010 11:03 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=94918&sid=72990874dfb39110b56b9112dca429bc#p94918"
  },
  {
    "author": "sofaset  Guest Posts: 1 Joined: Fri Oct 16, 2009 3:31 pm Gender: Male",
    "title": "Congestion in heart after CABG (bypass)",
    "content": "Dear Sir,  My mother, who is 74, underwent a CABG Bypass surgery in June 2009. 18 days after the surgery she had a partial heart attack in the front part of the heart in the hospital itself. She also had lung infection / pneumonia. She was in the ICU for a month. She also could not eat properly as she felt like vomiting. She also felt very weak.  Now it’s been 3 months after discharge, still she does not eat properly. She also cannot walk for a long distance. She feels very tired; she experiences breathlessness / short breath and palpitation.  While sleeping she feels congestion in the heart, shoulder pain at times, cough and breathlessness.  Please tell us as to why she cannot eat, or move around and why does she experience congestion after bypass.  Thank you,  Best Regards,\n\n",
    "posted_time": "Post  by sofaset » Fri Oct 16, 2009 3:53 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=84052&sid=72990874dfb39110b56b9112dca429bc#p84052"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Congestion in heart after CABG (bypass)",
    "content": "Hello -- I can offer a possible explanation for some of the problems your mother is having: Often and especially in older patients, an intraoperative heart attack can occur and apparently this was the case with your mother. It affected, from your description, the left anterior descending artery (LAD), which supplies a major part of the left ventricle, which is the real workhorse part of the heart. This could explain weakness, fatigue, even poor appetite, and probably stems from congestive heart failure, which should be treated on an ongoing basis. The description of \"congestion in the heart\", however, eludes me. Can you describe in more detail what is meant by this? Perhaps it is precisely congestive heart failure she is speaking of. Is there a cough or fluid in the lungs? If so, that would be the explanation most likely, and an infarct in the area served by the LAD is most likely to cause such a problem. There are medications that can help strengthen the heart muscle and the cardiac output which might also ease the symptoms. This should be followed closely by your mother's cardiologist.   I hope this is helpful to you. Good luck to you both. Please follow up with us here as needed.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Sun Nov 01, 2009 11:49 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=85586&sid=72990874dfb39110b56b9112dca429bc#p85586"
  },
  {
    "author": "Carter11788  Guest Posts: 1 Joined: Wed Sep 16, 2009 10:24 pm Gender: Female",
    "title": "Atrial septal aneurysm and pregnant.",
    "content": "Hi my nickname is carter,   I have a atrial septal aneurysm with no asd or pfo ( no defects at all) and very low pulmonary hypertention in the 20 percentile. I am wondering is this something that is worthy of worrying for while im pregnant? And can I keep my pregnancy and live through it?. im in my second trimester (16 weeks )im very scared do these symptoms pose a threat while pregnant. I have had no shortness of breath. Ive looked all over google and bing and yahoo and cant find anything but about the defect. Please answer im kinda worried. I'll be seeing my cardiologist on the 24th this month.\n\n",
    "posted_time": "Post  by Carter11788 » Wed Sep 16, 2009 10:42 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=82653&sid=72990874dfb39110b56b9112dca429bc#p82653"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Atrial septal aneurysm and pregnant.",
    "content": "Hello -- You will by now have seen your cardiologist, who is best equipped to answer your question, but I'll try to work with you anyway. The atrial septal aneurysm is usually not a problem unless it eventually causes pulling of nerve tissues which can cause atrial arrhythmias (which can usually be managed with conservative treatment if necessary, if they even occur). The notion of aneurysm, in this case, is not like that of an artery, which are prone to burst. The pressures on either side of the septum are pretty much equal, so this is merely a separation of septal tissue, forming a small void space. It doesn't usually cause any serious problems as there is no place for anything to go. It's more an anatomical anomaly which must be noted and should not be affected (or affect) your pregnancy.  The PH is another matter, but since it is currently mild it will likely be considered a minor risk for pregnancy, although the pregnancy and delivery could cause it to become more severe afterward. If so, it would have to be followed closely, but it should be followed regularly anyway, as it can often progress on its own anyway. This is something of greater concern, although it may just as easily remain stable or even improve with time. Pregnancy could, as I've said, make it worsen, but not likely something that would show up til afterward. It should be tracked carefully during pregnancy, however, and especially during delivery. A Cesarian delivery may be considered for someone with low grade PH (cor pulmonale).   I hope this helps answer your concerns. Please follow up with us here as needed. Good luck to you!\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Thu Oct 22, 2009 10:26 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=84436&sid=72990874dfb39110b56b9112dca429bc#p84436"
  },
  {
    "author": "slc25  Guest Posts: 2 Joined: Wed May 06, 2009 1:05 pm Gender: Female",
    "title": "Can an ASD disappear in adults?",
    "content": "I am a 26 y/o 125lb female previously diagnosed with a murmer/mitral valve prolapse and SVT in my teens. I saw an electrophysiologist in 2008 because even though I had been on Toprol for several years, I had become increasingly symptomatic: exercise intolerance, shortness of breath, fainting, fatigue. My heart rate rarely dropped below 100 and got worse when I laid down flat and relaxed at night. The Cardio recommended ablation and scheduled me for a stress test.   Six weeks later I had my treadmill test as scheduled with the Chief of the Cardiology Dept. (don't remember the exact title) and three other doctors and nurses presiding. I lasted three minutes on the treadmill with my heart rate at 240. They took me off and laid me on the table for the TTE and my heart rate was not coming down much and the right side of my heart was dilated, so the Department Head told me I had an inappropriate response to exercise and they would do a bubble study to check for a hole. During the bubble study, he and everyone else in the room saw the bubbles passing across the top part and he told me that I did have a hole in my heart and would be scheduled for a TEE and closure.  While I was still sedated from the TEE, the technician told my husband that he didn't find a hole. When I went back to the cardiologist, he said the TEE and cardiac MRI revealed no structural abnormality. He put me on Bystolic and told me to come back every few years for a check up. He didn't say anything about ablation.  My question is: Have you ever heard of a bubble study giving a false positive for an Atrial Septal Defect, or of a hole not showing up on TEE and MRI? How can I know for sure whether or not there is a hole when one Cardiologist gave one answer and another gave a different one? Did the ASD close on it's own in a matter of 6 weeks, or is it a flap that opens and closes based on my exertion level?   Please help, I am confused.\n\n",
    "posted_time": "Post  by slc25 » Wed May 06, 2009 2:00 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=77159&sid=72990874dfb39110b56b9112dca429bc#p77159"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Can an ASD disappear in adults?",
    "content": "Hello --  First, looking at your history I find it's pretty typical of a certain subset of patient which has a common set of signs and symptoms  which you have. That being said. the ASD (often a patent foramen ovale or PFO), can be so small and tight as to allow bubbles to pass after stress when the dynamics are very different than at rest (as with the TEE) and so essentially does, clinically at least, \"disappear.\" This type is often undetected and when it is it is usually followed as per suggestion by the cardiologist. It may be frustrating to get two different stories from the same doctor, but the TEE doesn't lie. The bubble test can make things appear different than they are, especially after stress.   You may have dysautonomia (most people with this set of defects do) and the exercise response can be inappropriate withouth there being any significant defect. Neurocardiogenic syncope is common with this group, but is not dangerous assuming one is able to avoid bumps on the head due to falling. SVT is common with MVP anyway, so ablation is not always indicated, but you could perhaps undergo an electrophysiology study if this continues or becomes more frequent and bothersome. There may be an associated atrioventricular re-entry tract (AVNRT) causing the SVT, and ablation can eliminate this entirely.   To answer your last question more precisely, while the hole may clinically disappear, it is present, and rarely a flap, but often a very tiny, insignificant hole and often not the cause of exercise intolerance but can be exposed via exercise and can sometimes contribute somewhat to that intolerance. It can open more at those times and virtually disappear when at rest. It should just be followed. It's not precisely a false positive, but like MVP, it can often be visualized one time and not the next, a frustrating thing for everyone. The change to Bystolic is not unreasonable and may actually work better for you than Toprol, although the latter is one o fthe best known meta blockers. If it wasn't doing the job maybe Bystolic will work better for you.  I hope this is helfpul. Please follow up with us here as needed and keep us updated. Good luck to you.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Mon May 11, 2009 9:52 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=77781&sid=72990874dfb39110b56b9112dca429bc#p77781"
  },
  {
    "author": "slc25  Guest Posts: 2 Joined: Wed May 06, 2009 1:05 pm Gender: Female",
    "title": "Re: Can an ASD disappear in adults?",
    "content": "Wow, thank you for taking the time to give me all of that information. That really clears up a lot for me. So, does this mean I can SCUBA dive?  -Valerie\n\n",
    "posted_time": "Post  by slc25 » Tue May 12, 2009 11:11 am",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=77837&sid=72990874dfb39110b56b9112dca429bc#p77837"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Can an ASD disappear in adults?",
    "content": "You're very welcome! Glad it was helpful. As to your question re: SCUBA diving, that has certain considerations attached to it which would best be addressed by your personal doctor. There should be a fairly simple yes or no depending upon how he weighs all the factors. I'd be remiss to tell you it was okay from this distance. Wish I could, but that's one for the attending. :)\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Sat May 16, 2009 9:49 am",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=78448&sid=72990874dfb39110b56b9112dca429bc#p78448"
  },
  {
    "author": "raaj79  Guest Posts: 1 Joined: Mon Jan 12, 2009 10:08 pm Gender: Male",
    "title": "Bicuspid Aortic valve & Erectile dysfunction",
    "content": "Hi, I'm a 30 year old male who has been diagnosed with a bicuspid aortic valve at the age of 2. There is a heart murmur, but other than that nothing to worry about and I get regular checkups.  My concern is this. In the last few years, I've developed Erectile Dysfunction. Its not total ED, I can get an erection, just that its difficult to get, and hard to keep and not that strong. There are times when there is a lack of drive altogether and I cannot get an erection.  To treat this I've been using Viagra 100mg whenever I have sex, sometimes I do not need to use it, but on most cases I do. My question is whether my congenital heart disease is related to me having ED? Is there a correlation between the two?\n\n",
    "posted_time": "Post  by raaj79 » Mon Jan 12, 2009 10:13 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=68090&sid=72990874dfb39110b56b9112dca429bc#p68090"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Bicuspid Aortic valve & Erectile dysfunction",
    "content": "Hello -  What you're referring to as \"congenital heart disease\" is actually a congenital structural heart abnormality, which may broadly be considered heart disease, but actually is a defect in a valve, and which should not,  like coronary artery disease, be related to your partial ED problem. Further, if your ED was due to distraction and anxiety related to the knowlege of your bicuspid aortic valve, you'd have more of a problem most likely (in terms of ED). However, again, men your age rarely have ED except due to some psychological issue, so this may be worth a look.   If Viagra works for you, then at least until you discover the underlying cause of the ED (and I certainly can't say that future research may not establish some up-til-now undiscovered link between bicuspid aortic valve and  ED), you'll have an assist when you need it.  More importantly, I think, is that you have at least annual echocardiograms and a chest x-ray or MRI (or CT) to be sure you're not developing any dilation of the ascending aorta, for which there is a lifelong additional risk when bicuspid aortic valve is present.   I hope this answers your question. Good luck to you. Please follow up with us as needed.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Wed Jan 14, 2009 9:26 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=68367&sid=72990874dfb39110b56b9112dca429bc#p68367"
  },
  {
    "author": "maja602  Guest Posts: 1 Joined: Sun Jan 04, 2009 1:54 am Gender: Female",
    "title": "Newly diagnosed ASD",
    "content": "Hello. I am a 24 year old female in generally good health. I went for a physical a couple weeks ago. My physician identified a grade 4/6 systolic ejection murmur heard loudest over the left sternal border.  She sent me for an echocardiogram. I had this performed on Dec 31, 2008. The radiologist came in at the end of the test and told me that I have a small ASD. He didn't say much else and told me to follow up with my family physician for the results. I have an appointment in 2 weeks with her and am anxious to find out more.  I've been doing some reading on ASDs and treatment. My question is - is it recommended that ALL ASDs are closed? Is there any reason why they would not close an ASD? Based on what I have read, even when the ASD is small, there can be symptoms later in life. Any information on what I can expect to happen next would be helpful. Also, should I ask for a referral to a cardiologist regardless of how big the ASD is?   Thanks in advance for any information you can provide.\n\n",
    "posted_time": "Post  by maja602 » Sun Jan 04, 2009 2:02 am",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=66864&sid=72990874dfb39110b56b9112dca429bc#p66864"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Newly diagnosed ASD",
    "content": "Hi there -  Last things first: yes, you should absolutely ask for a cardiology consult. That's the only thing that makes sense. I realize managed care is making things go out of order quite a bit these days, but this is a cardiological issue and while  your GP should be involved, a cardiologist should be in charge at this point.  Now then: a small ASD, at your age, obviously isn't causing any obvious symptoms. You could, conceivably, go your whole life without any problems. However, there is always a greater risk of eventual problems, whether they be shunting of blood from one side to another to the detriment of good functioning; there is a greater than average risk of small clots forming eventually, especially if the slightly greater risk of developing atrial fibrillation is eventually realized. These are all \"maybes\", but this is why even a small ASD is generally repaired if practical (which it usually is).   As for the repair, it can usually be accomplished by catheter guided placement of a small patch, which can be virtually an in-and-out procedure many times. This would involve inserting a catheter via a tiny incision in the groin, into a femoral vessel, feeding it up to the heart, and watching the entire thing on a monitor screen. It's simple, relatively easy, minimally invasive, and takes a few hours. There are a few cases in which the ASD is difficult to reach directly via catheter, although it's almost always best to at least have it visualized that way anyway.   There's likely no immediate problem, and I have known patients who've had these discovered well into the fifth decade with no particular problems having taken place. Still,  the sooner the thing is repaired, if that is possible (and it almost always is), the less the chance of some random mishap later on. There's plenty of time to discuss this with a cardiologist and develop a plan. It's not usually a big deal at all. Once in a great while either the ASD is considered too insignificant or is simply watched over a period of time rather than repaired early, and there are also a few cases where the ASD is found to be located in an awkward place and then the need for open (but still usually minimally invasive) surgery is discussed. These are increasingly unusual.  I hope this is helpful to you. Please keep us updated, and if there are any additional questions or concerns, please follow up with  us here.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Sun Jan 04, 2009 8:07 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=66922&sid=72990874dfb39110b56b9112dca429bc#p66922"
  },
  {
    "author": "thestocksfam2001  Guest Posts: 1 Joined: Mon Sep 22, 2008 1:55 pm Gender: Female",
    "title": "Bicuspid heart valve and fainting/seizure?",
    "content": "Hello there,   I am not sure if I am even posting in the correct area but I am trying to get some feedback on an issue my husband has. Sorry this is a long post... Here is the history.   In 2005, when my husband was 26 years old he fainted/passed out/hit dead air at work (he was an underground miner). He was taken to the ER where they ran the gauntlet of test on him; EKG, MRI, CAT scans, blood work etc. All tests were fine for the most part, they did say that he had a bicuspid heart valve which was not a problem and diagnosed his episode Syncope. We were referred to a cardiologist and he explained what the bicuspid heart valve was and said that we really didn't have anything to worry about. Fast forward a five months, my husband was really tired after a long 16 hour day at work and was sitting on the couch. I could tell he was fighting sleep, next thing I know he just kind of slumps and his whole body went slack. Then he jerked a little and started snoring. I went over to him and tried to wake him up, it took about 2 minutes or so before he woke up. When he did wake up he was very disoriented, he asked me the same question 4 times and kept repeating his sentences. In about 5 minutes he was just fine and no longer confused but he didn't remember talking to me right after he woke up. I just chalked it up to the fact that he was really tired and we didn't go to the doctor.   About three months later, on my husbands one day off from work we went out to get a sandwich for lunch and he asked me to drive home because he was really tired. We switched places and about 15 minutes later we were pulling in the driveway when he did the same thing- slumped and sounded like he held his breathe. I put the truck in park and leaned over to see if he was okay when he started seizing. This was very different than the earlier faint, this to me was a full blown seizure. I called the paramedics and they were there in a bout 30 minutes (it was snowing and in rural Colorado). By the time they had got there my husbands seizure was over, he had about five minutes of disorientation and didn't remember the episode at all but was feeling fine. When the ambulance showed up he actually picked up the stretcher and helped them put it back in the truck and said he was feeling just fine:) I forced him to let them take him to the hospital, where again they ran a battery of tests. All of which came back fine. We were referred to a neurologist this time who then performed an EEG also. No tumor, no brain issues and no cause. The neurologist prescribed an anti-seizure medicine and we thought we were good. We did all the follow ups with the doctor and the medicine seemed to to the trick.   Now a couple of years later, my husband had another issue last night. I made a doctors appointment but they can't get him in until Friday. He was really tired again, we had a weekend away and drove about 12 hours with little sleep. It was late , about 8:30pm and my husband was in the recliner starting to doze off when he slumped down made some moaning noises and looked like he went to sleep. I went over to ask is he was okay because of the moans and could not wake him up for about a minute. When he woke he was once again disoriented for about 5 minutes and then was fine.   I found some web sites about syncope and one said \"abnormalities of the heart valves can cause fainting/syncope\". Then when I was looking at bicuspid valve pages the symptoms of that can be fatigue, dizziness and fainting. Now I know that I am no doctor, but it seems like the connection was missed earlier. Every doctor we saw, we told them about the bicuspid valve and everyone dismissed it as not having anything to do with the fainting issues. I will be sure to bring it up again on Friday with a new doc in a new state now. I was just wondering if anyone is familiar with bicuspid valves and fainting or syncope. Or if anyone had any advice on any avenues we should pursue! Thank you so much for your time!\n\n",
    "posted_time": "Post  by thestocksfam2001 » Mon Sep 22, 2008 2:05 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=61201&sid=72990874dfb39110b56b9112dca429bc#p61201"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Bicuspid heart valve and fainting/seizure?",
    "content": "Hi there -  Your concern is very understandable. The fact is that while there is no direct connection between bicuspid valve and seizures/fainting, there is an indirect and poorly understood statistical conncection between this (and several other interchangeable valve abnormalities) and vasovagal episodes (resulting in fainting and even seizure-like activity). While  the valve abnormality is duly noted, it probably won't be  figured into the equation when your husband is evaluated. However, he should be  tested for vasovagal reflex (often now referred to as neurocardiogenic syncope). While there is no clear reason why these two things should co-exist, the often do. The testing would be to determine if your husband suffers from neurocardiogenic syncope, and a tilt-table test would be one of the big ones. I might also mention that some people who suffer from vasovagal reflex often have this happen when they've been exceptionally active and are very tired. They tend to doze off, fall deeply asleep, and  almost seem to go into a partial seizure if disturbed.   If the cardiological study shows up nothing, a neurological workup might be next in order. I don't think this is a life-threatening problem (unless, of course, it were to occur when your husband was driving or something like that). Still, it is something that needs to be clarified. The fact that the bicuspid valve is present is more a marker than anything else, and is not, so far as I am aware, ever actually a cause of this sort of symptomology.    I hope this is helpful. Best of luck to you both, and please follow up here as needed.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Tue Sep 30, 2008 11:05 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=61668&sid=72990874dfb39110b56b9112dca429bc#p61668"
  },
  {
    "author": "glenp  Guest Posts: 8 Joined: Sun Sep 23, 2007 6:48 pm",
    "title": "Extra cardiac shunt",
    "content": "I am a 57 year old female, have crouzons, and 5 years ago was diagnosed with CFS.   I had many of the CFS symptoms when I was young, but only the last 5 years has it severely affected me.  My blood pressure is normal, Cortisol levels in the am are 204 and 334 in the pm, lymphocyte count is usually low or low normal.  IgA is 0.92 (low normal).  My worst symptom is the exhaustion and not being able even keep up my home.  I get out of breath easily.    My question concerns the results of a recent echo gram.  Much of it seems to be normal except for:  Following injection of agitated dextrose into the right arm, the right heart cavities become markedly echogenic.  During spontaneous respiration <5 bubbles, and with cough <5 bubbles are identified in the left heart in a single frame consistent with a mild extracardiac shunt.  No right to left shunt is identified with Valsalva maneuver.    A few contrast bubbles are noted late in the LV cavity.  This is consistent with minimal intra-pulmonary shunting.  Borderline abnormal study.    My question is,   How much does this affect me concerning my CFS.  Would the symptoms be significant?  Any help or advise would be much appreciated. This is the only heart test that I have ever had.\n\n",
    "posted_time": "Post  by glenp » Mon Mar 03, 2008 12:12 am",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=54896&sid=72990874dfb39110b56b9112dca429bc#p54896"
  },
  {
    "author": "Dr. A. Madia  Medical Doctor Posts: 207 Joined: Fri Jan 06, 2006 6:50 am Gender: Male Location: India",
    "title": "Re: Extra cardiac shunt",
    "content": "Hi,  First let me discuss the normal circulation.   Oxygen depleted blood turns around from tissues and reaches back to the heart via the Inferior and Superior vena cava. It then enters the Right artium and then Right Ventricle. Right Ventricle pumps it up through the Pulmonary Artery to the lungs so that this de-oxygentated blood could release the carbon dioxide to the atmosphere and saturate itself with fresh oxygen.   This oxygenated blood now comes back to the heart via the Pulmonary veins to the Left Atrium , thence to Left Ventricle and LV in turn pumps it out again to the tissues.   Suppose there is a hole in the heart which causes a communication between the right and left hearts. Thus either the Fresh oxygenated blood will mix with the de-oxygenated blood of the right heart system or vice versa depending on the pressure differences bet the two hearts. This type of situation commonly occurs in congenital heart disease and is called a 'Shunt'.  Rarely this shunt situation is mimicked even though there is no such hole or communication bet the two hearts. The culprit here is something called an 'Arteriovenous malformation' or communication bet the venous and arterial systems in the Lung tissue. This effectively serves as a Shunt. This being outside the heart perimeter is called \"extra cardiac shunt.\"  The important thing is the severity of such shunt. If the quantum of shunted blood is very small, the mixing of de-oxygenated blood with fresh blood is miniscule and can be ignored. This can be judged from the Oxygen saturation measurted through a monitor in the clinics. If O2 saturation is above 96%, this shunt of yours can be ignored. If it is significantly less than 96% then probably you have an answer to the reason foryour CFS.  I hope I am clear and this is useful to you.   Apurva\n\n",
    "posted_time": "Post  by Dr. A. Madia » Mon Mar 17, 2008 12:18 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=56179&sid=72990874dfb39110b56b9112dca429bc#p56179"
  },
  {
    "author": "Southy1  Guest Posts: 3 Joined: Thu Jan 03, 2008 11:14 am",
    "title": "hole in heart... should i be more catious?",
    "content": "Hi there...  This is a bit of a general question.  I had a hole in my heart from birth, and had a couple of operations to make the hole as small as possible. Unfortunatley i cant remember what 'type' it was, as i know there are two main ones. But i know it was known to be the more serious and complicated hole in heart.  I have had a couple of dental procedures, that have made me go under anesetic so my heart can be monitored throughout.  Recently i have had a really heavy cough, and after visiting the docs was given a course of amoxcillin... to treat what he thought was a flu, with bronchitis symptoms.   When he asked if i had any illness i said no. Since my hole in heart has never caused any probs, it didnt occur that i should mention it! :-S   I was just wondering now im a bit older, and living idependently, are there any anti biotics that i should let myself be prescribed? and any particular activities that may affect my heart condition in anyway. I was meant to go for a scan at the age of 17, but the hospital never got in contact... (im 19 now)  Thanks for reading and any helpful advice.  P.S I did tell the doc when i registered that i had had a hole in my heart, so im pressuming it was in front of him on the computer anyway?  xxx\n\n",
    "posted_time": "Post  by Southy1 » Sat Jan 05, 2008 8:47 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=52779&sid=72990874dfb39110b56b9112dca429bc#p52779"
  },
  {
    "author": "Dr. A. Madia  Medical Doctor Posts: 207 Joined: Fri Jan 06, 2006 6:50 am Gender: Male Location: India",
    "title": "Re: hole in heart... should i be more catious?",
    "content": "Hi,  You had a hole in the heart from birth. You say it was the more serious kind and complicated one. It required more than one surgery to 'make it as small as possible'. This information could mean a congenital cyanotic heart disease.  If a total correction was achieved, there is no issue now. Irrespective of that, there is no issue against taking any antibiotic for brochitis or any other condition either. Of course you must tell your doctor of your past condition and surgeries.  At this stage you should undergo an evaluation of your current status of the heart. Also there are certain preventive antibiotics that you should take during any future dental procedure or non cardiac surgeries to prevent your heart getting infected.[Endocarditis Prophylaxis.]  Apurva\n\n",
    "posted_time": "Post  by Dr. A. Madia » Wed Mar 12, 2008 11:26 am",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=55765&sid=72990874dfb39110b56b9112dca429bc#p55765"
  },
  {
    "author": "Katy101  Guest Posts: 1 Joined: Wed Jan 02, 2008 11:23 pm",
    "title": "Dizziness, fainting and shortness of breath",
    "content": "I've done some research, and I need a second opinion on my symptoms and some treatment options? For the moment, I have no family doctor, and am reserved about going to one.  I feel dizzy and have shortness of breath after excersizing or having an emotional outburst.  I tend to faint or become dizzy if I over-exert myself.  If I have a panic attack or feel too much stress/anxiety I also tend to faint.  Running or lots of movement makes me very tired and I get dizzy.  I've never been diagnosed for a heart defect, but from what I've read online and in books, these symptoms all lead to it. Would you be able to help clear some of this up?\n\n",
    "posted_time": "Post  by Katy101 » Wed Jan 02, 2008 11:40 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=52561&sid=72990874dfb39110b56b9112dca429bc#p52561"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "Re: Dizziness, fainting and shortness of breath",
    "content": "Hello Katy101,  Dizziness and feelings of lightheadedness are extremely common.  Almost always they are not serious.  However, the red flag that we look for is fainting or near fainting due to activity.  This can signal an underlying heart condition such as a dysrhythmia where the heart is not able to pump enough blood.  I would recommend you see a doctor about this.  You may also need to see a cardiologist.  Overall, the odds are still that this is not a serious issue; however, being wrong can have terrible outcomes so it is safest to have this checked out.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Thu Feb 14, 2008 12:26 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=53835&sid=72990874dfb39110b56b9112dca429bc#p53835"
  },
  {
    "author": "tink903  Guest Posts: 1 Joined: Sun Sep 30, 2007 9:12 pm",
    "title": "congenital heart patients and birth control",
    "content": "I am a 22 year old female born with pulmonary atresia and pulmonary stenosis. My last surgery was when I was 12 and I had a stent placed in pulmonary artery. Recently I was put on birth control (YAZ)  to regulate my periods that were coming every 2 weeks. I recently heard that birth control is unsafe to give to heart patients, and with YAZ being a new form of birth control I worry that not all of the possible side effects have been discovered.  What worries me is the leg cramps that I have been getting at night.The cramps wake me up out of a sound sleep.  Is this an indication of potential blood clots (a possible side effect of the birth control)? If so would you recommend a bloodline test? Should I pursue further opinions and perhaps stop the birth control?  Any help would be greatly appreaciated Thank you\n\n",
    "posted_time": "Post  by tink903 » Sun Sep 30, 2007 9:25 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=48493&sid=72990874dfb39110b56b9112dca429bc#p48493"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Tink903,  The main risk with oral contraceptives and congenital heart disease is the possibility of blood clots as you have mentioned.  The actual risk of this depends on the risk of blood clots forming with the underlying congenital heart disease.  Some congenital heart lesions require anti-coagulation to prevent clotting from occurring after repair.  This mostly depends on the type of valves used in the repair.  If anti-coagulation is needed your doctor may recommend against oral contraceptives.  Yaz is a little different than most of the birth control pills previously available.  The progesterone component of the pill has a diuretic component.  Rarely, electrolyte abnormalities can occur with this that can cause the cramping feeling.  It may also be a side effect of the medicine.  I would recommend you talk with your cardiologist to see if there is a reason for not taking the oral contraceptive.  I would also recommend you talk with your gynecologist about the cramping.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Mon Oct 01, 2007 10:50 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=48549&sid=72990874dfb39110b56b9112dca429bc#p48549"
  },
  {
    "author": "herronmdh  Guest Posts: 1 Joined: Mon Aug 06, 2007 10:32 am",
    "title": "Chest pain 8 months after bypass surgery.",
    "content": "I am a 52 year old male. 3 stints 7 years ago a triple bypass last December and another stint in April. Since the bypass I have had chest pain in the middle and left side of my chest all the time. Everyone tells me it's just the brestbone healing? Nice but I can't sleep and it is always there. During the day if i'm doing things it's around a 4 on the pain scale but at night when I sit down it goes up to a 6or 7 and I have to change postions all the time to get relief. I felt better before the surgery! And then a stint right after? They told me that the surgen made the stiches too tight and blocked off the bypass 98 percent - nice. So what was the point of the bypass? What can I do about the pain and why is it there. I am very active, but this is just messing up my life.  Thanks Mike\n\n",
    "posted_time": "Post  by herronmdh » Mon Aug 06, 2007 10:47 am",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=45767&sid=72990874dfb39110b56b9112dca429bc#p45767"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Mike,  I would advise you to follow up with your cardiac surgeon.  It may be that you are having some pain related to the sternum healing, especially if it hurts when you push on it.  With heart issues it is always wise to make sure pain isn't coming from the heart.  Your doctor can help sort this out.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sat Aug 11, 2007 3:47 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=46099&sid=72990874dfb39110b56b9112dca429bc#p46099"
  },
  {
    "author": "j_serner  Guest Posts: 1 Joined: Wed Apr 18, 2007 11:04 am Location: MO",
    "title": "Chest Pain",
    "content": "I am a 27 year old female, My mother side has alot of heart disease and high blood pressure, my father side unknown. I have been diagnosed with acid reflex and gurd.  I have been having chest pain continous for 3 days, plus pain in my arms, shoulders and neck.  And I have been having a either muscle spasm or a bubbly sinsation in the middle of my chest wich causes me to have an anxiety attack.  I am scard not knowing.  I haven't went to the doctor for this yet.   I do have children and my youngest is 3 months old so I pack her around and also her in her carseat alot..  Is this something that I need to be extremly concerned about Thank you for your time.\n\n",
    "posted_time": "Post  by j_serner » Wed Apr 18, 2007 11:38 am",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=40951&sid=72990874dfb39110b56b9112dca429bc#p40951"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "[no title]",
    "content": "Hello j_serner - While I wouldn't be unduly concerned I would take at least a healthy concern in the symptoms for three reasons: One , you appear to have a family history of heart disease, although it's unclear whether it was premature or not (prior to age 60) on your mother's side; Two, your symptoms, while consistent with GERD, could also, conceivably, be consistent with cardiac pain. Since they appear two be fairly new they are worth investigating; and Three, the symptoms are causing you considerable anxiety. Although you are a young woman and presumably healthy otherwise, you have children who are dependent on you. While the risk, statistiaclly, is small, pain that radiates from the chest into the arms and neck should be investigated to rule out any possible heart problems. GERD can mimic heart pain very accurately, which only clouds the picture. This is the likely cause of your discomfort, but if the symptoms are new it is far better to err on the side of caution and ease your mind. Who needs all that anxiety? And you don't need, either, to run the risk that you even remotely could be having a heart problem. Go see a doctor or get to a medical facility ASAP and find out for sure. If it's GERD there are things that can be done to get it under control. If it's something else you need to know that too.   I'm betting, in this case, on GERD, but with the family history you have I strongly advise you get yourself checked at once. Then you can relax, knowing exactly what's going on and what you need (or don't need) to do about it.   Good luck to you and please stay in touch.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Wed Apr 18, 2007 12:44 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=40952&sid=72990874dfb39110b56b9112dca429bc#p40952"
  },
  {
    "author": "jean12  Guest Posts: 1 Joined: Mon Feb 05, 2007 4:02 am",
    "title": "PFO Dizziness",
    "content": "I am 28 year old female. I went to the doctor for dizziness/faintness and some pain under my left arm. I was found to have an abnormal EKG showing left atrial enlargement and a bundle branch block. had an ECHO done with bubble test revealing a PFO. Had a stress ECHO to rule out high atrial pressure with exertion. MD does not think dizziness is related to PFO, states that I am fine for now. However, I am still dizzy and feel faint at times. I have been seen by EENT, who is starting me on allergy shots d/t long history of allergies and sinus trouble. Had a CT of sinuses done and CT with contrast of brain. both normal. Had a mammogram with ultrasound done for pain under arm which was normal. I had a bilateral corotid doppler done which was normal. I have also been diagnosed with orthostatic hypotension and wear ted hose. I am still dizzy and feel faint. I follow a healthy diet and exercise reg. My dizziness seems to happen most when I am in a busy place, lying in bed, or lifting weights. I take allegra, asa, codliver oil, multivit, singular, vit. E, and garlic. I have been symptomatic for 7 months now.  I know that my feeling faint is most likely due to my low blood pressure. Could this be related to my PFO. Should I go back to the cardiologist? I guess I am trying to figure out what the underlying cause of my low bp is? Could it be hormonal? Thank you for taking the time to answer.\n\n",
    "posted_time": "Post  by jean12 » Mon Feb 05, 2007 4:22 am",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=38413&sid=72990874dfb39110b56b9112dca429bc#p38413"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Your PFO is unlikely to be causing your dizziness.  PFO's are generally incidental findings.  Really, the only thing we advise against is scuba diving with PFO's because too rapid of an ascent could cause bubble formation in the blood.  These bubbles could then cross the PFO and go to the brain, potentially causing a stroke.  It is rare that they cause any symptoms at all.  Regarding your orthostatic BP, low BP can certainly cause dizziness.  The best way to combat low BP is by staying very well hydrated.  You may also be advised by your doctor to take a daily steroid medication that will make you retain fluid in the veins (a mineralocorticoid type steroid, not a glucocorticoid steroid that can have side effects with prolonged exposure).  I would recommend that you continue to follow up with your doctor and cardiologist.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sun Mar 18, 2007 8:51 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=39707&sid=72990874dfb39110b56b9112dca429bc#p39707"
  },
  {
    "author": "klasiu  Guest Posts: 1 Joined: Fri Mar 09, 2007 7:26 pm",
    "title": "Coronary Artery Fistulas",
    "content": "Hello, I am a 35 year old female in relatively good health. I take no medications other than Topamax for migraine prophylaxis. I had open heart surgery on May 8, 2006 to ligate a RCA to LV Coronary Artery Fistula which was misdiagnosed when I was a child as a heart murmur. I developed a cardiac tamponade, which required a second surgery on May 13, 2006. After being released from the hospital, I developed an infection in my incision (which was caught early and taken care of with antibiotics), I then caught pneumonia which was also treated with a course of antibiotics. My sternal incision has formed a keloid scar, for which I have received injections of kenalog to minimize the pain & itch(3 injections to date). I was recently (1/23/07) hospitalized for chest pains and had several tests. The cardiac cath done prior to CAF ligation revealed no blockages, but the tests done during the Jan 2007 hospital stay were as follows: ECG returned an inferior infarct, X-rays revealed an enlarged heart, nuclear stress test indicated probable issues with front & back of heart. The doctors also suspect that my sternum hasn't fully healed due to the rocking and crunching that happens when they palpate my chest. One of the cardiologists I saw recommended that I undergo another cardiac cath. I was hesitant due to the complications I had following the surgery - especially since the cardiologists seem unsure of what may be causing my symptoms (and test results) and a general concensus that issues with my sternum could be causing a majority of my problems - ECG and Stress test results notwithstanding.    Due to the differences in opinion on how to proceed, I traveled to another island (I'm in Hawaii) to obtain yet another opinion.  I was advised that I could choose to have a 64 slice CTA scan performed in lieu of another cardiac cath for the time being;  then, if the CTA scan indicates a problem, I could have another cardiac cath performed.  My quandary is that while my insurance will cover a cardiac cath, it will not cover a CTA scan. I would gladly pay for the CTA out of pocket if this will accurately diagnose what is causing the chest pains; however, if I will have to eventually undergo a cardiac cath anyway, I would rather skip the CTA even though I am hesitating to go with another invasive procedure.  Any advice would be appreciated!\n\n",
    "posted_time": "Post  by klasiu » Fri Mar 09, 2007 7:44 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=39422&sid=72990874dfb39110b56b9112dca429bc#p39422"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Coronary artery fistulas",
    "content": "Dear klasiu,   Personally, i don't think that the pain that you have is related to coronary disease, because i don't think it is possible to have coronary artery diseasr develop over this short time period.  However, if your doctor suggested that you get another cardiac cath done based on the available information, i think you should go ahead and get it done, even if you just have it to have the peace of mind.  Every time, you have to have a procedure done of course, you have to weigh the risks and the benefits of the procedure, before deciding whether or not you want the procedure done.  Thank you very much for using our website http://doctorslounge.com and I hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Fri Mar 16, 2007 4:50 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=39651&sid=72990874dfb39110b56b9112dca429bc#p39651"
  },
  {
    "author": "Marceline F, RN  Nurse Posts: 229 Joined: Wed Feb 28, 2007 1:54 am",
    "title": "[no title]",
    "content": "Dear Klasiu,  WOW, seems like you have had more than your share of problems for your young age! There are several things I would like to address from my professional experience. First of all, a heart murmur is a sound. The etiology of the murmur might not be caught for many years, usually until the individual becomes symptomatic, or there develops a need for diagnostics based perhaps on need for health insurance changes or job requirements. It is unfortunate that the surgery you had led to so many post \"complications\". The cardiac tamponade could certainly have contributed to an inferior wall MI. Review of your clinical history perioperatively might reveal that your heart experienced an injury that showed in your later stress test as \"probable issues with front and back of heart\". It is indeed unlikely that new plaque or lesions developed between your initial cath (clean coronaries) and the later chest pain, even though I suppose nothing is totally impossible. It is also remotely posible that surgical scarring could account for some mechanical stenosing of coronary veins and arteries.  Regarding your sternum: The infection in your incision could have contributed to an unstable sternum. Sternal wound infections have been known to end up with complications in the sternum itself. Personally, I doubt that the MD assessments contributed to the problem, the sternum is typically wired together post OHS, and unless you are the unfortunate recipient of CPR, standard palpations do not rock or crunch the chest.  You express a concern about a repeated invasive cardiac catheterization. CTA (computed tomographic angiography) is an excellent method of non-invasively determining existing cardiac vessel disease. Used as an adjunct to other diagnostic tests, it may help you determine need to do another interventional CC. It certainly would be well worth your time to discuss this further with your trusted cardiologist.\n\n",
    "posted_time": "Post  by Marceline F, RN » Sat Mar 17, 2007 12:50 am",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=39653&sid=72990874dfb39110b56b9112dca429bc#p39653"
  },
  {
    "author": "yarak  Guest Posts: 1 Joined: Tue Dec 05, 2006 1:32 pm",
    "title": "PFO and antibiiotic",
    "content": "M, 30, Diagnos: Small hole in heart, top chambers(PFO). Dr said that i don't need surgery. \"leave it alone\".  do i need antibiotic before surgery or dental appointment? i don't take any meds right now.  im a healthy persone thnaks\n\n",
    "posted_time": "Post  by yarak » Tue Dec 05, 2006 1:43 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=35568&sid=72990874dfb39110b56b9112dca429bc#p35568"
  },
  {
    "author": "rachelg  Guest Posts: 2 Joined: Wed Dec 06, 2006 6:34 am  Contact:   Contact rachelg       Yahoo Messenger",
    "title": "PFO and antibiotics",
    "content": "A patent foramen ovale, or PFO, usually originates from before birth as a way to shunt blood a through the heart without passing through the lungs (since they are not needed until birth). This hole usually closes shortly after birth. As many as one in five people have a PFO, but there are no known risk factors associated with the condition. A condition known as Endocarditis would warrant the need for antibiotics before surgery or a dental procedure, however.  Rachel M. Groves, RN\n\n",
    "posted_time": "Post  by rachelg » Sat Dec 09, 2006 5:39 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=35819&sid=72990874dfb39110b56b9112dca429bc#p35819"
  },
  {
    "author": "Dr. A. Madia  Medical Doctor Posts: 207 Joined: Fri Jan 06, 2006 6:50 am Gender: Male Location: India",
    "title": "[no title]",
    "content": "Hi Yarak,  PFO is generally considered a physiologic condition. There are ony two consequences of the same and relatively rare ones at that.  One is paradoxical embolisation , the other is recurrent migrains. None of these conditions require active closure of PFO in all patients.   Endocarditic prophylaxis in PFO is NOT required.  Apurva\n\n",
    "posted_time": "Post  by Dr. A. Madia » Sun Dec 17, 2006 2:44 am",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=36327&sid=72990874dfb39110b56b9112dca429bc#p36327"
  },
  {
    "author": "alien3d  Guest Posts: 2 Joined: Sun May 01, 2005 7:50 am Location: malaysia  Contact:   Contact alien3d       Yahoo Messenger",
    "title": "palpilation",
    "content": "age:26 sex:nale disease:mitral valve prolpased   Last week i totally sob.my heart palpilation unsual.i got into ward and waiting 1 month for echocardiorgram.When i walk  around 50 meter i got exausted and palpilation.I don't what's wrong my body getting 25% more letagic.Is there any food must i avoid?or anything to reduce this sob and palpilation.Last admin hospital 142 s pulse\n\n",
    "posted_time": "Post  by alien3d » Sun May 14, 2006 11:35 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=32669&sid=72990874dfb39110b56b9112dca429bc#p32669"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi alien3d, When symptoms from mitral valve disorders become apparent they may present as fatigue, shortness of breath, palpitations, chest pain, etc., depending on the degree of the prolapse. One particular treatment aimed at reducing symptoms is by the use of medications, beta blockers or calcium channel blockers in people who don't tolerate beta blckers well. As for any dietary measures, reduction of caffiene products may help in decreasing palpitations if these are the results of dietary consumption. Sincerely, Theresa Jones, RN\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Sun Jun 18, 2006 6:26 am",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=33049&sid=72990874dfb39110b56b9112dca429bc#p33049"
  },
  {
    "author": "motherof3  Guest Posts: 19 Joined: Thu Feb 23, 2006 4:45 pm",
    "title": "PFO and Migraine Question",
    "content": "Hello Doctor, I am a 37 year old female, with a history of migraines.  I have just recently had a TTE with Bubble and was found to have a small PFO shunting left to right.  I have done some research on this corelation of PFO and Migraine so deceided to go into a clinical study for PFO closure and was wondering about your knowledge of this procedure coming from a cardiologist view instead of a neurologist's view alone.  Thanks in advance for your input as it means a great deal to me. Janice\n\n",
    "posted_time": "Post  by motherof3 » Mon Mar 20, 2006 4:56 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=32082&sid=72990874dfb39110b56b9112dca429bc#p32082"
  },
  {
    "author": "Dr. A. Madia  Medical Doctor Posts: 207 Joined: Fri Jan 06, 2006 6:50 am Gender: Male Location: India",
    "title": "[no title]",
    "content": "Hi.  The topic is a highly interesting one and equally controversial. The cause of migraine is not clear. Lots of food products are atrributed to be the reason behind it like cheese, chocolate, red wine etc. The theory is that a chemical substance causes abnormal dilatation of brain arteries in susceptible persons.   Some doctors have observed that patients having Atrial septal defects [ASD] with left to right shunts as well as migraine headaches were \"miraculously\" relieved of their migraines after surgical closure of the ASD or PFO.   The theory propunded is that the unknown chemical substance or a small platelet embolus or a gas embolus released from peripheral circulation, could travel to the right atrium and pass thru pumonary circulation, and get metabolised there thus failing to reach the cerebral circulation. However in cases like ASD or PFO, the chemical may cross the atrial septum and thus bypass the pulmonary circulation thereby reaching the brain circulation thus causing migraine.   Then why cant this happen all the time and a situation of continuous migraine result? Because, the shunt generally is left to right and the chemical cant cross the septum and reach left atrium all the time. Only when a person gets to do Valsalva like procedure, thereby raising the right atrial pressure transiently, the crossover to the left atrium can occur.   An article has appeared showing experimentalroof of this theory in Journal of American College of Cardiology in 2005.   A Cardiothoracic  surgeon colleague of mine once told me an interesting anecdote. He did a surgical closure of ASD in a young lady. On discharge he prescribed her some routine antibiotics and other symtomatic medicines. On first followup the lady tells him, that those medicines you gave me for migraine worked miraculously well!! My surgeon friend was confused first, not having given her any treatment for migraine. But then he realised that closing the septal defect had probably cured the lady of her migraines!.  Dr. Apurva Madia.   Reference: 1. J Am Coll Cardiol 2005; 45:489-92.\n\n",
    "posted_time": "Post  by Dr. A. Madia » Fri Mar 24, 2006 6:37 am",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=32152&sid=72990874dfb39110b56b9112dca429bc#p32152"
  },
  {
    "author": "motherof3  Guest Posts: 19 Joined: Thu Feb 23, 2006 4:45 pm",
    "title": "[no title]",
    "content": "Dr. Madia,  Thank you for your reply.  I am sceduled to have mine closed on April 10th in a clinical study that is being conducted here in the United States.  I am very excited to hae this procedure done, but yet am skeptical at the same time as I am sure you can understand.  I have done research and have in fact read the journal that you cited in your post, but what I found most interesting is your collegue that had those results with his patient.  Again, thank you for your reply and calming some fears for me.  i will keep you posted as to my results after the closure as right now I am having on average 7 to 8 migraines a month and I just want my life back.  They are figuring that I have had at least 6 or 7 if not more mini strokes because I have lots of neurological deficits that were originally thought to be MS.  I will be included into the Escape Migraine Clinical Trial here in the States and will keep you posted.  Thanks Again Janice\n\n",
    "posted_time": "Post  by motherof3 » Fri Mar 24, 2006 9:53 am",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=32163&sid=72990874dfb39110b56b9112dca429bc#p32163"
  },
  {
    "author": "cielerella  Guest Posts: 2 Joined: Mon Jul 04, 2005 11:32 pm Location: Springfield, Oregon",
    "title": "Congestive Heart Failure Look-Alike",
    "content": "I'm a 42 year old female. 5'4\", 220lbs.  Sudden onset of these 3 symptoms at same time; Sceptic skin infection at site of hysterectomy scar and under eyes (symetrical), any scratch or cut becomes infected. Infection spots will almost heal but then come back with a vengence, exact same form as before.       Severe pitting edema, from toes to top of thighs. Was in hands too at first, but that became only occasional. Most days couldn't walk.  No diuretics would rid edema, elevation didn't help either. Had for 5 months til doc gave me antihistamine and new antibiotic, then lost 20 lbs of water in 3 days. Back pain in lower left area. Stabbing like knives and grabbing/twisting that took me to my knees. Doc thought CHF. He was sure. But echo and Ekg showed heart fine. Then had kidney echo, showed fine. Blood tests for heart, liver, kidney, and liver, came back fine. Can find nothing wrong. Skin infection still here. Doc took me off antibiotics since they weren't helping. Off antihistamine too. Only diuretics now til bottle runs out, then see if edema comes back. Doc has run out of ideas. I don't want to not know what this was. I had the edema for 5 solid months, lost feeling in some toes - still lost. Whether edema comes back when off diuretic or not, I want to know what this is. And what about skin infection and back pain??? Thanks, Cielerella [/i]\n\n",
    "posted_time": "Post  by cielerella » Mon Jul 04, 2005 11:47 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=16291&sid=72990874dfb39110b56b9112dca429bc#p16291"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi cielerella, During your blood test was there also included a BNP (B-type natriuretic peptide) which aides in the diagnosis of CHF? Have the recurrent skin infections been tested for a resistent bacteria? In my opinion, these are the first two things I would inquire about...... Sincerely, Rntdj\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Tue Jul 05, 2005 5:40 am",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=16304&sid=72990874dfb39110b56b9112dca429bc#p16304"
  },
  {
    "author": "cielerella  Guest Posts: 2 Joined: Mon Jul 04, 2005 11:32 pm Location: Springfield, Oregon",
    "title": "Reply to Rntdj",
    "content": "Rntdj,   Thank you for replying. I don't know if a BNP was in the blood test. My family doc wrote \"Congestive Heart Failure\" in my chart, but the cardiologist said he shouldn't have, because although I show all the symptoms, I just didn't show any signs on the EKG and echo.   My doc has not tested the infection. He only gave me different types of antibiotics.     I get so out of breath, red faced, and sweaty (soaking my hair sweaty) now when I do the slightest exertion (like attempting to clean the kitchen). I can tell that something is wrong still.     Having my feet and legs, up to the top of my thighs, swollen so severely the skin was tight and when there was no more room for water, my feet would take on odd shapes as big bumps were formed to hold the water. For 5 months. I don't know about this, but I would think that that would be HORRIBLE for a person's health, doing irrepairable damage to the feet and legs. Or am I wrong? Do people suffer such severe edema non stop for that kind of length of time with no ill effects? What would cause edema to go on that long?   I will call my doc today and ask him about the BNP test and resistent bacteria, thank you.  Cielerella\n\n",
    "posted_time": "Post  by cielerella » Tue Jul 05, 2005 8:30 am",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=16313&sid=72990874dfb39110b56b9112dca429bc#p16313"
  },
  {
    "author": "kaesmom  Guest Posts: 2 Joined: Mon Mar 07, 2005 6:47 am Location: Junction City, Kansas",
    "title": "Former repair of ASD and VSD and not SVtachardia",
    "content": "I am on the brink of losing my mind. I had a ASD adn a VSD repaired when i was 5 years old. That was back in 1974. SInce then I have had numerous test done for chest pain, ache, etc. Well, i went to see my cardiologist to make sure it would be okay for me to become preg and he wanted to do a nuclear stress test just to make sure there were no problems. It was negative for Ischemia and he said it would be perfectly fine. At twenty weeks pregnant  I was just standing at work talking to someone and my heart started to race. I started to pass out and they called the ambulance but by the time they arrived my heart rate was back to normal and my blood pressure was fine. Well, just three days later it happened again while at home. I was just sitting on a chair. This time the racing would not stop. I went to the emergency room. My heart rate was 217. Right before they gave me the meds to slow it down it went down by itself, but it lasted almost an hour and a half. I went to my doctor the next day and he did a echocardiogram and put me on digoxin. The echo showed no valve issues and at first they had my ejection fraction at 40 percent but he said that could not be correct just by looking at my muscle working. He redid it and got it at 55 percent. I got a call after my cardiologist looked at it and the nurse told me that he said again no valve issues but that they could not get a clear veiw of my atrial wall, or muscle??? He wants to do a transesophageal echo after the baby is born. The tech that did the echo did tell me that it looked like my atrial muscle was not working as hard as it should. I am SCARED to death of dying before my baby is born. I already have a two year old that needs her mommy. The nurse told me that  he wanted to do this procedure to see if after the baby comes but that it SHOULDNT be a problem during my pg. WHAT! I don't have another appt wth him until April 4th. Lately my chest has been hurting and in between my shoulder blades. I don't know what is is but i am scared. Its kinda a strange pain. I cant even discribe it. It is not excrutiating but it is very worrisome. I don't even really know what I am asking. Well one thing,, is the 55 percent EF normal? Should i be concerned? Should I ask for more test? And can anything test wise even be done with my being pg? My baby is due the end of May and I am terrified! Thanks for your time.\n\n",
    "posted_time": "Post  by kaesmom » Mon Mar 07, 2005 7:04 am",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=10510&sid=72990874dfb39110b56b9112dca429bc#p10510"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Former repair of asd and vsd & not sv tachycardia",
    "content": "Dear Kaesmom,  Females of the child bearing age are naturally protected against coronary disease. Having chest pain during pregnancy has to be reported to your physician. Even though most of the times, it is no big deal, yet sometimes it proves to be due to something serious (yet unrelated to coronary disease). Acid reflux disease is not a serious cause but it is a common cause of chest pain in the pregnant females.  There is no need to worry, an ejection fraction of 55% is normal. What the doctor meant that it could wait after pregnancy is that there is no emergency in doing the transesophageal echo now and since it is going to be uncomfortable for you during pregnancy, it is better to wait till after pregnancy and have it done.  The question is why have you had these 2 episodes of svt? What did the ecg that you had in the ed show? i assume that you had all the blood tests needed including a thyroid function test and electrolytes in the blood. You need to have enough sleep and rest. Your history of and asd its correction can be the cause behind the arrhythmias or the arrhythmias can just be primary, meaning due to a cause in the conduction electrical system of the heart itself.  Digoxin is not going to prevent other episodes, it might make the episodes less fast.  If you have another one of these episodes, i suggest that you see an electrophysiologist, a cardiologist specialized in arrhythmias.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.  Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Thu Mar 17, 2005 10:28 am",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=10933&sid=72990874dfb39110b56b9112dca429bc#p10933"
  },
  {
    "author": "kaesmom  Guest Posts: 2 Joined: Mon Mar 07, 2005 6:47 am Location: Junction City, Kansas",
    "title": "thankyou and another question",
    "content": "Thank you SO much for your reply. When seen in the emergency room for my svt they just told me that is what it was. I did go see my cardiologist and have seen him again since I posted the first question to you. He was trying to explain it is terms I can understand and he told me that on my echo it looked like the hole they closed when i was five (the asd) seemed to possibly have a \"little air coming in from under the door\" He is not sure of the extent and that is why he wants to do the transesophageal echo after the baby is born, he told me that it should cause me no issues with the pregnancy. If there is a leak could it cause the SVTs? I asked him if they were preg related and he said he can not be sure at this point. He will know more when he does the procedure. I never had them before. As a matter of fact, the reason I saw him before I was pregnanct was for a SLOW  heart beat! I am so confused. I am also worried that the issue with the asd could cause cardiomyopathy. Can it cause that? ONe more thing,, you said that women in thier child bearing years are protected against coronoary artery disease? So you cant have a heart attack at  my age? Im 34 years old. That always scares me! Both my parents have heart issues and my dad has had two bypasses. My mom has had a heart attack as well. Hers was a blood clot. Anyway, thank you SOO very much for answering my post..  Thanks again Melissa\n\n",
    "posted_time": "Post  by kaesmom » Wed Mar 30, 2005 9:33 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=11627&sid=72990874dfb39110b56b9112dca429bc#p11627"
  },
  {
    "author": "stephy  Guest Posts: 1 Joined: Wed Mar 23, 2005 8:06 pm Location: sarasota",
    "title": "Strong PVC with bending over",
    "content": "Hello Doctor, I have ASD or PFO (they not sure yet). When I bend over to put on shoes or put cake into stove or sit in car or sometimes when trying to deficate. i get what seems to be PVCs like 3 in a row...this started about 3 weeks ago ..now the pvc also come with stress also.1 does having them when i bend or strain mean something like i am developing a problem in my heart..2 is my asd causing this with the pressure change in my heart when i bend or stran or is it unrelated. ( the things that i think are pvc - feel like i have a skipped beat and then like getting punched in the chest (my heart hurts) and it is heard to breath ..i cant talk when they happen...but when they are  gone i feel normal...i had an echo and tee..and besides the asd or pfo..they said slight right heart enlargement due to asd or pfo, but all else is normal.  Thank you.\n\n",
    "posted_time": "Post  by stephy » Wed Mar 23, 2005 8:14 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=11267&sid=72990874dfb39110b56b9112dca429bc#p11267"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Strong pvc with bending over",
    "content": "Dear Stephy,  Besides potential heart causes, extra beats can have other causes including: 1. An overactive thyroid gland. 2. Electrolytes disturbance. 3. Smoking. 4. Drinking alcohol. 5. Drinking too much caffeinated beverages. 6. Not getting enough sleep. 7. Stress.   i would recommend a thyroid blood test and electrolytes. If you smoke or drink alcohol or caffeinated beverages, try to cut down or even stop if you can. Try also to get enough sleep and rest.  These extra beats that you are feeling might as well be premature atrial contractions as much as being ventricular contractions. These might be due the asd/pfo that you have.   The best way to find out is to have a 24 hours heart monitor (called a Holter's monitor) to find out the nature of those beats. Patients with asds can have an atrial arrhythmia called atrial fibrillation. Please, mention these extra beats to your doctor.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.  Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Wed Mar 23, 2005 11:47 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=11279&sid=72990874dfb39110b56b9112dca429bc#p11279"
  },
  {
    "author": "smwalker  Guest Posts: 1 Joined: Tue Jan 18, 2005 8:32 am Location: andalusia alabama",
    "title": "Hereditary female heart problems",
    "content": "My grandmother died in 1990. I do not remember the exact reason but I do remember the doctor telling my mother and uncle that she had an irregular heart beat.I also remember that her cardiologist said that what she had was hereditary and that if it had been \"caught\" when she was younger that it could have been treated differently/better.He also stated that this was passed through the female line and that if we had\"it\" it would show up around our 30's.  My mother does not remember this conversation and says she has no clue what my sisters and I are talking about. I do not know what to tell my doctor other than what I have previousily stated.I am not asking for a diagnosis just maybe a direction to move in. I have a daughter and one of my sisters has 2.We  think about this and wonder if one of them could have the same problem.None of them are close to 30 and they all are healthy.Yet we still wonder if there is \"something\" hiding and  we do not know what to even to begin to ask about.\n\n",
    "posted_time": "Post  by smwalker » Tue Jan 18, 2005 8:50 am",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8267&sid=72990874dfb39110b56b9112dca429bc#p8267"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Hereditary female heart problems",
    "content": "Dear smwalker,  i wish i could help you figure out this puzzle, but unfortunately i can not.  Thank you very much for using our website http://doctorslounge.com   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Wed Jan 19, 2005 2:21 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8329&sid=72990874dfb39110b56b9112dca429bc#p8329"
  },
  {
    "author": "Dickons  Guest Posts: 1 Joined: Fri Mar 18, 2005 5:23 pm Location: Canada",
    "title": "Hereditary female heart problems",
    "content": "I have no idea if this is of any help or would be a logical reason for an irregular heartbeat.  Only a Doctor could answer that and my suggestion is she talk to her Doctor about the possibility of  FMD or Fibromuscular Dysplasia, although it is not only females who get it, it is 3:1.  FMD can present in the heart although it is extremely rare and normally presents in the renal arteries.  Also it generally presents between the 3rd and 5th decade.\n\n",
    "posted_time": "Post  by Dickons » Fri Mar 18, 2005 5:33 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=11038&sid=72990874dfb39110b56b9112dca429bc#p11038"
  },
  {
    "author": "John25  Guest Posts: 2 Joined: Thu Feb 03, 2005 10:43 am Location: tampa",
    "title": "ASD PFO Afib",
    "content": "Hello Dr.  5 '7 130 lb male i have had irregular beats and sortness of breath with acitvity, so i went to a doc he did echo and said i had a small asd (which needs closing) with Lt to RT shunting and a bubble study which showed bad RT to Lt shunting. To confirm they had me do  a TEE which showed a large mobile PFO with bi directional shunting,  i was told i have slight rt heart enlargement, and my dr hears a faint sistoic murmur. i got 3 other opionions and all agree the tee shows PFO. but two said they can see a part of the TEE that suggests a small to mid ASD inadditon to the PFO. But they said it is not clear and i would need another echo focusing on that area. Both said they are sure a better study would show the asd based on the Lt to Rt flow they see.I also had an  event monitor and they found PVC, PAC, PJC, SVT   and A fib (A Fib only comes when i do physical activity like run or lift weights it may come during the running or several hours later). two doctors said they think the afib is related to the hole because it comes with exersice which may change the pressure in the heart and the size of the atriam and affect the electrical stuff inside it. The other two said not related.   1. does faint sistoic murmur heard mean i have asd also or can that be caused by PFO 2. can PFO cause slight rt heart enlargement or is that only caused by ASD 3. are the irregular beats a separate problem or related to the PFO/ ASD 4. how can i have an echo and tee and still need another echo per those two other Congenital heart desease Doctors. Is it possible that no one other than Congenital heart doctors not know how to perform good echos to look for ASD's. 5. I saw an electrical guy for the irrgular beats and he looked at the monitor results for  a few seconds and said try troprol xl and if that doesnt work try another drug that could cause more irregular beats and go from there...what is the standard process for trying to solve irregular beats...should they look more at the monitor results or do more test..before they  just say take this drug 6. Not sure what my next step should be...should i close the hole and hope it stops the afib. should i take the beta blockers and hope it stops the afib which only occurs when i run or should i go get yet another echo to see if i have an asd also?  thanks so much!!!\n\n",
    "posted_time": "Post  by John25 » Thu Feb 03, 2005 11:27 am",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8886&sid=72990874dfb39110b56b9112dca429bc#p8886"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: asd, pfo, atrial fibrillation",
    "content": "Dear John,  To answer your questions. 1. Murmurs are sounds heard due to disturbance in blood flow. Systolic murmurs are not related to the asd/pfo perse because the disturbance in flow caused by the pfo/asd is very small to be heard, but murmurs can be heard due to increase flow across the pulmonary or tricuspid valves. 2. A pfo probably does not have significant hemodynamic effects on the heart. 3. Most probably the irregular heart beats that you have are related to the asd/pfo. 4. Transthoracic echos are usually done by echo techs and interpreted by cardiologist. On the other hand, tee is done by the cardiologists themselves. There are experienced echocardiographers and more experienced echocardiographers, sometimes, what one can find is not going to be the same as someone else. So, if both of them recommend having a tee, i would suggest that you think about having one done. However, they both said that most probably, according to other findings on the tee, they suspect that you have an asd, so why repeat it, i will leave you to discuss this with your doctors. 5. The best way to treat arrhythmias is to try and find a cause for it, if a cause can be found, then treat the cause and hopefully the arrhythmias will go away. If not, then depending on the type of arrhythmias, treatment is given accordingly using certain medications. Each doctor sees what is best for each patient and then prescribes the medicine he/she thinks is going to take care of this patient's particular problem. If this drug does not work (happens all the time), then patient is switched to another medication and so forth. 6. Personally, i think that since you are becoming symptomatic, the best way to go is to close this asd sooner rather than later, because eventually, it will need to be closed.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Tue Feb 08, 2005 2:24 am",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=9053&sid=72990874dfb39110b56b9112dca429bc#p9053"
  },
  {
    "author": "John25  Guest Posts: 2 Joined: Thu Feb 03, 2005 10:43 am Location: tampa",
    "title": "[no title]",
    "content": "thank you !!!!\n\n",
    "posted_time": "Post  by John25 » Tue Feb 08, 2005 6:15 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=9078&sid=72990874dfb39110b56b9112dca429bc#p9078"
  },
  {
    "author": "Sierra5492  Guest Posts: 1 Joined: Mon Nov 08, 2004 9:02 am Location: Cornelius",
    "title": "Arterio Ventricular Malformation",
    "content": "My Husband has been having many issues that I am very concerned about. He was diagnosed with an AV(ArterioVentricular) Malformation in the military,which when he was first diagnosed it was because he was having frequent hemoptysis. He had many different procedures done to diagnose his condition.    He has recently been experiencing these symptoms:  1.\tTired all the time 2.\tNo Energy. 3.\tVery irritable. 5.\tSevere headache left side with numbness, swelling, pain and tingling going down left arm. Hand turns colors. Disorientation occurs and has a hard time concentrating and focusing on what I am saying to him. Sometimes happens on Right side. Episodes last anywhere from 15 to 45 minutes then subsides. In the past 6 months have had about 4 or 5 episodes. The last one was about a month ago. 6.\tFrequent headaches that occur almost on a daily basis. I take between 4 and 6 Ibuprofen. The Ibuprofen only takes away the headache for a couple of hours and then the headache comes back.  7.\tChest pains when under a lot of work related stress.  Yesterday was particularly bad in that he had those symptoms off and on all day and as of last night the episode lasted more than an hour.   Any insight would be helpful.  He is having an MRI/ MRA today which hopefully will tell us more.   I have heard that when a person is diagnosed with having AV Malformations that there are usually more than one?\n\n",
    "posted_time": "Post  by Sierra5492 » Mon Nov 08, 2004 9:30 am",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6345&sid=72990874dfb39110b56b9112dca429bc#p6345"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: a-v malformations",
    "content": "Dear Ms. Tieman,  If a person has a-v malformation in one place. There is a high possibility that he/she has them in other palces of his body as well.  The symptoms that your husband is experiencing could be related to an intracranial a-v malformation.  i hope that the mri/mra that you are referring to is an mri/mra of the head/neck and brain circulation and this is a very good step in the right direction.  Update us with the results.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.  Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Thu Nov 18, 2004 11:44 am",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6515&sid=72990874dfb39110b56b9112dca429bc#p6515"
  },
  {
    "author": "friend833  Guest Posts: 1 Joined: Wed Oct 27, 2004 6:52 pm Location: Manitoba Canada  Contact:   Contact friend833       Website   Yahoo Messenger",
    "title": "Tingling in left arm and left leg",
    "content": "also feeling of swelling of fingers toes and left lower lip. Had MRI done showed I had a posibble mini stroke. Saw a neuroligist he said it is Migraines when I have this problem even though I don't have a headache. I have done some checking and nowhere can I find that a migraine does not mean headache. I have had problems with migraines before so I think he is realating this to them. The emergency Doc I seen had suggested it is MS. My family doc said it was a mini stroke. Know I'm wondering should I get a second opinion. The neuroligist said the MRI  I had showing a mini stroke doesn't mean anything he could pull ten people off the street do a MRI and they would have the same results. What should I do?  Thanks\n\n",
    "posted_time": "Post  by friend833 » Wed Oct 27, 2004 7:03 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6126&sid=72990874dfb39110b56b9112dca429bc#p6126"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Tingling in left arm and left leg",
    "content": "Dear Friend833,  If this was multiple sclerosis, it would have appeared on the mri as it has a certain appearance. If you are still worried about this being ms, there are other investigations such as a spinal tap to get some of the fluid around the spinal cord to analyse it.  There are also other investigations that the neurlogist is more familiar with them than i am. Also, i can not really interpret the results of the mri because a neurologist sees far more mri than i do.  A pattern similar to the one that you have on the mri can be seen in cases of inflammation of the small arteries and blood vessels (condition known as vasculitis), there are also certain investigations that can be done to detect the presence of such condition.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.  Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Wed Nov 17, 2004 7:20 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6502&sid=72990874dfb39110b56b9112dca429bc#p6502"
  },
  {
    "author": "JRaley  Guest Posts: 1 Joined: Sun Oct 24, 2004 7:53 pm Location: Kentucky",
    "title": "ASD? vague heart murmur",
    "content": "I am a med student, which seems to predispose me to hypochondria; however, I was diagnosed with a \"heart murmur\" at birth.  I am from a rural area and few tests if any were done because I was asymptomatic.  Now that I am in medical school I can tell you that I have a systolic heart murmur, am still asymptomatic, and am an avid fitness person.  When I palpate my heart I can feel it beating very strong in my chest, but I am very lean, thin, and fit.  Occassionally my heart beat is irregular just as every other person in my family.  It never rasies and I can't say that I have ever had chest pain.  two years ago I had a curbside echo done upon a surgeon friend's suggestion.  My questions are these: 1. should I be worried?, 2. what about the strong pmi and palpability in several areas?, 3. echo was \"normal\", but I never met the cardiologist, if you saw my echo without seeing me would you be confident in it?  I appreciate your time.  JR\n\n",
    "posted_time": "Post  by JRaley » Sun Oct 24, 2004 8:05 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6051&sid=72990874dfb39110b56b9112dca429bc#p6051"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: asd? Vague heart murmur",
    "content": "Dear jRaley,  Atrial septal defects don't produce murmurs, it's ventricular septal defects actually that cause a systolic murmur. Other conditions that might cause a systolic murmur in young age is hypertrophic cardiomyopathy and congenital aortic and pulmonary stenosis.  Since the echocardiogram did not show any of these conditions which are readily identifiable in most of the cases, then you don't have them.  My recommendation is for you to be seen by a health care professional to decide the exact nature of the murmur.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.  Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Wed Nov 17, 2004 5:26 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6500&sid=72990874dfb39110b56b9112dca429bc#p6500"
  },
  {
    "author": "Maree Stebbings  Guest Posts: 4 Joined: Tue Aug 10, 2004 6:55 am Location: Australia",
    "title": "My six year old son has Patent Ductus Arteriosus",
    "content": "Hello  I'm just wanting to know about patent ductus arteriousus. My son was born with this defect and VSD he was 10 days overdue and weighed 9pounds 9ounces. He was last reveiwed at 3 years old and the VSD had closed but he still had the PDA I was told it would probably close on it's own but just recently I had him at the GP and the hospital and two different doctors picked up his murmur - neither time he had a fever. Should he be reassessed I have no idea about this I feel like I was packed off last time and told not to worry, but I do. He is small for his age he started large but didn't grow very well for a long time his growth picked up a bit when the VSD closed but he is still alot smaller than the children in his class he is now 61/2 yrs old. What should I do? There was a letter apparently sent to a pediatric cardiologist but this was a couple of months ago and I've heard nothing.\n\n",
    "posted_time": "Post  by Maree Stebbings » Tue Aug 10, 2004 7:12 am",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=4489&sid=72990874dfb39110b56b9112dca429bc#p4489"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: My six year old son",
    "content": "Dear Maree,  i don't think that at this time, the patent ductus is going to close spontaneously. Most authorities on congential heart disease say that patent ductus arteriosus is less likely to close in full term babies an it has been six ears now.   The negative health effects of the patent ductus arteriosus depends on its size, if large with high flow, it can lead to heart failure and pulmonary hypertension.  Your son has to go to a pediatric cardiologist and followed up on regular basis if the patent ductus arteriosus is deemed small enough to be left alone and not closed surgically. In this case, the ductus is usually very small and the flow across it is small and does not cause any problems. In your son's case, since he has a murmur (even if his ductus is small enough not to be treated), there is a higher chance to develep an infection in the ductus. So, antibiotics have to be given in certain situations like when he goes to his dentist.  Your son's patent ductus arteriosus has to be evaluated and then the decision on whether to close it or to follow it up will be upto to his cardiologist according to what the evaluation will show, but i would urge you to take him in.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Tue Aug 10, 2004 8:23 am",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=4491&sid=72990874dfb39110b56b9112dca429bc#p4491"
  },
  {
    "author": "Maree Stebbings  Guest Posts: 4 Joined: Tue Aug 10, 2004 6:55 am Location: Australia",
    "title": "[no title]",
    "content": "thank you so much for your speedy reply I really appreciate it. He is going to have his tonsils out does he need to do anything before this? I am trying to get him into the pediatric cardiologist at the moment\n\n",
    "posted_time": "Post  by Maree Stebbings » Tue Aug 10, 2004 7:14 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=4503&sid=72990874dfb39110b56b9112dca429bc#p4503"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: My six year old son",
    "content": "Dear Maree,  The surgeon and the anesthesist have to be aware of his condition and he has to get antibiotics for prophylaxis against infection of the ductus.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Tue Aug 10, 2004 7:47 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=4508&sid=72990874dfb39110b56b9112dca429bc#p4508"
  },
  {
    "author": "Bailey5  Guest Posts: 3 Joined: Wed Jan 21, 2004 4:58 pm Location: Texas",
    "title": "Heart Failure in ACHD",
    "content": "Hubby is 30, born with D-TGA with large VSD now has SPH. (he has Eisenmengers).He is now on Coreg for Heart Failure. Is there anything else that can be done or is this the last result before Heart/lung transplant?\n\n",
    "posted_time": "Post  by Bailey5 » Wed Jan 21, 2004 5:00 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2238&sid=72990874dfb39110b56b9112dca429bc#p2238"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Heart failure in adult congenital heart disease",
    "content": "Dear Kim,  In addition to the coreg, i hope that he has been taking the other usual medications prescribed for heart failure.  There are certain clinical trials with a certain prostaglandin but is given in cases of primary pulmonary hypertension and i have not heard that it was tried in secondary pulmonary hypertension.  In your husband's case, i think, the next step is heart/lung transplantation.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Wed Jan 28, 2004 8:58 am",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2307&sid=72990874dfb39110b56b9112dca429bc#p2307"
  },
  {
    "author": "BeccaSue1975  Guest Posts: 1 Joined: Wed Dec 03, 2003 4:09 pm Location: South Florida  Contact:   Contact BeccaSue1975       AOL",
    "title": "VSD has enlarged",
    "content": "[color=blue][/color]Hi    My name is Rebecca. I am a 28 year old female. I was born with a large VSD. The VSD was never repaired as it closed significantly, on it's own. In 1996 the VSD was found to be 1mm in diameter. I had not had an echo since the one in 1996. This October I had an echo done and the hole had increased in size from 1mm to 1.5cm. I am sheduled for a TEE next week. I am nervous about this whole thing. I am currious to know some kind of statistics on adults who have VSD's that increase in size. I haven't been able to find any information on what would cause this enlargement or what the results of the hole getting larger can have on my body. Am I going to just drop dead? I have 3 very young children and I would of course like to live a long life. I would so appreciate any information that can be provided in regards to this situation. Thanks in advance, Rebecca S. Gay\n\n",
    "posted_time": "Post  by BeccaSue1975 » Wed Dec 03, 2003 4:17 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1809&sid=72990874dfb39110b56b9112dca429bc#p1809"
  },
  {
    "author": "sisohel  Guest Posts: 26 Joined: Tue Mar 18, 2003 10:46 am Location: Dhaka Bangladesh  Contact:   Contact sisohel       Website   Yahoo Messenger",
    "title": "[no title]",
    "content": "Dear Rebeca, It is quiet natural for a VSD to enlarge during adulthood and you are not going to die of it. All you need is a quick repair of the defect by a cardiac surgeon soon. Regards,\n\n",
    "posted_time": "Post  by sisohel » Mon Dec 22, 2003 2:08 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1979&sid=72990874dfb39110b56b9112dca429bc#p1979"
  },
  {
    "author": "sally  Guest Posts: 2 Joined: Thu Sep 25, 2003 1:28 pm",
    "title": "Finding new heart defects",
    "content": "Hi and thanks for the forum.  I will be 50 in a few months, having had surgery for TOF and PDA as a teen. I had an ablation (RVOT) in 2000. My last cath was about 2 years ago at which time they found a small apical  diverticulum in the left ventricle. From what I understand, this is not very common and I am not getting much information about it and it wasn't even talked about by my cardiologist at the time. I did read though, that diverticulums are often mis-read and may be aneurysms instead. How would I know this? My main concern is why hasn't this been seen ever before throughout all my caths and procedures and echoes? Is it just that the equipment was better with this hosp's cath lab? Could this NOT be congenital and just develop over my lifetime? Would this mean it's more aneurysm than diverticulum? May this enlarge or rupture and SHOULD it be a concern and be treated? Is this a common finding along with my TOF and PDA and bicuspid aortic valve? I also some has secondary pulmonary hypertension but am not treated for this. I feel ok when just sitting but often get very SOB with minor exertion; last echo was beginning of 2003 (prior to AICD placement for syncope and V-tach) and nothing was new or of concern, although this left ventricular diverticulum was only mentioned once and that was in the cath they did in 1/02. Sorry for the round-about questions! I feel like I would totally bother my cardiologist (a pediatric one) because he is so exceptionally busy with the sick children and I am one of the healthiest TOF's around!!  I just don't want to be stupid or neglecting something if I can get ahead of it. Thank you SO much for any information you can provide!!\n\n",
    "posted_time": "Post  by sally » Thu Sep 25, 2003 1:41 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1370&sid=72990874dfb39110b56b9112dca429bc#p1370"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Finding new heart defects",
    "content": "Dear Sally,  Thank you very much for using our website.  A left ventricular diverticulum is a very rare condition. It is usually associated with congenital heart disease. Since they are usually asymptomatic, if they islolated (not associated with congenital heart disease) sometimes they are discovered late in life.  There are two types of diverticula, the first type is formed of the three layers of the heart. The second is formed of fibrous tissue mainly. They could be differentiated based on the fact that the first type contains heart muscle fibers and usually contracts as the heart and this should be obvious whether during echo or cath.  Their complication include rupture and thrombus formation and embolization. Rupture is more common with the second type (firbous tissue type), however.  There is no consensus agreement or guidelines to treat those.  The difference between an aneurysm and a diverticulum is the size of the communication with the heart. In case of aneurysms the communication is wide while with diverticula the communication is small. i guess if you had an aneurysm they would have called it an aneurysm. However, in the second type of diverticula, the connection with the ventricle is wide. Usually the first type arises from the apex while the second may arise from both the apex and of the base of the ventricle  In your condition, i can not answer the questions that you have about why it was not discovered before or why no one talked to you about.  Personally, i would assume that the diverticulum was not there since first you had an open heart surgery to correct your congenital heart disease and if it was there i would assume that they would have taken care of it then. Could have it been missed? i guess it could. Second, you had several caths before and it was not there and it should be obvious on them. You can have all your caths films reviewed if you like.  Does it make any difference if you find out whether you had before or developped it recently?   Yes, and this is because from your history you had v-tach and you had to have an aicd placed.   What is the importance? This diverticulum could be the cause of the v-tach after all. And the next question would be is removing the diverticulum going to solve the v-tach problem? Could be, but you are going to need the aicd after all so why take the risk of surgery?  My suggestion is that you should have this diverticulum followed by echocardiogram at least every year to see if it is getting larger.  Once more, thank you very much for using our website http://doctorslounge.com and i hope that this information helped.  Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Sat Oct 11, 2003 12:28 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1422&sid=72990874dfb39110b56b9112dca429bc#p1422"
  },
  {
    "author": "sally  Guest Posts: 2 Joined: Thu Sep 25, 2003 1:28 pm",
    "title": "[no title]",
    "content": "Doctor, thank you so much for your great reply and for making so much sense for me! I'm sorry so do this but I have an additional question pertaining to this: If this LV Divertic. was just discovered and described during my last cath, and it was not mentioned on the echo I had some months later, how can I follow the size of it with echo? Do you think the person who did the last echo (the one directly prior to insertion of AICD) perhaps didn't see it or think it was anything because it's a rare thing and was not looking for it - and should I have mentioned it beforehand - ? In other words, do I have to have caths to follow it or do you think echoes in the future - as long as people know it exists - will be ok to follow the growth of the diverticulum?  Also, what is your opinion of adults with congenital heart disease seeing pediatric cardiologists? I have heard differing opinions from everyday folks saying pediatric docs are more familiar with the configuration/anatomy of congenital heart disease but they are unable to think of the future heart things we all may get in addition to our prior existing heart conditions like needing valve replacements, etc. Also, if I have a bicuspid aortic valve that is mild-moderately leaking, when should it be repaired - if ever? ....Should one go out of their way to a large \"Center\" like UCLA or Mayo who has both pediatric and adult cardio's on staff and who work as a team?  Thanks again very much for this forum and for your help. We are so happy to have answers.\n\n",
    "posted_time": "Post  by sally » Wed Oct 15, 2003 10:42 am",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1447&sid=72990874dfb39110b56b9112dca429bc#p1447"
  },
  {
    "author": "vickisun  Guest Posts: 1 Joined: Wed Jun 04, 2003 11:54 am",
    "title": "PFO and TEE",
    "content": "March 9, 2003 my 30 yr old son had a stroke.  A TEE was performed and 2 doctors saw the PFO and what they think is a Fibroelastoma.  My son has recovered totally from the stroke and is currently on Coumaden.  A second TEE was performed yesterday by a different doctor and he didn't see the PFO at all nor the fibroelastoma.  The doctor said that my son may not need open heart now.  He is going to discuss it with the hospital heart board and get back to us.  I said, but how could there not be a PFO now when there was one before.  He said PFO's often do this.  I cannot find any info on this subject of seeing a PFO one time and not seeing another time doing a TEE.  We have to wait over a week to get more information so I thought you could help me. Thank You, Vicki\n\n",
    "posted_time": "Post  by vickisun » Wed Jun 04, 2003 12:00 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=874&sid=72990874dfb39110b56b9112dca429bc#p874"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: pfo and tee",
    "content": "Dear Vicki,  Thank you very much for using our website.  A pfo is an unlcosed connection between the right and left sides of the heart.  A pfo is usually discovered when a something called a \"contrast tee or the bubble test\" is done and this is usually done by using agitated fluid that when injected into the veins appears in the right side of the heart as bubbles.   Normally, bubbles this size should not pass to the left side of the heart through the lungs and can not pass to the left side spontaneously because normally there is no connection between the two. If a certain number of the bubbles appears in the left side of the heart this usually suggests the presence of a pfo. Some pfos allow blood to pass all the time. Some allow the blood to pass only if the pressure in the right side of the heart is higher than the left and this happens when a person coughs, sneezes, strains, blows his nose, etc...  And some allow the bloos to pass sometimes without high pressure and sometimes with high pressure.   A color dopler can also be used during tee to identify the pfo if big enough.   Tee and many other procedures depend on the operator. If a different operator is the one that did the tee in the 2nd time this could be the cause in not seeing the pfo. Or if the bubble test was not performed or if your son was not asked to strain during injection of the fluid to increase the pressure in the right side of the heart.  About the fibroelastoma, on which side of the heart was it identified, right or left? and how big it was? i can not tell for sure and i am not really sure if anybody can really tell if a mass that was identified on tee is a certain tumour and this tumour is a fibroelastoma. Most of the people would say that this is a mass. It could be a blood clot although a blood clot has different characteristics than tumours and usually easily identified as a blood clot and a tumour is usually said to a tumour and most probably a tumour of this or that kind.   Disappearance of a mass from an echo means either it was there and then went away or was not there from the begining and i can not be the judge of that. But if it was there and then disappeared then the diagnosis of a fibroelastoma i think at that time should be doubted and another diagnsois considered.  If there is any doubt about the absence or the presence of a mass in the heart and what it is,  i think the best choice is to go for an mri of the heart and i think this will be a little bit hard because there are not so many radiologists out there that could really read one.  Once more, thank you very much for using our website http://doctorslounge.com and i hope that this information helped.  Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Sun Jun 08, 2003 10:31 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=906&sid=72990874dfb39110b56b9112dca429bc#p906"
  },
  {
    "author": "jamie howden",
    "title": "patent ductus arteriousus",
    "content": "I have just recintly found this subject very intersting,because my gilfriend had this operation carried on the patent ductus arterious when she was 3 years of age.I would there for like to no a few questons if possible on this subject .should she have any health checks regulary and if i see a pulse beating  in the neck is this any thing to worry about.Can this be passed down .\n\n",
    "posted_time": "Post  by jamie howden » Wed May 21, 2003 12:47 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=771&sid=72990874dfb39110b56b9112dca429bc#p771"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Patent ductus arteriousus",
    "content": "Dear Jamie,  Surgery at 3 years of age for patent ductus should be curable and most probably she has had lots of follow-up before they decided to let her be. So, there is no need to worry form this side.  About whether patent ductus can be passed or not. i do not think it is an inherited disease if this is what you mean. However, congenital heart diseases (including patent ductus) are quite common in the general population and they happen to people who do not have a history of congenital heart disease in the family.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.  Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Wed May 21, 2003 10:16 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=773&sid=72990874dfb39110b56b9112dca429bc#p773"
  },
  {
    "author": "Sister",
    "title": "Patent Ductus Arteriousus confusion",
    "content": "My brother was recently told by his doctor that he needed to go get an echocardiogram done to look at his heart because she heard, what she thought was, a heart murmur. When we got  the results back, we were told its a type of patent ductus arteriosus. I was researching this heart problem and it is constantly referred to as during the infantcy stage of life, not a thirteen year olds. What will he need done to his heart? Why didn't the doctor detect the heart murmur before?\n\n",
    "posted_time": "Post  by Sister » Sat Dec 28, 2002 7:07 am",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=78&sid=72990874dfb39110b56b9112dca429bc#p78"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Patent ductus arteriosus confusion",
    "content": "Dear guest,   Thank you very much for using our website.   Patent ductus arteriosus is a connection that is present betweer the 2 major blood vessels that arise from the heart, the aorta and the pulmonary artery. It is present normally in the fetus. It should close after delivery, if it does not, then the patient will have a patent ductus arteriosus.   If the patent ductus arteriosus is small, there will be no sypmtoms and could sometimes go undetected.   I am not sure why your brother went and saw the doctor to begin with unless it was just a regular follow-up.   What should be done depends on the size of the patent ductus arteriosus and whether there is a possibility that it will pose a threat of heart failure or not. There is also a possibilty (although rare in small ducts), that the patent ductus arteriosus could get infected and cause serious problems.   i think your brother should see a cardiologist and at age thirteen i think it would be a good idea to see a pediatric cardiologist first.   At that point, most probably they will go with cardiac catheterization to do initial evaluation and then decide which way to go.   Important is to tell the dentist of your brother that he was diagnosed with patent ductus arteriosus and that he will antibiotics for some of the procedures that might be done.   Treatment options include:  1. Closure through catheter.  2. Surgery.   Once more thank you very much for using our website http://doctorslounge.com and if you still have any concerns or questions do not hesitate to post them.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Sun Feb 09, 2003 9:44 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=305&sid=72990874dfb39110b56b9112dca429bc#p305"
  },
  {
    "author": "salah  Guest Posts: 1 Joined: Tue Jan 14, 2003 12:39 pm",
    "title": "Dilated cardiomyopathy in infancy",
    "content": "Hello, I have a case with cardiac problem 2 years old male child presented with shortness of the breath for 2 month duration induced by infleunza on examination he is anemic normochromic normocytic cornial opacity of left eye ecchocardiogram reveals dilated cardiomyopathy, MP he is on digoxin partialy improved please guide us what shall we do next? Thank you  Dr salah erbil 14-1-2003\n\n",
    "posted_time": "Post  by salah » Tue Jan 14, 2003 12:55 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=134&sid=72990874dfb39110b56b9112dca429bc#p134"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: cardiomyopathy",
    "content": "Dear Dr. Salah,  Thank you very much for using our webstie.  i am not a pediatrician but i think congestive heart failure is treated the same way as it is treated in adults.  In adults, the standard regimen consitsts of: 1. Angiotensin converting enzyme inhibitors: captopril, lisinopril, etc... 2. Diuretics:           A. Lasix: In cases of volume overload.           B. Spironolactone: In resistant cases. 3. Digoxin. 4. Beta-blockers in the form of carvedilol in cases where the patient does not have florid heart failure. It takes a while for the patient to improve but it has been shown to decrease mortality and improve the cardiac function as well. 5. Treatment of the cause if not idiopathic.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped and if you still have any more concerns or questions, please, so not hesitate to post them.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Tue Jan 14, 2003 11:57 pm",
    "category": "Cardiology",
    "sub_category": "Congenital Heart Disease in Adults",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=135&sid=72990874dfb39110b56b9112dca429bc#p135"
  }
]