[
  {
    "author": "Teacher7  Guest Posts: 1 Joined: Tue Jul 06, 2010 11:52 am Gender: Male",
    "title": "In foramina impingement",
    "content": "I am a 59 year-old male in excellent health as per recent physical. I backpack 17 miles/week. In April, I slipped from a sitting position and slightly bumped the back of my head. I have had stiff aching pain on the right back of my neck ever since. Biggest issue is when I turn in my sleep. Chiropractor worked on this for 3 weeks with little help Stated that a muscle in there was 'in spasm'. Doctor took X-rays. Conclusion: \"Multilevel disk space reduction...anterior and lateral osteophytes...Inforamina impingement bilateral and most severe at C-3, C-5 levels on right...caused by osteophytes from uncovertebral joints and facet joints...severe degenerative changes are present...no evidence of injury is noted.\"  Does this ever heal or improve?  Do I seek surgery or just take painkillers from now on?  Why did I never have any trace of pain before I slipped?  Do I stop backpacking?  My doctor simply gave me no instruction.\n\n",
    "posted_time": "Post  by Teacher7 » Tue Jul 06, 2010 12:14 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=96220&sid=6f34443d29ecb8ba7c519979dcede7af#p96220"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: In foramina impingement",
    "content": "Hello, The findings on x-ray suggest long term development of spurring, disc space narrowing and in general \"degenerative changes\".  The slip and bump on the back of the head did not cause the bony neck issues.  The bump may have set off a spell of muscle spasm and arthritis in the neck.   Surgery should be an option of last resort unless the nerves exited the cervical vertebrae are being damaged severely by the spurs.  In this case, surgery may be required.  Check with a neurosurgeon or physiatrist regarding proper nerve testing.  Take care.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Thu Sep 30, 2010 7:48 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=102334&sid=6f34443d29ecb8ba7c519979dcede7af#p102334"
  },
  {
    "author": "JYJCY  Guest Posts: 1 Joined: Tue Jul 06, 2010 5:54 pm Gender: Female",
    "title": "Spinal Arthritis",
    "content": "I have suffered from back pain for a number of years. One doctor said I had muscle strain, one PA said the same thing and the military PA couldn't be bothered. I went to a nurse practicianer that listened (finally) to me and ordered an Xray.  This is the results:   AP and lateral views of the thoracic spine were performed demonstrating thoracic curvature convex to the right with the findings consistant with a mild degree of scoliosis but no acute fracture or subluxation. There is mild disc space narrowing and osteophyte formation in the lower thoracic spine between T6-7 and T12-L1  AP and lateral views were perfomed demonstrating multilevel disc space narrowing and osteophyte formation throughtout the lumbar spine most notably at L5-S1 with no acute fracture or subluxation. The S1 joints are notable for mild bilateral S1 joint sclerosis.  My main malfunction is numbness around the area of T6-7.(Had to look that up too.) Sitting too long hurts my back, standing to long hurts my back, and I can't lie on my back. Put it this way, a good day is when my back is numb.  My mother has scoliosis so I know what that is.   The nurse practitioner said I had arthritis. I had to look up a lot of words to figure out what the results said.   I was original put on 800mg of ibuprophen and 750mg of Ruboxin. Since the xrays I was put on 750mg of Methocarbamol and 50mg of Tramadol.   I really hate taking pills.  My question is: Are these drugs very effective for my condition. I just took my first Tramadol and only feel slightly weird. \"I hate weird.\"\n\n",
    "posted_time": "Post  by JYJCY » Tue Jul 06, 2010 7:00 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=96258&sid=6f34443d29ecb8ba7c519979dcede7af#p96258"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: Spinal Arthritis",
    "content": "Hello, From an x-ray point of view, the findings in your spine are minimal and I agree with the general diagnosis of arthritis.  Mild scoliosis is also noted. You may consider adding physical therapy to your treatment for pain relief and to improve function including sleep.  The meds prescribed are relatively safe with low side effect profile.  None are classified as narcotics which should be avoided in the treatment of long term/chronic back pain. All in all, it seems your treatment plan is on the right track - just add some rehabilitation for a month or so then continue with home exercise program.  Take care.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Thu Sep 30, 2010 7:42 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=102333&sid=6f34443d29ecb8ba7c519979dcede7af#p102333"
  },
  {
    "author": "brew  Guest Posts: 1 Joined: Tue Jun 29, 2010 8:20 pm Gender: Female",
    "title": "chondromalcia Patella; treatments",
    "content": "What are the best treatments for Chondromalcia Patella? I've tried physical therapy and exercises but it only worsens the pain. It's getting to the point that I can barelly walk without my knees swelling an throbbing with pain. What do I do? Is surgery the next best option?\n\n",
    "posted_time": "Post  by brew » Tue Jun 29, 2010 8:42 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=95570&sid=6f34443d29ecb8ba7c519979dcede7af#p95570"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: chondromalcia Patella; treatments",
    "content": "Hello, In severe cases, the patella surface can be resurfaced with a prosthesis or by allograft (osteochondral allograft).   Also, if the lateral retinaculum is tight and causing chronic dislocation or subluxation, a release of this tight tissue can be done.   Otherwise conservative treatment focuses on maintain range of motion, quadricep strength and hamstring length, bracing and NSAIDs (to decrease inflammation).  Take care.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Fri Jul 09, 2010 1:31 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=96554&sid=6f34443d29ecb8ba7c519979dcede7af#p96554"
  },
  {
    "author": "outback_jack  Guest Posts: 5 Joined: Tue Nov 11, 2008 1:30 am Gender: Male",
    "title": "Supplements for osteoarthritis?",
    "content": "Hi,  About a year ago I started suffering continuous chronic pain around the left groin area, X-rays indeed eventually confirmed the onset of osteoarthritis of the left hip (I was only 37).  Been trying to combat this thing agressively, heat-pads/creams/pain-killers have been controlling the pain, but unfortunately they're not doing anything about the underlying disease.  The pain seems to wax and wan over a cycle of weeks, my condition seems stable at the moment - after 1 year its still relatively mild- but  there's still a gradual detoriation going on.  I investigated supplements, but the studies on glucosamine chondroitin are disapponing and unconvincing, I don't think the supplement is of any use.    I eventually opted for the same supplements that would be used for osteoporosis - the follwing supplement combo:  Calcium, Vitamin D, Magnesium and Boron.    Boron is particularly intriguing, studies show a strong correlation between soil levels of Boron and incidence of oseto-arthritis.  Unfortunately, there is not yet clear evidence for this supplement combo either - I wondered what the medical opinion on this supplement combo is?  A recent study has found that a known drug for osteoporosis (PTH - Parathyroid hormone) could stop and actually reverse cartilage loss in osteoarthritis.  If confirmed this would be a huge breakthrough, it would be first ever drug shown to definitely stop and reverse cartilage loss.  Any opinions of this?  Link to news report below:  http://www.news-medical.net/news/200909 ... ritis.aspx   Note that the 4 supplements I mentioned (Calcium, Vitamin D, Magnesium and Boron) are known to be intimately connected to PTH levels, which is (weak) evidence that they could be effective against osteo-arthritis.\n\n",
    "posted_time": "Post  by outback_jack » Tue Nov 17, 2009 12:16 am",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=87143&sid=6f34443d29ecb8ba7c519979dcede7af#p87143"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: Supplements for osteoarthritis?",
    "content": "Hi, Osteoarthritis(OA) is not an exclusive disorder of articular cartilage of joints. Almost all components of an involved joint are adversely affected by OA (including the peri-articular bone, synovial lining, adjacent connective tissue elements and muscles).  The pathogenesis of osteoarthritis is not well understood (as is the disease progression and origin of pain).  Hereditary / mechanical factors and the effects of ageing seem to be the central underlying factors.Role of cytokines is still being elucidated.  Apart from these, other factors have been shown to affect the progression of OA, including obesity, associated intra-articular crystal deposition,the presence of polyarticular disease,joint instability / malalignment, peripheral neuropathy and muscle weakness.  At present there is no single, proven effective treatment which takes care of the onset, progression and pain of OA. The supplements you mention are extensively talked about but remain largely of unproven benefit.  The link you have provided is an isolated study and is surely 'interesting'. More studies may be needed to corraborate these observations. Best wishes!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Thu Dec 10, 2009 1:49 am",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=88638&sid=6f34443d29ecb8ba7c519979dcede7af#p88638"
  },
  {
    "author": "afoster  Guest Posts: 1 Joined: Sat Mar 01, 2008 4:05 am Gender: Female",
    "title": "Diagnosed with Spondylolsis",
    "content": "Hello.  I was in a 4 car (including mine) accident in October.  I was banged around 3 different times, once hard enough to knock a drive shaft completely out of a truck.  I went to the ER and after several tests, was diagnosed with Spondylolsis in a vertebrae in my lower back.  When dealing with the insurance company of one of the vehicles that hit me, the insurance staff member informed me that since it was a degenerative disease that I had it prior to the accident.  I was in the Air Force not even a year prior to the accident and was medically discharged for stress fractures in both knees, ankles, and feet.  They did tests from my lower back down to see if they had to discharge me or if they could keep me.  They found nothing wrong with my lower back and that is where the Spondylolsis is.  The vertebrae was moved forward 3mm.  I am 22 years old.  None of my family members have ever had this and I don't have a history of back pain what-so-ever and have never had leg problems before going into the Air Force.  My question is how big of a chance is it that this is a degenerative thing and not linked at all with my accident?  They are only offering to pay for the medical bills, which is great!  However, I now have back pain every day and have trouble standing and walking for long periods which only happened before my stress fractures healed.  I was told by my ER doctor that it could give me problems during childbirth when I decide to have a child.\n\n",
    "posted_time": "Post  by afoster » Sat Mar 01, 2008 4:19 am",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=54751&sid=6f34443d29ecb8ba7c519979dcede7af#p54751"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Diagnosed with Spondylolsis",
    "content": "Hi afoster -  Your post brings up several issues that are common in insurance face-offs. First, in most states, even a pre-existing condition, if it is aggravated by trauma caused by the defendant, is an insurance liability for the defendant's carrier. It sounds like you have documented recent (Air Force) studies showing the diagnosis of spondylosis is recent if it is correct at all. While what you decribe is possibly the result of spondylosis, the forward thrust of the vertebra suggests common mechanism of trauma (were you struck from behind?). Usually pre-existing conditions are not held against the plaintif in a fault-determined accident.   Second, I would strongly recommend waving a copy of that Air Force medical exam in their faces. Do you have an attorney working with you on this? There are plenty of them out there in this field, and the contingency fee (often limited by the state and averaging around 20 per cent of the damages awarded) is usually worth it if the case is worth pursuing at all.  Finally, I would also strongly recommend a second opinion re:the spondylosis diagnosis. I suspect it isn't correct. This is a long-term denerative disease, not something that happens overnight. And if you were struck in the rear, then what you describe is, as I have said above, a classic injury. Check it out.  Please keep in touch with us here. I hope everything works out for you.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Thu Jul 17, 2008 3:10 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=58858&sid=6f34443d29ecb8ba7c519979dcede7af#p58858"
  },
  {
    "author": "cadcar34  Guest Posts: 1 Joined: Mon Nov 09, 2009 7:24 pm Gender: Female",
    "title": "Re: Diagnosed with Spondylolsis",
    "content": "I have been diagnosed with spondylosis, post-air force (they never found it, despite countless xrays) by the VA.  If you are out of the military now and had medical problems in the air force, even if you didn't get out with a disability, you should still go to your VA representative and begin your 'disability rating' process.  You list the doctor that diagnosed you with the spondylosis and they will verify it with their own extensive testing.  You will be compensated by the VA if the diagnosis is correct, because it is degenerative.  It may take time, so be patient and diligent with your appointments because it is worth it in the end, and it's completely free, and if you don't live near a VA medical center, they will pay you for your travel.  Get copies of all of your medical (and dental) records from the Air Force and any other dr. and go to http://vabenefits.vba.va.gov/vonapp/main.asp or your local representative to begin your case processing.  Best wishes, and feel better!\n\n",
    "posted_time": "Post  by cadcar34 » Mon Nov 09, 2009 7:48 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=86396&sid=6f34443d29ecb8ba7c519979dcede7af#p86396"
  },
  {
    "author": "Seeshell1975  Guest Posts: 4 Joined: Sun Jun 01, 2003 7:14 am",
    "title": "Osteoarthritis or something else?",
    "content": "I am now 27 years old.  I have been suffering with joint pain since the age of 15.  It started in one knee, spread to other joints in my legs, and now the thoracic portion of my back.  Several years ago my sediment and the inflamation factor in my blood was high, tests for ANA and Rheumatoid arthritis were negative.  Recent x-rays showed deterioration in my back.  My leg had been numb for four years and my physical therapist found a pinched nerve at L3.  Four weeks of physical therapy helped clear up some of the numbness in my leg and movement in my back, but the pain is still there.  Is it possible to have osteoarthritis at 15 or is there something else possibly going on.  I have made an appointment with a very good rheumatologist in my area, but I couldn't get an appointment until august and I am currently having a very bad period.  For years doctors told me that I had pulled a muscle.\n\n",
    "posted_time": "Post  by Seeshell1975 » Sun Jun 01, 2003 7:21 am",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=855&sid=6f34443d29ecb8ba7c519979dcede7af#p855"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "Re: osteoarthritis",
    "content": "Seeshell, What exactly did the x-ray say. Please copy the details here.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Sun Jun 01, 2003 5:58 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=856&sid=6f34443d29ecb8ba7c519979dcede7af#p856"
  },
  {
    "author": "Seeshell1975  Guest Posts: 4 Joined: Sun Jun 01, 2003 7:14 am",
    "title": "[no title]",
    "content": "I am currently getting copies of my medical records to take to the rheumatologist, however my primary care physician stated that I had bone spurs and deterioration in the thoracic part of my spine, however he stated that the report did not specify at which vertebrae it was at.\n\n",
    "posted_time": "Post  by Seeshell1975 » Sun Jun 01, 2003 6:02 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=857&sid=6f34443d29ecb8ba7c519979dcede7af#p857"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "Bone spurs",
    "content": "Well that sounds rather strange cause even if the report doesnt state which vertebrae the spur are it shouldnt be too difficult for your doctor to tell by just looking at the x-rays.  As far as spurs are concerned: Bone spurs are the result of changes over time to the ends of the bones, particularly the vertebrae that make up the spinal column. The fibrous cushions, or disks, between vertebrae tend to toughen and shrink with age. Meanwhile, the tough, elastic cartilage at the ends of the bones progressively hardens.   As the space between the vertebrae becomes narrower, the bone tends to compensate for the loss by growing knobby enlargements, commonly called bone spurs. These growths are often seen in older people who have disk problems, but they also can occur in young adults — especially athletes, dancers or laborers — who put unusual stress on muscles, ligaments and tendons.   Unlike the rounded ends of bones in normal joints, spurs do not develop a layer of protective cartilage. In some cases, the new bony surfaces eventually smooth themselves through normal movement. But when they don't, bone spurs can rub against other bony surfaces, nerves or blood vessels, causing pain and inflammation. When such bony growths appear in the upper vertebrae of the neck, the condition is called cervical osteoarthritis. A particularly bothersome condition occurs when a spur develops in the foot, causing pain when standing or walking.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Sun Jun 01, 2003 6:09 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=858&sid=6f34443d29ecb8ba7c519979dcede7af#p858"
  },
  {
    "author": "Seeshell1975  Guest Posts: 4 Joined: Sun Jun 01, 2003 7:14 am",
    "title": "[no title]",
    "content": "the doctor did not see the actual x-rays, just the radiology report.  He gave me percocet for the pain, but I have a sixteen month old son, so I can't take it.  Do products like osteo biflex or such actually help ease the pain and inflammation?  I've tried ibruprofen, tylenol, aleve, and exedrine, and nothing really seems to help. I can't use creams or rubs because my skin is too sensitive.  I'm really having trouble taking care of my son because of it and my rheumatology appointment is three months away.\n\n",
    "posted_time": "Post  by Seeshell1975 » Sun Jun 01, 2003 6:17 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=859&sid=6f34443d29ecb8ba7c519979dcede7af#p859"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "Osteoarthritis therapy",
    "content": "Well if you've taken these painkillers and they havent done much then Osteo Bi-Flex wont be the quick cure either. You should try limiting movement as much as is practically possible and you should try topical analgesics to help. If your skin is sensitive to one of them it doesnt mean its sensitve to all of them. Its not the ideal therapy but i think its better than taking nothing at all.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Sun Jun 01, 2003 6:27 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=860&sid=6f34443d29ecb8ba7c519979dcede7af#p860"
  },
  {
    "author": "Seeshell1975  Guest Posts: 4 Joined: Sun Jun 01, 2003 7:14 am",
    "title": "[no title]",
    "content": "Thanks for the advice !\n\n",
    "posted_time": "Post  by Seeshell1975 » Sun Jun 01, 2003 6:43 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=861&sid=6f34443d29ecb8ba7c519979dcede7af#p861"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "welcome",
    "content": "Your welcome Seeshell!\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Mon Jun 02, 2003 6:18 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=862&sid=6f34443d29ecb8ba7c519979dcede7af#p862"
  },
  {
    "author": "fedsafety  Guest Posts: 1 Joined: Wed Nov 04, 2009 12:36 pm Gender: Male",
    "title": "Re: Osteoarthritis or something else?",
    "content": "I am a 43 year old male.  I have had knee problems all my life.  I have osteoarthritis in both knees on the medial side.  On the left knee there is a 3 mm piece of the medial condyle missing and on the right 3 cm is missing.  I injured the left knee in 2000 and had the fragment removed and have had minor discomfort since.  I had the fragments removed in December of 2008 and have had significant trouble with it, even when using an 'off-loader' brace.  I also have HCM so I am prohibited from solid cardio work that would help me lose weight.  I have three kids under the age of 9 and I am just trying to keep up with them.  My doctor says the right knee is a candidate for a partial knee replacement, but his practice does not do it.  So I am looking for some information and perhaps a good Medical Group to talk to in the Mid Atlantic Area.  I am in Delaware.\n\n",
    "posted_time": "Post  by fedsafety » Wed Nov 04, 2009 2:52 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=85898&sid=6f34443d29ecb8ba7c519979dcede7af#p85898"
  },
  {
    "author": "aleve  Guest Posts: 1 Joined: Fri Oct 30, 2009 7:42 am Gender: Male",
    "title": "Sore knucles and trigger fingers",
    "content": "I have just started to get sore knuckles on all my fingers and when  i make a close my fingers they lock up....also my knees poop, feet hurt after being on them for a period of time. don't know whats going on ?????\n\n",
    "posted_time": "Post  by aleve » Fri Oct 30, 2009 7:55 am",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=85280&sid=6f34443d29ecb8ba7c519979dcede7af#p85280"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: Sore knucles and trigger fingers",
    "content": "Hello, Multiple painful and stiff joints in the hands and feet warrants x-rays and blood tests for rheumatoid arthritis (rheumatoid factor, sed rate, CRP, anti-CCP, CBC).  For pain relief use NSAID's until testing is complete.  Obviously, this will be coordinated through your family physician as he/she will do a thorough history and physical to better define and treat your condition.  Take care.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Fri Oct 30, 2009 8:22 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=85346&sid=6f34443d29ecb8ba7c519979dcede7af#p85346"
  },
  {
    "author": "mumoffive  Guest Posts: 8 Joined: Wed Oct 26, 2005 3:31 pm Location: new zealand",
    "title": "Chronic Sore Neck & Headaches",
    "content": "Hi. For two and a half years I have had chronic neck pain. I have been not only to my own doctor but several others...all I have had in this time is 1 xray on my neck which showed nothing.  I have been taking amitriptyline, up to 70 milograms which pretty much knocks me out overnight. I take the medication when my pain is a 10/10 which is basically 3 times a week. Otherwise I sit at about a 7/10. Every day I am getting headaches and everyday I have this pain. I get numbness in my hands and sometimes shooting pains through my left arm. I always get tingling in my fingers. One day two weeks ago I had enough of the pain and went back to see a different doctor. He was appalled that I had been left in so much pain and referred me to a chiropractor urgently. I got in the same day and honestly after the first session I thought I was going to die....I was in that much pain that my husband had to knock me out overnight with the amitriptyline. 2 days later I nervously went back to the chiropractor and have been seeing him now for 4 times and I am still no better. He tells me I have good motion in my neck and that I am getting better. I am NOT feeling any better and in fact on some days I am in such bad pain. I am booked in to see an Orthopeadic Surgeon at the end of October but the chiropractor said the surgeon will do nothing. I am so fearful that I have to live in this pain for more years. Why am I not getting a CT scan on my head and an MRI? Or is this not warranted?? I am in so much pain that I constantly think of just going to my accident and emergency. But afraid they will just send me home. The chiropractor is not making me better, I am still in a lot of pain. What do I do? What do I demand? PLEASE HELP me. I am desperate.\n\n",
    "posted_time": "Post  by mumoffive » Fri Oct 02, 2009 1:25 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=83378&sid=6f34443d29ecb8ba7c519979dcede7af#p83378"
  },
  {
    "author": "Debra Van Ness RN  Nurse Posts: 79 Joined: Mon Feb 02, 2009 9:58 pm Gender: Female",
    "title": "Re: Chronic Sore Neck & Headaches",
    "content": "Ok, this is my reply.  Please know that I am a nurse.  I am an RN.  I cannot ever diagnose.  So don't take it that way.  My opinion is that you could have fibromyalgia.  Symptoms are much like what you are describing and the neck and shoulder and upper back pain is the most prominent pain with many fibro patients.    It could be a host of many other things so don't just take this word and go with it.  I am just saying, read up on fibromyalgia and speak to your physician.  Debra Van Ness RN\n\n",
    "posted_time": "Post  by Debra Van Ness RN » Sat Oct 10, 2009 1:00 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=83580&sid=6f34443d29ecb8ba7c519979dcede7af#p83580"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: Chronic Sore Neck & Headaches",
    "content": "Hello, Since you have neck pain with arm numbness and tingling then you should look into having an MRI done to evaluate the nerve and disc structures in the cervical pain. Also you should avoid chiropractic work until the MRI results come back... especially since the pain levels increase with treatment.  Take care.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Sun Oct 11, 2009 9:17 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=83623&sid=6f34443d29ecb8ba7c519979dcede7af#p83623"
  },
  {
    "author": "mumoffive  Guest Posts: 8 Joined: Wed Oct 26, 2005 3:31 pm Location: new zealand",
    "title": "Re: Chronic Sore Neck & Headaches",
    "content": "Hi Debra and Tom,  Thanks so much for both your replies. Re-reading my post, I see how many times I mentioned the word 'pain'! Sorry about that. Regarding the fibromyalgia, I will read up about that tonight, thanks Debra. Regarding the MRI...I have always thought I needed further evaluating and told my chiropractor so but he does'nt listen. I have had 8 sessions now and have been in more pain in the last 2 days. I have also had more numbness in both arms.I see the Orthopeadic Surgeon in 2 weeks so will ask for an MRI. Thank you for responding...I will be stopping the chiropractor appoints until I see the surgeon and will let you know how I get on. Thanks again...:-) Suzy\n\n",
    "posted_time": "Post  by mumoffive » Mon Oct 12, 2009 2:47 am",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=83632&sid=6f34443d29ecb8ba7c519979dcede7af#p83632"
  },
  {
    "author": "mumoffive  Guest Posts: 8 Joined: Wed Oct 26, 2005 3:31 pm Location: new zealand",
    "title": "Re: Chronic Sore Neck & Headaches",
    "content": "Well I had my appointment yesterday with the Orthopeadic Surgeon. He is giving me an MRI scan and I did'nt have to ask for one! He asked if I had bladder problems...and I said yes for about the same amount of time I've had my sore neck. I can wait anywhere up to 6 months for the MRI...I'm not sure how urgent I will be. Thank goodness something is finally being done...I am in so much agony, I just want the pain to be gone. Will keep you updated.\n\n",
    "posted_time": "Post  by mumoffive » Thu Oct 22, 2009 11:20 am",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=84385&sid=6f34443d29ecb8ba7c519979dcede7af#p84385"
  },
  {
    "author": "bionic50  Guest Posts: 2 Joined: Thu Oct 15, 2009 10:22 am Gender: Female",
    "title": "Groin and Hip PAin",
    "content": "After experiencing severe lower back pain, I was diagnosed with DJD of the lumbar spine. Not long afterwards, I began experiencing right groin and hip pain. Sometimes there would be swelling in the groin area.  Upon visiting the doctor, this pain was autmatically attributed to my back. No x-rays of the hip region were taken.  Over the years the pain in my groin became increasingly worse.  The x-rays showed advanced endstage arthritic change with loss of joint space and I was told I needed a hip replacement.  Could the condition of my hip be related to the degeneration in my spine, or could the groin pain I began experiencing have been from the onset of osteoarthritis.  Also, can osteoarthritis be detected without the use of imaging?\n\n",
    "posted_time": "Post  by bionic50 » Thu Oct 15, 2009 10:46 am",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=83912&sid=6f34443d29ecb8ba7c519979dcede7af#p83912"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: Groin and Hip PAin",
    "content": "Hello, Lumbar degeneration can refer pain to the hip and groin...but so can osteoarthritis (OA) of the hip. X-ray of the hip joint can reveal OA - whether mild or severe.  Take care.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Sat Oct 17, 2009 2:27 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=84139&sid=6f34443d29ecb8ba7c519979dcede7af#p84139"
  },
  {
    "author": "PsoriaticArt  Guest Posts: 1 Joined: Thu Oct 15, 2009 1:51 pm Gender: Male",
    "title": "Psoriatic Arthritis",
    "content": "i am using humira injections bi-weekly and only meds for pain is tyenol being allergic to asprin is there any meds that will help to control pain, swelling and morning stiffness i can't take  drugs such as aspirin and ibuprofen (Advil, Motrin, others) . is there anything else.  or am i simple out of luck!  for as it is now i simple wear out doing daily activities and have to take a break for awhile any assistance you may offer would greatly be appreciated\n\n",
    "posted_time": "Post  by PsoriaticArt » Thu Oct 15, 2009 2:24 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=83932&sid=6f34443d29ecb8ba7c519979dcede7af#p83932"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: Psoriatic Arthritis",
    "content": "Hello, Tramadol is a non narcotic pain medicine in a different class than NSAID or aspirin.    Also if the problem with aspirin or NSAID is gastrointestinal irritation then a topical cream like Voltaren may work.  Methyl salicylate topical ointments may also help - see over the counter liniment's active ingredients for methyl salicylate.    Wintergreen essential oil also contains 85% methyl salicylate - just make sure it's therapeutic grade oil.   Lininment or oil can be messaged directly into affected joint.  Adding moist heat may enhance the benefit.  Take care.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Sat Oct 17, 2009 2:23 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=84138&sid=6f34443d29ecb8ba7c519979dcede7af#p84138"
  },
  {
    "author": "qapuki  Guest Posts: 1 Joined: Fri Sep 18, 2009 4:13 pm Gender: Male",
    "title": "Swollen Knee On infants",
    "content": "My daughter have swollen knee, firstable i thought she was complaining due to an injury, we went to see an orthopedic and did a xray, and no injury did the knee swollen, they told me to do some analysys. then he noticed some kind of infection going on, could anyone tell me wheather this can be complicated matter, beacuse i started to get worried for my 3 years daughter.  Anyone?\n\n",
    "posted_time": "Post  by qapuki » Fri Sep 18, 2009 4:26 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=82795&sid=6f34443d29ecb8ba7c519979dcede7af#p82795"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: Swollen Knee On infants",
    "content": "Hello, If the child's joint is swollen, red, warm and tender or the physician thinks it is an infection, it is a serious matter.   Infected knees in anyone but in particular the young and the old is a concern as the infection, if not treated, can not only destroy the joint but get into the blood stream and cause the body to become sick (sepsis).   In the young and old in particular, sepsis can cause death.  So, follow what your physician says and get good care for your daughter's knee.  Take care.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Sun Sep 27, 2009 9:13 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=83309&sid=6f34443d29ecb8ba7c519979dcede7af#p83309"
  },
  {
    "author": "missmarymiss  Guest Posts: 1 Joined: Wed Sep 16, 2009 7:07 pm Gender: Female",
    "title": "crooked toe",
    "content": "About 3 weeks ago I started getting a pain at the base of my second toe (ball of the foot).  Last week my toe started to shift towards the big toe. It's worst when I walk but it's always bent now.  No swelling and no redness.   Looks like the Vulcan \"live long an prosper\" sign.\n\n",
    "posted_time": "Post  by missmarymiss » Wed Sep 16, 2009 7:27 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=82632&sid=6f34443d29ecb8ba7c519979dcede7af#p82632"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: crooked toe",
    "content": "Hello, It is hard to tell what is causing the deformity.  Two possibilities perhaps three.  First, the intrinsic muscles could be weak.  Second, a bony abnormality or tumor could be growing between the toes.  Third, a Morton's neuroma could be developing.  My first step would be to get in to see the physician for physical exam.  The Morton's neuroma would be painful to palpation.  An x-ray would be indicated as well.  Actually, a fourth possibility is the most probable. Check the mobility of the 1st ray (long bone of the 1st toe) to see if it is mobility.  A hypermobile first ray may cause the second digit to move over.  This would show up on x-ray...and over time you may see a bunion develop on the first toe.  Take care.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Sun Sep 20, 2009 8:27 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=82988&sid=6f34443d29ecb8ba7c519979dcede7af#p82988"
  },
  {
    "author": "moomom  Guest Posts: 11 Joined: Wed Feb 04, 2004 11:23 pm Location: GASTON, SC",
    "title": "hip/leg pain",
    "content": "i am experiencing severe hip/leg pain on my left side. this has been going on for about a week. also, my right leg feels like there is a bad cramp coming if i straighten it.i have been diagnosed with degenerative arthritis in my lower spine, and have unknown \"erythema nodosum\" like spots on my lower legs. i exercise reg. and have had no injury that im aware of. i have recently lost 25lbs. to be 203 and am working to go lower. iam currentlly not exercising becase the pain is so severe. any  thoughts?\n\n",
    "posted_time": "Post  by moomom » Sun May 30, 2004 9:44 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3482&sid=6f34443d29ecb8ba7c519979dcede7af#p3482"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Hip/leg pain",
    "content": "Dear Moomom,  Thank you very much for using our website.  Your leg/hip pain can be related to your back problems. Hip pain can also be related to a new hip problem as well.  You have been experiencing this for about a week now, if you think that the pain is getting worse or not impoving, i would encourage you to be seen by your doctor to determine whether this is something that warrants an imaging study like a ct scan or not to look for a change in your back problem like a herniated disc.  Losing 25 pounds should make your back problem better not worse as by losing weight you are taking a load off your back. But, you could have pulled a muscle or did a wrong twist.  i would also encourage you to be as active as you can. Meaning that there is no need for bed rest if you have back pain. On the contary try to do your activities of daily living and if you have pain that is preventing you from doing your activities comfortably, you may use pain medications to make it easier.  Once more, thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Mon May 31, 2004 11:32 am",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3491&sid=6f34443d29ecb8ba7c519979dcede7af#p3491"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Dear Dr. Yasser, What are the possibilities that her arthritis is inflammatory and not degenerative and given the age, multisystem involvement and the erythema nodosum, that she may have an autoimmune rheumatic disease (as you yourself previously suggested)? Would you still advise a biopsy from the lung lesion or an ANA, RF test maybe?  Of particular concern to me is the possibility that this is a developing case of seronegative spondyloarthritis (e.g. ankylosing spondylitis). This condition as you well know is associated with asymmetrical involvement of the spine and the sacroiliac joints in addition to a high incidence of erythema nodosum. There have been reports of chronic fibrotic changes in the lungs that resemble tuberculosis.  What are your thoughts on this?  Thank you.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Mon May 31, 2004 4:23 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3503&sid=6f34443d29ecb8ba7c519979dcede7af#p3503"
  },
  {
    "author": "moomom  Guest Posts: 11 Joined: Wed Feb 04, 2004 11:23 pm Location: GASTON, SC",
    "title": "hip-leg pain",
    "content": "i have been experiencing these types of episodes over the past 4 years. usually though, it is in my right hip. one time the emergency room dr. called it a sipped disc, another time it was sciatica. the symptoms right now are not severe, but continual from the middle of my hip to my toes only on my left side. i also have a pronounced limp on my right leg that started up around 5 years ago. all test have come back normal--diabeties, pap, all the test for lupus, etc. the only thing that concerns me on blood work ishigh(16.9) hemaglobin, hemocrit(47.5) monocytes were low(2) glucose was high(99) white blood cells were (10.1) high . all cholesterol levels were great.magnesium was 2.1 marked high,a1c was 4.6, marked low. been diagonosied with moderate first degree spondylolisthesis at l5-s1 with exaggerated lordosis but without spinal stenosis on  4/03-- but was told it was known as degenerative arthritis of the lower spine.  i have been fighting this debilitating sickness for over four years, and none of the doctors can help, thanks alot.my current dr. will not do a biopsy and is calling what i have vasculitis and tells me to wear support hose, which does not help.\n\n",
    "posted_time": "Post  by moomom » Fri Jun 04, 2004 8:48 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3584&sid=6f34443d29ecb8ba7c519979dcede7af#p3584"
  },
  {
    "author": "Elktracks  Guest Posts: 1 Joined: Thu May 12, 2005 6:22 pm",
    "title": "Hip Pain",
    "content": "I will be turning 30 in a week. I have been suffering from hip pain since I was 16 yrs old. I can't walk or stand for more than 15 minutes without it starting to hurt. Sometimes I can feel and hear a clicking noise. I've had numerous x-rays taken with no explanation of what is causing the pain. I've been through physical therapy with no improvements. I've been put on Ibuprofen so many times, it's ridiculous. I just want to get a diagnostic test and see what I can do to ease the pain.\n\n",
    "posted_time": "Post  by Elktracks » Thu May 12, 2005 6:32 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=13667&sid=6f34443d29ecb8ba7c519979dcede7af#p13667"
  },
  {
    "author": "cjhdd  Guest Posts: 8 Joined: Mon May 30, 2005 11:42 pm",
    "title": "Just a Thought About Hip Pain",
    "content": "For nearly a year, I suffered pain down my right leg, from my  hip to ankle. At first I thought it might be general pain from my fibromyalgia or arthritis.   It steadily became worse and I began to mis-step. I would lose my balance and have sharpe pains from my hip down my leg. Pain would involve my thigh, buttock and femoral head, and weight bearing pain.  An x-ray demonstrated AVN. Avascular Necrosis of the Hip.  Degenerative changes in the acetabular, flattening of the femoral head, joint space narrowing and collapse of the femoral head.  I had surgery August two years ago, and have no problems walking. I do know, eventually, my left hip will need surgery also, but I do not know when. I had the surgery performed in Baltimore MD at Sinai Hospital.   cjhd\n\n",
    "posted_time": "Post  by cjhdd » Tue May 31, 2005 5:10 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=14454&sid=6f34443d29ecb8ba7c519979dcede7af#p14454"
  },
  {
    "author": "rebeccastrecker  Guest Posts: 1 Joined: Mon Feb 27, 2006 4:31 pm Location: Southern Calif.  Contact:   Contact rebeccastrecker       Website",
    "title": "erythema nodosum?",
    "content": "Hi, Do you still have erythema nodosum? I have had EN for 37 yrs. Please contact me to discuss further. I have been researching EN for the past few years and perhaps I can help you figure out the trigger or cause that will lead to resolution of it.  I moderate the online erythema nodosum support group, so I have met about 1000 with EN by now.  Best wishes,\n\n",
    "posted_time": "Post  by rebeccastrecker » Mon Feb 27, 2006 4:44 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=31474&sid=6f34443d29ecb8ba7c519979dcede7af#p31474"
  },
  {
    "author": "sfreed  Guest Posts: 1 Joined: Sun Sep 06, 2009 2:57 pm Gender: Female",
    "title": "Re: hip/leg pain",
    "content": "Sometimes my hip joint feels like it gets misplaced or something and I get a sharp pain in that area. If I keep my leg still it doesn't hurt but when I move it, it does. I think it happens when I move it a certian way but I'm not sure exactly what I'm doing to cause it. Usually if I relax my leg for a while it will go away. If I move my leg or try to walk I feel a sharp pain and cannot walk without limping. I think I've had this problem for a few years (maybe 5) but it wasn't so bad. Recently its been happening more often and the pain is more severe. Can you help me figure out what this is and what I can do about it?\n\n",
    "posted_time": "Post  by sfreed » Sun Sep 06, 2009 3:31 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=81887&sid=6f34443d29ecb8ba7c519979dcede7af#p81887"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: hip/leg pain",
    "content": "Hello,  There are some steps you can take to figure out what is going on with the hip.  First, an x-ray will give a view of the hip joint itself.  Second, sometimes the labrum of the hip tears causing this type of pain thus an MRI would be warranted.   Nevertheless, a visit to your family physician to asses the hip is a good start.  Take care.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Mon Sep 07, 2009 2:47 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=82013&sid=6f34443d29ecb8ba7c519979dcede7af#p82013"
  },
  {
    "author": "musicmanimal  Guest Posts: 1 Joined: Sun May 24, 2009 12:50 am Gender: Male",
    "title": "Stiffnes, aching, swollen knee",
    "content": "I am a 55y/o, been in excellent shape all my life, physically and mentally.  I eat well and drink a lot of water...Over the past year I have noticed that if I sleep with my knees on top of each other (on my side, most preferred) I awake with serious pains in my knees.  My mattress by the way is very good.  Now most recently my left knee has been swollen, stiff, cant bend.  The top and sides are tender and the back as well.. I don't lift weights...I am a performing Musician prone to moving as an athelete (pivoting, etc..) Thank you\n\n",
    "posted_time": "Post  by musicmanimal » Sun May 24, 2009 1:05 am",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=79384&sid=6f34443d29ecb8ba7c519979dcede7af#p79384"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: Stiffnes, aching, swollen knee",
    "content": "Hello, This may be nothing more than mild osteoarthritis in the knees.    Sleeping with a pillow between the knees will decrease the pressure on them and ease the pressure on the spine.   Acetaminophen and moist heat before bed may help as well as a general exercise program - walking or swimming 3-4 days a week.  If needed, see a physician who can evaluate the spine and knees more thoroughly.   Take care.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Tue Jun 16, 2009 8:20 am",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=80651&sid=6f34443d29ecb8ba7c519979dcede7af#p80651"
  },
  {
    "author": "runski  Guest Posts: 1 Joined: Fri May 22, 2009 5:24 pm Gender: Male",
    "title": "Long term undefined immobility",
    "content": "It started in 2005:  numbness in right foot sun damage and mild skin cancers Right hip pain causing immobility undefined polyartritis rapid weight loss pancreatic tumours which self healed lower limb ulcers - pyoderma gangrenosium diagnosed Cutuneous vascilitis  There is no definitive diagnosis yet. I lead an active life up to 2006, daily exercise, walking, cycling, tennis and I have been immobile for the past three years.   Can you please help or even advise where I might locate a doctor or team of doctors that take on unusual or difficult cases. I live in ireland but am prepared to travel.\n\n",
    "posted_time": "Post  by runski » Fri May 22, 2009 5:42 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=79254&sid=6f34443d29ecb8ba7c519979dcede7af#p79254"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: Long term undefined immobility",
    "content": "Hello, There is a lot going on and I am sorry to hear that you have been immobile for the past 3 years.  I would start addresses these issues with a long visit at your family physician.  He will be the one who will make the necessary referrals to the specialists and keep all the consultations on record in one place in your chart.  The most important concern at this point is the sudden (and I assume unintentional) weight loss with history of pancreatic tumors.  Your family physician should take an extensive history including a review of the different body systems and perhaps a bone scan or CT scan of chest and abdomen to make sure there are no signs of tumors or cancer.    The polyarthritis and vasculitis can be addressed initially with the family physician with some basic rheumatology testing (blood work: CBC, sed rate, CRP, ANA, RF, anti-CCP).  Take care.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Tue Jun 16, 2009 8:15 am",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=80650&sid=6f34443d29ecb8ba7c519979dcede7af#p80650"
  },
  {
    "author": "Snuck  Guest Posts: 5 Joined: Sun May 03, 2009 9:08 am Gender: Male",
    "title": "Osteochondrosis in Knees and Weight lifting",
    "content": "Apparently I have Osteochondrosis in both knees, it occured a 3/4 years ago. I have a hard bone like lump under each knee where it meets the shin.  I am in my early 20s and have began a weight lifting routing. However, integral to weight lifting is the Squat, which requires, by definition a squating motion with weight on the shoulders.   I don't have any particular pain in my knees (which was the case when it first started), but they often feel weak under pressure, and the most concerning thing is the crackling sound they make even when I do an unweighted squating movement. I play sports and when running my knee doesnt cause me any real pain.  Im am getting an X-ray or the appropriate scan to confirm the condition.  I was wondering, is it a bad idea to do squats and deadlifts (require similar motion witthe legs)? Even with knee braces/straps as they are pretty crucial to the programme.\n\n",
    "posted_time": "Post  by Snuck » Sun May 03, 2009 9:15 am",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=76741&sid=6f34443d29ecb8ba7c519979dcede7af#p76741"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: Osteochondrosis in Knees and Weight lifting",
    "content": "Hello, Osteochondrosis of the tibial tubercle is similar to Osgood Schlatters disease but in an adult. The cause is too much pull on the patellar ligament via the quadriceps muscle.  I would discourage squats and dead lifts at this time to allow for healing of this area.   You may even consider this a weight training injury and therefore should avoid the same mechanism of injury until completely healed.    Take care.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Tue May 19, 2009 9:14 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=78888&sid=6f34443d29ecb8ba7c519979dcede7af#p78888"
  },
  {
    "author": "greeneyes58  Guest Posts: 4 Joined: Sun Aug 19, 2007 6:38 pm",
    "title": "degenerative disc disease",
    "content": "49 year old female, just dx with deg. disc disease, family history of osteo arthritis and dx disc disease, cannot take nsaids, or anti inflammatory meds at all.  Can take only 3 ibuprophen a day,  cannot take steroids, I have a very sensitive stomach. I do suffer from spinal pain,  I have several bulging discs,  and I suffer with severe knee pain due to osteoarthritis, what do you suggest for pain and what does my future appear to be with pain.  The 3 ibuprophen just don't cut it.  I also take nexium everynight. I have had knee injections for several years now. Thank you so much for your opinion   Greeneyes58\n\n",
    "posted_time": "Post  by greeneyes58 » Sun Aug 19, 2007 8:04 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=46583&sid=6f34443d29ecb8ba7c519979dcede7af#p46583"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Greeneyes58,  Unfortunately, osteoarthritis and degenerative disk disease tend to be chronic pain producers.  NSAIDS are often helpful but can be hard on the stomach as you have found.  You may want to talk to your doctor about trying one of the COX-2 inhibitor type anti-inflammatories (such as celebrex or vioxx).  Basically these are a subclass of NSAIDS that more specifically target the pain aspects of inflammation and are supposed to cause less GI irritation.  They may work well for you.    Some people will have trouble, even with these meds though.  If this turns out to be the case you may want to consider seeing a pain specialist.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Wed Sep 12, 2007 5:29 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=47739&sid=6f34443d29ecb8ba7c519979dcede7af#p47739"
  },
  {
    "author": "neednewback  Guest Posts: 1 Joined: Mon Mar 17, 2008 8:53 pm Gender: Male",
    "title": "Re: degenerative disc disease",
    "content": "Acupuncture and a TENS machine can be used for pain reduction and muscle stimulation.  I have just recently been diagnosed with multiple bulging discs, disc disc dessication, a tear and a few other things.  I'm starting acupuncture tomorrow and going to buy a TENS machine and have high hopes for them both.  I have been on meds for 2 weeks and my goal is to get off soon and start to rehabilitate my back.  What do people think of acupuncture and TENS.\n\n",
    "posted_time": "Post  by neednewback » Mon Mar 17, 2008 9:06 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=56207&sid=6f34443d29ecb8ba7c519979dcede7af#p56207"
  },
  {
    "author": "soreknee  Guest Posts: 1 Joined: Wed Apr 29, 2009 8:39 pm Gender: Female",
    "title": "Re: degenerative disc disease",
    "content": "I have had laser microspine on my back but still have lots of pain and problems with muscle spasms.  I have used a TENS unit for over a year, it helps to block the pain signals and seems to loosen the muscles alittle.  I bought mine online and the electrodes as well.  The $50 units work as well as the $100 units.  I also use muscle relaxing cream and lidocaine patches.\n\n",
    "posted_time": "Post  by soreknee » Wed Apr 29, 2009 8:56 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=76338&sid=6f34443d29ecb8ba7c519979dcede7af#p76338"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: degenerative disc disease",
    "content": "Hello, Thanks for writing in.  The Tens unit is a good option for pain relief.  It is non invasive and can be used long term without side effects.  A drawback is the patches need to be placed on the low back and changed regularly so if a person has difficulty reaching or seeing the area it may take a bit to learn how to apply the patches.   The skin must be inspected for irritation or allergic reaction.  Take care.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Mon May 04, 2009 6:07 am",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=76865&sid=6f34443d29ecb8ba7c519979dcede7af#p76865"
  },
  {
    "author": "anjilzheart  Guest Posts: 1 Joined: Sun May 29, 2005 6:23 am Location: Prineville, OR  Contact:   Contact anjilzheart       AOL",
    "title": "Who is right about my diagnosis?",
    "content": "Hi!  October 2003 I went to a GP because I was extremely tired ALL the time.//The results of the blood tests were that I had rheumatoid arthritis and he immediately put me on Vioxx and gave me shot of methotrexate and told me I would  have to come in for these weekly shots for the rest of my life.//Well, needless to say, I got really really REALLY sick from the shot, and thought I was going to die!!!But after about five days, I was better and after one hospital visit to the emergency room, I was instructed by two other doctors that methotrexate should never have been prescribed for me initially and was advised to stop the injections.//I was referred to the best rheumatologist in the area, and had to wait four months to get in to see him.  In the meantime Vioxx was working wonderfully, and I was no longer experiencing pain.//Well, when I finally got to see the rheumatologist, he talked to me, talked to me about my weight, and had me perform a few physical floor touching excercises and informed me that I did NOT have RA.//Well, I've mentioned this to my new GP, and he said that I did indeed have some sorth of arthritis in response to my telling him that the Rheumatologist said I did not.  So that made a total of three General Practioner's telling me that I had RA based on my raised test that indicates inflammation  within the body (I forget what it is called.).  Anyway, with the pulling of Vioxx off the market, I was really disappointed, because this had been the first time I had been pain free in a long time.  I tried Celebrex, but I didn't think it had as good as effect.  Recently about three months ago, I went to my regular doctor to ask if there was something else out there, as even though the Rheumatologist said that I didn't have RA, I was experiencing more and more pain every day.....my feet ached horribly and would swell at times, but were not hot to the touch.  After sitting for long perioids of time, I can barely move and walk stifly and painfully for a short while.  Mornings, I walk stiffly.  I've noticed now that my hands and feet ache and swell at the joints, but the main point of pain for me are my left hip and my right shoulder.   They are the worst, but now within the last six months and it appears to be getting worse, I have started having problems lifting the lightest of things, sometimes even forks..without pain in both hands and/or my shoulders.   My regular MD gave me three otherr samples of types of meds to try and told me to let him know which one helped the best, Bextra, Celebrex (we already knew that result), some other drug,  I tried them all for the designated time period, and let them know that Bextra worked the best for me.  They got me a bunch of samples, and the very next day I heard that Bextra was pulled off the market.  He had told me that after we tried all these medications that there were others we could try, and I said...like the ones that cost $15,000 per year...And he said yes.....Well lo and behold when I asked for something else along this line since Bextra was no longer available to me, as neither was Vioxx, and the other drugs naproxen sodium, ibuprofen, and the other trial prescrip meds he gave me didn't work, he turned around and just left a message for me to take naproxen sodium, advil, or celebrex...So I got frustrated and reschedueld another appt with the best Rheumatologist that I saw before and I see him next week.   //What I am afraid of is that I may get the same answer and the pain is excruciating most of the time after sitting or laying for long perioods of time and I cannot even get up from a sitting position and sometimes have to roll off onto the floor and then painfully and slowly help myself up.  I'm getting really frustrated and confused here.   Is it still possible that I have RA? I can still do the ra physical test the RA doctor had me do, which was touch the floor with my hands......but the pain and tiredness I feel  is sooooooooooooooo much worse than it was a year ago.  I don't want to wait around and take one and then the other doctor's word, when I am experiencing this pain that is clearly getting worse and is having a crippling effect on me....It's getting to the point as far as holding things, that my fingers kinda double up and I can't hold things regularly anymore well and I'm always stretching parts of my body as that seems to help the muscles and joints.  Oh...and also...right up in my shoulder area in front of my armpits, are bunches of nodules on each side of my chest.....could this be related to my shoulder pain?  Thank you so much for you listening to my ramblings in not a very logical order.  I'm starting to get rummy from sooooooooooooo many sleepless nights.  Thank you  anjilzheart\n\n",
    "posted_time": "Post  by anjilzheart » Sun May 29, 2005 6:49 am",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=14341&sid=6f34443d29ecb8ba7c519979dcede7af#p14341"
  },
  {
    "author": "Shannon Morgan, CMA  Medical Assistant Posts: 530 Joined: Fri May 06, 2005 6:28 pm Location: Dallas, Texas. USA.",
    "title": "[no title]",
    "content": "Have you had a complete exam lately, other than testing for RA?  I mean full blood chemistry panel, CBC,thyroid and ANA titer?  Chest X-ray?    If not, make an appt. to have this done.  Your symptoms sound much like Lupus, but there are other conditions with joint pain and swelling such as yours.\n\n",
    "posted_time": "Post  by Shannon Morgan, CMA » Tue Jun 07, 2005 9:15 am",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=14749&sid=6f34443d29ecb8ba7c519979dcede7af#p14749"
  },
  {
    "author": "GODSPRINZES  Guest Posts: 1 Joined: Wed Sep 07, 2005 3:48 pm Location: FORNEY TEXAS",
    "title": "[no title]",
    "content": "PLEASE HELP ME! I AM 40 YEARS OLD AND ONE DAY AT WORK I BECAME VERY ILL AND WAS RUSHED TO THE HOSPITAL AND ADMITTED, AFTER SEVERAL TEST THEY STATED TO ME I HAD THYROID PROBLEMS, WELL NOW I KNOW WHY I COULD NOT GET RID OF THE WEIGHT.    AFTER TWO MONTHS LATER I WAS ADMITTED AGAIN TO A DIFFERENT HOSPITAL BECAUSE I HAD A HARD TIME SWALLOWING, I WAS DIZZY, AND MY NECK AND BACK WAS BURNING TINGLING AND NUMBNESS THROUGH OUT MY HANDS AND FEET. FINALLY AFTER ALL TEST WERE DONE I HAVE DEGENERATIVE DISC DISEASE.  THE PAIN AND BURNING IN MY BACK, NECK AND WEAKNESS IS SO BAD AT TIMES. ONE NURO DOCTOR I WENT TO STATED THAT I WAS NORMAL. HOW CAN I BE NORMAL WITH SO MUCH PAIN. I AM NOW GOING TO SEE A SPINE DOCTOR AND HOPES HE CAN HELP. WHAT IS THE CAUSE OF ALL OF THE PAIN AND BURNING OF MY SPINE AND WEAKNESS OF MY BODY? CAN YOU  PLEASE TELL ME? THANKS\n\n",
    "posted_time": "Post  by GODSPRINZES » Wed Sep 07, 2005 4:12 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=20112&sid=6f34443d29ecb8ba7c519979dcede7af#p20112"
  },
  {
    "author": "jennya4  Guest Posts: 1 Joined: Tue Apr 14, 2009 2:21 pm Gender: Female",
    "title": "Re: Who is right about my diagnosis?",
    "content": "Look into ankloysing spondylitis. Sounds like it could be the culprit. Look it up on web. Never know but worth a try. Have your hips and your SI joints x rayed or MRI done of them. It is considered a man's disease but if can affect women too. Good Luck\n\n",
    "posted_time": "Post  by jennya4 » Tue Apr 14, 2009 4:59 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=74240&sid=6f34443d29ecb8ba7c519979dcede7af#p74240"
  },
  {
    "author": "Ruth Shellon  Guest Posts: 1 Joined: Sun Apr 05, 2009 2:07 pm Gender: Female",
    "title": "Pain in head and between shoulders every week since 2002",
    "content": "On average of twice per week,I have had ongoing headaches, coupled with neck pain, which is just above the center of my shoulder blades since 2002. I was involved in a vehicle rollover accident in 2002. I have seen several doctors about this. I have also had intermittent episodes of numbness on the right side of my face and around my ear. I am exhausted and this is a real problem; Yet noone comes up with an conclusion, even after MRI's, X-Rays, and nerve conduction tests. Any thoughts about where to go now?\n\n",
    "posted_time": "Post  by Ruth Shellon » Sun Apr 05, 2009 2:25 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=73207&sid=6f34443d29ecb8ba7c519979dcede7af#p73207"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: Pain in head and between shoulders every week since 2002",
    "content": "Hello, This is a difficult case because all the scans are negative yet symptoms still persist.  At this point since the nerves, bones, and intervertebral discs are intact (per imaging results), then you can feel safe to rehabilitate the area.  This is often done via physical therapy.   Sometimes we can't give a specific diagnosis but can only rule out certain serious causes and then give reassurance and treat the symptoms. Take care and let us know how it goes.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Fri Apr 10, 2009 7:24 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=73845&sid=6f34443d29ecb8ba7c519979dcede7af#p73845"
  },
  {
    "author": "millerlisa  Guest Posts: 1 Joined: Wed Apr 01, 2009 2:57 pm Gender: Female",
    "title": "Bump on tibial tuberosity",
    "content": "I recently suffered a sever ankle inversion on my right foot.  I have had 2 cortisone injections which have helped with the swelling and inflammation.  Some pain still persists and the injury occurred 5 months ago.  I am 36, female and very active.  I run an average of 12-15 miles per week.   I have noticed since I began running again that there is a bump on or near my tibial tuberosity of my \"good\" leg that was not injured.  What is causing this?  Could I have changed my running gait inadvertantly?  I know osgood-schlatter's disease is of a pediatric nature.  Any ideas of what is causing this?\n\n",
    "posted_time": "Post  by millerlisa » Thu Apr 02, 2009 11:24 am",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=72827&sid=6f34443d29ecb8ba7c519979dcede7af#p72827"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: Bump on tibial tuberosity",
    "content": "Hello, If you were a teenager, I would immediately diagnose Osgood-Schlatter.   It is possible that on the good leg the quad has overworked in compensation (from the ankle sprain) and has caused some hypertrophic changes at the tibial tubercle (where the quad attaches).  You may use a patella strap and ice and ibuprofen for a few weeks to see if the bump goes down. Keep us posted.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Mon Apr 06, 2009 7:34 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=73384&sid=6f34443d29ecb8ba7c519979dcede7af#p73384"
  },
  {
    "author": "charley d  Guest Posts: 1 Joined: Sun Jan 25, 2009 8:48 am Gender: Female",
    "title": "consistant back pain",
    "content": "I've been having back pain for about 6 weeks. The whole back, centered along my spine, from my neck to the small of my back. I'm 44, 120 lbs, female, I do karate 2x/week, swim 1x/week, belly dance and am in excellent health & physical condition.  I drive my car a lot for my sales job but it's the same car I've had for 4 years. Our mattress is a pretty good one. The pain is constant & consistent without much variation in degree of pain (discomfort, maybe the word pain is too strong), I'd rate it at 5 out of 10 every day. My mother has degenerative disk disease, should I consider looking into this?\n\n",
    "posted_time": "Post  by charley d » Sun Jan 25, 2009 9:10 am",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=69690&sid=6f34443d29ecb8ba7c519979dcede7af#p69690"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: consistant back pain",
    "content": "Hello, Thanks for writing in.  You have reported pain/discomfort along the entire spine - from the neck to the low back.  You are physically fit.  Mother has degenerative disc disease.  You spend considerable time driving.  In the spine, a small amount of pain can trigger a general amount of pain.  In other words, the muscles along the spine (the paraspinal muscle run the length of the entire spine) can spasm and cause pain or discomfort.  Pain can also be referred from one place in the back to another (without muscle spasm).    With your history, I would evaluate the back for overall mobility to determine if you tend toward hyper or hypo mobility.  I would suspect the former.  With hypermobility of the spine, there is an increase of shearing force at the facet joints (small joints in the spine)and increased risk of laxity between the vertebrae.  Over time this can caused arthritis, mal aligned of the spine, or inflamation in the tissue supporting the spine including the discs.    Degenerative disc disease is a broad term which radiologist use to describe abnormal MRI findings of the spine.  Before having an MRI, you may consider seeing a massage therapist or physical therapist.  MRI would be indicated if these do not help or if your pain is worsening or if numbness/tingling/limb weakness occur (an indication for possible nerve damage).    Also, use of NSAIDs for a week, heat and/or ice packs may provide some immediately relief.  If in doubt or concern about any above information, consult your primary physician for an accurate diagnosis and treatment options.   Keep us posted and take care.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Sat Jan 31, 2009 8:58 am",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=70338&sid=6f34443d29ecb8ba7c519979dcede7af#p70338"
  },
  {
    "author": "Falcone  Guest Posts: 10 Joined: Thu Dec 25, 2008 11:27 am Gender: Male",
    "title": "Articular Knee Cartilage damage",
    "content": "I discovered I had articular cartilage damage in my knees a few years ago. Although I have no pain running, It is uncomfortable (although not painful) to squat down and my knees make tearing/cracking sounds.  Does this mean I am likely to have walking problems as I grow older? Also will I lose height over time because of this?\n\n",
    "posted_time": "Post  by Falcone » Fri Jan 23, 2009 8:03 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=69543&sid=6f34443d29ecb8ba7c519979dcede7af#p69543"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: Articular Knee Cartilage damage",
    "content": "Hello,  No, you should not lose height with degenerative knee damage.    Yes, as time goes on, you may have difficulty walking ...maybe at 50 years old or older.  This is a gradual process though and does not occur overnight.    Maintaining good leg strength and flexibility will be important.  Also, maintain a healthy weight.  Obesity will worsen knee degeneration.  If a lot of grinding sensation with squats than avoid that exercise.   And swimming or biking may be better options that running.    Let us know how it goes or if you have any other questions.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Mon Jan 26, 2009 11:51 am",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=69828&sid=6f34443d29ecb8ba7c519979dcede7af#p69828"
  },
  {
    "author": "wildone9026  Guest Posts: 2 Joined: Fri Jan 09, 2009 4:50 pm Gender: Female",
    "title": "Osgood schlatter in right knee, can it last more than 1 year",
    "content": "hi, im 13 years old and ive had osgood schlatter in my right knee for about 1 year and 4 months. it used to be in both my right and left knee, but disappeared from my left knee about ten months ago. my right knee is getting worse and worse, and the bump is becoming larger and more painfull. what should  i do to treat it? will i need to get surgery? and is it common for osgood to last more then a year? thank you for all your help.\n\n",
    "posted_time": "Post  by wildone9026 » Fri Jan 09, 2009 6:42 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=67630&sid=6f34443d29ecb8ba7c519979dcede7af#p67630"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: Osgood schlatter in right knee, can it last more than 1 year",
    "content": "Hello, As long as you are growing, Osgood schlatters can persist.    The condition involves increased stress on the patellar tendon where it inserts into the front of the tibia.  Calcifcation and chronic inflamation can develop therefore a bump may appear.  Treatment includes treating inflamation with NSAIDS, ice (regularly especially after every bout of exercise), a patella strap or brace to ease the pressure off the tibial tubercle, and quadriceps strengthening.   Physicial therapists and athletic training can help with any rehab program.    Sometimes surgeon remove the bump or ossification site but I would not recommend this until after growth spurts are done and only if the condition remains problematic.  Let us know how things turn out.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Sat Jan 10, 2009 2:29 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=67761&sid=6f34443d29ecb8ba7c519979dcede7af#p67761"
  },
  {
    "author": "wildone9026  Guest Posts: 2 Joined: Fri Jan 09, 2009 4:50 pm Gender: Female",
    "title": "Re: Osgood schlatter in right knee, can it last more than 1 year",
    "content": "do you know why it would go away in one knee and not in the other? and my family goes snowboarding every weekend, and it puts a lot of stress on my knee. should i take sometime off untill it gets better? recently, my knee has been hurting even if i don't use it. thanks, laura\n\n",
    "posted_time": "Post  by wildone9026 » Sat Jan 10, 2009 4:32 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=67769&sid=6f34443d29ecb8ba7c519979dcede7af#p67769"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: Osgood schlatter in right knee, can it last more than 1 year",
    "content": "Hello,  It is not unusual for one knee to be better or worse than the other - assymetry is common with Osgood Schlatter's.  Since this condition is caused by repetitive stress on the tibial tubercle (bony attachment of the patellar tendon) then avoiding repetitive stress is part of the solution.  Therefore use caution with running, jumping, cutting...and skiing. Typically, activity levels are dictated by pain and inflammation levels but remember - pain and inflammation may not occur until after the activity ...so easy does it.    Also use ice after exercise/activity.   Consult a trainer or therapist for specific treatment and exercises.  After the bone's growth plate matures (anywhere from 14y.o - 18y.o.) the problem should cease.  If it persists beyond this, see an orthopedist.  Let me know if you have any more questions and I'll try to answer them.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Mon Jan 12, 2009 2:01 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=68020&sid=6f34443d29ecb8ba7c519979dcede7af#p68020"
  },
  {
    "author": "princesssallamat  Guest Posts: 1 Joined: Wed Dec 31, 2008 4:54 pm Gender: Female",
    "title": "Bone/flesh eating disease",
    "content": "Hi,   My mom and her friends are concerened about a friend of theirs. She was diagnosed with 'some' disease that has her bones deteriorating. They saw her face and it was red with spots on her face or really tiny pimples I should say on her face. She feels her body is hot. Her face is pale/yellowish. She has lost any appetite she had for food. Her doctor told her to sit in the sun and her doctor said that she has a Vitamin D dificency.   She was also taking medication for high blood pressure and the doctor said that medication she was taking had something to do with it.   We don't know what she has to help her. She said they didn't really tell her what she has. She said that they just told her that her \"bones were being eaten.\"   We want to help her and stand by her side. She has been so depressed and I think that has not been helping her. We want to do anything to make her feel better and to snap out of this depression she's been isolating herself with.   Thank you so much.   -Jazie\n\n",
    "posted_time": "Post  by princesssallamat » Wed Dec 31, 2008 5:11 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=66495&sid=6f34443d29ecb8ba7c519979dcede7af#p66495"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: Bone/flesh eating disease",
    "content": "Cirrhosis (irreversible inflammation of the liver) can present with the symptoms you have described however we would need to know more information from her history and physical and testing to know this for sure.    Vitamin D deficiency leads to bone loss.   Causes of Vitamin D deficiency includes:  poor absorbtion in the gut mal nourishment (decrease intake of calcium) lack of sun exposure kidney or liver disease stomach surgery (including gastric bypass) Medications (eg some anti convulsants, long term corticosteroid use)  It may be helpful if your friend is willing to have a health advocate (someone who will go with her to doctor's visits, tests, or procedures - to give support and help in relationship with physicians).  All the best to your friend.  Keep us posted.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Sat Jan 03, 2009 10:34 am",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=66771&sid=6f34443d29ecb8ba7c519979dcede7af#p66771"
  },
  {
    "author": "Kat58  Guest Posts: 3 Joined: Mon Apr 18, 2005 9:31 am Location: Calif",
    "title": "Pain & Restless Nights - I Am So Sick Of This!!!",
    "content": "I am a 49 yr old female and back in 98 after a year 1/2 of doing repetitive work (med office) I developed Carpal Tunnel along with neck & shoulder pain. I was also diagnosed with Degenerative Disc Disease at this time. As the years went on my problems not only worsened but I had also developed new ones.  I have suffered many sleepness nights due to neck pain, tried many different pillows with no relief,  numbness in wrists & hands and arm pain. I am a side sleeper and also experience severe burning in my upper arms so I am constantly switching from one side to the other.   Last year I started to develop symptoms of RLS.  My former dr  prescribed Requip but it seemed to make things worse so I quit taking it after 2 days. I also experience this same ugly feeling in my arms.  I experience mild to moderate RLS during the day but come nighttime it's a lot worse.  I toss and turn to the point where I have to get up and sleep on the couch so I don't keep my husband awake.  I have tried prescription Ibupofen, Soma, combining ibuprofen & Soma, Naproxen and plain ole asprin. When all these fail I resort to sleeping pills.  I am so sick of this every single night and so sick of taking pills. I don't know what to do anymore, all I know is this has got to stop.  I am tired most of the time due to lack of sleep and depressed. I am not seeing a doctor at this time, partly because I don't have a one (looking for a new one) and partly because I just can't afford the $45 copay.    I don't know if this goes hand in hand but within the last year or so I have begun to experience what I think are pre menopausal symptoms, irregular periods, occasional night sweats, dry skin, slight hair loss, facial hair on skin and irritability.  My former doc did take blood tests but they came back normal. Lately I am constantly hot all of time. It's been very hot where I live so that isn't helping things.  And most recently hearing problems where I experience a thumping in my ears. Certain things can trigger this such as noise from the tv or when listening on the phone, cell phones are the worst so I try to avoid them.  Anyway, right now my main concern is the  DD & RLS.... would it be better to seek out a neurologist for treatment or should I see a different type of doctor?\n\n",
    "posted_time": "Post  by Kat58 » Tue Sep 02, 2008 2:21 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=59714&sid=6f34443d29ecb8ba7c519979dcede7af#p59714"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: Pain & Restless Nights - I Am So Sick Of This!!!",
    "content": "Thanks for your patience.  It would be good to find a primary care physician who is known for his or her thoroughness and compentency in the areas you describe.    It would be worthwhile to screen for hypothyroidism which can cause many of your symptoms including restless legs.   Also, do you suffer from migraines?  Migraine can have extra symptoms like depression, cold sensation and thumping in ears.    Regarding the DDD, it will be important to engage in a regular exercise program including stretching.  A physical therapist can help with the neck and arm exercises. Cervical traction may also help.  An easy carpal tunnel exercise:while resting forearm on a table or the thigh, do wrist extensions holding a light dumbell (< 5lb) until posterior forearm muscle fatigues...daily for 4 weeks.  If pain then stop.  Squeezing exercises eg squeezing a ball are always contraindicated with carpal tunnel.    Keep us posted.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Wed Dec 31, 2008 12:20 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=66477&sid=6f34443d29ecb8ba7c519979dcede7af#p66477"
  },
  {
    "author": "seahorse618  Guest Posts: 2 Joined: Wed Jul 20, 2005 2:14 pm Location: San Diego",
    "title": "Osteonecrosis and ADA",
    "content": "Can anyone tell me if this condition qualifies for ADA?  I need to know because of a job situation... its very important.\n\n",
    "posted_time": "Post  by seahorse618 » Mon Nov 03, 2008 10:52 am",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=63033&sid=6f34443d29ecb8ba7c519979dcede7af#p63033"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Osteonecrosis and ADA",
    "content": "Hi there -  The answer to your question would depend entirely upon the severity of the symptoms and the limitations  placed on you by the degree of the disease.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Sun Dec 21, 2008 9:22 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=65595&sid=6f34443d29ecb8ba7c519979dcede7af#p65595"
  },
  {
    "author": "Firoozeh  Guest Posts: 2 Joined: Sun Nov 02, 2008 8:53 am Gender: Female",
    "title": "Toes in Feet bone Shrinkage?",
    "content": "My Grandmothers  bones in her feet toes seem to have shrunken and gotten narrower..to the point where she is in extreme pain and her weight cannot hold her up...and allow her to walk.   What is the problem here?  It just suddenly happened.  Her toes gotten alot smaller.\n\n",
    "posted_time": "Post  by Firoozeh » Sun Nov 02, 2008 9:09 am",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=62943&sid=6f34443d29ecb8ba7c519979dcede7af#p62943"
  },
  {
    "author": "Firoozeh  Guest Posts: 2 Joined: Sun Nov 02, 2008 8:53 am Gender: Female",
    "title": "Re: Toes in Feet bone Shrunkage?",
    "content": "my grand mom suddenly in a lot of pain in the legs,and she can not walk any more,and her bone in leg suddenly became soooooooo thin,like some thing eating her bones,what is this ,is it bone cancer,she is75 years old,please let me know i am worry for her thank you\n\n",
    "posted_time": "Post  by Firoozeh » Sat Nov 15, 2008 9:35 am",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=64350&sid=6f34443d29ecb8ba7c519979dcede7af#p64350"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "Re: Toes in Feet bone Shrunkage?",
    "content": "Hello,  It is very difficult to tell what  your grandmother’s problem could be without direct clinical examination. It would be also more useful if you can provide us more information about her personal history, medical history, current medications and relevant past history.  This picture could be due to muscle atrophy and weakness. This is usually seen when there is due a neurovascular defect.    If she has diabetes mellitus, a common cause for bilateral symmetrical distal neuropathy (polyneuropathy) and weakness due to defective nerve supply to the peripheral parts of the body including the muscles although late in the course of the disease after sensory neuropathy.  She might have also vascular problems which are common at her age; this might add to the muscle weakness.  This would predispose her to more complications due to immobility like serious infections and DVT.   Other causes like disuse atrophy if she is bedridden for long period, bone or skeletal diseases or malignancies are also possible.  If it is of an acute onset causes like infections (e.g.myositis), drug induced including steroids, and other metabolic abnormalities should be excluded.   I would advise you to follow up with her doctor, direct clinical (especially neurological) examination is essential.  Please keep us updated. Best regards.\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Sat Nov 15, 2008 2:33 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=64370&sid=6f34443d29ecb8ba7c519979dcede7af#p64370"
  },
  {
    "author": "Blondefox2104  Guest Posts: 1 Joined: Fri Jul 22, 2005 2:53 pm Location: Houston  Contact:   Contact Blondefox2104       Yahoo Messenger",
    "title": "Severe knee pain",
    "content": "For many years both my knees seem like they \"pop\" out of place every once in a while. It happens when I sit on my heels and move or if i slightly move the upper part of my leg without moving the lower (when sitting down or standing up, or turning over). Once it \"happens\" it's like my knee bones moved beside each other and then i have to have some one pull my leg straight for me so it snaps back into place. Then it hurts very badly for a few days. This happens a few times a year with both knees. It's never both knees at once. It's starting to happen more offten. Can some one give me an idea of why this is happening,or maybe  tell me what it is?  I'm only 22 and I was never on track or any other sport like that. I've been a swimmer for 13 years.\n\n",
    "posted_time": "Post  by Blondefox2104 » Fri Jul 22, 2005 3:05 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=17254&sid=6f34443d29ecb8ba7c519979dcede7af#p17254"
  },
  {
    "author": "druv  Guest Posts: 5 Joined: Thu Oct 06, 2005 12:33 am Location: india",
    "title": "arthritis",
    "content": "hi, have you checked if its arthritis or not.. the same symtpoms are there in arthritis too. The term is used for over 100 different varieties of joint problems that have specific symptoms, such as pain, swelling, and stiffness. Osteoarthritis (OA) and rheumatoid arthritis (RA) are the two most common types of arthritic conditions.  The effects of arthritis are often mild, but in some cases they can be crippling. Rheumatoid arthritis affects between one and two out of every hundred people, with more women than men being affected. Joints and other organs may be affected by this form of arthritis..  so please go and check with your bone specialist on this.\n\n",
    "posted_time": "Post  by druv » Thu Oct 06, 2005 12:47 am",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=22619&sid=6f34443d29ecb8ba7c519979dcede7af#p22619"
  },
  {
    "author": "papia  Guest Posts: 3 Joined: Sun Oct 09, 2005 11:33 am Location: bangladesh",
    "title": "medications for rheumatoid arthritis",
    "content": "oh hi blondefox, im quite sure as druv said that it could be rheumatoid arthritis..  my grandmother too is suffering from this so i know what are the symptoms . this is just the beginning so please start your treatment immediately..  My granny used clinoril for her condition and gradually she began to see some improvement. though her condition did not improve drastically but yes there was marked improvement iin the pain and movement too. More common side effects may include:  Abdominal pain, constipation, diarrhea, dizziness, gas, headache, indigestion, itching, loss of appetite, nausea, nervousness, rash, ringing in ears, stomach cramps, swelling due to fluid retention, vomiting . Less common or rare side effects may include:  Abdominal inflammation, anemia, appetite change, bloody diarrhea, blurred vision, change in color of urine, chest pain, colitis, congestive heart failure, depression, fever, hair loss,  liver failure, loss of sense of taste, low blood pressure, muscle and joint pain, nosebleed, painful urination, pancreatitis, peptic ulcer, sensitivity to light, shortness of breath, skin eruptions, sleepiness, Stevens-Johnson syndrome (blisters in the mouth and eyes), vaginal bleeding, weakness, yellow eyes and skin .\n\n",
    "posted_time": "Post  by papia » Sun Oct 09, 2005 11:57 am",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=22904&sid=6f34443d29ecb8ba7c519979dcede7af#p22904"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Severe knee pain",
    "content": "Hello blondefox -  What you describe sounds like \"loose\" joints. Your knees, being the ones that carry a large amount of weight and do a huge amount of work, would likely be the first ones (and maybe the only ones, but time will tell) to show signs of looseness. This is usually due to connective tissue disease, either of the mixed variety, Ehlers-Danlos Type One, or Marfan's syndrome. Are you by any chance tall or at least have long legs (and arms) compared with others? People with Marfan's often have longer-than usual long bones, as well as sometimes longer digits, especially the fingers.   Mixed Connective Tissue Disease (MCTD) can cause a lot of rather random-seeming problems over time, rarely life-threatening ones. E-D can cause more serious joint problems in time, and requires more attention. Marfan's Syndrome can be largely benign, but often also can often cause, over time, such serious problems as detached retina, heart valve problems and even aortic aneurism. For this reason, you probably ought to be tested for autoimmune and connective tissue disease. You may just have \"trick\" knees, but more often than not this partial slipping out of joint can cause problems, including several forms of arthritis due to the constant irritation. Collagen (connective tissue) disease is sometimes compatible with little or no limitation, but it's best to know at least, so that if different annoying future problems surface your doctors will know to look at that as a possible cause. If it's there.   I hope this is helpful. Please do follow up with us.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Thu Jul 17, 2008 3:23 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=58859&sid=6f34443d29ecb8ba7c519979dcede7af#p58859"
  },
  {
    "author": "HappyLady27  Guest Posts: 24 Joined: Sun Nov 25, 2007 10:47 am",
    "title": "Degenerative Bone Disease in a twelve year old.",
    "content": "Hi everyone I hope you all are doing well.              My niece was having horrid back pain, so bad that she was crippleing over.  She was takein to the doctors and had scans and all sorts of tests. The doctors were ballfed that a twelve year old had degenerative bone disease.  She has  four buldging diskes and one that is so deterierated that it basically gone. My sister had back surgery for this, also my mother and brother have this.Is this herreditary ? Is it odd that a twelve year old has this? My mother thinks that it was brought out becuse my  niece fell and hit her back when she was two years old. That is a big streach. Could that bring something like that out? I thank you for reading this  I just am very curiouse.  Happy Lady\n\n",
    "posted_time": "Post  by HappyLady27 » Wed Jan 30, 2008 9:14 am",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=53439&sid=6f34443d29ecb8ba7c519979dcede7af#p53439"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "Re: Degenerative Bone Disease in a twelve year old.",
    "content": "Hello Happy Lady,  I would recommend your niece see her pediatrician and possibly an endocrinologist.  While it is possible that some trauma led to this, I would be concerned that she may have some problems with her calcium regulation.  I would recommend her vitamin D and parathyroid hormone levels be tested to look for any conditions such as rickets or other similar problems.  Follow up with her doctor is important.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sun Feb 03, 2008 11:35 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=53537&sid=6f34443d29ecb8ba7c519979dcede7af#p53537"
  },
  {
    "author": "HappyLady27  Guest Posts: 24 Joined: Sun Nov 25, 2007 10:47 am",
    "title": "Re: Degenerative Bone Disease in a twelve year old.",
    "content": "Thank you very much for replaying to me, my sister had took her to the doctor she had went to for her back, however she is also going to get a second oppinon thanks for the advice. HappyLady27\n\n",
    "posted_time": "Post  by HappyLady27 » Sat Feb 09, 2008 12:56 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=53627&sid=6f34443d29ecb8ba7c519979dcede7af#p53627"
  },
  {
    "author": "lilylenay  Guest Posts: 22 Joined: Thu May 03, 2007 3:47 pm",
    "title": "Lower back has hurt constantly for the last year",
    "content": "for the last year my lower back has hurt constantly. And not just a little bit either. Thean the pain spread to my legs but especially my left hip and calves. There are times it hurts so bad that I have a really hard time walkin.i have had a doctor say say he thought it was either bursitis or tendonitis. I am currently taking 2 anti-inflammatory pills per day and 3 ibuprofen's x's 2-3 per day. and that doesn't make it stp hurting at all. I have had blood work done. Not sure of the exact tests,but so far everything has been normal. I am 21 and I feel 60. It makes it hard for me to take care of my 9 month old daugter sometimes. Degenerative disc disease runs on my dad's side of the family,and on my mom's it's tumors and degenerative bone and joint disease. If you could please give me some ideas I would appreciate it very much. Thanx for your time  amber\n\n",
    "posted_time": "Post  by lilylenay » Wed May 16, 2007 2:16 am",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=42550&sid=6f34443d29ecb8ba7c519979dcede7af#p42550"
  },
  {
    "author": "Marceline F, RN  Nurse Posts: 229 Joined: Wed Feb 28, 2007 1:54 am",
    "title": "[no title]",
    "content": "Dear Amber, Our lower back is a very fragile area and easily prone to injury.  Doing simple things such as carrying your precious child on one hip all the time can \"throw\" your back out, as well as wrong turning to pick up heavy loads.  The Lumbar region and the Sacroiliac joints have both been culpable of causing great pain when injured!  While I respect and appreciate your primary's attention to your complaint, frequently allopathic medicine practitioners prefer medicinal interventions and do not choose to perform manipulation of these areas back into proper alignment. It may be of value to contact your insurance company to see who they will authorize: Chiropractic Physicians or Doctors of Osteopathy (DO) whose practice includes direct hands on manipulation and realignment of spinal subluxations.  It would be well worth your while to explore Chiropractic care to solve your problem.\n\n",
    "posted_time": "Post  by Marceline F, RN » Thu Jun 28, 2007 3:11 am",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=43827&sid=6f34443d29ecb8ba7c519979dcede7af#p43827"
  },
  {
    "author": "greeneyes58  Guest Posts: 4 Joined: Sun Aug 19, 2007 6:38 pm",
    "title": "low back pain",
    "content": "age 49 female, I had lower back pain and sciatica for 7 years, and suffered so much with the pain, I can truly sympathize so much with you.  I went to a wonderful pain doctor and he caurterize the nerves in my lower back and I have no more pain at all, I am pain free.  I have heard this works for some people but then some it doesnt.  So good luck and I wish you well.  Greeneyes58\n\n",
    "posted_time": "Post  by greeneyes58 » Sun Aug 19, 2007 8:09 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=46585&sid=6f34443d29ecb8ba7c519979dcede7af#p46585"
  },
  {
    "author": "Hippytrip  Guest Posts: 1 Joined: Fri May 18, 2007 7:49 am",
    "title": "TOE PAIN",
    "content": "I am a 24y/o female (nurse at that). The pain started back in November? In the second toe of my right foot, I thought at first my new shoes squeezed my toes together causing the soreness. So I never wore the shoes again. Soreness changed to redness & swelling which spread to my big toe & my 3 toe, then up my foot almost to my ankle. I went to the podiatrist did a round of ABX & a steroid Dose Pack, no DX. I went back several times, the Steroid relieved the pain and swelling for about 2 weeks, then it returned. Not spread all over my foot, just on my 3 toes. Since then I have developed A Swollen, red nodule on my great toe right about the middle of it. I have had 2 sets of X-Rays, an MRI, 2 CBC's & Uric Acid's, 1 ANA, CCP IGg, HLA b27, Rheumatodi Arthritis factor, Sed. Rate, & a C-Reactive Protein. EVERYTHING IS NORMAL. I am in serious pain and need help trying to a DX. I have seen 1 podiatrist, 1 bone dr, 2 rheumatologis, & 4 of the Gyno's that I work for. Everyone just says \"WEIRD\". Well I say PAINFUL. PLEASE ANY IDEAS WILL HELP...\n\n",
    "posted_time": "Post  by Hippytrip » Fri May 18, 2007 8:00 am",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=42684&sid=6f34443d29ecb8ba7c519979dcede7af#p42684"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi Hippytrip, Were any diagnostics, i.e., bone scan completed to evaluate for osteomyelitis? Have you experienced any drainage and if so was a specimen sent for culture and sensitivity? Sincerely, Theresa Jones, RN\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Fri Jun 22, 2007 2:11 am",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=43766&sid=6f34443d29ecb8ba7c519979dcede7af#p43766"
  },
  {
    "author": "burning neck  Guest Posts: 1 Joined: Mon Sep 26, 2005 10:37 pm Location: Ga.",
    "title": "neck and shoulders",
    "content": "I am a 45 yr. female tierd of the burning in my neck along with numbnes and tingling down my neck both shoulders and arms in the last week my arms feel like they weigh a million pounds. I am also numb all the way down my back. I have degernerative disc diease and splondyosis.MRI results show loss of disc space at c4 and c5 ,anterior spuring ,disc protrussion.C3-C4 disc spur complex with underlying protruded disc.C4-C5bilateral disc spur complexes Encroachment into neuroforamina. I also have an anual tear in my L4-L5 .Hernated disc in L5-s1.I also have Osto Arthritis.I have not been back to the dr. since my findings of my MRIs.In Constant pain and scared .I have An ulcer so I cant take  antiinflamatories.The Dr. gave me pain med and muscle relaxiors it dosent help.Idont know what to do my husband was killed 6 months ago and I have a 5 yr. old and a 20yr old with a new grandbabby 2 wks. old. Live with me.I have to work.I would like to know if i need surgury how long is recup. time. I have been wearing a collor for 2 months .I feel like I might be doing more damage to my self because of being scared.If surgury how long is recover time. I need to know the pros and cons. Thank you so much for ypur time.\n\n",
    "posted_time": "Post  by burning neck » Mon Sep 26, 2005 11:18 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=21685&sid=6f34443d29ecb8ba7c519979dcede7af#p21685"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Hello,  These symptoms are related  to the degenerative disc lesions in the region of the cervical vertebrae. An associated Muscle spasm alone can cause or aggravate the pain due to disc lesions.    These conditions can be treated in the majority of cases with medical and conservative treatment (non surgical).  Non surgical treatment include, physical therapy, certain exercises, weight reduction, epidural steroid injections, non-steroidal anti-inflammatory medications, and decreased daily activities.   Surgery for disc herniation is only considered if symptoms are not controlled after at least one month (6 weeks) of medical and conservative treatment, or in very complicated cases with serious symptoms.  A spinal physician is the one able to determine if surgery is the best treatment for the patient after evaluating the patient personal, social, occupational and disease condition.\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Fri Aug 18, 2006 2:24 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=33892&sid=6f34443d29ecb8ba7c519979dcede7af#p33892"
  },
  {
    "author": "dcbowiemmd  Guest Posts: 1 Joined: Wed Feb 15, 2006 12:13 am  Contact:   Contact dcbowiemmd       AOL",
    "title": "degen joint disease plus",
    "content": "I am 47,male,asym hiv,neuropathy,mild IgaNeph,toprol xl 50mg,altace 10mg,lipitor 10mg,sustiva 600mg,epzicom,undetectable hiv. Recent dexa showed mild bone loss,   wound up in er last week, bone pain, having consipation,some breathing probls, massive xrays showed:  LUMBAR SPINE Comparison: None. Findings: There is mild scoliosis with convexity to the left. There are mild degenerative changes with minimal intervertebral disc space narrowing at the L3-4, L4-5 and L5-S1 levels with small anterior osteophytes at these levels. The vertebral body heights are normal. There is no fracture or subluxation seen. There is minimal facet hypertrophy at the L5 level. IMPRESSION: 1. Negative fracture. 2. Mild scoliosis with convexity to the left. 3. Mild degenerative changes at L3-4, L4-5 and L5-S1.  CHEST, PA AND LATERAL VIEWS: Comparison: None. Findings: The cardiac silhouette is within normal limits. There is right hilar fullness, which may be related to adenopathy or vasculature. An underlying mass in this location cannot be entirely excluded. There is a 3 mm nodular density in the left upper lobe, which is nonspecific. Recommend comparison with outside films or follow-up in three to six months. The remainder of the lung fields are grossly clear. There is no focal consolidation, pneumothorax or pleural effusion.  SACRUM COCCYX INDICATION: Pain. SACROCOCCYGEAL FILM: Suboptimal positioning provided. No definite fracture or dislocation is seen. If there is strong suspicion of a sacrococcygeal fracture, consider CT scan.   BILATERAL HIPS There is no fracture, dislocation or other bony abnormality detected. There is a 6.6 x 3.3 cm air collection at the level of the pubic symphysis. Question attempted Foley catheter placement or herniated bowel. IMPRESSION: 1. Negative fracture. 2. Air collection at the level of the pubic symphysis, as above described.  Also .. swooshing noise in my left ear .. dr told me I have an ear effusion.  Anyway ... They said I have degen joint disease based on the xrays and I guess because of the pain I was in.  Gave me two pain meds .. they help so much .. oxycodone w/apap and naproxen.  So what type of doc do I see now?  I am at a loss.  I will be seeing a bone doctor .. but after reading the reports I got to bring with me ... I just don't know ..   I find it hard to work with all of this .. If I did not have the pain and dull feeling I could work .. but all of this is disabling .. (try to convince the higher powers of that! )  ...   anyway .. can you email give me your thoughts and what my next step/s should be?  Thanks\n\n",
    "posted_time": "Post  by dcbowiemmd » Wed Feb 15, 2006 12:36 am",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=30703&sid=6f34443d29ecb8ba7c519979dcede7af#p30703"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi dcbowiemmd, The \"bone doctor\" or Orthopedic Physician, will be able to best identify appropriate treatment options regarding the pain you are experiencing. There are medications that decrease pain levels to a more tolerable level that are non-narcotic based. However, with regards to the statement in the report \"right hilar fullness\" should also be followed up on. I hope you are being evaluated and treated by an Infectious Disease Specialist. Sincerely, Theresa Jones, RN\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Fri Aug 11, 2006 6:14 am",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=33840&sid=6f34443d29ecb8ba7c519979dcede7af#p33840"
  },
  {
    "author": "JKF  Guest Posts: 51 Joined: Thu Jan 19, 2006 11:08 am Location: Missouri",
    "title": "Are they connected",
    "content": "I have been diagnosed with severe arthritis in my neck (by an MRI) and a pinched nerve in my neck ( by an emg). I am scheduled to see a neurosurgeon in two weeks. Is this a serious condition.?  I have been feeling numbness and tingling in my left shoulder and weakness in my arms for quite a qhile. Thank you. JKF\n\n",
    "posted_time": "Post  by JKF » Fri Jun 16, 2006 10:36 am",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=33033&sid=6f34443d29ecb8ba7c519979dcede7af#p33033"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi JKF, Depending on the specific area of nerve compression determines conservative verses surgical intervention. Nerve compression may result from injury, ie., whiplash, herniation, arthritis, etc. Conservative treatment typically is aimed at relieving symptoms and may range from the use of certain medications, physical therapy, etc., to alleviate the irritation and compression/pressure. When conservative measures fail surgical treatment may be beneficial. Sincerely, Theresa Jones, RN\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Wed Jun 21, 2006 8:36 am",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=33099&sid=6f34443d29ecb8ba7c519979dcede7af#p33099"
  },
  {
    "author": "JKF  Guest Posts: 51 Joined: Thu Jan 19, 2006 11:08 am Location: Missouri",
    "title": "[no title]",
    "content": "I went to the doctor today. She    told my several of my discs are compressed and a nerve is p inched. She recommends for now physical therapy and epidural shots in the neck. She thinks that will help for now. Eventually I may have to have surgery but as for now we will try a more conservative approach. JKF\n\n",
    "posted_time": "Post  by JKF » Thu Jun 29, 2006 4:59 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=33190&sid=6f34443d29ecb8ba7c519979dcede7af#p33190"
  },
  {
    "author": "4PtSake  Guest Posts: 29 Joined: Thu May 19, 2005 3:22 am Location: Montana  Contact:   Contact 4PtSake       Yahoo Messenger",
    "title": "Dizziness and DDD...",
    "content": "Hello  If anyone can answer this question I would be ever so grateful.  After a fall several months ago I found out through Xrays initially and then an MRI that I have \"...fairly advanced cervical sponylosis with degenerative disc disease and stenosis at C5-6\" according to the orthapedist I was seeing. I was told by the PA who did the Xrays that my neck has no natural curve left and is starting to curve backwards. It was obvious, even to me, that the problem had been there for a long time but I don't understand how I could have been more-or-less unaware of it prior to the fall. If anyone could explain how the fall could have made the problems symptomatic all of the sudden that would help too but my main question is this...Could one (or any combination) of the affore mentioned \"issues\" with my neck be causing dizziness (and sometimes nausea) and is it something I should worry about? I have occassional tingling in my upper arms and sometimes my pinky and ring fingers (mostly on the right) will get pins-and-needles or go numb when I overdo certain movements...the doctor said those symptoms are most likely connected but not a major concern unless they become more persistant...does the dizziness fit into that catagory as well? Any information, comments, ot insights would be greatly appreciated. Thank you so much for offering this opportunity/forum!\n\n",
    "posted_time": "Post  by 4PtSake » Thu Jul 28, 2005 2:36 am",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=17630&sid=6f34443d29ecb8ba7c519979dcede7af#p17630"
  },
  {
    "author": "4PtSake  Guest Posts: 29 Joined: Thu May 19, 2005 3:22 am Location: Montana  Contact:   Contact 4PtSake       Yahoo Messenger",
    "title": "[no title]",
    "content": "P.S. I've also had some trouble with swallowing...like someone is pressing on my throat an inch or so above my collar bone.\n\n",
    "posted_time": "Post  by 4PtSake » Thu Jul 28, 2005 3:19 am",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=17632&sid=6f34443d29ecb8ba7c519979dcede7af#p17632"
  },
  {
    "author": "magic  Guest Posts: 4 Joined: Mon Nov 14, 2005 8:11 am Location: Florida",
    "title": "Dizziness",
    "content": "You know I have just joined this site and no one answers I seen this one and thought I would respong I too had a hit to myhead and been having the same dizzy feeling and numbness and pain Let me know how your doing\n\n",
    "posted_time": "Post  by magic » Wed Nov 16, 2005 3:37 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=25260&sid=6f34443d29ecb8ba7c519979dcede7af#p25260"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hello, Cervical spine injuries including herniation and bone spurs, nerve compression, often cause numbness, tingling, weakness, of arms and hands As for the dizziness and accompanying nausea, dizziness in itself, will cause episodes of nausea and sometimes vomiting. Cervical Vertigo generally results from damage to the cervical nerves and may be associated with, for example,blunt head injuries, whiplash, cervical spondylosis, etc. A MRI is a useful diagnostic tool in identifying disorders involving nerves etc. Sincerely, Theresa Jones, RN\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Thu Mar 16, 2006 8:04 am",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=32011&sid=6f34443d29ecb8ba7c519979dcede7af#p32011"
  },
  {
    "author": "4PtSake  Guest Posts: 29 Joined: Thu May 19, 2005 3:22 am Location: Montana  Contact:   Contact 4PtSake       Yahoo Messenger",
    "title": "Theresa and Magic",
    "content": "Hi Thersa and Magic! Thank you, Theresa, for the information and response. I've actually been doing somewhat better since that post, Magic, and I'm sorry no one has responded to your questions...I hope everything is going OK for you.  I still have occassional occipital headaches, tingling, and dizziness but I was sent for physical therapy to work on the muscles and given a home exercise program and an occiput cushion to use to keep them loosened up. If I do too much lifting or anything that gives my neck too much of a workout it can greatly aggrivate things but I'm slowly learning what NOT to do and that helps too. They did do an MRI and said I had advanced DDD but I was not told that I had any nerve damage. Is it possible, Theresa, that occassional swelling due to irritation in the cervical spine could cause the symptoms on an occassional basis rather than it being due to damage?  One other question I do have, Theresa, is...my neck sometimes feels like it sticks and then lets loose with a pop (sometimes painful) when I turn my head or look up...it usually happens when my neck symptoms have been aggrivated. Is it likely that this problem is bone spurs or could this also be the result of the loss of disc space (or the spondylosis) and my vertabra grinding on each other? Thanks again, Theresa...sometimes a little info can put a lot of things in much better perspective. I truly appreciate having this forum available to ask questions and you taking the time to answer them. Please take care :o)\n\n",
    "posted_time": "Post  by 4PtSake » Fri Mar 17, 2006 12:22 am",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=32029&sid=6f34443d29ecb8ba7c519979dcede7af#p32029"
  },
  {
    "author": "splume  Guest Posts: 32 Joined: Fri Sep 17, 2004 6:35 pm Location: st. louis",
    "title": "frontal head posture",
    "content": "I recently developed a large swollen mass at the base of my neck, I went to a chiropractor, (I've never been to one before) they took x-rays and told me that my spine was reversed, that it was as straight as a rod... and this doctor proceeded to tell me in all her years she has never seen anyone as young as me have this so bad.... she showed me a poster that showed a normal spine, and stage 1,2, & 3 subluxation degeneration... she told me I was at stage two, and I would have to be seen everyday for at least a week. I asked what this leads to, but she just handed me a pamphlet on frontal head posture. I brought this information to my primary doctor, who in turn had me go to the hospital to get what he called \"real\" x-rays. I did this this mornng.... I have heard nothing as of yet.... but I went back to the chiropractor today and he managed to adjust my neck once, as my swelling is still profound, and my muscles are still to tense to manuvere my head freely. I am scheduled to go back in the morning to try some more adjustments.... What exactly is this disease... can it be cured? how did I get it? what should I do?\n\n",
    "posted_time": "Post  by splume » Fri Apr 29, 2005 8:28 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=13132&sid=6f34443d29ecb8ba7c519979dcede7af#p13132"
  },
  {
    "author": "Rhonda P, CEP  Paramedic Posts: 252 Joined: Wed Mar 16, 2005 8:37 am Gender: Female Location: USA",
    "title": "subluxation degeneration",
    "content": "Hello splume,  If you have a spinal subluxation degeneration in stage 2, you may have bone spurs, calcium buildup and arthritis in your neck and I don’t think you should be having aggressive movement done in that area until you know if a piece of spur could be broken off and injure something or cause permanent numbness or paralysis. You should probably be seeing a bone specialist; I think your second doctor was probably right to order another x-ray. If you can, try to hold off on the chiropractor treatment until after you get the results from the second x-ray just to make sure there isn’t anything that can become loose through manipulation. A second opinion never hurts when you’re talking about your body and health.\n\n",
    "posted_time": "Post  by Rhonda P, CEP » Sat Apr 30, 2005 10:46 am",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=13156&sid=6f34443d29ecb8ba7c519979dcede7af#p13156"
  },
  {
    "author": "ppm  Guest Posts: 1 Joined: Fri Apr 01, 2005 2:20 pm Location: New York",
    "title": "Cleidocranial Dysostosis",
    "content": "Looking for help!  I am a 27 year old male born with Cleidocranial Dysostosis.  Research tells me that this birth defect is hereditary but no one that I can find in my family tree has it.  I am looking at starting a family in the near future and would like any information that I can obtain about passing this on to my children.  I am wondering if any symptoms of this can be noticed in an amnio?  If not, how long into the pregnancy does it take to notice the symptoms?  Any information that you can give me would be greatly appreciated.  Thank You, Paul\n\n",
    "posted_time": "Post  by ppm » Fri Apr 01, 2005 2:26 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=11711&sid=6f34443d29ecb8ba7c519979dcede7af#p11711"
  },
  {
    "author": "Rhonda P, CEP  Paramedic Posts: 252 Joined: Wed Mar 16, 2005 8:37 am Gender: Female Location: USA",
    "title": "cleidocranial dysostosis",
    "content": "Hello Paul,  The American Journal of Human Genetics has quite a few articles on Cleidocranial dysostosis. This is inherited as an autosomal dominant characteristic, which means that if one parent is affected, each child has a 50% chance of having the disease. Any child who inherits the gene for the condition from the affected parent, regardless of the other parent's normal gene, will develop it. Cleidocranial dysostosis causes an incomplete development or absence of the collar bones and allows the shoulders to be brought together in front of the body. Other bone abnormalities also exist and the persons Intelligence is usually normal. The disorder is present from before birth (congenital) and equally common in males and females.  Genetic counseling is appropriate for prospective parents with a family history of cleidocranial dysostosis, or if one or both parents are affected.  I don’t believe it can be picked up by Amniocentesis but it can be found on Ultrasound or X-ray\n\n",
    "posted_time": "Post  by Rhonda P, CEP » Thu Apr 07, 2005 8:34 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=12016&sid=6f34443d29ecb8ba7c519979dcede7af#p12016"
  },
  {
    "author": "dmamacher  Guest Posts: 7 Joined: Tue Dec 07, 2004 6:38 am Location: South Carolina",
    "title": "AC Joint",
    "content": "I woke from a nap on Christmas afternoon (Saturday) in a severe amount of pain.  Although I napped on the couch and didnt really move, the pain was coming from my left shoulder.  Since it was a holiday weekend I resigned myself to have to wait until Monday to see a Dr..    Monday morning when I woke, the pain was gone but I had limited movement when it came to certain reaching movements.  Wednesday the pain was back, in addtion to the movement problems.  The pain stopped by Friday but I was referred to have an EMG.  It  showed that the infraspinatus and the supraspinatus were \"dead\" as i call it.  There was nothing coming from those two muscles.  An MRI shows Hypertrophy of the AC Joint which is causing impingement of the rotator cuff.  I do have Degenerative Joint Disease and have had to have a disc removed at L4-L5 but my question is, can there also be a neurological cause to this?  An MRI shows that I have prominence of the ventricular system and mild diffuse volume loss.  I have memory problems and my Neurologist found gait disturbances.  I am waiting for my appointment for him to go over the several brain MRIs that I've had (TIA related).  I can handle a simple ortho issue but my fear is that its more.  Do you have an opinion?  I appreciate any feedback you can provide.\n\n",
    "posted_time": "Post  by dmamacher » Fri Jan 21, 2005 11:23 am",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8390&sid=6f34443d29ecb8ba7c519979dcede7af#p8390"
  },
  {
    "author": "Dr. A. Saif  Medical Doctor Posts: 101 Joined: Mon Oct 25, 2004 1:56 pm Location: UK  Contact:   Contact Dr. A. Saif       Yahoo Messenger",
    "title": "[no title]",
    "content": "Dear D,  Sorry about the rather long lag between post and reply, I presume by now you have much of the answers you need.   I will focus on the things you have mentioned that relate to your shoulder The supraspinatus and infraspinatus are part of the rotator cuff of muscles that attach to the top end of your humerus (the humeral head), and move your shoulder.  They can appear dead to EMG is the nerve to them is injured.  The suprascapular nerve supplies these and can be damaged by pressure on a particular area of your shoulder.  The damage can also be caused by a cyst that presses on this nerve at a particular point on the shoulder blade (scapula).  Another reason is a reason is a rotator cuff tear.  Iit would have to be quite a big tear, and although can be caused by impingement, I presume the MRI didn't show such a tear.  Impingement itself is painful, and requires intitially physio and anti-inflammatories, perhaps a shoulder injection of steroids, occassionally needs surgical decompression...  While TIAs and other neurological conditions that you have mentioned can affect these muscles, the EMG trace would not be \"dead\", and pain is not normally a feature.  Hope this helps  Saif\n\n",
    "posted_time": "Post  by Dr. A. Saif » Fri Feb 18, 2005 11:55 am",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=9639&sid=6f34443d29ecb8ba7c519979dcede7af#p9639"
  },
  {
    "author": "firemom31  Guest Posts: 12 Joined: Mon Nov 15, 2004 8:49 pm Location: Ohio",
    "title": "Can I have DJD at my age?",
    "content": "I have always been very active and healthy. I am a volunteer EMT, which is physically strenuous. Three years ago I jumped out of a squad onto a concrete surface. I was carrying around 100lbs of equipment and landed very hard. I suffered severe, debilitating lumbar pain and was told by the doctor that I had subluxated vertebrae at L5-S1. This has severly limited my physical activity. When I lie on my side I can hear and feel my spine popping from my neck down to the mid-thoracic area. It is usually painless but occaisionally I experience sharp pain. I also have hip and thigh pain on the right side and my hip frequently catches and pops on that side, which is also quite painful. The pain often wakes me up during the night. I have been given Vicodin but it doesn't help at all. I fear that my back injury has altered my gait and in turn caused degeneration in my hip. Do I have a hip replacement in my future? I can't take NSAIDS due to a hx of gastric ulcers.\n\n",
    "posted_time": "Post  by firemom31 » Wed Nov 17, 2004 10:07 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6505&sid=6f34443d29ecb8ba7c519979dcede7af#p6505"
  },
  {
    "author": "Dr. A. Saif  Medical Doctor Posts: 101 Joined: Mon Oct 25, 2004 1:56 pm Location: UK  Contact:   Contact Dr. A. Saif       Yahoo Messenger",
    "title": "[no title]",
    "content": "Hi Firemom,  I guess Degenerative Joint Disease can occur at you age...ceratinly you sound as if you have given your joints enough workout.  Osteo-arthritis can be secondary to both specific injuries to the joints, as well as repeated low grade stresses over the years.    Your back and neck Having a spondylolisthesis, \"subluxated vertebrae at L5-S1\", can cause low back pain and also cause pain radiating into the legs, if nerve roots are compressed. Instability here can be due to some injury, or something you have since childhood.  If a lumbar suport helps, it is said to a sign of some instability here, which perhaps might benefit from surgery.  Vertical impacts can cause stressed to your discs and the facet joints in your spine. DJD in the latter can cause the popping sounds in your back, although some people have them normally.  Your hip and thigh pains could reflect disease in the hip joint.  However hip joint pains are more typically focused around the groin.  It may necessary to check whether the pains in your thigh and side do not represent nerve root problems, caused by your back.  Another cause of such pain may be DJD in the sacro-iliac joints...  Back problems can certainly cause abnormal gait, just as hip problems can...it is probably likely from your story that that both are caused by your previous stresses to your body.  If you can't take NSAIDs ( there are  newer ones that do not irritate the stomach  such as Celecoxib), it does limit the spectrum of drugs that help this condition.  Physiotherapy and swimming will help in most cases.  More radical treatment whether it is hip replacement, or spinal surgery to stabilise your lower back, requires a greater detailed examination and investigation.  If you are having sleepless nights, I guess you need some help, and I would suggest you approach your friendly neighbourhood orthopedic surgeon for help.  He may examine you to evaluate whther the pin in your hip comes from your hip or your back, do some blood tests to ensure your joints are not affected by some systemic inflamatory condition and perhaps do an X-ray of your pelvis, if he feels your hip is the culprit.  At your relative youth, perhaps a hip replacement is bit extreme, and as for predicting whether you will need one in the future...welll it is a common operation, but my crystal ball has sadly lost its shine   Hope this helps  Saif\n\n",
    "posted_time": "Post  by Dr. A. Saif » Fri Dec 10, 2004 3:51 pm",
    "category": "Orthopedics",
    "sub_category": "Degenerative Bone Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6976&sid=6f34443d29ecb8ba7c519979dcede7af#p6976"
  }
]