[
  {
    "author": "nina80  Guest Posts: 1 Joined: Sat Jun 19, 2010 12:54 pm Gender: Female",
    "title": "Information on home dialysis and equipment",
    "content": "This is for a friend of mine and I am trying to get some information that would help him with his dads treatment. He is pretty stressed and I wanted to help as much as possible and since he is on a time crunch.   1. Which is the best dialysis equipment for home use with/without a home nurse 2. How can the equipment be purchased for a reasonable price to ship if to Tashkant? 3. Where or which country can it be purchased from for easy shipping?\n\n",
    "posted_time": "Post  by nina80 » Sat Jun 19, 2010 1:00 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Dialysis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=94595&sid=49dd062a5f7cb617d6adea3156a05bfc#p94595"
  },
  {
    "author": "isapr5  Guest Posts: 1 Joined: Fri Oct 16, 2009 9:24 pm Gender: Male",
    "title": "Risk of Kidney Malfunction after Attempted Overdose",
    "content": "Hello,  I attempted suicide about a month ago by ingesting about 30 antidepressant pills (Lexapro). I've since started an aggressive regimen of Effexor and Abilify as well as individual and group therapy.  I'm concerned, however, that even if I didn't sustain kidney and liver damage immediately following my overdose, I can expect kidney damage in the long term that will require dialysis. The paramedic who arrived at the scene of my overdose stated that I may have to undergo dialysis in 10-15 years, and my attending nurse corroborated that.  Is there anything I can do (e.g., lifestyle changes in diet) within the next 10 or so years to reduce the odds that I will eventually require kidney dialysis? This of course assumes that I will overcome my suicidal tendencies, and I'm working hard to do just that.   Thank you, and I look forward to hearing from you.  Best,  isapr5\n\n",
    "posted_time": "Post  by isapr5 » Fri Oct 16, 2009 9:50 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Dialysis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=84076&sid=49dd062a5f7cb617d6adea3156a05bfc#p84076"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "Re: Risk of Kidney Malfunction after Attempted Overdose",
    "content": "Hi isapr5, I hope that you are continuing to improve! The complication of an overdose of certain medications is liver and kidney failure. According to the Lexapro Official FDA information renal failure is a rare complication of a Lexapro overdose. That certainly is not meant to imply \"Never\" but rare. Some of the causes of chronic disease are uncontrolled hypertension and diabetes, large quantities of over the counter pain relievers, large quantities of caffiene, etc. Eat a healthy diet, exercise and continue your treatment for your depression. Best wishes! Sincerely, Theresa Jones, RN\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Sun Oct 25, 2009 6:57 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Dialysis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=84682&sid=49dd062a5f7cb617d6adea3156a05bfc#p84682"
  },
  {
    "author": "SDRAKE814  Guest Posts: 1 Joined: Fri Dec 01, 2006 3:15 pm",
    "title": "peritoneal dialysis and pregnacy",
    "content": "I am a 32 year old women and i am on peritoneal dialysis. I am also on the list for a kidney transplant and have been on that list for the past 4 years. My question to you is , is it possible to have a healthy baby while on dialysis. I think my time is runny out and i want a child. At this time i have no children. If this can be done what should i do to make sure all is ok?? Please any info will be appreciated..   thanks chlidless in NJ\n\n",
    "posted_time": "Post  by SDRAKE814 » Fri Dec 01, 2006 4:03 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Dialysis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=35448&sid=49dd062a5f7cb617d6adea3156a05bfc#p35448"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Hello,  Women of childbearing age do not often get pregnant whilst on dialysis because the high level of waste products from renal failure interfere with ovulation and the menstrual cycle. Do you still get your perdiods? If a woman becomes pregnant while on dialysis they often develop high blood pressure which almost always causes problems leading to premature delivery.  In one study performed in the United States, 1.5% (between one and two in a hundred) of young women on dialysis became pregnant in a two year period. Half the pregnancies resulted in the birth of a live child. There were many miscarriages in early pregnancies, and some stillbirths. All living babies were born prematurely.  I think it would be better if you wait till after a kidney transplant. While there are still risks, the likelihood of a successful pregnancy rises to over 70%.   You would also be better able to care for a child if they had a kidney transplant, rather than being on dialysis.  Hope this helps.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Thu Dec 21, 2006 9:37 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Dialysis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=36568&sid=49dd062a5f7cb617d6adea3156a05bfc#p36568"
  },
  {
    "author": "renchy RN  Guest Posts: 1 Joined: Sun Jan 11, 2009 1:09 pm Gender: Female",
    "title": "Re: peritoneal dialysis and pregnacy",
    "content": "We have Case Report of a 43 year old women, 4 years on peritoneal dialysis. She has three daughters. First two she had before starting PD, and one when she had while she was on PD.  She is also on list for a kidney transplant.  Concerning your question, yes, it possible to have a healthy baby while on peritoneal dialysis. Of course, pregnancy on PD is very rare, but it is possible. The percentage in Croatia (my country) is 1-2%, I think. No more.  In our Case Report, pregnancy resulted in the birth of a live child. Baby was born normally, nine month (not prematurely, not Cesarean section). Baby has 5 month now, and it is health.  I hope this gives you hope.  Good luck.  Renchy\n\n",
    "posted_time": "Post  by renchy RN » Sat Jan 31, 2009 3:09 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Dialysis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=70349&sid=49dd062a5f7cb617d6adea3156a05bfc#p70349"
  },
  {
    "author": "susanrhodes27  Guest Posts: 1 Joined: Wed Feb 27, 2008 9:19 am Gender: Female",
    "title": "Coils and fistulas.... I'm confused",
    "content": "My mom is on dialysis. Recently she had a access put in her arm. After being on the machine and having problems consistently because low blood flow, we went to have it checked out. Turns out the access wasn't closed off properly. The doctor did a procedure to insert a coil to close it off, the coil didn't stay and got caught in the bloodstream and is now lodged in her lung. The doctors are saying to leave it there because surgery would damage the lung even more. Is this a good idea? Could the coil be problematic?\n\n",
    "posted_time": "Post  by susanrhodes27 » Wed Feb 27, 2008 9:25 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Dialysis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=54485&sid=49dd062a5f7cb617d6adea3156a05bfc#p54485"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Coils and fistulas.... I'm confused",
    "content": "Hello -  As strange as it may seem, the coil staying put is less likely to cause a problem than going in to get it, largely because it is made of material intended to dwell in the body's tissues, so it's unlikely to cause a problem unless it eventually moves into a spot where it is blocking something. This is also unlikely, because of the coil design, which will likely cause some scar tissue to grow into and around it, holding in still. Going in to remove it when it's not causing a problem could actually be a lot more traumatic. Of course, if some problem, as unlkely as it is, should develop in the future, then removal would have to be decided upon by weighing risk vs. benefit. It should cause no problem where it is, however.   I hope this is helpful. Good luck to you and your mom.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Thu Aug 07, 2008 9:56 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Dialysis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=59150&sid=49dd062a5f7cb617d6adea3156a05bfc#p59150"
  },
  {
    "author": "windward  Guest Posts: 1 Joined: Sat May 12, 2007 4:42 am",
    "title": "After effects of Dialysis",
    "content": "Mr Henderson Age 57 Sex Male  History Renel faliure been on hemo-dialysis for the past 6 mounths.  Question: About 1 hour after dialysis my voice gets very weak as if i am about to lose it, i also get hot and feel very faint if i try to do anything which makes me have to sit for about 3 to 4 hours when everything seems to return to normal do you know what might be causeing these effects i know  that dialysis is an aggrssive treatment and people suffer washout afterwards but these symptons are different to what i have been experincing normaly\n\n",
    "posted_time": "Post  by windward » Sat May 12, 2007 4:56 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Dialysis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=42344&sid=49dd062a5f7cb617d6adea3156a05bfc#p42344"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi windward, Have you informed the dialysis staff that you are experiencing these symptoms? Voice changes are not typically a common complaint that I have encountered after dialysis treatment. The faint feeling may be related to hypotension (decreased blood pressure). I would strongly encourage you to make the team aware of your symptoms so that if a programming adjustment to the machine is required to adjust the amount of fluid removed it can be done. This may assist with alleviation of symptoms. Best wishes. Sincerely, Theresa Jones, RN\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Fri Jun 22, 2007 9:45 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Dialysis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=43775&sid=49dd062a5f7cb617d6adea3156a05bfc#p43775"
  },
  {
    "author": "Cantante  Guest Posts: 3 Joined: Sat May 12, 2007 9:18 am",
    "title": "Shunt in arm",
    "content": "My mother (62)has Wegener's and went into kidney failure and was on dialysis for 6 months before kidneys came back. Ironically, her kidneys came back a week after shunt was placed in her arm. Even though she is not on dialysis anymore, she still has the shunt in her arm and has recently noticed 2 knots along the scar of the shunt. Is this normal?  She is currently on Cytoxan, prednisone, renavite, and lasik pill.  Thanks!\n\n",
    "posted_time": "Post  by Cantante » Fri Jun 15, 2007 1:29 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Dialysis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=43663&sid=49dd062a5f7cb617d6adea3156a05bfc#p43663"
  },
  {
    "author": "Marceline F, RN  Nurse Posts: 229 Joined: Wed Feb 28, 2007 1:54 am",
    "title": "[no title]",
    "content": "Dear Cantante, Without visually inspecting the arm, I can say that yes, frequently \"knots\" can be noted along the placement of the scar.  An AV fistula (arteriovenous fistula) or shunt, is a surgically created shortcut or bypass from an artery to a vein for the purpose of dialysis.  The anastamosis (joining) of the two vessels can be felt as scar tissue.  The important thing is that there is a strong bruit or \"thrill\" felt along the scar line which indicated that the fistula is working. I am delighted on your mom's behalf that she has had renal recovery and the only caution I will remind you is that she should never have blood pressures or lab work done on that arm from here forward. The next time she has followup for the surgery, ask the surgeon about the \"knots\".\n\n",
    "posted_time": "Post  by Marceline F, RN » Sun Jun 17, 2007 4:21 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Dialysis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=43674&sid=49dd062a5f7cb617d6adea3156a05bfc#p43674"
  },
  {
    "author": "ekimbram",
    "title": "Peritonitis in CAPD patients",
    "content": "My mother was diagnosed with peritonitis on 4-9-02 (Tues.) due to being on peritoneal dialysis. The antibiotic that her physician chose to treat it was anceft (not sure if proper spelling). It has been 6 days and she is not better. Is this the proper antibiotic????\n\n",
    "posted_time": "Post  by ekimbram » Fri Mar 07, 2003 9:26 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Dialysis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=477&sid=49dd062a5f7cb617d6adea3156a05bfc#p477"
  },
  {
    "author": "malagatta",
    "title": "Ancef as single therapy for peritonitis in PD",
    "content": "There is more than one way to skin a cat and only the physician who is familiar with your mother's case can answer this. Perhaps he knows something I don't, maybe he already knows the organism from a prior episode or from a gram stain. In general Ancef is a wonderful antibiotic but it works best when combined with an \"aminoglycoside\" for initial treatment. In other words I would have chosen teo antibiotics, one Ancef and then another to complement Ancef.   The fact that your mom's peritonitis is not better in six days further supports the theory that the antibiotic choice is not correct altogether. However, one must consider two other scenarios. Perhaps your mother has a fungal infection or an infection that is so strong that it requires removal of the catheter. At this point I would probably remove her catheter and add a second drug if not antifungals.   The key to this case seems to be the initial culture and cell count as well as proper identification of the organism. If these were blurry I would opt to expand coverage to more antibiotics or remove the catheter depending on the patient's condition.   Mark LaGatta\n\n",
    "posted_time": "Post  by malagatta » Fri Mar 07, 2003 9:27 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Dialysis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=478&sid=49dd062a5f7cb617d6adea3156a05bfc#p478"
  },
  {
    "author": "Dr Robert James  Guest Posts: 2 Joined: Sun Jan 04, 2004 8:46 am Location: Internet  Contact:   Contact Dr Robert James       Website",
    "title": "[no title]",
    "content": "Pl check with the treating physician, u may ask him politely about the reports. Culture- blood and local swab, etc culture reports and the sensitivity reports. I am sure he must have done it. But medicines(antibiotics) in patients on dialysis are started based on c/s report and to to cover a broad spectrum of organisms.  Regards\n\n",
    "posted_time": "Post  by Dr Robert James » Wed Jan 28, 2004 4:53 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Dialysis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2303&sid=49dd062a5f7cb617d6adea3156a05bfc#p2303"
  },
  {
    "author": "Inovative22  Guest Posts: 1 Joined: Tue Jan 06, 2004 1:18 am Location: NoHo",
    "title": "Cardiovascular & nevervus system risks of tattoo removal",
    "content": "I have been doing a lot of  research on this topic for quite some time. I had some tattooing done in my younger days, and now I want to have them removed.  I am very concerned with possible health risks. I have consulted with a tattoo removal M.D. But  I  was not satisfied with the answers to my questions, so I was hoping someone could answer them. My main health concerns include risk of possible liver damage, cardiovascular damage, ( arteries, heart, and lungs ) and even brain damage.  The reason for this is because I chose to have my tattooing done with a special type of compound which contains iron oxide. ( this prevents fading of the tattoo ) Tattoo removal is done with a short beams of laser that break up the tattoo pigments into fragments.  Then they are removed by your The body's immune system. My main concern is will the iron oxide posse any risk( as it travels through my blood stream.) to my arteries, liver, heart, or brain? And if so are these risk serious?? - Mike, CA\n\n",
    "posted_time": "Post  by Inovative22 » Tue Jan 06, 2004 2:53 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Dialysis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2085&sid=49dd062a5f7cb617d6adea3156a05bfc#p2085"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Innovative, The two predominant risks of improper tattooing procedure are exposure to blood borne pathogens and allergic responses to the pigments used in the ink. Tattoo inks are not regulated by the FDA or any other watchdog. This means that not many studies (which need sponsoring, organizing) have been conducted to evaluate the risks which you have outlined. In short, no one can give you a concrete conclusion as to the long term effects of tattoo removal.   A good place to start researching is to perform a medline search at The National Library of Medicine.   Click here  Type in keywords such as iron oxide and heart disease and it will return all the studies performed using those keywords. If you find anything it would be best to return here and post it as not all published abstracts have the same credibility and the process of evaluation would best be left to an M.D. / researcher.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Sat Jan 24, 2004 5:32 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Dialysis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2268&sid=49dd062a5f7cb617d6adea3156a05bfc#p2268"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Cardiovascular & nervous system risks of tattoo remo",
    "content": "Dear Mike,   How big of a tattoo(s) are we talking about? And was this iron used in all the colors of the tattoo(s) or just a few drops here and there?   If it is not that big of a tattoo(s) and it is not really in an obvious place(s), i would suggest for you to remove it surgically. i.e. Remove the part of skin where the tattoo(s) is present and this way you will not have to worry about the side effects of iron.   Iron can have detrimental effect on the health system if it chronically accumulates over a long period of time like in patients who need chronic blood transfusions or in patients born with an in-born error of iron metabolism called hemochromatosis.   Personally, i do not really think that the amount of iron present in the tattoo(s) that you have will pose any health threat, putting in mind that i am not a specialized person in tattoo removal. If you still have any major concerns, the best type of doctor to ask all these questions about iron would be a hematologist (a doctor specialized in blood diseases).   Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Mon Jan 26, 2004 11:47 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Dialysis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2285&sid=49dd062a5f7cb617d6adea3156a05bfc#p2285"
  }
]