[
  {
    "author": "macacat210  Guest Posts: 1 Joined: Thu Aug 19, 2010 9:21 am Gender: Female",
    "title": "can drinking tea raise blood pressure",
    "content": "I normally had 120/80 blood pressure.  While in humid florida recently, I had 145/100 bp's.  I was drinking alot of tea and taking vitamin B complex.  I was tired, so my logic was the tea and B would boost my energy levels.  I am ADHD and take ritalyn daily.  My first cousin just had 3 brain hemorages and anerism of the brain.  Should I be concerned?\n\n",
    "posted_time": "Post  by macacat210 » Thu Aug 19, 2010 9:34 am",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=101306&sid=ff00860746e7d0fa079c9e29861e2918#p101306"
  },
  {
    "author": "Dr.M.jagesh kamath  Medical Doctor Posts: 1303 Joined: Mon Aug 03, 2009 7:24 am Gender: Male",
    "title": "Re: can drinking tea raise blood pressure",
    "content": "Hello,Very high level of caffeine(Found in tea also)could raise the blood pressure transiently.Thus it is advisable for you to avoid highly caffeinated drinks an hour before checking.However a diastolic of 100 mm seems quite high and may not be the regular white collar hypertension.You should get rechecked and make sure of the levels.If this persists beyond 90 mm diastolic will need followup for medical treatment.Obesity control,salt limitation,moderate exercise,stress control can modify borderline and hypertension per se. Best wishes.\n\n",
    "posted_time": "Post  by Dr.M.jagesh kamath » Tue Aug 31, 2010 12:25 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=102030&sid=ff00860746e7d0fa079c9e29861e2918#p102030"
  },
  {
    "author": "mial7  Guest Posts: 1 Joined: Wed Oct 28, 2009 3:57 pm Gender: Female",
    "title": "hip/knee/thigh pain = circulation prob?",
    "content": "Hello. I have developed hip and knee pain. It began as a noticeable pain on the inside of my left knee while doing yoga- then both inside knee areas- noticeable with movement, then my hips. My hips hurt at night, but mainly the right side. I position myself to reduce the strain on my hip and right thigh at night, often I awaken with the right thigh and hip/groin area hurting from my sleeping position. It hurts my hip to cross my right leg while sitting, and I feel my hip when climbing stairs or walking. My thighs sometimes hurt like they are strained ( including the hamstrings). I feel hip and knee pain if I do certain yoga moves like bending from the waist to touch the floor. At one point I went to the doctor because I thought it may be sciatica ( the right side hurt including my lower back into my foot). I failed the sciatica leg lift 'test' and was sent for an xray of my lower back- which showed nothing remarkable. Blood tests did not show evidence of inflammation or vit deficiencies. I have high 'bad' cholesterol, but also high 'good' cholesterol which always puts my reading in the 'normal' range in the blood test. My doctor suggested niacin and aspirin- and basically sent me on my way. Does this mean he thinks I have a circulation problem? He didn't say so, and now it worries me. Would you think this is circulation? I live in Northern Canada- any pursuit of a specialist requires very expensive travel- so your input would be greatly appreciated. Where do I go from here? Your input is greatly appreciated.\n\n",
    "posted_time": "Post  by mial7 » Wed Oct 28, 2009 4:36 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=85106&sid=ff00860746e7d0fa079c9e29861e2918#p85106"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: hip/knee/thigh pain = circulation prob?",
    "content": "Hi there -- Your symptoms do not in any way sound like they are vascular in nature, for any number of reasons. Further, yoga will certainly expose any tightness, loss of flexibility, etc. What you have going on could be directly related to the practice of yoga, which is often quite painful at first despite claims made to the contrary. However, it seems likely you also have some inflammatory process going on with ligaments and joints. This could be rheumatoid in nature, and if so may well respond positively to naproxyn (branded Aleve) or other non-steroidal anti-inflammatory (NSAID) meds. In any case I see nothing in your post suggestive of vascular involvement, but do see a good deal suggestive of rheumatoid disease, and you may need to ratchet back the intensity of your yoga practice (but don't stop if you can help it), try an NSAID pain medication, and if these steps don't yield some relief you may need to be evaluated for rheumatoid disease, although the treatment would likely be simiilar to what I've already suggested, at least at first, so trying this would be a good first step. If you do get some relief you can then plan according to the course of the problem rather than going to great lengths to get the same results. Should any of this get worse, you'll need to have hands-on medical evaluation, however.   The niacin was prescribed because even though you have high \"good\" cholesterol (HDL), you still also have high \"bad\" cholesterol as well, and this can have its effects long term, regardless of the ratio of HDL to LDL. It's preferred the total number be lowered. Niacin is an inexpensive way to achieve this.   Hope this is helpful. Good luck to you. Please follow up with us here as needed.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Mon Nov 02, 2009 10:09 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=85717&sid=ff00860746e7d0fa079c9e29861e2918#p85717"
  },
  {
    "author": "KCL  Guest Posts: 1 Joined: Tue Oct 27, 2009 11:50 am Gender: Female",
    "title": "Surgery after having the Ross Procedure done?",
    "content": "I am a 42 year old female that was born with aortic stenosis.  I also had a bicuspid valve.  At age 14, I had surgery done to repair the valve.  At age of 36, I had the Ross Procedure done.  I was under the assumption/hope that this would be the last heart surgery I would need.  Well, I am now being told that my aorta valve is leaking at a moderate level again.  My cardiologist says that I will have to have surgery again in the future although it could be a couple of years from now.  What options for surgery will I have?  Is there anything that I can do to slow down the progress of this leaky valve?\n\n",
    "posted_time": "Post  by KCL » Tue Oct 27, 2009 1:02 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=84979&sid=ff00860746e7d0fa079c9e29861e2918#p84979"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Surgery after having the Ross Procedure done?",
    "content": "Hello -- I am not in general a great fan of the Ross procedure except in certain selected patients, as it is rather complicated and leaves open the potential for later aortic valve disease as you've experienced. In the future you may well have no alternative but to accept a very strong and reliable prosthetic valve, since the Ross can only be done once. While this would mean accepting also lifelong use of anticoagulant therapy, in many cases it is a very worthwhile tradeoff of a minor annoyance in exchange for a valve that should last several lifetimes over.   Hope this is helpful to you. Good luck with this and please follow up with us as needed.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Mon Nov 02, 2009 12:13 am",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=85594&sid=ff00860746e7d0fa079c9e29861e2918#p85594"
  },
  {
    "author": "kvitka  Guest Posts: 1 Joined: Mon Sep 07, 2009 1:01 pm Gender: Female",
    "title": "Aortic insufficiency",
    "content": "Hello,  Since the age of 3 (I am 24 now) I was told that I have Paroxysmal Tachycardia, however it is nothing to be scared of. I was living not taking care too much about my heart. However, I have moved to another country and had passed a very stressful year. Two months ago I had an attack of tachycardia, with pulsation 230. I got in panic and experienced a horrible panic attack.  I undergone cardiac analyses and was diagnosed with aortic insufficiency (light level), Mitral valve prolapse (light level and without noticed insufficiency), and tricuspid insufficiency. I was told I was born like that and the level is light.  Since the time of the last attack, I am tired,to climb stairs it's a really hard task for me, I often feel light- headed, sometimes feeling hard heart beats and chest pain. I am very scared every time I feel it. I told all that to the family doctor and she said it is psychological. But I feel scared after I have hard heart beats, or all that feelings, not before! I have a strong fear of death and no doctor explained to me if this condition I have will allow me to have a long life.   Thanks for reading this and hope to hear answers.  Kind regards,  Marina\n\n",
    "posted_time": "Post  by kvitka » Mon Sep 07, 2009 4:04 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=82019&sid=ff00860746e7d0fa079c9e29861e2918#p82019"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Aortic insufficiency",
    "content": "Hello Marina -- From the sound of things you have a genetic set of three valvular abnormalities which are mild. This probably should be confirmed, however, by a second opinion by another doctor (cardiologist) to be sure. If in fact the abnormalities are mild, they are probably not causing the symptoms, although mitral valve prolapse (MVP), while usually quite benign, can cause lots of palpitations, tachycardias, etc. as well as anxiety, fatigue, in fact all the symptoms you've described -- which also would be consistent with a finding of anxiety/panic disorder (which is often seen with MVP anyway). The only thing you mention which is potentially worrisome -- though it seems unlikely -- is the aortic valve abnormality. This is said to be \"light\" or not significant, which is fine, if correct. If it is more severe than diagnosed (this can only be ascertained by a second opinion) it could also cause the symptoms you describe, and the only reason I even mention this is because if,on the off-chance the doctor you saw didn't read the aortic valve measurements correctly this could be a remotely possible cause for your symptoms and would then require additional attention. I don't think that's the case, but at a distance it's not fair to you for me to try and imagine what the valve looks like. Only a doctor can make certain this diagnosis is correct, and since your symptoms seem to be getting worse, while I do suspect anxiety is the culprit, it would be wrong to just tell you, all these miles away, that everything is fine. I believe it is, but knowing for certain would be the best way to make you able to relax about this and approach it in the most effective way. If it's not being caused by the aortic valve problem then it is almost certainly an anxiety issue and there are medications that can be very helpful with this if that's the case.  I hope this is helpful. Good luck to you, and please follow up with us here as needed.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Sat Oct 24, 2009 10:40 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=84649&sid=ff00860746e7d0fa079c9e29861e2918#p84649"
  },
  {
    "author": "Geordie97  Guest Posts: 5 Joined: Sat Jan 17, 2009 12:19 am Gender: Male Location: Memphis, TN",
    "title": "Aneurysm repair and chest pain",
    "content": "Quick history...53 year old male, firefighter and law enforcment officer.  Bicuspid aortic valve diagnosis at age 4 in 1959. Aortic commisurotomy in 1967 Aortic valve replacement (Bjork-Shiley) in 1975 Congestive heart failure diagnosis in 2005, symptoms relieved with medications Ascending aortic aneurysm diagnosed in 2008 (5.4cm) Ascending aortic aneurysm repair and aortic valve replacement on 9/11/2008  I had no symptoms before or after the discovery but due to the size of the aneurysm, we decided to have the surgery and get it repaired.  I returned to work on 12/14/2008 but had two minor cases of staph infection on/around the incision in late October/early November.  Since the surgery, I have had some trouble getting used to the new sound of my heart.  My resting heart rate prior to the surgery was around 68 and is currently around 80, plus my heart seems to be pounding all the time to the point that I can feel it beating, especially if I take a deep breath,  and you can actually see my chest (beneath the collarbone) moving.  For the last couple of days, I have had some pain on the left side of my chest, under my breast.  I don't believe it's heart related though I think it may be surgical.  Is it possible that adhesions are causing the pain?  The area on my left side of the incision next to my breast is slightly sensitive to touch also.  I can provide a complete listing of my medications but I'm currently at work and don't have a complete list with me.  All in all, I feel pretty lucky to have found the aneurysm. I was surfing the web and found the Bicuspid Foundation (http://www.bicuspidfoundation.com) website where it mentioned the possibility of BAV patients developing aneurysms in their early 50's.  I requested my cardiologist to do a CAT and we discovered it.  Otherwise, I probably would never have known.  Due to the size at the time of the discovery, we decided not to wait and see if it was growing or how fast.\n\n",
    "posted_time": "Post  by Geordie97 » Sat Jan 17, 2009 12:34 am",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=68685&sid=ff00860746e7d0fa079c9e29861e2918#p68685"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Aneurysm repair and chest pain",
    "content": "Hello -  This definitely warrants an evaluation. While it is most likely due to something related to the surgery (adhesions are one possibility), there are other post surgical problems which are rare but do occur, including scar tissue complicating the seating of the replacement valve (very rare) and sometimes a progression of the dilation from the aortic arch into one of the takeoff branch arteries such as the left common carotid artery or the left subclavian. This should be visualized for possible dilation; the visible pulsing beneath the collar bone concerns me just a little.  As for the sound and feel of the new valve, this is very common and usually becomes tuned out by the patient, but it can take some time. They can be rather noisy (to the owner at least) and I've had the odd experience of listening, without stethescope, to a co-worker's titanium aortic valve, both via close proximity and by standing with the person in a small, tile-walled room. It was startling to say the least, so I can well understand how it must sound to you. They work incredibly well, however.  You were extremely fortunate to have discovered the aneurysm and had it repaired. Not everyone with BAV is aware of the additional risk (which is something of a mystery) of ascending aortic aneurysm linked to this defect.   I hope you'll have this discomfort and visible pulsing checked. It may well be nothing at all, or may even be indicative of how effectively the new valve is working, but it also is a little odd. The sound and the increased rate are normal.  Hope this is helpful and that you'll follow up with us here as needed. Best of luck to you.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Sat Jan 17, 2009 8:44 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=68779&sid=ff00860746e7d0fa079c9e29861e2918#p68779"
  },
  {
    "author": "Geordie97  Guest Posts: 5 Joined: Sat Jan 17, 2009 12:19 am Gender: Male Location: Memphis, TN",
    "title": "Re: Aneurysm repair and chest pain",
    "content": "Thanks John,  Actually, this valve (St Jude) is much quieter than my old Bjork-Shiley, which was titanium and stainless (it happens to be sitting on my desk...I had it for 33 years and wanted to keep it..just have to figure out what I am going to do with it) but it's not the valve noise as much as the louder, stronger heart beat.  And, since I didn't have any blockage, I can't understand why it would be any different than before, other than the fact that the fat around the heart has been moved and maybe that's why I hear it so much louder.    As far as the pain, it's not a constant pain. I usually feel it more as I get tired and/or when I take a deeeeeep breath.    Will the faster heart rate eventually go back to \"normal\"??  I realize that the muscle has been stretched/pulled/etc during the surgery and, like any muscle, it takes time to heal but I would think that my heart rate would resume it's \"normal\" speed soon.\n\n",
    "posted_time": "Post  by Geordie97 » Sat Jan 17, 2009 8:59 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=68785&sid=ff00860746e7d0fa079c9e29861e2918#p68785"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Aneurysm repair and chest pain",
    "content": "That Bjork-Shiley is an antique by now! And you're probably right about the actual heart sounds being audible due to loss of fat. Fat is a remarkable audio insulator, and many of us have quite a lot accumulated on the outside of our hearts (where it does no harm and does keep things quiet). I'd expect that will eventually either become background noise (tuned out) or will accumulate some more fat insulation.  The reflex increase in sinus-dictated rate post-surgery can last for weeks or months. Sometimes it becomes reset as the baseline rate (which still wouldn't be a bad one) but in your case I feel fairly certain it will start to slow over time, depending, to a great extent, on the fitness level you manage to achieve.   The pain, since it seems related to fatigue and breathing, is probably inflammatory in origin. Again,this sort of thing is fairly common post thoracic surgery in particular, since so much has to be forcefully moved around (even in minimally invasive operations). You might ask your doctor what would be an acceptable anti-inflammatory to use in combination with your anticoagulant therapy.   Good luck and stay in touch.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Sun Jan 18, 2009 11:01 am",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=68848&sid=ff00860746e7d0fa079c9e29861e2918#p68848"
  },
  {
    "author": "Geordie97  Guest Posts: 5 Joined: Sat Jan 17, 2009 12:19 am Gender: Male Location: Memphis, TN",
    "title": "Re: Aneurysm repair and chest pain",
    "content": "Thanks John.  Actually, I'm already on Celebrex, among my many prescriptions that I take.  As far as fitness, I do need to work on that.  I'm a volunteer firefighter and a Federal LEO so I need to be in shape.  I've noticed that my fatigue level is much lower than before.  I am back to bowling, walking a lot (and relatively quickly...I do about a 12 minute mile) and riding the motorcycle (don't say it...you are an EMT and I work rescue and should know better, especially on coumadin but...!!).  I will update my profile with my meds so you can see what I'm on.\n\n",
    "posted_time": "Post  by Geordie97 » Sun Jan 18, 2009 12:31 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=68858&sid=ff00860746e7d0fa079c9e29861e2918#p68858"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Aneurysm repair and chest pain",
    "content": "You're welcome!  The Celebrex should be fairly effective where this is concerned. If it's not, then this may be worth a second look. Then again, if you were already on that med when this started, it could be that it would be worse had you not been taking Celebrex. Still worth a second look.   I don't see anything else in the updated meds info that might be affecting this one way or the other.   As for the motorcycle, one of the great pleasures in life for a lot of people, and your riding would at least fall under the heading of informed consent. You know what you're doing. Otherwise you seem to be doing very well with your fitness program. A 12-minute mile is pretty brisk.   All in all, other than this intermittent pain, it sounds as though you're doing great. Keep up the good work and keep us updated as well.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Mon Jan 19, 2009 4:42 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=69018&sid=ff00860746e7d0fa079c9e29861e2918#p69018"
  },
  {
    "author": "Geordie97  Guest Posts: 5 Joined: Sat Jan 17, 2009 12:19 am Gender: Male Location: Memphis, TN",
    "title": "Re: Aneurysm repair and chest pain",
    "content": "Hi John,     Well, it's a number of months later and, all in all, I'm doing great.  I did get to read my surgical report and when they removed the aneurysm, it was at 5.7cm so it apparently was growing and it was a good thing we did the surgery when we did.        I do have another problem and though it's in my chest, I don't think it's cardiac related but wanted your opinion.  I have a spot just at/under my 7th rib on my left that is quite painful.  At times, if I move wrong or stretch, it's almost as if a knife is cutting in to me.  That may last up to a minute (though it feels MUCH longer) and then goes back to a dull pain.  It is tender to touch, causing a sharp knifing pain also.  The spot is about 1.5\" from my sternum.  I thought about the possibility of costochondritis but it doesn't seem to be in the right place for that.  I don't think it's any of my organs as I'm not having any other symptoms.  It almost feels like a cracked rib but doesn't really hurt any more with a deep breath.  Any suggestions????  THanks\n\n",
    "posted_time": "Post  by Geordie97 » Sat Aug 22, 2009 2:39 am",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=81625&sid=ff00860746e7d0fa079c9e29861e2918#p81625"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Aneurysm repair and chest pain",
    "content": "Your new pain is definitely not cardiac-related, although my be indirecty related to the surgery or at least is musculoskeletal in origin. Because it is highly localized, lasts only a brief amount of time and is tender to the touch, it only qualifies for this classification of aggravation. Could still be costochondritis, but also could be either a cracked or stressed rib or could be inflamed muscle. It in no way resembles cardiac problem or even any internal organic problem. If it doesn't go away shortly it will probably respond to something like ibuprofin or naproxyn, although because of your history you probably would be wise to ask your doctor about use of either of these before buying some. It would likely be fine, but there are some considerations that make them less than ideal. Still, if it's not too bothersome it can probably just be left to run its course.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Fri Aug 28, 2009 8:21 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=81707&sid=ff00860746e7d0fa079c9e29861e2918#p81707"
  },
  {
    "author": "amekaze  Guest Posts: 1 Joined: Thu Apr 30, 2009 7:11 pm Gender: Female",
    "title": "SVT related to Marfan?",
    "content": "I am a 20 year old female. The only known issues any of my family members have is diabetes in my Grandfather. I don't drink or smoke or do drugs of any sort. I have been physically fit my entire life with a very few problems that have sent me to the doctors. In 2007 I had an SVT. No source or reason was found. I have had severely flat feet and required special made orthodics.  Recently I have been to the doctors with sharp chest pains on my right side when breathing randomly over a few years. My doctor confirmed a chest wall deformity and I had an X ray and CT scan. I don't know what he is looking for because I don't have the results yet. I have been doing my own research and would bet all the money in the world I have Pectus Caritum. All my symptoms fit but it does not explain the sharp pain. Upon further research I am suspicious of my having Marfan syndrome. Physically I match descriptions. And that conclusion would explain the few health problems I have ever had that no one could explain. My question is (sorry it took so long), could an SVT with no known cause be a sign or related to Marfan?  Any info would be great! Thanks, Amekaze\n\n",
    "posted_time": "Post  by amekaze » Thu Apr 30, 2009 7:27 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=76441&sid=ff00860746e7d0fa079c9e29861e2918#p76441"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: SVT related to Marfan?",
    "content": "Hi there --  First, if you have a significant number of Markers for Markan's you should be screend for the syndrome, and also for Ehlers-Danlos disease, which is a similar disorder, but is more often characterized in part by flat feet. You may, of course, not have either,  and usually there has been some family history of either, although it could be several generations back.  To answer your question, arrhythmias are more common with Marfan's than in the general population, but even without Marfan's, people who are tall and slim, with longer-than-normal long bones and digits, and with various chest wall abnormalities, are for some reason more prone to these arrhythmias, including SVT. However, these same people are also more likely to have some degree of mitral valve prolapse, which is also associatated with a higher incidence of SVT, for unclear reasons. At any rate, the one thing must be managed (SVT) on its own, whether or not a connective tissue disease is present.  MVP is seen in most Marfan's subjects. Therefore, at least indirectly, yes, SVT could be related to Marfan's. Even if it's not, however, it needs to be addressed if it causes problems for you.   I hope this answers your question.  Please follow up with us here as needed. Good luck to you, and please update us as you learn more.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Sun May 03, 2009 9:35 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=76823&sid=ff00860746e7d0fa079c9e29861e2918#p76823"
  },
  {
    "author": "tigerlily  Guest Posts: 3 Joined: Fri Apr 10, 2009 3:30 pm Gender: Female",
    "title": "Slight dilation of the ascending aorta",
    "content": "Dear DoctorsLounge Team, first of all please excuse any mistake of spelling or expression; I am not a native speaker of English.  I am a 36-year-old female, BMI 26, and I  was diagnosed a slight dilation of the ascending aorta today. The size of the aorta is 36.8 mm (measured by CT and confirmed by ultrasound). Since there was also done a CT of all the vessels in the abdominal area and in the head and the results were not ready today (the doctor had to leave early), my cardiologist only gave me the result of the heart CT and postponed the final consultation to Tuesday. He just mentioned today that he will probably put me on beta blockers because my HR is quite high (between 80 and 90 - my BP, though, is fine, around 110:65) and that we will do a stress ECG on Tuesday. He said, I can do sports with this dilation but should avoid having a high HR for a longer time, e.g. I should rather do walking than running.  He wants to see me (after the consulation on Tuesday) for a follow-up around August and then probably yearly.  Is there anything else to consider with this diagnosis? How serious is the situation? Is it still allowed for me to become pregnant? Should I lose weight?  Thank you very much in advance for your help!\n\n",
    "posted_time": "Post  by tigerlily » Fri Apr 10, 2009 3:49 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=73815&sid=ff00860746e7d0fa079c9e29861e2918#p73815"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Slight dilation of the ascending aorta",
    "content": "Hello --  First, your English is excellent!  Now then -- the dilation of your aorta is not remarkable, so unless you also have been diagnosed with Marfan syndrome or a bicuspid aortic valve (which would show up on the heart study when results are in, if either is present), it probably poses no forseeable significant threat, although it should be followed periodically via CT or MRI to be sure it's not expanding more. The beta blocker is an appropriate, although your heart rate really isn't that big a concern, although BP definitely would be, and that seems better than fine.   Once all the other results are available for comparison alongside the possible aneurysm, if nothing else shows up (especially bicuspid aortic valve, which still is not necessarily terribly significant in the short term), then you should be able to persue a vigorous fitness program and also carry a baby full term, although the latter would, of course, require additional studies (sonography) to be certain the aorta isn't expanding during that time.   Based on what you've provided so far, you would seem to be in very good shape. Please do follow up with us once you know the other test restults, however. Good luck to you. Hope this is hepful.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Thu Apr 23, 2009 10:24 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=75610&sid=ff00860746e7d0fa079c9e29861e2918#p75610"
  },
  {
    "author": "tigerlily  Guest Posts: 3 Joined: Fri Apr 10, 2009 3:30 pm Gender: Female",
    "title": "Re: Slight dilation of the ascending aorta",
    "content": "Dear Dr. Kenyon, thank you very much for your detailed answer which was extremely helpful and reassuring. All other results were fine. The doctor explicitly said that I do not have a bicuspid aortic valve. He did not mention \"Marfan\" but I am sure he would have if there had been any hint in the results.  Thanks again!\n\n",
    "posted_time": "Post  by tigerlily » Sat Apr 25, 2009 11:52 am",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=75776&sid=ff00860746e7d0fa079c9e29861e2918#p75776"
  },
  {
    "author": "MKD  Guest Posts: 5 Joined: Thu Nov 13, 2008 2:27 pm Gender: Female",
    "title": "Aortic Root Dilation",
    "content": "in June 2007, during a cardiac catheterization, a dilation was found on my ascending aorta. According to the catherization report, the dilation was 4.7cm, and the technician doing the procedure even let me see it on the screen and it was VERY noticeable. A CT scan was performed the following day, and according to that report, the dilation was set at 4.0 cm. A month later, I saw a CT surgeon who was very laid-back about the whole thing, was very adamant that the dilation could not be called an anerysm, and said there was nothing to worry about and he didn't need to see me for another 2 years. I never had an answer as to why the two reports differed so much in the size of the dilation, nor have I ever had a response to my question \"which one of the two investigations could be deemed more reliable, catherization or CT scan?\"  I have not been seen about this dilation since July 2007, and I must admit to feeling a bit worried about it. Would I be terribly pathetic if I were to call and ask for a follow-up at this point? I am currently on Flecainide, 200mg/day for frequent and debilitating PVCs (50,000+/day - constant bigeminy) which is why I was in the hospital in the first place when the dilation was found. No other medications.  I also have a fluctuating BP, it can go from 130/80 to 145/105 in minutes. I often deal with pressure in my chest and up into my throat, and a dizzy feeling. Thank you for your help.\n\n",
    "posted_time": "Post  by MKD » Thu Jan 08, 2009 10:00 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=67513&sid=ff00860746e7d0fa079c9e29861e2918#p67513"
  },
  {
    "author": "MKD  Guest Posts: 5 Joined: Thu Nov 13, 2008 2:27 pm Gender: Female",
    "title": "Re: Aortic Root Dilation",
    "content": "I forgot to mention, I'm a 44 year old female, regularly active, slightly overweight, mother of two boys. All my diagnostic tests have also yielded results as a thickened aortic valve (a couple of cardiologists have said it's bicuspid, another couple have said it's not), moderate regurgitation - the murmur of which is not always picked up with a stethoscope, and usually only by women for some reason (do women have a more acute sense of hearing I wonder?), and a bovine (??) arch. A holter monitor when I first started having PVCs, also picked up on a Wenkebach block, of 2.8 seconds.\n\n",
    "posted_time": "Post  by MKD » Fri Jan 09, 2009 5:07 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=67623&sid=ff00860746e7d0fa079c9e29861e2918#p67623"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Aortic Root Dilation",
    "content": "Hello -  This is a really peculiar situation you've been put in. There is something not normal about your ascending aorta, you have lots of PVCs (not important in themselves, but perhaps a rare window into what may be wrong here this time), and are on a medication which almost certainly was intended to reduce the frequency of PVCs, yet is generally considered to be an unwise choice for this sort of thing.   First: the two studies, CT and angiogram, could reasonably be expected to agree; however, the angiogram is usually the gold standard for cardiovascular studies, so we'll have to give it the nod. The CT does have some limitations by comparison. So your ascending pipe is, let's say, 4.7 cm. In any case the usual \"cut point\" or size at which most doctors would choose to go in and repair or replace the segment (in patients with Marfan syndrome), is 5.5, which is probably why your CT surgeon was \"laid back\" about this. However, this isn't always the best way to relax an (understandably) anxious patient. Better to go into some detail about what might or might not be going on and why. Further,  in patients without Marfan's syndrome (and we haven't yet determined this about you), a measurement of 4.9 is considered an aneurism (aortic ectasia) and is then followed closely.   There are a number of things which may (or of course may not) be associated with such a dilation of the ascending aorta, and these things are usually discovered and measured by means of MRI rather than angiogram or CT (which is the least senstive of the three for these purposes). For instance, if you've had an echocardiogram (and this should also have showed up on angiogram, but echo is actually better for this purpose) which showed a bicuspid aortic valve, there is a greater lifetime risk of ascending aortic aneurysm. If there is an aneurysm of the sinus of valsalva, which is contained in the ascending aorta near the arch, this can sometimes be missed on both types of imaging you mentioned having had.   In any case two years is, in my experience and opinion, too long a time to go between followups for this problem. Further, any sort of aortic valve insufficiency is prone to cause more PVCs than there would be otherwise. Again, PVCs in general are not the problem or a problem even, but in some people they may lead to discovery of some problem with the aortic valve and/or outflow tract, and these are associated, in certain patients, with an increased risk of aneurysm. So I think your cardiologist and CT surgeon, together, should,first, look  at this via MRI, and second should follow this at more like six month to one year intervals rather than two years. The difference between the dilation of your particular ascending aorta and one that has an aneurysm, is 2 cm. If it were to progress at 1 cm per year (as non-dissecting ones are inclined to do), then that would be cutting things rather close. Also there is the issue of your blood pressure, which is a major factor in the management of aneurysms, or even potential aneurysms.   Further, the flecainide issue really troubles me. Here's why: in the 1980s the National Institutes of Health conducted a massive study of people (who, admittedly, had all had previous heart attacks), with PVCs, which back then were still believed to be a potential problem (they are no longer seen as something that should routinely be treated except for the sake of the patient's peace of mind, as they can cause a great deal of discomfort and anxiety); the study, known as the CAST study, had a disastrous outcome which proved that the whole class of drugs (including flecainide) dedicated to supressing PVCs caused more life-threatening arrhythmias than in those who got no medication at all. To shorten this story, in the late 1980s all those drugs had to have a warning added to their literature stating that they were not recommended for routine suppression of PVCs and,  further,  that PVCs alone did not increase mortality among any subset of patients and that when they needed to be supressed for the patient's peace of mind then a beta blocking drug should be the first line choice. You have a right to this information. What you do with it is up to you. I'd bring it to the attention of the  doctor, who of course has every right to prescribe the drug in spite of these warnings, if he believes it will serve the purpose. You, as the patient, do not have to accept this prescription, however, unless all this has been discussed between you and your doctor and you're taking this  drug having been informed of the CAST study implications.   That was unpleasant, but you need to know this, and also that a beta blocker could reduce the frequency of PVCs and lower your blood pressure at the same time. This is significant.  In  light of the imaging techniques used, the disparity between the results, the fact that a third imagine technique (MRI) and even a fourth (transesophageal echocardiogram) are preferable to either of the others for following this aortic dilation, plus the two-year window for followup suggested, and the presription of flecainide to supress PVCs, you might want to consider a second/third opinion on this matter.   Finally, you would not be in the least bit \"pathetic\" if you were to question any of the findings and to ask for (or even demand) a followup earlier than planned (soon, actually). We must not live in thrall to our doctors but, rather, be our own advocates and work with them,  even when they may feel the patient isn't competent to participate in the process. In my experience cardiology seems to be a specialty where this assumption is more common than many others for some  reason. I strongly endorse your taking this bull by the horns.   I hope this has been helpful to you. My best to you, and I hope you'll follow up with us here, and keep us updated as to future developments also.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Fri Jan 09, 2009 9:37 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=67662&sid=ff00860746e7d0fa079c9e29861e2918#p67662"
  },
  {
    "author": "MKD  Guest Posts: 5 Joined: Thu Nov 13, 2008 2:27 pm Gender: Female",
    "title": "Re: Aortic Root Dilation",
    "content": "Dr. Kenyon, Thank you SO much for your compassionate and informative response. You have no idea how much your response has meant for me. I'm almost in tears because it feels like some of my feelings on this issue have been vindicated. You are absolutely right, there can indeed be a bit of a god-complex going on with some of the doctors in the profession, and I have had the misfortune of meeting quite a few of them. I saw 6 cardiologists before I found my current EP who actually listens and seems very knowledgeable on his subject. He also has some humility and most of all a sense of humor. First, no, I do not have Marfan syndrome. I (personally) think the dilation was caused by a) uncontrolled hypertension (I have been measuring around 140/95 for years but my PCP has blamed it on \"white coat syndrome\") and b) the PVCs. I did know about the CAST study, as I am one of those annoying people who will not take medications until I know as much as possible about them, but felt that I had no choice. I tried 5 different beta blockers (also one calcium channel blocker and one drug similar to flecainide, but not as \"bad\") and I simply cannot take them. I get severe depression, and my heart rate goes way down to the point where all I can do is sleep (and this is on the lowest possible dose), and I also could not live with the PVCs as they made me lethargic, dizzy and depressed (as well as a bit anxious, although - as I'm very much into research - I did know they were not dangerous). I was offered the option of an ablation or the flecainide, and the counseling I received suggested the flecainide was the less dangerous option. I must say though, I have had misgivings about taking them ever since I got them. My prescription is about to expire in a month, perhaps I should make an appointment with my EP and the CT surgeon and see them both on the same day to see where things are at with this, before I continue taking them. I have a problem with doing an MRI, I am ludicrously claustrophobic and simply cannot handle that machine, but if they could sedate me, perhaps that would be a good choice. I have had several echos to check the aortic valve - but never a transesophogeal echo - and that's where the conflicting opinions have been. The catheterization said it was bicuspid, CT scans (I've had 3) say it's tricuspid (well, one was inconclusive), one echo said bicuspid, another tricuspid. So, as you can see.. there is confusion. And I've had echos and CT scans at different hospitals, so it's not down to just one interpretation. Dr. Kenyon, I wish you were my CT surgeon, I feel more comfortable baring my soul to you online than I do with my CT surgeon in real life, but I will take your advice and I shall call to make an appointment first thing on Monday. And if that doesn't get me anywhere, I shall indeed seek out a second opinion.  I will be happy to return with more information once I have them. Thank you, again, for your kindness and professionalism.\n\n",
    "posted_time": "Post  by MKD » Sat Jan 10, 2009 4:42 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=67772&sid=ff00860746e7d0fa079c9e29861e2918#p67772"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Aortic Root Dilation",
    "content": "Hello and you are very, very welcome. Oh, and while I'm not an MD (I've just worked with a lot of them, mostly cardiologists, as a diagnostic technician), I'm terribly flattered by that. One of them, a rather \"colorful character\", once told me \"You have to have a personality disorder to go into this specialty.\" He may have had one himself, but I've also worked with some who have been some of the most remarkably compassionate people I've ever met. It just takes all kinds. There does seem to be something,  however, to that one doctor's observation. EP specialists, on the other hand (and this is of course only in my experience) seem, in general, to be more even-tempered. I have no idea why that is. You seem to have met more than your fair share of those \"inflated\" types. They're not all like that by a long shot.   I'm very pleased to see how thorough you've been in your research: this is, to my mind, the best kind of patient one could have. When someone uses the phrase  \"informed consent\" they know you not only know what it means, but that you're truly informed. It's a huge help.  I'm glad Marfan's has been ruled out. There is still a subset of otherwise \"normal\" people who have bicupsid aortic valve, and there is some statistical correlation between this and development of ascending aortic aneurism, so those need to be followed just in case. Since the status of your aortic valve is unclear, and since there has been a blood pressure problem over time, I'm sure you're right about the role that's played in the dilation (I won't call it an \"aneurysm\" at this time, because so far it hasn't qualified, and with  any luck it never will).   I almost guessed, in afterthought, that you might have had a discussion about the flecainide, and I now understand how and why you made that decision. Since you've not had an M.I. in the past, you don't really fit the profile of those people in the CAST study, even though it did lead to a total rethinking of PVCs and their treatment.  It's too bad about you and beta blockers, but some  people do have that reaction (lethargy and depression) and it can be pretty awful.  I also can appreciate your wanting to reduce the frequency,  as the feeling (among those who feel them -- not everyone does, which is an enduring mystery) is extremely unpleasant.   As for the possibility of MRI, childrean are routinely sedated for this, so I don't see why it would be unreasonable to do the same for an adult. Claustrophobia is a big contraindication for this  procedure -- unless you can find one of the \"open\" types in your area. These are sometimes a lot less confining, but there are those who still don't do well with them.  Ablation for PVCs has been rare until recently, but it's now getting to the point  where it could become much more common. Maybe in time this will be workable for you.  The disparity in reports on the status of your aortic valve is remarkble. A TEE might just be a way to clear that up once and for all, but it would seem there's something  unusual about the valve just because it causes so much disagreement. Interesting.  It's awfully important  to be able to talk to someone in the healthcare profession whom one trusts, in order to feel right about everything, even when everything isn't exactly right. I'm honored that you feel comfortable discussing this matter with me, and want you to know I'm here if you have any questions or anything you'd like  to discuss. This has been a big part of my utility as a cardiology tech (and as an ER/critical care tech as well) and I suppose led to my becoming certified in critical incident stress management. People  find I'm easy to talk to. I have no idea why.  I'm very gratified to know you'll be making an earlier appointment and seeking an  additional  opinion as well. This is your body, your health, and no one understands it, on a visceral level,  as well as you.   Thank you again for the very kind words. I'll look forward to updates from you. All the best to you.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Sat Jan 10, 2009 8:15 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=67800&sid=ff00860746e7d0fa079c9e29861e2918#p67800"
  },
  {
    "author": "MKD  Guest Posts: 5 Joined: Thu Nov 13, 2008 2:27 pm Gender: Female",
    "title": "Re: Aortic Root Dilation",
    "content": "Dr. Kenyon, As self-advocates go, I'm pretty darn awful. I called today to make my appointment with my CT surgeon. I have an appt on Jan 30 and they'll do a CT scan first, before I see the doctor. At first they tried to tell me I don't need to be seen until the summer, but I had the cohones to stand up to them on that. But how does one ask for a procedure such as an MRI instead of the CT scan, without sounding hysterical? I just can't do it. I hate to be \"that\" patient and I just keep keeping on, appearing more stoic and laid-back than I really am.  I'm studying to be a nurse, I can only hope I will be the professional that the patient feel they can turn to without ever feeling hysterical. Because it's no fun. I will keep you updated. Monica\n\n",
    "posted_time": "Post  by MKD » Mon Jan 12, 2009 7:50 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=68072&sid=ff00860746e7d0fa079c9e29861e2918#p68072"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Aortic Root Dilation",
    "content": "Hi Monica -  I hope you'll go a little easier on yourself. It's a lot easier to tell someone to be assertive than it is for anyone to actually be that way when the chips are down. The \"other side\" has an advantage in that they are well-practiced at giving the directions.  We' The good news here is that the situation has built-in slack. If the CT shows what is needed then it can be left as the document of record. If it's vague or if anyone equivocates, it can be argued that an MRI or even a transesophageal echocardiogram (TEE) should be done in order to clarify. It's not that CT isn't capable of demonstrating what's needed, only that there is more accurate technology if it's needed.  If it should come to that, you might just consider questioning the relative accuracy and asking for the most accurate imaging procedure. However, if things all come out looking as one might expect (at least as large a dilation as visualized by angiogram), then we should give the doctors their due and go with that. These things don't tend to get smaller, so if it comes out looking normal there would be a very good case for insisting on a \"tiebreaker\" be means of MRI or TEE. Meanwhile, you've done very well in handling yourself with this. It's not that easy. Just don't think of yourself in absolute terms as either \"too easy\" or \"too pushy.\" Just be you. You'll do fine. I think you'll make a very fine nurse, too, and I admire your choice of professions!  We'll be looking forward to your update.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Tue Jan 13, 2009 11:09 am",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=68144&sid=ff00860746e7d0fa079c9e29861e2918#p68144"
  },
  {
    "author": "MKD  Guest Posts: 5 Joined: Thu Nov 13, 2008 2:27 pm Gender: Female",
    "title": "Re: Aortic Root Dilation",
    "content": "So, I have news. On Tuesday this week, starting overnight, I began to have chest, shoulder and left arm pain. I took my BP over the day to check that it wasn't going too high, and it kept climbing. So, in the evening, as my BP reading was 156/104 and the pain was so bad that I could not breathe properly, we called the rescue squad out. They took me to the ER, I was put on morphine (which I absolutely hate, by the way) and my BP kept rising. They pumped more morphine in, my BP rose even further, until at one point it read 192/129. So, I told them to stop giving me morphine and to do something to get the BP down as I did not want to have a stroke. They responded by giving me Toradol and Ativan. The Ativan calmed my heart rate down (go figure) and the BP started coming down a bit as the morphine wore itself out.  I was then admitted to the hospital (they could not get my BP below 160/110) and in the morning I had an echo and a CT scan. The good news here is that the Aortic dilation is still at 4.0cm according to the CT scan (although, funnily enough the doctor who was treating me, a diagnostician of sorts, also agreed that the catheterization is a better diagnostic tool, and he would lean towards the 4.7cm value it had given as more accurate, but the radiologist who read the CT scan this time said \"those guys often aren't as good at measuring these things\".) So, as my BP came down over the day, I was finally released (still with lingering, mild chest pains, mind you) in the afternoon, with a prescription for Indomethacin for an \"inflamed nodule in the lung that had been found on the CT scan and which was probably the reason for my pain\" and lisinopril for the BP. I don't know what to think, or quite how to react to this. I don't like what I read about Indomethacin, and since my BP isn't always high, I'm not sure whether to take the ace inhibitor (yesterday at 6 in the morning on the ward, my BP was 96/54.. if I take an ace inhibitor, will it go even lower in the morning??). Oh, and since I have that reading of 4.0 again, I canceled my appointment tomorrow with my CT Surgeon. So, I'm coming to you, again, to ask you kindly for your opinion and insight, Dr. Kenyon. Thank you so much in advance. Monica\n\n",
    "posted_time": "Post  by MKD » Thu Jan 29, 2009 9:36 am",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=70184&sid=ff00860746e7d0fa079c9e29861e2918#p70184"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Aortic Root Dilation",
    "content": "Hi Monica -  Wow, I was getting tense just reading the beginning of your post! Thank goodness the dilation doesn't seem to have been affected by this episode. It was really very strange, at least on the surface. If the inflamed lung nodule was the cause of the pain and the pain began while you were sleeping, then this probably set off one of those awful coincidences where you wake up already knowing there's a potential problem, and with chest pain. This is going to send many people's BP straight up, of course (although some aren't as reactive as others), and this puts stress on the entire vascular system, but of course especially the first part of the aorta, which is scary to consider. However, it seems to have remained very elastic throughout all this, and is staying stable. That's the best news out of the whole incident. Who would expect something like that to happen out of the blue, though?   The morphine reaction (increased BP) isn't all that unusual, really, although I'm not sure why some people react to it more than others.   Indomethecin is awfully strong medicine for the sort of pain it seems you were having. It can have some pretty noxious side effects, too. If you've looked it up you already know about these. I would think a garden-variety NSAID would be as good, with less side effects, and if morphine wasn't effective before, should this happen again, other anti-inflammatories probably should be considered, maybe even low-dose, short-term steroids.  The disagreement over CT/MRI vs. angiogram is understandable. Each has its pros and cons. While the CT may be more accurate (and who knows for certain?) the more conservative approach would be to go with the higher number, even though you've now had consecutive CTs that yielded the same 4.0 size, which seems persuasive for general purposes.  Since you're apparently a hot reactor in terms of blood pressure (pain is often  very  powerful influence on blood pressure), it's probably safer to take the lisinopril than not. While your BP has dropped to low normal recently, it clearly has a great range, and you want to keep it in the normal numbers as much as possible. Lisinopril does have some potential for dropping the BP lower, but some other BP meds are worse about that. If it causes too many side effects you could reduce the dose or discuss discontinuing it, but I think most people with any aortic dilation are probably better off taking something to keep the BP on the lower side.  I hope you're feeling much better now, and please keep us updated. Hopefully that nodule will go away or at least keep \"quiet\" now.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Thu Jan 29, 2009 11:24 am",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=70219&sid=ff00860746e7d0fa079c9e29861e2918#p70219"
  },
  {
    "author": "mtstreet  Guest Posts: 18 Joined: Sat Jan 06, 2007 5:54 pm",
    "title": "Aortic and arterial aneurysm",
    "content": "Hi,  I am a 52 year old female with a history of two previous heart surgeries due to a bicuspid aortic valve.  The last surgery was in 1999, when my aortic valve was replaced and an aneurysm repaired.  I've had yearly echos since then and they've been fine.  However, last year I asked my cardio to do a CT after reading about how bicuspid valves are more prone to aneurysms.  Lo and behold, the CT showed an ascending aortic aneurysm measuring 4.5 cm. There were also aneurysms in the brachiocephalic artery (it measured 2.6 last year) and at the origin of the left common carotid artery. (1.8 cm.)  My cardio's nurse said that the aneurysm was \"mild\" and didn't seem concerned.  The only thing said to me was that I'd have another CT this year.  However, when I called to schedule this year's tests they would only set up my echo and - if I understood them correctly - a CT might not be scheduled depending on the results of the echo.  So my first question is:  do aneurysms normally show up on an echo?  Why did they show up on the CT scan last year but not the echo?  My second question is: I understand ascending aortic aneurysms are repaired at roughly 5 cm, though that threshold may be lower for me because of my small size. So I realize 4.5 is not critical, but can you tell me about the two arterial aneurysms?  What are normal measurements for the brachiocephalic and left common carotid arteries?  Thanks in advance for any information.\n\n",
    "posted_time": "Post  by mtstreet » Sun Jan 11, 2009 7:43 am",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=67847&sid=ff00860746e7d0fa079c9e29861e2918#p67847"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Aortic and arterial aneurysm",
    "content": "Hello -  Before we go into trying to answer your questions I'd like to ask one of my own: Do you by any chance have any connective tissue disease such as Marfan syndrome or Ehlers-Danlos disease? I only ask because while bicuspid aortic valve is a heritable abnormality that often is accompanied by a lifetime risk of ascending aortic aneurysm, you seem to have had quite a few aneurysms or at least dilations and only now have had the expected one show up. Which artery was involved in the aneurysm repair fixed at the time of the valve replacement?  Now then: while the ascending aortic aneurysm is hardly surprising in light of the presence of the (formerly) bicuspid aortic valve, these are sometimes difficult to visualize on echo because of the positioning of them, and a transesophageal echocardiogram or TEE (with the sonagraphic element passed down the throat to get a far better view) is preferable (maybe that's what's planned?), and after that MRI or CT imaging. Still,  if it showed up on CT before, that's reasonable; often they can't be seen on regular echo. A TEE will give the best visualization of this area as a rule.   Your current problem is a notable dilation (4.5 cm) whereas the point at which an otherwise \"normal\" person would be said to have an actual aneurysm at 4.9 cm, and for someone with Marfan's, the \"cut point\" is 5.5 cm.  There is no precise measurement for the brachiocephalic or inominate artery, since it comes off the aorta directly; rather, there is a complex formula for determining what it \"should\" be, and usually an aneurysm is diagnosed based upon visual difference between any segment of it and  the remainder. Having this dilate with the ascending aorta is not at all unusual because of the close relationship.  The same holds true for the left  common carotid, which also takes off from the aorta. This is often involved by direct association. This suggests the dilation involves the aortic arch, and these arteries are usually partially replaced during graft repairs out of anatomic necessity anyway.   Given the arteries involved, and the relatively small dilation of the affected aortic segment so far, you'll  probably be evaluated for the sake of a more precise measurement of the current dilation and then followed to determine if and when you'll need to have it repaired. When and if you do, those others, which are incidental to the main one,  would be repaired along with it.   I hope this is  helpful to you. Please follow up with us here as needed. Best of luck to you.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Mon Jan 12, 2009 9:25 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=68082&sid=ff00860746e7d0fa079c9e29861e2918#p68082"
  },
  {
    "author": "mtstreet  Guest Posts: 18 Joined: Sat Jan 06, 2007 5:54 pm",
    "title": "Re: Aortic and arterial aneurysm",
    "content": "Hi John,  Thanks so very much for your informative reply.  It certainly was helpful. I do not have Marfans or Ehlers-Danos and no one else in my family has a BAV.    I had my annual echo yesterday (no, it was not a TEE) and see my cardio next week.  I imagine she'll do further tests to see if the aneurysm has grown. It really makes me glad that I pushed her to do the CT or else I would never known it was there.   I like your use of the reassuring phrase \"when and if\" regarding a repair. : )  My second surgery was complicated by scar tissue from the first operation, which caused my right ventricle to become stuck to my sternum.  According to the surgeon it's still stuck and makes any redo rather risky.   Again, thanks a lot for the reply.  I appreciate it.  Cheers!\n\n",
    "posted_time": "Post  by mtstreet » Thu Jan 15, 2009 10:29 am",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=68407&sid=ff00860746e7d0fa079c9e29861e2918#p68407"
  },
  {
    "author": "mtstreet  Guest Posts: 18 Joined: Sat Jan 06, 2007 5:54 pm",
    "title": "Re: Aortic and arterial aneurysm",
    "content": "Hi again,  One more question.  You mentioned that my measurements suggest an involvement of the aortic arch.  Here are the measurements from last year's CT:   -the diameter of the aortic arch between the brachiocephalic and left common carotid artery is 3.0.   -between the left common carotid and the left subclavian artery it measures 2.0 -diameter of arch justdistal to the left subclavian artery is 2.8  Can you tell me if these measurements are normal?  Any info will be appreciated.  Thanks a lot!\n\n",
    "posted_time": "Post  by mtstreet » Fri Jan 16, 2009 8:07 am",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=68545&sid=ff00860746e7d0fa079c9e29861e2918#p68545"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Aortic and arterial aneurysm",
    "content": "The numbers suggest a small-to-normal sized arch, which is odd, because that would mean those other smaller take-off vessels are developing aneurysms independent of the ascending. This would suggest some sort of genetically-transmitted disease, since generally these dilate from their respective roots as the arch dilates.   Of course, I'm not looking at actual pictures of all this, and if I were it might make more sense than it seems to in some other way. At any rate, please continue to keep us updated. I hope this answer is in some way helpful. Continued good luck to you.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Fri Jan 16, 2009 7:10 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=68645&sid=ff00860746e7d0fa079c9e29861e2918#p68645"
  },
  {
    "author": "mtstreet  Guest Posts: 18 Joined: Sat Jan 06, 2007 5:54 pm",
    "title": "Re: Aortic and arterial aneurysm",
    "content": "Hi John,  Again, many thanks for the information.   The report made no mention of a problem with the arch so I got the impression that these are separate aneurysms.  I know there are limitations since you haven't seen the pictures, but you're saying that the arch doesn't appear dilated at this time, right?  And under normal circumstances it would be, given the dilations noted in the other arteries, right?   I'm unaware of having a  genetically-transmitted disease that would have caused this but have never been tested for anything.  Hmmmm....this is all very interesting. I didn't have a follow-up appointment last year to discuss the results of this test so when I looked at the report again recently I began to wonder about those other arteries. Are there any specific questions you might suggest I ask the cardio when I have my appointment this week?   Thanks again for your time and all the wonderful information.  Best wishes.\n\n",
    "posted_time": "Post  by mtstreet » Sun Jan 18, 2009 9:20 am",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=68835&sid=ff00860746e7d0fa079c9e29861e2918#p68835"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Aortic and arterial aneurysm",
    "content": "Again, you're very welcome.  Yes, you read me correctly. The arch doesn't appear to be dilated (at least to any remarkable degree -- it is often judged based on the surrounding anatomy, but it certainly doesn't look big by the numbers), and usually the take-off arteries, when they also have aneurisms, have them as part of an extension of the dilated arch, not as completely separate entities. I may be reaching an incorrect conclusion based on having to visualize using written info and numbers, but it sounds as though those other ones have developed independently, which is odd if I understand the situation correctly, and this would usually only be due to some sort of connective tissue disease that is inherited. Of course if I could see the actual pictures it might make more sense.   One thing that strikes me about the sizing of your aortic arch is that there is a distinct 1.0 cm narrower area between the left common carotid and left subclavian arteries. While this isn't a remarkable difference, and the overall size of the arch seems pretty normal, especially compared with the ascending leg, I'm wondering if the problem might not be due to a very slight coarctation (narrowing) of the aorta in that segment. This is often seen with BAV, but usually just beyond the roots of the takeoff arteries, instead of between some of them. It's also a pretty small degree of narrowing, possibly within normal limits. Still, it's an almost 30 per cent reduction in diameter at that point. This could possibly bear some relation to the rest of the dilated takeoff arteries. I'm no thoracic surgeon (or any other kind of doctor) but this is the only thing I can draw from the information. The arch is normally pretty consistent in its diameter, and your ascending portion is definitely dilated compared with this.   It's a puzzle for sure. I hope this is in some way useful to you. It at least raises some questions. I'm sure your doctor has a pretty good idea as to its importance, but it might be worth asking about it.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Mon Jan 19, 2009 4:35 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=69016&sid=ff00860746e7d0fa079c9e29861e2918#p69016"
  },
  {
    "author": "mtstreet  Guest Posts: 18 Joined: Sat Jan 06, 2007 5:54 pm",
    "title": "Re: Aortic and arterial aneurysm",
    "content": "Hi John.  Well, we'll see what the doctor says on Thursday.  Hate to bother you, but now I have a couple of unrelated question. The report from my echo last week was normal except it reported that the apex of the left ventricle is hypokinetic.  I understand the meaning of the word hypokinetic, but can you explain what significance this has?  Also, the aortic root has shrunk from 3.0 last year to 2.0 this year.  Is this important?  Thanks!\n\n",
    "posted_time": "Post  by mtstreet » Tue Jan 20, 2009 5:59 am",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=69103&sid=ff00860746e7d0fa079c9e29861e2918#p69103"
  },
  {
    "author": "kathys555  Guest Posts: 9 Joined: Sat Nov 15, 2008 3:38 pm Gender: Female",
    "title": "symptoms aortic dissection",
    "content": "car accident 2006 approx. wt 130lbs. bulging disc c 4-7 w/ neural foramina  narrowing more on left, herniated disc L5/s1 w/radiculopathy more on left, t -3 psterterior disc displacement w/desication, t-12 hemangioma,severe headaches, had a concussion 2006. always had low blood pressure.  leading up to now; weight 136lbs.  tested positive for lupus anticoagulant 2xtimes w/in last 4 months, high RDW, high ldl only on last test, right hand clutching for a while now, spacey feeling less since accident (something like that) severe chest pain for last few months (ripping feeling) had barrium swallow (normal) finally went to hospital checked, elevated enzymes but heart heart is fine. In hospitol blood pressure was lower than I have ever seen it like 86/48 w/ 97 beats, several other times  systolic stayed in 80's but distolic got as low as 42 beats in 90's     the chest pain is in front about at the 2nd 3rd rib, my sternum is elevated in that spot. I showed them at the hospital, I also have a ct scan that was done a few weeks ago looking for neck mass when the did ct scan they did brain down to aorta ( at least that's what I think it is. My family doctor told me it's my heart.( I DISAGREE)The last episode was yesterday this time had been very dizzy.   in this link figure 9 and 10 are what I see on my ct scan except mine is huge pushed out and to the left and pushing on sternum, the sternum in the ct is crooked so is mine more on left  http://www.med.wayne.edu/diagradiology/ ... tinum.html  http://tinyurl.com/yov389   anyway I showed the admitting er doctor she didn't say anything, I thought well maybe they'll look it over but they didn't. So here I am at home waiting to go to a heart hospital wednesday to get answers so in researching more things I thought maybe if I sign up to your site you could let me know what you think. Greatly appreciated.     from kathy, I am someone's daughter,mother,grandmother,aunt, neice, cousin, sister and freind.  Thank you Doctor  ps other important link  http://heart-disease.health-cares.net/a ... mptoms.php\n\n",
    "posted_time": "Post  by kathys555 » Sat Nov 15, 2008 4:15 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=64373&sid=ff00860746e7d0fa079c9e29861e2918#p64373"
  },
  {
    "author": "kathys555  Guest Posts: 9 Joined: Sat Nov 15, 2008 3:38 pm Gender: Female",
    "title": "Re: symptoms aortic dissection",
    "content": "also I have jaw and neck pain, redness on my cheeks and nose. I do have neck pain anyway w/bulging discs but it seems alot worse than it was. I have back pain, leg pain, severe headaches, muscle cramps, muscle spasms ect...  no fever, no lymes, no sickness, no anything.\n\n",
    "posted_time": "Post  by kathys555 » Sun Nov 16, 2008 2:06 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=64432&sid=ff00860746e7d0fa079c9e29861e2918#p64432"
  },
  {
    "author": "kathys555  Guest Posts: 9 Joined: Sat Nov 15, 2008 3:38 pm Gender: Female",
    "title": "[no title]",
    "content": "blood work from last week   mch,mchc,lymph%,creatinine low neut%, troponin high total and ldl cholesterol high hdl normal lupus anticoagulant\n\n",
    "posted_time": "Post  by kathys555 » Tue Nov 18, 2008 8:41 am",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=64589&sid=ff00860746e7d0fa079c9e29861e2918#p64589"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: symptoms aortic dissection",
    "content": "Hi there -  Unable to see the actual CT films of your thorax I can only go on the history and symptoms you provide. While it is not impossible you have an aortic dissection, it sounds very unlikely. It is relatively easy to recognize on x-ray, let alone on CT, but mainly it is rarely a chronic condition, is usually progressive, acute, emergent, presenting with deteriorating vital signs.   Again, it is not outside the realm of possibility, and someone should at least discuss this with you. Hopefully by now (Wednesday) they have. If there is an aneurysm (perhaps not dissecting, possibly due to trauma from 2 years previous) it should be manageable. It would appear to be not emergent, but could be acute.  Other possibilities are a congenital rotation of the heart outside the normal limits (not due to trauma -- some people have this, function with it, are asymptomatic), or a pseudoaneurysm resulting from trauma, which could cause the sort of large mass you describe in your CT films. This is usually quite manageable as well, and can also cause pain similar to that of a dissection, but without the catastrophic outcome you would likely have experienced already had that been the case.   One other possibility is that what you're seeing is pericardial effusion, which may or may not be related to the trauma of 2 years previous. This can cause the same sort of pain symptoms. The blood pressures you quote, while notable, are not especially a cause for alarm, although they do seem to correlate with your sensations of lightheadedness.   All in all the collection of findings warrant at least a closer look at the films (hopefully that's been done by now) and at the very least discussed with you). I suspect you have some sort of anatomical derangement, probably a result of the decellearation involved in the auto accident of 2 years ago, but probably not an aortic dissection, which sometimes does follow this sort of mechanism of trauma, but very rarely remains chronic.  Pseudoanerysm is another possibility,  as is pericardial effusion. There are others, also, which are less menacing in the short run, but anything crowding the area you describe should probably be reduced at the very least.   I wish I could see your films, and hope you will follow up with us here post visit to heart clinic to let us know what you learn. Meanwhile, the best of luck to you.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Wed Nov 19, 2008 9:19 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=64688&sid=ff00860746e7d0fa079c9e29861e2918#p64688"
  },
  {
    "author": "kathys555  Guest Posts: 9 Joined: Sat Nov 15, 2008 3:38 pm Gender: Female",
    "title": "Re: symptoms aortic dissection",
    "content": "Thank you for your response.  Tuesday (I think it was) went back to see radiologist she said that's your pulmonary arch. I said I thought it's my aortic arch, and the asked whi is it so large and pressing on sternum she said it's supposed to look like that, it's normal. I showed her where my chest sticks out and she said pulmonary arch. So research online told me different. Wednesday seen cardiologist and they did their evaluation told me to wait for my questions until he was done. Hearts fine. Well first question was what is this ct of he said AORTIC ARCH. Then I got a little excited and asked why is it so large and the whole sternum thing he asked what did the report say, I said the report was originally done for neck mass, didn't say anything about aorta. Well he kept saying I do heart go back to radiologist get them to do another report. I was so excited he went a got another doctor to just come in and say we do heart, we do heart. I was dressed by the time they came back in because I knew I would not get a straight answer.  Today went back to family doctor and told her she said that's my heart, radiologist said pulmonary arch and cardio said aortic arch. Well she didn't like the fact I reminded her what she said and she was wrong, she tried to say she said heart structures, leading to the heart and finally saying she said aorta and then said it looks normal to her...WHAT how can it look normal to her if she doesn't even know what she's looking at? Oh and a few other remarks I didn't appreciate, I am in search of a new family doctor...lol  I'm sorry I'm ranting. I get a little excited sometimes when it comes to things that need attention.  last friday had a few minutes only of extreme pain followed by dizziness this time. Few days ago I had an episode of felling like I was fading away.  I will get a camera take pictures of what I'm talking about and I will bring them here, I'm not sure how to bring them here. Do you have a link or email address I could get the to?    I really appreciate you being here for us. If after you see the pictures and want to call me crazy I will accept that with a crazy laugh and say thank you...lol\n\n",
    "posted_time": "Post  by kathys555 » Thu Nov 20, 2008 7:18 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=64714&sid=ff00860746e7d0fa079c9e29861e2918#p64714"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: symptoms aortic dissection",
    "content": "Hi there -  It's got to be extremely frustrating getting all this runaround about something that should be obvious. Of course a radiologist would best be able to recognize what's being looked at, but just based on the way the view was shot, I'd guess the reason  for all the confusion is that one looks down at the aortic arch with the apex of the heart normally protruding beyond it against the left part of the ribcage.   I have no earthly clue, as yet, how one posts pictures on this site (I haven't had any reason to learn. I'm remiss, I know), but if you can  figure out how it's done or find someone who does know, I'd love to see the shot. I may be able to figure out what's causing all the confusion, or if it's normal or not. There is, of course, a great deal of anatomic variation, so we'll see what we see.  I don't blame you for ranting, and you certainly have good reason for it. If a medical person doesn't know the answer, the  best answer becomes \"I don't know\", not \"It's this -- or, no, I guess it's that.\" If I'm guessing I'll say so. Hopefully I'll be able to tell if I can see it. I'm no radiologist, but I've looked at a few of these things.  New family doctor might be a good idea at this point. :)  I'll be waiting to hear/see more from you. Good luck with that.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Thu Nov 20, 2008 8:51 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=64718&sid=ff00860746e7d0fa079c9e29861e2918#p64718"
  },
  {
    "author": "kathys555  Guest Posts: 9 Joined: Sat Nov 15, 2008 3:38 pm Gender: Female",
    "title": "Re: symptoms aortic dissection",
    "content": "thank you so much I'll try to get them for you tomorrow or the next day I have to get the camera, then figure out how to get it to you. I'll teach you so next time you'll know for someone else. I'll talk to you soon.\n\n",
    "posted_time": "Post  by kathys555 » Thu Nov 20, 2008 9:01 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=64719&sid=ff00860746e7d0fa079c9e29861e2918#p64719"
  },
  {
    "author": "kathys555  Guest Posts: 9 Joined: Sat Nov 15, 2008 3:38 pm Gender: Female",
    "title": "Re: symptoms aortic dissection",
    "content": "ps.  you said  \"I'd guess the reason for all the confusion is that one looks down at the aortic arch with the apex of the heart normally protruding beyond it against the left part of the ribcage\"  in that series the aortic arch is the last shot, remember they were looking at a neck mass.  They said that looked like fatty tissue (or something along those lines)\n\n",
    "posted_time": "Post  by kathys555 » Thu Nov 20, 2008 9:07 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=64720&sid=ff00860746e7d0fa079c9e29861e2918#p64720"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: symptoms aortic dissection",
    "content": "That would be great. Knowing would be a huge help, too. I'm a little bit technologically compromised sometimes. :)\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Fri Nov 21, 2008 11:29 am",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=64740&sid=ff00860746e7d0fa079c9e29861e2918#p64740"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: symptoms aortic dissection",
    "content": "Regarding your PS: Duly noted.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Fri Nov 21, 2008 12:46 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=64741&sid=ff00860746e7d0fa079c9e29861e2918#p64741"
  },
  {
    "author": "kathys555  Guest Posts: 9 Joined: Sat Nov 15, 2008 3:38 pm Gender: Female",
    "title": "Re: symptoms aortic dissection",
    "content": "http://img505.imageshack.us/img505/2923/1011002ek7.jpg  http://img505.imageshack.us/img505/3306/1011005mp9.jpg  http://img505.imageshack.us/img505/9162/1011007mm0.jpg   okay they are here and they are backwards, in other words look at bottom one first and work your way up. I didn't do these completely myself so I can't explain sorry. Now you'll notice the brick in the spine that is actually not in me lol... I did take the pics and didn't  realize I got the house in there I thought it was sky.   but I think you can make out what I'm talking about. I forgot the films @ my brothers so if you need table location whatever let me know I'll pick them up tomarrow, but I do know the are 2.5mm thickness.  Thank you talk to you soon\n\n",
    "posted_time": "Post  by kathys555 » Fri Nov 21, 2008 8:06 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=64753&sid=ff00860746e7d0fa079c9e29861e2918#p64753"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: symptoms aortic dissection",
    "content": "Hi again, and thanks for the pictures. Don't worry about how to load them. I'll figure it out eventually -- I hope. :)  OK then, as we progress up toward the final (and most telling) view, it looks very much like a dilated aortic arch to me. There is definitely no cardiac profile shown in the view. An MRI would have been more detailed, but CT is the next best thing, and that's almost certainly not the pulmonary arch, which shouldn't be remarkable. This appears (to my non-radiologist's eye) to be a dilated aortic arch, quite possibly a false aneurysm (something I've only seen once or twice in my career personally, and both times the result of automotive trauma). While what we're seeing in that last (top) shot could be a normal variant at the extreme large end of the spectrum, given the symptoms that go with it and the history of deceleration trauma, it makes a good argument for urgent study to rule out, beyond any reasonable doubt, dilated aortic arch with possible false aneurysm/false lumen. The word \"false\" can be misleading, as it is still carrying blood (outside the normal aorta) and can produce what appears to be a large dilation. Some normal aortic arches can appear quite large from the superior view, but there are features of this view that suggest some derangement, if I am seeing what I believe I'm seeing. The arch appears to be dilated from the aortic root onward til it disappears from the view, which would include the entire arch, and which is why it looks to me like a false aneurism.   Based on the history, the appearance of the structures in the chest, the very firm, almost compressed relationship to the sternum, and the symptoms you describe, this should probably be evaluated by a vascular surgeon urgently. I think the quality of the images, because they are CT rather than MRI, may be causing some confusion and disagreement, and I may be adding to it, but if there is any doubt (and in my mind there is considerable doubt) then it should be clarified at once, for reasons I don't need to explain to you here.   In short, I think it is likely you've read this right, or at least pretty close to right. I'd be perfectly happy to be wrong, but there's only one way to be certain. MRI of the chest laterally and superiorly, aimed at the normal location of the aortic arch, as well as an echocardiogram to look for signs of aortic incompetence or changes to the root and valve. There's nothing to lose by doing this, and possibly everything to gain.  Thanks again for the pictures, which really do support your concern, in my humble opinion. As I said, I've seen a couple of these over the years, and they turned out to be traumatic false aneurysms. You certainly do fit the profile. \"If it walks like a duck...\", etc.   Please let us know what you do next and what you find out. I feel this should be studied urgently until such time as someone can absolutely disqualify the appearance of a dilated aortic arch.  Best of luck to you. Thanks again for going to all the trouble with the pictures. That's a nice light fixture you've got there, too. :)\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Sat Nov 22, 2008 11:50 am",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=64770&sid=ff00860746e7d0fa079c9e29861e2918#p64770"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: symptoms aortic dissection",
    "content": "PS - The elevated troponin level, although there are no actual figures posted, also add some weight to the possibility that this is not a normal arch. Dilation, dissection, etc., which begins at the root, as this one appears to, can cause some clinical signs and symptoms of MI, of which elevated trop. is one. Just another observation. Stay in touch, please.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Sat Nov 22, 2008 11:56 am",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=64771&sid=ff00860746e7d0fa079c9e29861e2918#p64771"
  },
  {
    "author": "kathys555  Guest Posts: 9 Joined: Sat Nov 15, 2008 3:38 pm Gender: Female",
    "title": "Re: symptoms aortic dissection",
    "content": "WOW!!! How I wish we were wrong and could give you that crazy laugh...lol  Tropinin  yes I didn't realize I forgot to put that up there. They have it as 0.04  then  0.10  then 0.07     3 different times  oh when they kept me in hospital last week or so overnight they were injecting me (twice) w/blood thinner that's probably why my blood pressure was lower than I ever seen.     Well, I appreciate you AND everyone else being here I'm trying to stay calm. I'm going to jump in shower and go to a hospital outside of this town maybe someone there will know what they're looking at lol...  Thanks and I pray I will talk to you soon Take care, Kathy  ps I'll check back in one more time before I leave if you would like to say something.  here's my # if you don't here from me one of my wonderful sons will answer. please make sure you don't put on the board ty  609-261-1292\n\n",
    "posted_time": "Post  by kathys555 » Sat Nov 22, 2008 1:32 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=64775&sid=ff00860746e7d0fa079c9e29861e2918#p64775"
  },
  {
    "author": "kathys555  Guest Posts: 9 Joined: Sat Nov 15, 2008 3:38 pm Gender: Female",
    "title": "Re: symptoms aortic dissection",
    "content": "remember that laugh? well here you go...lol  http://www.youtube.com/watch?v=WpripwOz ... re=related  They said there isn't anything wrong they checked from aorta to kidneys w/contrast ct and said my blood work is fine. I said all I wanted was a straight answer and I couldn't get it that's why I am here. So next step is Rheumatologist to find out why chest bones sticking out, why tested positive for lupus anticoagulant and maybe they can get to the root of the severe chest pains We'll see.   I will try to post the latest ct so you can have them online in case someone else experiences what I have and maybe this thread can help answer  their questions.  Thank you all for being here...  http://www.123greetings.com/thank_you/e ... day40.html\n\n",
    "posted_time": "Post  by kathys555 » Sun Nov 23, 2008 12:10 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=64802&sid=ff00860746e7d0fa079c9e29861e2918#p64802"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: symptoms aortic dissection",
    "content": "Hi again -  Sorry it took so long to reply, but apparently the posts were held up or I would have been notified of them. Anway, first, the TnT (troponin) levels are, as near as I can tell, based on my lab training, withing normal limits regardless of which measurement method is used, so I'm perplexed by that, but in a good way at least.  Evidently you have a normally odd aortic arch profile, which of course is the kind of thing that happens all the time, and which is why there are radiologists to read those films. Very good news, anyway. Now to find out just what is going on.   The laugh is priceless and timely as well. If only that could be bottled!   You're very welcome, and the team here thanks you for using The Doctors Lounge to try and find your answer. Hope you will stay in touch and keep us updated.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Thu Dec 04, 2008 11:39 am",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=65095&sid=ff00860746e7d0fa079c9e29861e2918#p65095"
  },
  {
    "author": "Tuffy  Guest Posts: 1 Joined: Fri Feb 22, 2008 5:23 pm Gender: Female",
    "title": "Atherosclerotic calcification",
    "content": "I have recently experienced dibilating low back pain with left hip, leg and foot pain. I was sent for a CT scan of the lumbarsacral spine. It said \"Atherosclerotic calcification is present in the distal aorta and aortic bifurcation\". I had two heart attacks in 2002 within 3 months of each other and I have 3 stents in my heart mid-lad.   I have several protrusions in my lumbar spine that indent the dural sac and extends into the foramina. I had a back injury in 1995 and I just assumed this pain in my back is truly back pain. Should I worry about it being from my heart? I have been very stressed for the last 6 months.   Should I be seeing my cardiologist? Am I going to have an aneursym from this calcium in my aorta?  thank you.\n\n",
    "posted_time": "Post  by Tuffy » Fri Feb 22, 2008 5:39 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=54173&sid=ff00860746e7d0fa079c9e29861e2918#p54173"
  },
  {
    "author": "Dr. A. Madia  Medical Doctor Posts: 207 Joined: Fri Jan 06, 2006 6:50 am Gender: Male Location: India",
    "title": "Re: Atherosclerotic calcification",
    "content": "Atherosclerosis is a process in which the inner lining of the arteries get fat deposition, on which calcium is also deposited and gradually the lumen gets narrowed. This was what caused you the heart attack in the first place.   Now, aorta is also an artery, and has the same tendency to get these fatty plaques. The disease process is the same, so some one having atherosclerosis in coronary is likely to have it in the aorta as well.  However aorta has adiameter of about one and a half inch, so it hardly affects the blood flow, as against the heart arteries which have a diameter of 4-5 millimeteres.  So your pain is certainly not due to the atherosclerosis in aorta, neither it has anything to do with your heart. I would advice you though to keep taking some form of a statin -Lipitor or Zocor- so as to prevent this atherosclerosis from progressing.  Apurva  P. s.  You will almost never ever get an aneurysm, it is highly unlikely. You need to see a spine doctor for your pain.\n\n",
    "posted_time": "Post  by Dr. A. Madia » Fri Feb 29, 2008 9:41 am",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=54639&sid=ff00860746e7d0fa079c9e29861e2918#p54639"
  },
  {
    "author": "Dallas girl  Guest Posts: 2 Joined: Sun Nov 25, 2007 5:41 pm",
    "title": "head and vascular problems undiagnosed",
    "content": "I am a very healthy 43 yr old woman.  2 months ago diagnosed w/ hypho-thyroidism. Thyroid tested 2 times lower than normal levels. Had full vaginal hysterectomy 5 weeks ago w/ general anesthesia.   Family history- father died at 49 of conjestive heart failure, he also had diabetes & high blood pessure. mother had corroted (sp?) artery disease and had her left CA operated on, and an artery in her left leg. She also has hypothyroid.  One brother w/ 2 brain tumors (both benign), 2 brothers have had stints, one brother at 47 was already diagnosed w/ conjestive heart failure & had by-pass surgery. One sister w/ diabetes & hypothyroid. Current meds 150 mgs of Buproprion (generic Wellbutrin) & 75 mcgs of Synthroid.  I am a healthy 43 yr old. Work out 6 days a week before my hysterectomy.  Original surgery scheduled Oct 16th.  Week before I had an uler appear in my mouth. Days later the lymph nodes around my left jaw swelled up.  Surgery postponed until 10/23.  The evening after my surgery I started having pressure in the back lower left side of my head...that has continued for 5 weeks now, along w/ head aches in that area only, pressure behind my left eye, sometimes pressure deep down in my left ear.  This Sat morning, I woke up at 4:00 am w/ a migrain type head ache just in that lower left quadrun. I took a prescription Alieve (which I had for my pain relief from surgery).  Hour later I finally laid back down, rolled onto my left side and my eyes started immediately jerking uncontrollably from left to right.  I rolled back on my back and it went away after 30 secs or so.  5 mins later, I rolled on my left side again and it did it agian.  By Sat at 6:00 am, that whole back left section of my head felt as if I had been hit by a baseball bat.  I was in bed until 2:00.  This morning, out of the blue, my nose started bleeding just on the left side.  I immediately called my Dr to report both incidents. They did an MRI and CAT scan on Fri.  The results showed some small white spots on my brain.  My Dr said he wasn't concerned.  ??!!  He said that, it could be caused by many things like high blood pressure. My blood pressure has Always run very low,. He also said high cholesterol could cause it. My cholesterol is low from working out.  Then he said migraines could cause it.  My first migraine was Sat morning, after the MRI and CAT scan were done.  Then he said that mini strokes could cause it, but he didn't think it was that. ??  Not sure how he could rule that out with all of the symptoms.  Later today, my left arm got very cold while the rest of my body was regular temp.  Yet another bizzare symptom on my left side.  After I get my MRA results tomorrow and enzyme and CBC results, I am going to a new Dr.  I have an appt w/ an ENT next week.  Will soon schedule w/ a neurologist.  I feel like I need to see a vascular specialist.  Any advice you have would be greatly appreciated.  This has been very scary and frustrating.  Thank you,  MJ\n\n",
    "posted_time": "Post  by Dallas girl » Mon Nov 26, 2007 10:38 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50867&sid=ff00860746e7d0fa079c9e29861e2918#p50867"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "Re: head and vascular problems undiagnosed",
    "content": "Hi Dallas Girl,  My initial thought in reading your symptoms was that this is a complex migraine.  This is still possible.  Other possibilities include a labrynthitis (inflammation of the balance centers of your ear) causing the problem with your eyes, a viral illness, and basically all the things your doctor had suggested.  The MRA will help answer some of these questions.  Seeing the ENT doctor is a good idea.  You may also want to see a neurologist.    Follow up with your doctor is important.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Fri Jan 25, 2008 9:52 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=53392&sid=ff00860746e7d0fa079c9e29861e2918#p53392"
  },
  {
    "author": "nelly145  Guest Posts: 20 Joined: Fri Feb 10, 2006 7:14 pm Location: West Palm beach, fl",
    "title": "strong abdominal pulse on left side",
    "content": "I am 21/female. I have an extremely strong pulse on the left side of my abdomen. It is super strong when lying down, if you put an object on it it would move quite a bit.  I have not noticed a visible mass but my stomach on both sides always looks quite distended, even when I have been very thin. I have noticed this for years now, and 3 years ago my Dr. noticed it, but she did not order any tests and said it was just because I was thin enough(5'9, 130 lbs). Since then I've gained about 20 pounds, and I can still feel the pulse quite strongly. I am definately not fat, but from what I've read everywhere else it seems you have to be very thin for this to be a normal thing. Should I be worried that this is an abdominal aortic aneurysm?\n\n",
    "posted_time": "Post  by nelly145 » Mon Oct 08, 2007 9:15 am",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=48820&sid=ff00860746e7d0fa079c9e29861e2918#p48820"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Nelly145,  Most likely you are still feeling normal abdominal pulsations.  This can often still be felt in people that are \"normal\" size.    Having said that, aortic aneurysms are serious issues so I would recommend having your doctor evaluate this when you see her, just to make sure it is OK.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Mon Oct 08, 2007 8:38 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=48838&sid=ff00860746e7d0fa079c9e29861e2918#p48838"
  },
  {
    "author": "Ag3ntman  Guest Posts: 1 Joined: Sun Sep 30, 2007 8:28 am",
    "title": "Assault victim- Marfans- Possible Dissection Help!",
    "content": "1)age:22 2)sex:M 3):Diagnoses: Marfans, lung collapse, eye problems 4): lung re-inflation, endoscopy 5): heart disease in grandparents 6) Prilosec  I was hit in the upper center/right portion of my chest very hard today. It causes severe pain and since it was in the center of my chest almost I thought I should go in to get it checked due to the marfans and aorta complications.   Anyway, they ran a CT scan and here are the results::  ct ches: pulsation artifacts. no obvious dissection or aortic injury.  what does that mean???? So there could be something but its just not OBVIOUS??? ...... I have never had anyone say I had pulsation artifacts before.... could that be a dissection????  he then goes to state my abdominal aorta looks good with no aortic dissection..   notice how he doesnt say NO AORTIC DISSECTION on the chest ct but just says \"no obvious dissection\" .... what should I do? they sent me home and it still is hurting bad......  Please help me .. should I get another CT or a second opinion???  Thanks  Ag3nt\n\n",
    "posted_time": "Post  by Ag3ntman » Sun Sep 30, 2007 8:33 am",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=48423&sid=ff00860746e7d0fa079c9e29861e2918#p48423"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Ag3ntman,  CT scans take the best pictures when there is no movement.  When the heart beats the aorta expands some.  It is likely that on previous scans the same artifact was seen but the radiologist simply didn't comment that it was present.  Given this description there is a very, very small possibility that a dissection is present. However, it is most likely that all is OK.  If you're still having pain you should follow up with your doctor.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Tue Oct 02, 2007 9:21 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=48588&sid=ff00860746e7d0fa079c9e29861e2918#p48588"
  },
  {
    "author": "carfran  Guest Posts: 1 Joined: Sun Sep 09, 2007 9:29 pm",
    "title": "hormone problems and hypertension",
    "content": "I am a female 47 year old and diagnosed with hypertension, obesity, asthma(allergy) and I am premenopausal.  My dad has had hypertension since he was 40 and my mom since she was 55.  My mom recently had 2 heart attacks at 66 and my dad had a balloon angioplasy at about 58. Both are still living. My 3 siblings have none of these diagnoses.  One grandmother lived to be 91 and the other one is still alive and 90.  Since 42, I have had several periods that last up to 3 months and bleeding so heavy that I can't leave the house for more than 1 hour at a time.  This problem has been controlled by taking bcp and I have even tried natural progesterone which both worked with one problem.  My blood pressure jumps/resets higher everytime I take hormones.  Last time,my blood pressure jumped from 140/90 to 160/100 so I am now taking a spironolactane and lisinopril.  My bp is now under 120/80 and stable and I seem to be having relatively normal periods again. I have been encouraged to have an ablation done on my uterus but I first want to understand my problem better.  I am also taking Allegra for my allergies of pollen,ragweed, and mold. (I struggle with sinus infections which I believe is related to some kind of fungus but I don't know how to treat it.)  I use albuterol when I start wheezing and can't breathe very well which always starts up in August to November.  My question:  I read that hormonal problems can cause hypertension; is this true and if so, how does that work?  Thanks.\n\n",
    "posted_time": "Post  by carfran » Sun Sep 09, 2007 10:04 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=47624&sid=ff00860746e7d0fa079c9e29861e2918#p47624"
  },
  {
    "author": "Debbie Miller, RN  Nurse Posts: 4746 Joined: Mon Apr 16, 2007 2:41 pm Gender: Female Location: USA",
    "title": "[no title]",
    "content": "It is true that there is a correlation between hormones and blood pressure, but usually we are talking about different hormones than the sex hormones that affect your periods.  The entire body functions as a result of hormones that make everything else work.  We don't know exactly why some people develop high blood pressure but various hormones may increase or decrease its presence.    Many patients with essential hypertension have  alterations of the renin-angiotensin-aldosterone system.  So, yes hormones are involved, but no, not the same hormones that are giving you grief with your periods.  Although we do have \"master\" glands that regulate the other hormones, so there can be a connection.  As for the ablation - this can be an excellent option for permanently controlling your excessive perimenopausal bleeding without adding additional hormones with their potential side effects.  I would agree with the doctors who are suggesting it.  You may also be able to reduce the risk of anemia that may come with your blood loss.  It is not an option for women who want to bear more children but I assume you are not in that category.\n\n",
    "posted_time": "Post  by Debbie Miller, RN » Wed Sep 12, 2007 11:09 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=47758&sid=ff00860746e7d0fa079c9e29861e2918#p47758"
  },
  {
    "author": "Agcurcio  Guest Posts: 2 Joined: Sat Mar 10, 2007 9:36 pm",
    "title": "4.6cm thoracic aortic aneurism",
    "content": "I am 27 years old, married less then 3 years with two little boys and i have an aneurism at 4.6 cm. I was diagnosed last november after months of tests for another medical problem I was having. I also have a bicuspid aortic valve and the strange part of this is that my inferior vena cava which normally makes it way back directly to my heart actualy leads to my liver. I have been told I am only the second person in the world to have all of these documented abnormalities. There is no \"name\" for what I have. I am hear asking only for advice or direction that my help me with my issues. I have been active my whole life and generally in good health. I have had to change my whole lifestyle to ensure I do not do anything Strenuous . I have been told that it is not marphans,since I don't fit the general body type(short, stalky). I have also been told that other then taking it easy, there is nothing I can do. Does this condition seem common to anyone? Is there anything I can do? Any help is appreciated.\n\n",
    "posted_time": "Post  by Agcurcio » Sat Mar 10, 2007 9:55 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=39470&sid=ff00860746e7d0fa079c9e29861e2918#p39470"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: 4.6 cm thoracic aortic aneurysm",
    "content": "Dear Agcurcio,  The first thought i had was that you have Marfan syndrome. However, it sounds that you have some kind of a connective tissue disease.  If you don't have Marfan syndrome, this could be another condition like Marfan called Ehlers-Danlos syndrome. Other causes might include inflammation of the big arteries of the body a condition called giant cell arteritis.   If you have not already seen a cardiothoracic surgeon, i think you should be evaluated by one.  There are ways to deal with thoracic aneurysms without having to go to surgery by means of minimally invasive procedures such as endovascular procedures to be done by interventional radiologists.  At least, you have to have serial cat scans of the chest to follow-up on the progress of the aneurysm according to how often your cardiac surgeon recommends.  If you are going to have any procedure of any kind even dental procedure, you have to tell your doctor that you have a bicuspid aortic valve and you need to take antibiotics before the procedure. Also, if you seek medical attention, you have to alert your health care givers to your condition including bicuspid aortic valve . Any chest pain in your case is an emergency and you have to immediately seek medical attention.  Thank you very much for using our website http://doctorslounge.com and I hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Mon Mar 12, 2007 11:37 am",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=39532&sid=ff00860746e7d0fa079c9e29861e2918#p39532"
  },
  {
    "author": "Agcurcio  Guest Posts: 2 Joined: Sat Mar 10, 2007 9:36 pm",
    "title": "[no title]",
    "content": "Thank you for the reply. Does the issue with my liver sound like anything you have heard before?\n\n",
    "posted_time": "Post  by Agcurcio » Sat Mar 17, 2007 10:31 am",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=39669&sid=ff00860746e7d0fa079c9e29861e2918#p39669"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: 4.6 cm thoracic aortic aneurysm",
    "content": "Dear Agcurcio,   No, i did not hear of anything like this before.  Thank you very much for using our website http://doctorslounge.com and I hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Tue Mar 20, 2007 1:45 am",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=39724&sid=ff00860746e7d0fa079c9e29861e2918#p39724"
  },
  {
    "author": "goetzco  Guest Posts: 1 Joined: Sun Apr 22, 2007 11:56 am",
    "title": "4.6 aneurysm",
    "content": "Agcurcio,  Not a doctor, but I would suggest you contact a thoracic surgeon about this. In 2005, at age 48, I was diagnosed with a heart murmur. Just a routine physical and establishing a new family doctor. He said the murmur was significant and scheduled me to see a cardiologist immediately. To make this short, the tests discovered I had a significant leakage in the aortic valve. The tests also discovered an aneurysm (5.3)  at the aortic root. Replaced the valve with mechanical one, and repaired the aortic root. Doc said I had about 1 to 1 1/2 years at the most with the aneurysm. My dad had one at age 75 that was a 5.0 and leaking when they did the surgery.   Bottom line, don't wait. If your not completely comfortable with 1 doc, it's never hurts to see another. Sorry I can't help you with the other issues, but I wish you the best.\n\n",
    "posted_time": "Post  by goetzco » Tue Apr 24, 2007 12:19 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=41328&sid=ff00860746e7d0fa079c9e29861e2918#p41328"
  },
  {
    "author": "tiffairy  Guest Posts: 28 Joined: Thu May 08, 2003 2:15 am",
    "title": "Celiac Axis Stenosis/Marfan's",
    "content": "I was undergoing an eval for Marfan's Syndrome (I'm 59\" and a bit on the thin side with Scoliosis, Pectus Excavatum, and hypermobile joints), my primary care doc ordered a Cardiac MRA and this report read \"No abnormality in the aorta suggesting Marfan's\" but it also noted a 20 percent stenosis of the Celiac Axis which if I am correct, is part of the Aorta ... so why is it that it said no abnormality? And exactly what does this stenosis mean? This was over a year ago, I just got a copy of the test today and saw this stenosis which my doctor never told me about.    Help!!!\n\n",
    "posted_time": "Post  by tiffairy » Fri Feb 23, 2007 3:39 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=38974&sid=ff00860746e7d0fa079c9e29861e2918#p38974"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "In Marfan's syndrome, the aortic root (the portion of the aorta that is directly attached to the heart where the aortic valve resides) can become dilated.  It is likely that the MRI did not show any of the typical cardiac findings associated with Marfan's syndrome.  Celiac axis stenosis refers to compression of the celiac artery.  This is the artery that comes off the aorta to feed the stomach and part of the small intestines.  If it becomes significantly obstructed, pain in the upper abdomen can result especially with eating.  This can also lead to weight loss and general poor GI health (vomiting/diarrhea, etc.)  The mechanism that these symptoms are caused by is still debated.  Some believe that the narrowing causes a decrease in blood flow resulting in the stomach/intestines being starved of nutrients and oxygen.  Blood flow increases with eating, so the pain worsens.  Others believe that there is enough collateral blood flow to keep the former description from happening and that the pain is actually caused by compression of the artery and surrounding nerves.  Regardless of the cause, if you are not having any symptoms you need not be particularly concerned about it.  It is probably an incidental finding.  Your degree of compression would be considered mild.  Should you begin to have symptoms consistent with celiac axis stenosis in the future, it would be good to remind your doctor about the previous findings.  Hope this helps.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Fri Feb 23, 2007 6:05 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=38977&sid=ff00860746e7d0fa079c9e29861e2918#p38977"
  },
  {
    "author": "jennykert  Guest Posts: 11 Joined: Wed Mar 16, 2005 11:28 am Location: North East US",
    "title": "Is screening needed?",
    "content": "My husband is 53 years old and in good health.  He currently takes norvasc for high blood pressure.  His older brother had surgery 2 years ago to repair an aortic aneurysm in his abdomen.  We just received word last night that his maternal aunt also has an aneurysm and will have surgery soon.  Both are heavy smokers.  My husband does not smoke.  My husbands brother called him last night to tell him to get screened, because this is hereditary.  I believe I read somewhere that smoking can contribute to the problem.  Should my husband be screened?  Thanks Jenny\n\n",
    "posted_time": "Post  by jennykert » Thu Jan 18, 2007 7:15 am",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=37745&sid=ff00860746e7d0fa079c9e29861e2918#p37745"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "[no title]",
    "content": "Hello jennykert - The short answer to your question is yes! It has become recognized fairly recently that abdominal aortic aneurism can be heritable. This can be an abnormality all by itself within families, or can be associated with one of a number of heritable connective tissue diseases. It can also be due, on occasion, to coincidence, but the risk is too great to hope that's the case.   Smoking definitely does not help with these things, and can hasten their development (and as you already know, can do a lot of other bad things to a body as well). But if two first-degree relatives have or have had an AAA then screening is eminently sensible (as well as extremely simple).   High blood pressure can also cause AAAs independent of any other risk factors. Elevated blood pressure and a family history, regardless of the smoking issue,  would make it very wise to have a doppler ultrasound exam, which takes about 15 minutes, is painless, and could well be life-saving. By all means tell your husband he needs to be screened for this. It can make all the difference, and repair, prior to an aneurism dissecting or rupturing, has become fairly routine and low-risk.   Please let us know how things go.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Sat Jan 20, 2007 8:33 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=37791&sid=ff00860746e7d0fa079c9e29861e2918#p37791"
  },
  {
    "author": "jennykert  Guest Posts: 11 Joined: Wed Mar 16, 2005 11:28 am Location: North East US",
    "title": "Good News",
    "content": "Good News to report.  My husband had his screening for the AAA, and all is well.  No aneuryism.  The technician even noted that he has very little plaque in his ateries and is sending some of the images to my husband's primary care physician.  Thanks again.  We are both  glad he got screened.  Jenny\n\n",
    "posted_time": "Post  by jennykert » Mon Feb 12, 2007 9:48 am",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=38639&sid=ff00860746e7d0fa079c9e29861e2918#p38639"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "[no title]",
    "content": "Hi jennykert - Outstanding news! It's a simple exam and well worth the time and cost in peace of mind. I'm really happy for the both of you. It's also nice to know there's so little plaque (we all start to develop some, usually by our teens or 20's, but the idea is to keep it at a minimum). Someone's doing something right.   Thanks for the update. I'm always happy to hear good news.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Mon Feb 12, 2007 10:13 am",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=38640&sid=ff00860746e7d0fa079c9e29861e2918#p38640"
  },
  {
    "author": "heartbroken  Guest Posts: 1 Joined: Wed Feb 01, 2006 1:24 am Location: wa",
    "title": "are aorta and brain aneurysms related?",
    "content": "my 35yo twin brother died suddenly from an aortic aneurysm and my 26 yo sister from a brain aneurysm, are these related?  My brother had hypertension.  His labs from the ER showed his potassium was 2.6.  Was this caused by the aneurysm  or can a k+ this low cause one?  Our cousin died from aortic aneurysm 2 weeks post partum and had physical characteristics of Marfans, but my brother did not have any of these.  Is genetic testing in order for  me or my children?\n\n",
    "posted_time": "Post  by heartbroken » Wed Feb 01, 2006 1:34 am",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=29657&sid=ff00860746e7d0fa079c9e29861e2918#p29657"
  },
  {
    "author": "surgicalhrtrn  Guest Posts: 1 Joined: Thu Jun 29, 2006 12:05 am",
    "title": "[no title]",
    "content": "Dear Heartbroken,  First of all, I am very sorry for your loss. To answer your question, brain anuerysms and aortic aneurysms are not related.  A brain aneurysm occurs in the brain and is often an \"outpouching\" of a vessel in the brain. When blood pressure becomes high, the aneurysm is at risk for rupture and that is often what causes death.  An aortic aneurysm occurs in the aorta in the body. The aorta is a vessel that branches off of the heart and runs down the center of the body. This is the main vessel in the body, that feeds blood supply to the kidneys, liver, and mulitple other organs. As with a brain aneursym, an \"outpouching\" of the aorta occurs and if blood pressure is too high the aorta will dissect or tear. There are 2 types of aortic aneurysms; ascending and descending. Ascending is above the level of the diaphragm and descending is below.   As for the low potassium, that did not cause the rupture of the aneurysm, the hypertension did. An aneurysm often times is developed through a thinning of the wall of the vessel. Hypertension can cause this as well as Marfan's syndrome.   As far as genetic testing goes, there is none that can be done. Just close contact and discussion with your primary care doctor is necessary. Your doctor can examine your children to see if they will develop Marfan's, monitor blood pressure closely to see if hypertension develops. and watch electrolyte levels to make sure nothing drops significantly.   Also, keep a log of the frequency and intensity of headaches, severe headaches can be a sign of a brain aneurysm.   Hope this answers your questions.   Best of luck to you!\n\n",
    "posted_time": "Post  by surgicalhrtrn » Sun Jul 02, 2006 10:16 am",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=33221&sid=ff00860746e7d0fa079c9e29861e2918#p33221"
  },
  {
    "author": "DavesMom  Guest Posts: 3 Joined: Fri Aug 19, 2005 6:53 pm Location: Illinois",
    "title": "Re: strong pulsating sensation in stomach",
    "content": "Hi! For the past month or so I've been able to feel my pulse beating strongly just by my navel.     I am 49 and six years ago had an aortic valve replacement.  At that same time the surgeon repaired an ascending aortic aneurysm.  Now I'm a bit paranoid about getting another one.  I had an echocardiogram back in February and it was fine.  Would evidence of an ascending aortic or abdominal aortic aneurysm have shown up on that?   I am 4'11 and weigh 105 pounds.      Thanks for any information.  Cheers!\n\n",
    "posted_time": "Post  by DavesMom » Fri Aug 19, 2005 7:09 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=19110&sid=ff00860746e7d0fa079c9e29861e2918#p19110"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi DavesMom, An echocardiogram shows heart rhythms etc. but would not show an abdominal aneurysm. An ultrasound of the abdomen would be one of the diagnostic studies to identify this condition. Sincerely, Rntdj\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Sat Aug 20, 2005 6:27 am",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=19128&sid=ff00860746e7d0fa079c9e29861e2918#p19128"
  },
  {
    "author": "katdarby  Guest Posts: 1 Joined: Sun Jun 12, 2005 8:25 pm Location: La",
    "title": "Strong pulsating sensation in stomach",
    "content": "I am a 23 year old female, about 5 foot 3 inches tall and weigh about 107 pounds.  Recently I have noticed that when I lie on my stomach or back I can feel my pulse beating strongly in my stomach.  when on my back I can actually see my stomach pulsating.  This is a bit alarming.  Is this normal or should I be concerned? Thank you for any help you can give me.\n\n",
    "posted_time": "Post  by katdarby » Sun Jun 12, 2005 8:32 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=15004&sid=ff00860746e7d0fa079c9e29861e2918#p15004"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi katdarby, People that are rather thin may sometimes notice pulsations in their abdomen.However, this would warrant an evaluation along with diagnostic studies to rule out any anomalies such as an abdominal aneurysm (a weakening in the aorta/ large vessel of the abdomen) I would very strongly suggest an evaluation. Sincerely, Rntdj\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Mon Jun 13, 2005 7:13 am",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=15027&sid=ff00860746e7d0fa079c9e29861e2918#p15027"
  },
  {
    "author": "jelliott  Guest Posts: 2 Joined: Thu Mar 24, 2005 12:30 pm Location: San Diego",
    "title": "Finding the top AS surgeons and hospitals in the US",
    "content": "My wife was born with Aortic Stenosis. At some point in the future, she will likely have the affected valve replaced. Naturally, we want to live near and have access to the best hospitals and particularly, the best surgeons for this particular procedure. If you have a list of these, an organization who tracks them or a URL with relevant information, please provide.\n\n",
    "posted_time": "Post  by jelliott » Thu Mar 24, 2005 12:34 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=11305&sid=ff00860746e7d0fa079c9e29861e2918#p11305"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "[no title]",
    "content": "Dear jelliott,  Aortic valve replacement is not that difficult of a procedure and any tertiary care center such as the university of California at San Diego, at Los Angeles or at San Francisco will have very qualified surgeons who can perform aortic valve replacements with utmost efficacy.  Thank you very much for using our website http://doctorslounge.com  Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Mon Mar 28, 2005 1:37 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=11490&sid=ff00860746e7d0fa079c9e29861e2918#p11490"
  },
  {
    "author": "jelliott  Guest Posts: 2 Joined: Thu Mar 24, 2005 12:30 pm Location: San Diego",
    "title": "Looking for somewhere outside CA",
    "content": "Dr Mokhtar,   Thanks for your input. Glad to hear that valve replacement is fairly easy. We are actually looking for places outside California. From the sounds of your advice, any \"major\" city in the US should have surgeons who can adequately perform the procedure.\n\n",
    "posted_time": "Post  by jelliott » Mon Mar 28, 2005 1:50 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=11492&sid=ff00860746e7d0fa079c9e29861e2918#p11492"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Looking for somewhere outside california",
    "content": "Dear jelliott,  Don't get me wrong, aortic valve replacement is still a major open heart surgery but there is now a lot more experience and advanced surgical and anesthesia techniques with such surgeries than there was 10 (or even 5) years ago. But it is still a major surgery that has its complications.  Any major city (and some  medium sized towns) in the usa should have such surgeons.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.  Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Mon Mar 28, 2005 2:15 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=11494&sid=ff00860746e7d0fa079c9e29861e2918#p11494"
  },
  {
    "author": "kimmer  Guest Posts: 2 Joined: Tue Jan 25, 2005 8:26 pm Location: Canada",
    "title": "Aortic Dissection",
    "content": "Helllo, Every now and then,  I get this severe \"stabbing\"  pain in my chest that radiates to my back.  After some time (sometimes 15 minutes - hours) it subsides.  I do not have high blood pressure, in fact it is on the lower end.  I have been told by my MD that I have slightly high cholesterol.  In fact at this very moment, I am experiencing these symptoms and it's been bothering for about 4 hrs. (this is the longest episode yet, and it's just killing me), but am apprehensive about going to emergency.  Is the symptoms of Aortic Dissection something that might come and go, or does it only happen once?  Thank you\n\n",
    "posted_time": "Post  by kimmer » Tue Jan 25, 2005 8:40 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8562&sid=ff00860746e7d0fa079c9e29861e2918#p8562"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Aortic dissection",
    "content": "Dear Kimmer,  Whenever you have severe chest pain that lasts that long no matter what the cause might be, please, go to the emergency departement early rather than waiting for several hours in excruciating pain.  Pain of aortic dissection is usually very severe from the begining and then in some patients it can subside if the dissection stops. But it usually continues and follows the pathway of spread of the dissection itself. If the dissection continues to the arm, the patient will have severe arm pain. If it continues to the abdomen, severe excruciating abdominal pain and so forth. In addition to the pain, there are other manifestations that occur depending on which arteries are blocked by the dissection like stroke symptoms if the arteries supplying the brain are occluded and so on.  You have to have risk factors for aortic dissection though, the most common being hypertension. Others include diseases that make the fibrous tissue supporting the aorta weak and easy to dissect, this includes diseases such as Marfan's syndrome and Ehlers-Danlos syndrome.  i can not tell whether or not this pain that you have been having is in fact aortic dissection. You have to be evaluated by a health care professional as soon as possible.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.  Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Sat Jan 29, 2005 7:15 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8717&sid=ff00860746e7d0fa079c9e29861e2918#p8717"
  },
  {
    "author": "kimmer  Guest Posts: 2 Joined: Tue Jan 25, 2005 8:26 pm Location: Canada",
    "title": "Thank-you!",
    "content": "Dear Doctor, Thank you so much for your kind reply.  I appreciate you gettting back to me so quickly.  You've made me feel much more at ease, and am seeing my physician in a few days.  Once again ... THANK-YOU\n\n",
    "posted_time": "Post  by kimmer » Sun Jan 30, 2005 10:15 am",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8736&sid=ff00860746e7d0fa079c9e29861e2918#p8736"
  },
  {
    "author": "biduacharya  Guest Posts: 1 Joined: Wed Dec 01, 2004 11:03 pm Location: Cuttack, Orissa",
    "title": "Hot sensation in Ear etc-taking Seloken XL 50 & Ecosprin",
    "content": "My husband is 58 years old with a mostly sitting in a chair job. He had an Angioplasty operation around January of 2004.  Since  September, 2004, he has been taking Seloken XL 50 mg and Ecosprin 150 daily, once in the morning. After two weeks of taking these medications, he has been complaining about \"feeling hot and burning\" sensation starting with his ears (outside) and progressing to all over his body.  All blood tests in the Lipid profile show normal values - including Blod pressure and blood sugar and cholestoral levels.  I ma at a loss as to what's causing these sensations. Our family physician is not able to give us a  good explanation of the cause of such ailment.  I'd really appreciate any help you may provide so that I can undertand my husband's ailment/complaint and be able to take care of his needs better.  Thanks you very much, and I am looking forward to your answer.  Bidu Acharya Cuttack, Orissa, India\n\n",
    "posted_time": "Post  by biduacharya » Wed Dec 01, 2004 11:23 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6809&sid=ff00860746e7d0fa079c9e29861e2918#p6809"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Hot sensation in Ear. Taking seloken xl 50 & ecospri",
    "content": "Dear Mrs. Acharya,  The scientific name for seloken is metoprolol. Metoprolol is not known to cause this specific side effect of having hot sensation that starts in the head and then extends to the rest of the body.  If you suspect that the metoprolol is the medication that is causing that, i would suggest that your husband stops taking it, but under strict medical supervision because sudden cessation of metoprolol and the medications of its group can lead to sudden increase in blood pressure and may be a heart attack.  But before assuming that metoprolol is the culprit and it is stopped, i would recommend that your husband be seen by a neurologist. Feeling heat in absence of the appropriate stimulus is an abnormal sensation and could either be related to nerves giving this sensation or the blood vessels being dilated but from your description, it sounds to me more like this is a neurological problem. This could be a warning symptom for a stroke.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Sat Dec 04, 2004 1:48 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6866&sid=ff00860746e7d0fa079c9e29861e2918#p6866"
  },
  {
    "author": "concernedson  Guest Posts: 1 Joined: Mon Sep 20, 2004 10:52 am Location: Elgin, IL",
    "title": "Tumor in the Aorta",
    "content": "My father is being tested for a Tumor in the Aorta, next to the heart. He has had Pancretic Cancer 2 years ago, currently treated for Prostate Cancer and now this. I have searched the net trying to find something on this and had no luck. I hope you can shed light on this for me and him. Is there such a thing? How serious could it be? Also, what treatments are available? We are awaiting an MRI test and other blood work, but the results are slow going.   Please help.  Thank you, Concerned Son\n\n",
    "posted_time": "Post  by concernedson » Mon Sep 20, 2004 10:58 am",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5436&sid=ff00860746e7d0fa079c9e29861e2918#p5436"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Tumor in the aorta",
    "content": "Dear Concerned Son,  Primary aortic tumours are rare. i am not sure exactly what was seen and by what type of imaging studies.  This could be a metastasis (spread) from the cancers that your father had before whether the pancreatic or the prostate. It could also be spread from a yet to be discovered tumour somewhere else in the body like lung cancer or melanoma.  If a biopsy is necessary, your dad and his general condition is going to dictate whether to do or not. If he is healthy and if this was another cancer and his health can stand whatever treatment might be needed, then a biopsy can be done. If his general condition is not good enough for cancer treatment or he is going to refuse treatment (let's say because of previous experiences), then no need for the biopsy.  The mri is a good modality of investigation.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped and please keep me updated.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Mon Sep 27, 2004 12:41 am",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5625&sid=ff00860746e7d0fa079c9e29861e2918#p5625"
  },
  {
    "author": "DeeDee63  Guest Posts: 4 Joined: Mon Sep 06, 2004 7:18 pm Location: Mishawaka  Contact:   Contact DeeDee63       Website   Yahoo Messenger   AOL",
    "title": "Aneurysms...",
    "content": "I was diagnosed with aneurysms last thursday and now Im experiencing numbness in my right hand. is that a bad sign?    Dee\n\n",
    "posted_time": "Post  by DeeDee63 » Mon Sep 06, 2004 7:25 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5137&sid=ff00860746e7d0fa079c9e29861e2918#p5137"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Aneurysms...",
    "content": "Dear Dee,  Usually, aneuysm rupture is dramatic with severe headache, some patients lose consciousness and/or have seizures.  An increase in the size of the aneurysms can sometimes lead to certain neurological manifestations such as numbness, weakness according to the site of the aneurysm.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Mon Sep 06, 2004 10:03 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5150&sid=ff00860746e7d0fa079c9e29861e2918#p5150"
  },
  {
    "author": "frustrated  Guest Posts: 11 Joined: Tue Aug 31, 2004 7:15 am Location: canada",
    "title": "Aortic problems",
    "content": "Ive recently experienced abdominal pain that gets worse when i lay down ive had several ultrasounds. My reason of conern is that my heart beat can be seen and felt more towards my stomach and it is a very strong beat.... if i had the ultrasounds it would show if there is a problem with my aorta like an aneurysm right?\n\n",
    "posted_time": "Post  by frustrated » Wed Sep 01, 2004 1:27 am",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5017&sid=ff00860746e7d0fa079c9e29861e2918#p5017"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Yes frustrated, it would be clear in most cases where an aneurysm leads to visible pulsations.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Sun Sep 05, 2004 6:43 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5098&sid=ff00860746e7d0fa079c9e29861e2918#p5098"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Aortic problems",
    "content": "Dear Frustrated,  You don't have to be concerned. The pulsations of the aorta can certainly be felt and can normally be seen if the person is thin enough.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Sun Sep 05, 2004 8:33 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5103&sid=ff00860746e7d0fa079c9e29861e2918#p5103"
  },
  {
    "author": "viwa  Guest Posts: 1 Joined: Fri Jun 18, 2004 6:40 pm Location: Fiji Islands",
    "title": "[no title]",
    "content": "I had a patient with Marfans syndrome who had a recurrence of aortic aneurysim.  Could it be possible to have recurrences post surgical intervention.  What is the incidence of recurrence?\n\n",
    "posted_time": "Post  by viwa » Fri Jun 18, 2004 6:46 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3738&sid=ff00860746e7d0fa079c9e29861e2918#p3738"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Marfan's and recurrent aortic aneurysm",
    "content": "Dear Dr. Lailai,  i guess it depends on the location of the aneurysm, how big the aneurysm was before the original surgery and what kind of surgery your patient had.  But since the original disease behind the aneurysm is still there, and the patient still has his original aorta, i would think that it is likely for recurrence to occur.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Thu Jun 24, 2004 5:15 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3818&sid=ff00860746e7d0fa079c9e29861e2918#p3818"
  },
  {
    "author": "Leigh  Guest Posts: 1 Joined: Sat Apr 03, 2004 8:24 pm Location: columbus, ohio",
    "title": "Fibromuscular dysplasia",
    "content": "I am a 43 year old white female and was diagnosed with FMD Feb of 2001.  I have FMD in kidneys, one is very small and not functioning and the other has some disease also.  My creatine level is 1.5.  I had a stroke in 2002 and FMD was found in the interal carotid artery on the right side of the brain.  i have a 70% narrowing there.  2003 found high homosystien levels and an anueryesm on the arota approximately 4cm.  Drs. would like to do a bypass operation on the brain.  They are watching the aorta also.  My creatine levels have just recently (2 months) been at the 1.5.  How high is too high and when shoudl something be done with the kidney.  I am frightened about the bypass surgery and really have no troubling symptoms in the brain other than the stroke in 2002.\n\n",
    "posted_time": "Post  by Leigh » Sat Apr 03, 2004 8:38 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3005&sid=ff00860746e7d0fa079c9e29861e2918#p3005"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Fibromuscular dysplasia",
    "content": "Dear Leigh,  Thank you very much for using our website.  i assume, although you never mentioned it, that you are being treated for high blood pressure as your medication list shows.   A creatinine of 1.5 in itself does not mean that you have renal failure that needs dialysis if this is your question. You already have one non-functioning kidney, the best thing to protect the other kidney is to make sure that your blood pressure remains under very strict control and you avoid any thing (like medications) that could harm your remaining functioning kidney.  When is dialysis started? It differs from person to person. The kidney has a function of getting rid of excess fluid in our body in addition to many toxins that result from the body's metabolism as well. Once deemed not doing its job in a way that is going to jeopardize one's life, then dialysis is started and since dialysis is not the best thing to be having, now kidney transplant is available as the ultimate thing to do. About creatinine levels in the blood, it is a crude indication of kidney disease. According to the lab where you blood test is performed, it is considered abnormal if it is above 1.3-1.5, so your value of 1.5 might be slightly abnormal and might be on the higher side of normal. Usually, patients start dialysis with creatinine of 10 or above, all other things considered.  About carotid fmd, indications for intervention is to be symptomatic and you already had a stroke, it might happen again. Even in people who don't have fmd but have carotid stenosis 70% or more and become symptomatic (had a stroke, or a transient ischemic attack), need intervention.  Intervention in your case could be surgical and could be non-surgical by putting a stent in the affected segmen unless deemed not possible by your doctor. All procedures, whether minor or major, have their risks and benefits and one should weigh risks versus benefits and than takes the decision. If you don't want to have surgery, i don't think that anybody is going to force you to. If your doctor thinks that you need to have surgery, i would suggest that you visit with the surgeon who is giong to do the surgery and let him explain to you the benefits and risks of surgery in full and then think about it and take your decision. i don't think that your doctor wants to put you through all the risks of surgery unless he definitely thought you need it. And if you already met with the surgeon and had some concerns, take those concerns to your surgeon and let him answer all your questions and concerns.  And remember to always ask your doctor about other choices you might have.  Once more, thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Sun Apr 04, 2004 11:18 am",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3008&sid=ff00860746e7d0fa079c9e29861e2918#p3008"
  },
  {
    "author": "wizbanger  Guest Posts: 7 Joined: Mon Oct 20, 2003 8:10 am Location: Annapolis Md",
    "title": "Mild Aortic Enlargement",
    "content": "Would you offer an opinion? A friend of mine has told me that their Mother (age approx 77) has a recent diagnosis of “mild aortic enlargement\". I am not sure how the testing was performed (ultrasound CT/MRI etc) nor the exact location other then abdominal and size 2.8cm. I believe this diagnosis is via the family General Practitioner. The issue is he wants to re-exam her in a year. Is this too long of a time period for a re-examination. The only reason I was given when asked about this time period was the Doctors concern for insurance issues. My concern I suppose with the little information I have is how stable is this condition. I have read that the average enlargement of this size aneurysm is approx .4 to .5cm a year but I don’t know if this person will be considered average? At 3cm only .2cm away I believe a the diagnosis would change to an aneurysm. Would a follow-up visit before a year passes be called for? The overall history of this person I don’t know but I do believe she has controlled high blood pressure via meds, no connective tissue disorders, non-diabetic, no other family history and a reasonable lipid profile. What do you think in general would be a reasonable time period for follow-up, based on information thus provided or if more is needed perhaps I can aquire it. Thank you for your thoughts.\n\n",
    "posted_time": "Post  by wizbanger » Thu Jan 22, 2004 12:23 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2249&sid=ff00860746e7d0fa079c9e29861e2918#p2249"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Mild Aortic Enlargement",
    "content": "Dear sir,  Thank you very much for using our website.  Aortic enlargement should be followed carefully. The usual interval of follow-up is a year between each exam and the reason being is the rate of enlargement of the aorta itself.  Vascular surgeons have divided patients with aortic aneurysms into 2 categories:  1. Patients with aortic aneurysms that enlarge < 0.5 cm/year. These patients need only  to be followed-up (unless the aneurysm is very big). 2. Patients with aortic aneurysms that enlarge > 0.5 cm/year. These patients are considered to have rapidly enlarging abdominal aortic aneurysms with a higher chance of rupture and need to be operated upon.  So, a yearly exam is considered the standard of care unless any symptoms arise and the main symptom is abdominal pain or a new mass appearing in the abdomen.  Once more, thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Mon Jan 26, 2004 10:29 am",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2283&sid=ff00860746e7d0fa079c9e29861e2918#p2283"
  },
  {
    "author": "wizbanger  Guest Posts: 7 Joined: Mon Oct 20, 2003 8:10 am Location: Annapolis Md",
    "title": "[no title]",
    "content": "Thank You yes it seems a bit reassuring and I understood your reasoning.   Although I did ask her older daughter for and was told she is diabetic, overweight, her Lipid profile is bad (her daughter didn't know the numbers for me just indicated bad) and when I asked about her blood pressure was told 170/80 while on meds.  I asked about other markers CRP/homocysteine/LP(a) etc.  but she didn't know the results. Sorry I didn’t have that information to begin with.  I hope she is seeing her Doctor more frequently for these other factors but would this change your thoughts any for follow-up testing concern the mild aortic enlargement or would it still stay once a year.   I wanted to correct my previous information and yet not take too much of your time (sorry).  Thanks once again for sharing you knowledge and for being so helpful.\n\n",
    "posted_time": "Post  by wizbanger » Mon Jan 26, 2004 9:49 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2289&sid=ff00860746e7d0fa079c9e29861e2918#p2289"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Mild Aortic Enlargement",
    "content": "Dear Wizbanger,  From the info that you told me regarding the blood pressure in a diabetic patient, her blood pressure should be controlled way better than that down to 125/80 or even lower as this will help in the delay of renal failure in patients with diabetes, about the lipid profile, the ldl should be < 100, otherwise her chances of having a heart attack or a stroke become higher.  And for follow-up of the aorta, i do not think it is necessary to be done except once a year unless the patient develops any alarming symptoms as discussed before.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Tue Jan 27, 2004 8:11 am",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2293&sid=ff00860746e7d0fa079c9e29861e2918#p2293"
  },
  {
    "author": "milkmanswife  Guest Posts: 1 Joined: Sat Jan 10, 2004 1:16 pm Location: Michigan",
    "title": "Abdominal mass found on my Aorta",
    "content": "I had a routine tubal ligation on Dec 30th and when I awoke I was told I have a mass,cyst,hematoma, on my Aorta located where the artery branches into two. They took a picture and it is blue in color.  They OB/GYN says it is a hematoma from surgery and to wait 8 weeks, take another CT and see if it has gone down. The Surgeon he called in to look at it before closing me up said it is a cyst and is softball size and needs to come out.  The CT scan shows the size at 1.56cm by 3.07 cm.  You can see and feel my heart beat pulsate by my navel when I law down. Aneurysms run in my family and my Dad had a Triple A repaired using a new stent. I am otherwise a healthy 37 yr old female.  I am scared and confused.  These doctors don't agree on the diagnosis.  When I ask them could this be an a Triple A, they both say \"no\".  Is there any other tests to determine what this mass is?  I am so worried and anxoius I have started to have panic attacks.  I have 3 beautiful kids to take care of.  I don't want to have surgery but I want to know what it is and if it could be cancer. Should I be looking for a special kind of Doctor to deal with this health concern?\n\n",
    "posted_time": "Post  by milkmanswife » Sat Jan 10, 2004 1:45 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2139&sid=ff00860746e7d0fa079c9e29861e2918#p2139"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Abdomial mass found on my Aorta",
    "content": "Dear Milkmanswife,  Thank you very much for using our website.  Abdominal aortic aneurysms are quite rare in females under the age of 70 years. So, most probably what you have is not an abdominal aortic aneurysm.  A hematoma is a bruise. A cyst is a collection of fluid which is most of the time benign. So, most probably there is no need to panic.  If you are really confused, you can ask for a second opinion from a third physician or surgeon or if you are really concerned about the nature of this mass, you can ask your physician to refer you to an oncologist (a tumour specialist) to take his opinion about the nature of this mass.  i know it is difficult to wait but my suggestion at the present time is to wait for the 8 weeks and then have the follow-up ct scan of the abdomen to see the progress of the mass.  If it is a hematoma, it should be resolving, if a cyst, most probably it will either remain the same size or increase slightly.  Once more, thank you very much for using our website http://doctorslounge.com and i hope that this information helped and please, keep me posted.  Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Mon Jan 26, 2004 10:46 am",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2284&sid=ff00860746e7d0fa079c9e29861e2918#p2284"
  },
  {
    "author": "caliente8785  Guest Posts: 2 Joined: Wed Feb 26, 2003 9:42 pm",
    "title": "Could this be an aneurysm?",
    "content": "I am an active teenager and I recently I have felt a pulsating sensation between my ribs, right near my sternum. Not only can I feel it, but when it occurs, it is visible through my skin as well. It almost feels as though my heart is skipping a beat or palpitating, but I have never felt it so low before. I have no other symptoms. Could this be an aneurysm?\n\n",
    "posted_time": "Post  by caliente8785 » Wed Feb 26, 2003 9:45 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=414&sid=ff00860746e7d0fa079c9e29861e2918#p414"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Could this be an aneurysm?",
    "content": "Dear Guest,  The thing that you are feeling is your own heart. If it is beating, i guess this is a good sign   .  It is normal to feel you heart beats at this area because this is where you heart is located. There is nothing abnormal about this.  Your heart is not a point you heart occupies a spave in the chest as big as your fist. If you do not have too much fat in this area, it is not uncommon to see the heart pulsating.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Thu Feb 27, 2003 1:33 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=418&sid=ff00860746e7d0fa079c9e29861e2918#p418"
  },
  {
    "author": "caliente8785  Guest Posts: 2 Joined: Wed Feb 26, 2003 9:42 pm",
    "title": "Re: Could this be an aneurysm?",
    "content": "Thank you for your response - it definitely is comforting! The only thing I may not have made clear in my first post is the fact that the pulse is extremely irregular, it lacks rhythm and is inconsistent. It has been occuring a few times a day for the past 4 or 5 days and such a sensation had not occured prior to this. I know that the pulse of your heart can be felt and seen in the area, but this is not a regular heart beat. Does this additional info change anything? Thanks again.\n\n",
    "posted_time": "Post  by caliente8785 » Thu Feb 27, 2003 1:46 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=419&sid=ff00860746e7d0fa079c9e29861e2918#p419"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Could this be an aneurysm?",
    "content": "Dear Guest,  Thank you very much for using our website.  Irregular heart beats is a significant thing. The problem is that if you need to feel heart beats at the heart it is sometimes difficult to appreciate the regularity of the heart as it moves during beating and sometimes you do not appreciate the beat not because it skipped but because the heart moves. If you want to look fo irrgeular heart beats at the heart then you will have to use a stethoscope to listen for the heart sounds.   This sounds difficult, you are right.  Peripheral pulse (the one usually felt at the wrist is a good reflector of the regularity of the heart beats, so it is better to be checking the pulse at this site to monitor for any irrgularities of the heart beats.  If this is obviosuly irrgular then you will have to see a doctor for that to see what kind of irregularities you have and then decide what caused them and how to treat them.  Once more, thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Fri Feb 28, 2003 7:53 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=427&sid=ff00860746e7d0fa079c9e29861e2918#p427"
  },
  {
    "author": "Freespirit  Guest Posts: 3 Joined: Tue Feb 11, 2003 7:56 pm",
    "title": "Surgery for aortic aneurysm",
    "content": "Hi...I've never posted here before, so hope I'm doing this correctly!  I'm wondering if you can tell me what you would do in this situation. An aortic aneurysm is discovered in an otherwise healthy 77 year old man. It is near one of the kidneys and affecting blood supply to that kidney. The aneurysm is 8 cm. in diameter.  The man's WBC is up, but the source of the infection is unknown, besides the possibility of it being caused from the aneurysm.  Would you wait to do the surgery (to remove that section of the artery) because of an elevated WBC?  Or is the need to remove an aneurysm that large more important than an infection?  Thanks for your help! Teri\n\n",
    "posted_time": "Post  by Freespirit » Tue Feb 11, 2003 8:15 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=336&sid=ff00860746e7d0fa079c9e29861e2918#p336"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Aotic aneurysm",
    "content": "Dear Teri,  An aortic aneursym that large carries the risk of rupture and sudden death if not operated upon. Causes of a high wbcs are many. Infection is just one of them.   My advice at this point is to go ahead and do surgery after making sure that this high white count is not due to infection as an ongoing infection could definitely lead to postoperative complications. If an infection is definitely ruled out and the patient still has an elevated white count then you go ahead and operate and then investigate the cause of the high white count.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.  Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Wed Feb 12, 2003 8:17 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=341&sid=ff00860746e7d0fa079c9e29861e2918#p341"
  },
  {
    "author": "Guest",
    "title": "[no title]",
    "content": "Dear Dr. Mokhtar,  Thank you for your insight.  Unfortunately, it's a \"done deal\" and the 77 yr. old man, my father, has passed away.  The hospital that discovered the aneurysm didn't do those types of surgeries so had to transport him to a larger hospital.  The smaller hospital almost had him flown over, but didn't only because the other hospital doesn't have a heli-pad; that's how urgent they felt it was.  They, too, knew that his WBC was up.  But, then, he gets to the larger hospital and they say they are going to wait until the WBC goes down.  They were thinking in about four days from then.  But, two days later, it started to leak so they had to do emergency surgery.  When they got inside him, it burst and, of course, was a complete mess in there.  So, instead of just being able to do the needed procedure, they had to spend time cleaning all that blood up, first.  Of course, this was cutting off his blood supply to his lower body for even longer.  They told us 20 minutes, but I have a hard time believing it was only for that long.  His kidneys shut down, but they told us that with two or three dialysis treatments, they should start back up.  They waited days before starting dialysis and in the meantime, he had a stroke.  Right after the stroke, they told us that we might want to change his \"code\".  That he will probably never walk again, etc.... etc..... and that we might want to consider not even starting dialysis!  It sounded crazy to us at the time, and still does (!), and we said that we were continuing on.  It'd only been two days since his surgery and we weren't going to give up on him, yet.  I think they knew more than they were letting on.  So, about the WBC and surgery.  I had an appendectomy a couple of years ago.  My WBC was up, due to the infection of the appendix.  But, they weren't going to take the chance of my appen. bursting so they did the surgery.  Isn't this routine procedure?  Another thing with that hospital and those doctors is, it seems that no one, except at the very beginning, was even trying to figure out what the cause of the elevated WBC was.  They never even talked about it.....in fact, my mother saw the surgeon before the surgery and I think once afterwards.  Then, a doctor took over that was just a general hospital doctor.... and we only saw him when he gave us the \"doom and gloom\" talk.  He wasn't even around before!  So, I don't know... the whole thing seems odd to me.  Can you tell me what other reasons the WBC goes up?  Thanks so much for your help.        Teri\n\n",
    "posted_time": "Post  by Guest » Thu Feb 13, 2003 12:03 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=346&sid=ff00860746e7d0fa079c9e29861e2918#p346"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Aotic aneurysm",
    "content": "Dear Teri,  Thank you very much for using our website and thank you very much for your update.  My sympathies about what happened to your dad.  Surgery on an aortic aneurysm is a very hectic situation whether it has leaked or not but of course it becomes more even more hectic if it leaks.  i do not know the exact condition of your father. How much blood he lost? How much blood transfusion did he receive? Is he on a ventilator? Are there any iv medications that he is receiving  to keep his blood pressure from going down? Renal failure is not an  uncommon complication after aortic aneurysm surgery, what did the kidney specialist have to say about it? Did they say anything about an infection? All these questions and many more need to be answered before really answering you about your dad's condition and the \"code status\".  However, i can try to shed some light on the causes of high white count. High white count can be caused by: 1. Infection. 2. Certain blood cancers. 3. Certain medications, steroids for example. 4. Stress. 5. Dehydration. 6. Having a heart attack or a stroke.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped and waiting for your update.  Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Thu Feb 13, 2003 8:35 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=348&sid=ff00860746e7d0fa079c9e29861e2918#p348"
  },
  {
    "author": "tandlb",
    "title": "Aortic Aneurysm caused by Cystic Medial Necrosis",
    "content": "What is Cystic Medial Necrosis? My husband, 39 yrs old, just underwent an emergency Ascending Aorta Dissection. The pathology report says the aneurysm was caused from Cystic Medial Necrosis.\n\n",
    "posted_time": "Post  by tandlb » Sat Dec 28, 2002 7:17 am",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=80&sid=ff00860746e7d0fa079c9e29861e2918#p80"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Aortic aneurysm",
    "content": "Dear guest,   Thank you very much for using our website.   The aorta is the largest vessel of the body. Its wall is formed of 3 layers. The innermost one (the one in direct contact with the blood) is called the intima. The one just outside of it is called the media (and this is the most important one to maitain the integrity of the aorta). The outermost one is called the adventitia. The media is formed of elastic tissue and some fibrous tissue.   Cystic medial necrosis is a term meaning that there was degeneration in the middle layer, the media, and hence the name medial.   The young age of your husband makes me think (unless he has had high blood pressure for a ling time) that he has one of the congenital diseases that causes degeneration of the tissues forming the media of the aorta. The most common one is called Marfan's syndrome. Another one is called Ehlers-Danlos syndrome.   Patients who have these diseases are prone to aortic dissection because of degeneration of the middle layer and they become more susciptible to injury of noirmal stress imposed on the aortic wall by normal blood pressure and they get dissection in the wall of the aorta which means simply that the aortic wall split into two.   Dissection of the ascending aorta is a medical emergency that is life threatening as you already might have known from your personal experience with your husband.   If your husband has either of the two diseases that i mentionned earlier, then he will be maintained on life long medications and he should be monitored regularly.   Once more thank you very much for using our website http://doctorslounge.com and if you still have any questions, please don't hesitate to post them.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Sun Feb 09, 2003 5:42 pm",
    "category": "Cardiology",
    "sub_category": "Diseases of the Aorta",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=261&sid=ff00860746e7d0fa079c9e29861e2918#p261"
  }
]