[
  {
    "author": "wsc  Guest Posts: 1 Joined: Mon Apr 20, 2009 7:19 pm Gender: Female",
    "title": "petscan moderate uptake in uterine cervix",
    "content": "I recently had a pet scan done to rule out lymphoma. it was determined through mediastinoscopy to be sarcoidosis. My pet showed moderate uptake in uterine cervix. Followup with gyn and pap. I had a pap a month prior that was normal as well as a CA 125 which was normal. Since I am a nurse my GYN said she would do a cervical and endometrial biopsy to alleviate my worries. The endometrium showed proliferative endometrium . I had cervical biopsies at 12 oclock, 3 oclock, 6 oclock and 9 oclock. The cervix at 6 oclock showed squamous metaplasia ,12 o clock endocervix with acute and chronic inflammation. My question is: is any of this any concern? Should I followup with any additional testing? , were the biopsies deep enough ? would these results show up on a pet as moderate uptake? What else may cause that area to light up? Do I now assume that that the pet was false positive in that area?My GYN is not concerned and I am to followup in a year. would you agree?  I have always had normal pap, no GYN issues. Should I be doing any addional tests. Based on this information would you be comfortable with this conclusion?  thank you  thanks for answering\n\n",
    "posted_time": "Post  by wsc » Mon Apr 20, 2009 7:33 pm",
    "category": "Oncology",
    "sub_category": "Endometrial Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=74983&sid=2539d4f4e28a9734797371a0eb6132d1#p74983"
  },
  {
    "author": "jcjg87  Guest Posts: 10 Joined: Wed May 30, 2007 7:05 pm",
    "title": "Cancer Research",
    "content": "Hello. I am a Junior undergraduate student, and I am taking a Cancer Biology class this semster. For our final paper, our professor has asked us to contact a doctor or resarcher and ask a few questions about the cancer type we have chosen. My cancer type is endometrial, and if possible, I would greatly appreciate some feedback on the disease.  The most common methods of treatment for the disease, if any other gynecologic problems such as endometriosis or cysts put you at a higher risk for developing the cancer, how common the cancer is in your area, and if you know of any new treatment options being researched, or if p53 has any link to this cancer  Thank you so much for your help, Jenny\n\n",
    "posted_time": "Post  by jcjg87 » Mon Dec 03, 2007 2:43 pm",
    "category": "Oncology",
    "sub_category": "Endometrial Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=51179&sid=2539d4f4e28a9734797371a0eb6132d1#p51179"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "Re: Cancer Research",
    "content": "Hi Jenny,  I apologize for not responding sooner.  Unfortunately, I don't think we have anyone on our editorial board that specializes in endometrial cancer.  I'd be happy to give you the information that I know.  p53 is associated with endometrial cancer.  There are several studies suggesting that overexpression of p53 correlates with a poorer prognosis in patients with endometrial cancer.  Treatment basically falls into four areas: surgical removal of the cancer (usually by a hysterectomy), chemotherapy, radiation therapy and hormonal therapy.  The specific combination of which of these is used depends upon the stage of cancer as well as the specific genetic make up of the cancer.  Endometrial cancer risk of development basically comes down to estrogen exposure.  Women taking estrogen alone (without progesterone) are at increased risk of developing endometrial cancer.  In addition, women taking tamoxifen may be at increased risk of developing endometrial cancer as well.  Women taking estrogen in combination with progesterone are not at increased risk of developing cancer.  I hope this helps some.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Fri Jan 25, 2008 10:46 pm",
    "category": "Oncology",
    "sub_category": "Endometrial Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=53394&sid=2539d4f4e28a9734797371a0eb6132d1#p53394"
  },
  {
    "author": "jfem  Guest Posts: 2 Joined: Mon Jul 23, 2007 2:56 pm",
    "title": "endometrial stripe",
    "content": "I am a 41 yo.no sig med or sur history. 4 children ( 12,9,8,6) never an abnormal pap, never any gyn issues. Regular cycle, between 29-31 days.,.bleeding is for about 2-3 days, never any problems. In the past 6 months, cycles have been between 26-28 days...still never any irregular bleeding, no pain, excpet during ovulation.( for about a day), most recently, a tiny bit of bladder pressure, but only slight.  Vag sono in 1/06 revealed an endometrial stripe of 6mm , uterus measured 7.9, this was taken on cycle day 6. Vag sono on 2.07 revealed endometrial stripe of 8 mm, uterus 9.2..taken on cycle day 9.  Ob said uterus felt a little enlarged, but nothing too much.  I'm freaking out that I have endometrial cancer..she is sending me for another sono in 2 weeks... should I be concerned?  I have no family hx of any cancer, or any issues like this. I do not take nay medications, I exercise regularly, am not overweight , and am in generally pretty good health.  Do I need another opinion? Should I be worried? I never had any issues like this before, so I am really upset. Thank you\n\n",
    "posted_time": "Post  by jfem » Mon Jul 23, 2007 3:07 pm",
    "category": "Oncology",
    "sub_category": "Endometrial Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=45006&sid=2539d4f4e28a9734797371a0eb6132d1#p45006"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Jfem,  The first question that is important in being able to answer your question why did you have the ultrasounds done?  Were you experiencing symptoms that led your doctor to order this?  Based on a general answer, I would not be too worried about the findings of your endometrial stripe thickness.  The thickness varies dramatically in a premenopausal woman.  it can range from a few millimeters up to 13-16mm during the secretory phase of the cycle.  Having a stripe that is about 8mm approaching the mid-cycle is most likely normal.  Repeating the ultrasound in 2 weeks seem quite reasonable.  I think the likelihood of cancer is low for you.  (Keep in mind that this is a generic answer as I don't know why you had the ultrasound originally.  Even so, I still think the likelihood will be low.)  Best wishes. Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Wed Jul 25, 2007 5:02 pm",
    "category": "Oncology",
    "sub_category": "Endometrial Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=45286&sid=2539d4f4e28a9734797371a0eb6132d1#p45286"
  },
  {
    "author": "jfem  Guest Posts: 2 Joined: Mon Jul 23, 2007 2:56 pm",
    "title": "Thanks!!!",
    "content": "Thank you for your response...  It's so reassuring to me...  The reason for the ultrasounds were \"bloating\", which was found to be from ulcerative colitis/ proctitis ( very mild)... and to check on the ovulation pain that I get every month. ( normal, cyclical, happens on ovulation day, lasts for a day, then goes away until the next month).   Again, thanks for your info and for your time.   J\n\n",
    "posted_time": "Post  by jfem » Wed Jul 25, 2007 5:50 pm",
    "category": "Oncology",
    "sub_category": "Endometrial Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=45296&sid=2539d4f4e28a9734797371a0eb6132d1#p45296"
  },
  {
    "author": "Wings  Guest Posts: 1 Joined: Wed Apr 25, 2007 1:01 pm Location: California",
    "title": "very thick endrometrial lining",
    "content": "I have had heavy bleading episodes for the last three months. happened one other time about 6 months after the delivery of my 4th child. that was 2 years ago. Since then, my period has been spiratic. Untill the last three cycles. Three months ago, my bleeding lasted 15 days, most of which was heavy bleading. (changing a pad every hour) that promted me to go to the doc. he perscribed bc pills and to double up on them untill the bleeding stopped. then went back for a Pap smear and pelvic exam. he felt that the uterus was inlarged and ordered an ultrasound. by the time the ultrasound could be scheduled, I was 5 days into my heavy bleed and had to have an intervaginal us. Passing very large clots I could feel at the time. Also at one point, my resting heart rate was 22 bpm.   The us showed that my endometrial lining was at 4cm. Doc sent me to a gyno and she has performed a D & C. I will get the results back on thursday may 10th. my question is, In all my research, I have found that the general thought is that 9 to 15 mm is concidered very thick... yet mine is 4 cm. I am over weight... should I have more cause for concern about uterin or enderometrial cancer because of the thickness of my lining? (It took 9 years to get pregnant with my last baby, I am now 41 years old.) what are my chances of having to have a full hystorectomy with that kind of a mesurement and what kind of questions should I have ready for my doc?   I am a little nervous, but not ready to give into unsolidified concerns.   Wings\n\n",
    "posted_time": "Post  by Wings » Sat May 05, 2007 11:51 am",
    "category": "Oncology",
    "sub_category": "Endometrial Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=41965&sid=2539d4f4e28a9734797371a0eb6132d1#p41965"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Unfortunately, I'm not able to answer most of your questions.  Regarding the question of endometrial cancer, when the gynecologist did the d&c, the lining was likely sent for analysis to the pathology lab.  There it will be examined very carefully for any signs of cancer.  This should give you a reliable answer to the cancer issue.  Follow up with your gynecologist is important.  Your gyn doc should be able to answer you other questions for you.  Also, some of my colleagues on this forum may have further answers for you.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sat May 05, 2007 1:36 pm",
    "category": "Oncology",
    "sub_category": "Endometrial Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=41966&sid=2539d4f4e28a9734797371a0eb6132d1#p41966"
  },
  {
    "author": "Christacey  Guest Posts: 1 Joined: Thu Apr 19, 2007 12:26 pm",
    "title": "Remove ovaries and cervix for complex atypical hyperplasia",
    "content": "I am a 36 year old woman - not overweight, have 3 kids but had heavy menstruation.  Recently had ablation. Follow-up pathology revealed complex hyperplasia with atypia.  Ob/gyn recommended supracervical laproscopic hysterectomy.  She wants to leave ovaries in but states she will look at them.  Plans to have pathologist look at uterus upon removal during surgery.    I have read that most people have total hysterectomy, some docs stating that if undetected cancer is present that it could spread in abdomen when uterus is cut.  I also heard that since complex atypical is estrogen fed that ovaries should go.  My doc is leaning towards keeping ovaries and cervix.  My surgery is May 22.  I am very scared and want things taken care of.  I could insist on ovary, fallopian and cervical removal as I am done having kids, but also heard that if you take out ovaries and do ERT it is rough to be young and go through menopause.  What is commonly recommended by onc gyn these days - should I insist on ovary, cervical (total) removal?\n\n",
    "posted_time": "Post  by Christacey » Thu Apr 19, 2007 12:39 pm",
    "category": "Oncology",
    "sub_category": "Endometrial Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=41009&sid=2539d4f4e28a9734797371a0eb6132d1#p41009"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "I cannot speak with any expertise; however, if the ovaries are able to be spared this can have significant benefits.  The benefits must be weighed with the risks, though.  I would recommend you see another gynecologist or gyn. oncologist for a second opinion.   I suspect that your primary gynecologist will even be willing to give you a referal since second opinions can be very helpful.  Sorry I can't be of any more help.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Wed Apr 25, 2007 11:57 pm",
    "category": "Oncology",
    "sub_category": "Endometrial Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=41446&sid=2539d4f4e28a9734797371a0eb6132d1#p41446"
  },
  {
    "author": "Mumms  Guest Posts: 1 Joined: Wed Aug 03, 2005 12:25 am Location: Ak",
    "title": "Follow up and further testing",
    "content": "Hi, I am a recovering endometrial cancer patients, 3.0 Hemocrit w/ 6 units of blood transfused...Doing quite well, but started having fevers a week after surgery about 10 mo. ago off and on, went through the radiation (good), still have an occassional spotting during relations or bowel straining.  Had CBC tests done, came back w/6.2H Potassium, T. Bilirubin 1.6H, WBC 2.9L, SEG 72H, RDW 15.6H, Gran1.9L, supposedly the blood wasn't hemolized, so redid the tests with results of WBC2.3L, RBC 5.24H ABS# Neutrophil 1.3L, the rest of the tests results were unremarkable.  I have lots of pain in the hip joints and lower area as if maybe a low grade infection is hiding, doesn't show up enough to cause alarm, but I break out with a fever for some reason or another about every 2 1/2 to 3 weeks of about 101 to 103 degrees for a few days or so...Not sure whether to head to the urologist or gyn as the reg. doctor said the tests didn't show what he had suspected...I have great pain and ache all over and especially the areas mentioned and am relieved after the fevers.  I did have a normal bone scan too, sorry so lengthy just not quite sure what to think...\n\n",
    "posted_time": "Post  by Mumms » Wed Aug 03, 2005 12:44 am",
    "category": "Oncology",
    "sub_category": "Endometrial Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=18002&sid=2539d4f4e28a9734797371a0eb6132d1#p18002"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi Mumms, The specialist that would be the most effective in treatment and monitoring progress is an Oncologist. Sincerely, Theresa Jones, RN\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Fri Jul 14, 2006 6:14 am",
    "category": "Oncology",
    "sub_category": "Endometrial Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=33398&sid=2539d4f4e28a9734797371a0eb6132d1#p33398"
  },
  {
    "author": "melntod  Guest Posts: 5 Joined: Sat Mar 12, 2005 1:20 pm Location: Virginia",
    "title": "endometriosis after complete hysterectomy?",
    "content": "I was wondering can you get endometriosis after having a complete hysterectomy? I am having lower back pain and also pain where my ovaries used to be, actually all over my lower abdomen. I know that I have a swollen lymph node under my chin on the left side, but now I am also having pain and pressure under my left rib, and a pain in my left shoulder. Can that all be connected? I appreciate any answers that you can give me!\n\n",
    "posted_time": "Post  by melntod » Mon Apr 04, 2005 11:01 am",
    "category": "Oncology",
    "sub_category": "Endometrial Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=11883&sid=2539d4f4e28a9734797371a0eb6132d1#p11883"
  },
  {
    "author": "mandy25  Guest Posts: 3 Joined: Sun Feb 26, 2006 9:16 am",
    "title": "endometriosis",
    "content": "my name is amanda i am 27 and suffered from this condition for 3 years, if you have any concerns i would recommened you see your gp as i wouldnt wish this on anyone and would urge woman to get checked as soon as possible if they have any symptoms from endometriosis.your gpcan tell you all you need to know. i got steralized last year and over the last few weeks i have been getting severe cramps in my abdomen usually on left hand side, sexual intercourse is once again sore and i also have been bleeding after sexual intercourse all those dreaded symptoms i had long ago. tommorow morning i am getting an appointment with my gp and hope it is not endometriosis once again, even though it usually is uncommon after being steralized i wont take any chances and the earlier you cath it the easier for the doctors to get rid of it. as a woman with this condition in the past please seek advice from your gp.good luck xx\n\n",
    "posted_time": "Post  by mandy25 » Sun Feb 26, 2006 9:39 am",
    "category": "Oncology",
    "sub_category": "Endometrial Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=31409&sid=2539d4f4e28a9734797371a0eb6132d1#p31409"
  },
  {
    "author": "Leena  Guest Posts: 3 Joined: Wed Jun 11, 2003 7:34 pm",
    "title": "Adenocarcinoma Endometrium",
    "content": "Dear Doctors,  My friend was diagnosed with Adenocarcenoma of the endometrium in  January 2001. The doctor though initially decided to do hysteractomy on her suddenly changed his mind since she was only 30 and never had a chance to have a baby. They decided to treat her with Provera 10mg for one year period. In between this they did altogether 8 biopsies in an 8 month period! The doctors did tests every month such as Hysteroscopy +ECC(endocervical curettage+EA.) The subsequent samples showed nothing serious.   After stopping Provera, the doctors wanted the couple to try for a baby and to speed up the process they put her on fertility drugs and altogether treated her with Fertomide and Letrozole tablets,and then they did ultra sound every month on her during the medication.Initially eggs were not produced but improvment were shown later.Then they injected her with Profassi 500 IU twice and since nothing was happening they prescribed an HSG and it showed  the uterus synache with irregular filling defects, bilateral fimbrial both end blockage. In May 2003 the doctor recommended laproscopic sugery to remove the blockage.  Despite all the pain that she has endured for more than two years  1)do you think there is a chance for her to conceive a baby ?  2)Her doctor said that if she gets pregnant, there will be a good chance that the adenocarcinoma of the endometrium will be reversed and thus the problem might be solved permanently but if she does not get pregnant  there is a possibility that this problem can come back later. Is this true? 3)What is the possibilty of a complete cure with this medication?  4)Is she at risk if she delays getting a  hysterectomy? Kindly give your valueable opinion.  thanks  Leena[/b]\n\n",
    "posted_time": "Post  by Leena » Wed Jun 11, 2003 7:41 pm",
    "category": "Oncology",
    "sub_category": "Endometrial Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=936&sid=2539d4f4e28a9734797371a0eb6132d1#p936"
  },
  {
    "author": "Dr. Jeffrey Gordon  Medical Doctor Posts: 127 Joined: Sun Jan 05, 2003 5:22 pm",
    "title": "Endometrial cancer",
    "content": "Leena,  Thanks for your post to The Doctor's Lounge.  Fertility and infertility issues are beyond my area of expertise.  I won't be able to help you with those questions.  I don't know the specifics of your friend's endometrial cancer diagnosis.  As a medical Oncologist, I tend to see patients with advanced stages of endometrial cancer.  It sounds like from your post that your friend has an early stage, but that surgery is being deferred since a hysterectomy will preclude the future possibility of bearing children.  You may want to post your question on the Intern Medicine or Fertility Boards on this web site.  If there are any Gynecology Oncologists who stop by this site, then they would be better able toasnwer these questions.\n\n",
    "posted_time": "Post  by Dr. Jeffrey Gordon » Mon Jun 23, 2003 7:43 pm",
    "category": "Oncology",
    "sub_category": "Endometrial Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1025&sid=2539d4f4e28a9734797371a0eb6132d1#p1025"
  },
  {
    "author": "Eskimopup",
    "title": "Please add direction",
    "content": "I began w/ family Dr. many months ago for a pain in the LUQ, proximinal to adrenal gland.  Severe fatigue and at that time abnormal menstration.  Abnormal being every 10 days, terrible cramping and about the 7th day severe diarrhea lasting 3 days, then the cycle beginning again.  I was told it was reflux and dreaded the next 3 visits with the same complaint.  The 4th visit was with the NP, told it was gastrointestinal something and I requested a Pap, may as well while I was there.  The Pap was abnormal and I followed up with a GYN and colposcopy.  On 3/6/3 I had a cone biopsy and vaginal complete hysterectomy.  Dianosis Stage1A1 adenocarcinoma of the cervix.  No lymphs were biopsied that I know of.  I have more detail on the tissue diags if it would help.  I've spoken with the surgeon numerous times via phone since with the same LUQ pain, bladder contractions, low back pain (similiar to labor pain), and cramping.  I was told this is normal.  Two weeks ago I went to urgent care, with the same pains, terrible fatigue and ill feeling.  UA was done and clear.  I was told of anemia I had after the surgery and still in recovery period.  The cramping is on both sides and I know I have the right ovary and apparently some of my left ovary that was suppose to be taken in 1986, I was told cancer, but Dr. notes apparently say cyst.  Darn glad I'm a nursing student, but still confused and frustrated.  All of the above, and back to the cramping every 7 days, bloating, loss of appetite, no weight loss, unsymetrical thighs and seems pitting behavior.  I'm questioning whether a CA-125 assay, pelvic ultrasound, or whatever test maybe valuable.  UC physician suggested follow up with family doctor and I feel I've hit a dead end there.  Would follow-up with GYN be more appropriate now or wait until middle of June for surgery follow-up appointment.  I really like to have a nurse in the room, not because I feel uncomfortable with the Dr. doing the procedure, but I can get a non-medical answer to my questions.  But I feel uncomfortable making this request, because I don't want to offend a male Dr.\n\n",
    "posted_time": "Post  by Eskimopup » Thu May 08, 2003 11:36 am",
    "category": "Oncology",
    "sub_category": "Endometrial Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=707&sid=2539d4f4e28a9734797371a0eb6132d1#p707"
  },
  {
    "author": "Dr. Jeffrey Gordon  Medical Doctor Posts: 127 Joined: Sun Jan 05, 2003 5:22 pm",
    "title": "Cervix cancer",
    "content": "Eskimopup,  Thanks for your posting.  It seems very appropraite that you seek the medical evaluation of a GYN specialist given the continued problems that you are experiencing.  I am not implying to overstep the role of a GYN docotor, but you should seek the evaluation as well of a GYN Oncologist for a thorough work-up of your problems.  Your problems may not be related to any cancer issues, but your symptoms are not specific enough to be diagnostic of any particular problem, thus the need for a thorough re-evaluation of what is going on.  A CA-125 level can be helpful if it is significantly elevated, but other non-malignant processes can mildly or moderatley elevate its level.  Nevertheless, I would obtain such a test.  Have you had a pelvic ultrasound or CAT scan imaging of the abdomen and pelvis regions?  Do you have more detailed information about the pathology report outlining \"adenocarcinoma of the cervix\"?  What information is present to declare the cancer a Stage IA1?  You should not feel embarassed or shy in asking for a female health care worker (such as a nurse) to be present when a male doctor performs a GYN exam.  In my practice, whenever I perform such an exam or even a digital rectal exam on a female patient, I have one of my female nurses present.  This is not just for legal reasons, but I believe it provides a level of comfort for my female patients.   Likewise, you should not feel that you are disturbing or disappointing a doctor in asking a non-physician to explain what is goin on.  Sometimes doctors don't have a lot of time to explain everyhting or tend to explain it in technical terms that are not always easy to understand.  You should know what is goin on with your medical evaluation and should be an active part of it.  Asking questions is part of the process.  That is how I view it.\n\n",
    "posted_time": "Post  by Dr. Jeffrey Gordon » Fri May 09, 2003 10:32 am",
    "category": "Oncology",
    "sub_category": "Endometrial Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=711&sid=2539d4f4e28a9734797371a0eb6132d1#p711"
  },
  {
    "author": "Eskimopups  Guest Posts: 1 Joined: Thu May 08, 2003 10:52 am  Contact:   Contact Eskimopups       AOL",
    "title": "Add'l information",
    "content": "This is right off my hospital summary and mostly means absolutely nothing to me, so if there's incomplete or too much info I apologize.  Tissue Description Uterus (85grams; endometruim curettings 2x1.2x1cm; endocervix curettins 8mm) and conization of the cervix (3.3x3x1.7cm). CR03-1907 A1, A2, A3, A4, A5, A6, A7, A8, B1, B1, C1, C2, C3, C4, C5, C6  Diagnosis Multifocal areas of endocervical adenocarcinoma in situ are identified.  Focally the endocervical margin is positive in the 9-10 o'clock position. Residual endocervical adenocarcinoma in situ is identified with a focal area of superficial invasion (less than 2mm invasion). The endometrium is proliferative phase. The myometruim is unremarkable. Proliferative phase endometruim. Endocervical mucosa and stroma.  I did have a pelvic ultrasound done prior to the surgery, but not after and no CAT scan ever.  The surgeon also mentioned removal of some lymph node prior to surgery and when I asked why the sagittal incision, rather than the transverse pelvic, it was explained in the event of the removal of this lymph node.  I had a vaginal hysterectomy, so I know that the para aorta lymph node wasn't removed.  I'm wondering where this lymph is located in relationship to the pain I have in the LUQ.  I know that when there are swollen lymphs in the groin or neck they are tender and are generally worse in the morning when there is little activity.  I'm wondering if this LUQ pain is possibly this lymph, I don't know where this lymph is located.  This pain is worst in the morning before I get out of bed and when I'm up and moving it lessens and sometimes goes away.  I feel my pain tolerance is great and upon wakening it is probably an 8.  I've learned that if I'm up it lessens, so it's a great effort to \"drag myself out of bed\".    Dr.s have cooralated this pain with constipation, maybe from their exams and respiratory.  I'm confident that my bowel routine is normal with the exception of the diarrhea at the 7th day of my cycle.  I have asthma and WBC was high for histamines.  Chest x-rays were clear and I haven't noticed any allergy or asthma problems.  My personal feeling with the exams with a physician is that a nurse should be present, not for the legalities, but because generally they are female and can relate...their job is to educate as well.  If I'm able to describe in detail, the nurse is not only able to relate to the experience but has medical and personal knowledge as to the description.  I know how time is a factor, I don't think the legalities is what a Dr. should consider as a factor of whether a nurse is present, but the quality of care.  I don't ask for a nurse's presence not because of being uncomfortable, but because of the Dr.s time restraints and the implication that I may feel uncomfortable.  My personal opinion is anytime a physician is with a patient a nurse should be present, for educational and follow-up purposes.  Working in healthcare I see the nurse isn't present many times and that interferes with the quality of care.  Not only does it require extra time of reading Drs. notes, but often there are questions that aren't in take home pamphlets and nursing education that a patient thinks of that are significant.  Besides even though I work in healthcare and I'm a nursing student, I don't know everything my Dr. may be explaining to me either.  I am my ownly advocate, but I'm not likely to seek further care because there may be a connotation of some sort.  Many being a hyprochondriac, after being told \"its a normal healing process\".  The forum is great as far as pointing me in a direction in that although each Dr. at my facility has the same access to my records, I'm getting direction from them in that they don't want to step on one another's toes in their specialty.  Urgent care treats the complaints and refers to family Dr., Surgeon refers it's \"normal healing\" see family Dr.; family Dr. refers surgeon says complaints \"normal healing\" and he sees 100's of patients and doesn't remember my original complaints.  I'm referring that although I'm in this healthcare circle, I need direction that I refer to the specialty that most meets my needs and stop the pass the buck.  Which I feel from your response it would be my GYN and suggest the CA-125 assay, pelvic ultrasound and CAT scan.\n\n",
    "posted_time": "Post  by Eskimopups » Sun May 11, 2003 11:25 am",
    "category": "Oncology",
    "sub_category": "Endometrial Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=723&sid=2539d4f4e28a9734797371a0eb6132d1#p723"
  }
]