[
  {
    "author": "donna p  Guest Posts: 2 Joined: Tue Jan 13, 2009 5:09 pm Gender: Female",
    "title": "AC Attenuation Correction Thickness on a PET/CT Scan Slide",
    "content": "General query, Please:  attenuation correction thickness refers to a length between slides on a ct scan or thickness of a tumor?  PET/CT results translated.  Thank you.\n\n",
    "posted_time": "Post  by donna p » Tue Jan 13, 2009 5:58 pm",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=68187&sid=12cfdcd35656625058d9263b35450f66#p68187"
  },
  {
    "author": "Faye Lang, RN, MSW  Nurse Posts: 468 Joined: Thu Oct 30, 2008 7:01 pm Gender: Female Location: California",
    "title": "Re: AC Attenuation Correction Thickness on a PET/CT Scan Slide",
    "content": "Hello Donna,  The term attenuation in a CT or PET scan refers to what happens when a beam of radiation passes through matter.  The beam decreases.  So, attenuation correction thickness is to allow for that decrease in establishing the thickness of whatever is being scanned.    I hope this helps you.  Faye, RN, MSW\n\n",
    "posted_time": "Post  by Faye Lang, RN, MSW » Fri Mar 20, 2009 2:20 pm",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=71472&sid=12cfdcd35656625058d9263b35450f66#p71472"
  },
  {
    "author": "dyagernpc  Nurse Posts: 2 Joined: Sat Nov 01, 2008 11:47 pm Gender: Female Location: IL",
    "title": "Re: AC Attenuation Correction Thickness on a PET/CT Scan Slide",
    "content": "In CT-based attenuation correction, CT data are acquired over the area of the body to be scanned with PET and are reconstructed into a series of transverse CT images. A multilinear transformation is applied to estimate the linear attenuation coefficient at 511 keV (µ511) from the CT numbers (Hounsfield units). After the transformation is applied, these data are smoothed to a degree comparable to the resolution of PET to minimize edge artifacts. The resulting transformed and smoothed images are then forward-projected to generate the CT-based attenuation correction file, which is applied to the emission data.  Basically, the attenuation correction is the final image based on the merged computed data from the PET and CT scans which highlights tumors or \"hot spots\".   http://radiology.rsnajnls.org/cgi/conte ... type=HWCIT\n\n",
    "posted_time": "Post  by dyagernpc » Sun Mar 22, 2009 11:51 am",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=71503&sid=12cfdcd35656625058d9263b35450f66#p71503"
  },
  {
    "author": "donna p  Guest Posts: 2 Joined: Tue Jan 13, 2009 5:09 pm Gender: Female",
    "title": "Re: AC Attenuation Correction Thickness on a PET/CT Scan Slide",
    "content": "Faye Lang, RN, MSW wrote:Hello Donna,  The term attenuation in a CT or PET scan refers to what happens when a beam of radiation passes through matter. The beam decreases. So, attenuation correction thickness is to allow for that decrease in establishing the thickness of whatever is being scanned.   I hope this helps you.  Faye, RN, MSW  i.e. a tumor, Faye, in a head and neck ct/pet, CTAC 3.75 THICK in slide annotation;  I am not being facetious.  Thanks for the response kindly, Donna P.\n\n",
    "posted_time": "Post  by donna p » Thu Jul 16, 2009 12:26 am",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=80937&sid=12cfdcd35656625058d9263b35450f66#p80937"
  },
  {
    "author": "Faye Lang, RN, MSW  Nurse Posts: 468 Joined: Thu Oct 30, 2008 7:01 pm Gender: Female Location: California",
    "title": "Re: AC Attenuation Correction Thickness on a PET/CT Scan Slide",
    "content": "Hi donna p,  Thank you for the update.  I'm sorry to hear that there is a tumor involved.  I wish you (or the person involved) successful treatment and recovery.  Best wishes,\n\n",
    "posted_time": "Post  by Faye Lang, RN, MSW » Tue Aug 10, 2010 9:14 pm",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=100377&sid=12cfdcd35656625058d9263b35450f66#p100377"
  },
  {
    "author": "Katybug44  Guest Posts: 1 Joined: Wed Jun 09, 2010 8:21 am Gender: Female",
    "title": "Recently diagnosed with Hashimoto's Thyroiditis",
    "content": "I was just recently diagnosed with Hashimoto's thyroiditis found by my Rheumatologist after doing multiple autoimmune/Antibodies test. I had been testing positive (Last 5 lab test ANA, 1:120, 1:140, 1:140) for Lupus. The joint pain left me almost unable to function and the swelling left me unable to close my hands. My PCP recommended a Rheumatologist.  She determined from the blood work that I did not have Lupus, Nor did I have Rheumatoid Arthritis. However, the Thyroid came back as an 1800 where the normal range is <60.. So my Rheumatologist sent me back to my PCP to schedule an appt. with a Endrocrinologist. I can not see him until next month and because my Joints we causing much pain my PCP prescribed a Prednisone pack 12days. She also gave me a script for a Thyroid ultrasound. My first question is.. With me being on Prednisone for another week. Should I wait to get the Ultrasound (Will it skew the results if there are nodules or goiter).. and the other question i have is I currently gain about 3-5 lbs a week and I have tried everything. Do you have any suggestions as to what works best for patients with Thyroid problems and should I be taking (or will it help to take) a thyroid supplement OTC?. Thanks for your Expertise.\n\n",
    "posted_time": "Post  by Katybug44 » Wed Jun 09, 2010 2:41 pm",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=93649&sid=12cfdcd35656625058d9263b35450f66#p93649"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: Recently diagnosed with Hashimoto's Thyroiditis",
    "content": "Hi, It appears that your doctor perhaps considered 'mixed connective tissue disease' (MCTD)  on the basis of the clinical features and serological findings. Prednisolone is used to control the symptoms of the MCTD. Thyroid functions may return to normal even without  thyroid replacement therapy. There are some reports which appear to show that Hashimoto's thyroiditis responds to systemic steroid preparations.  Corticosteroids are not routinely used in the management of Hashimoto's thyroiditis except in cases of Hashimoto's encephalopathy.  Total T4 and total T3 measurements are less reliable because several medications can interfere with their measurement(for example, glucocorticoids, estrogen and estrogen-containing oral contraceptives, tamoxifen citrate, methadone hydrochloride, nicotinic acid, fluouracil, mitotane, androgens, & anabolic steroids. Measurement of free Thyroid hormones(widely available) overcomes these errors.  I would strongly advise against taking thyroid supplements on your own.It is better to follow your doctor's advice and keep your next appointment. Best wishes!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Thu Jun 17, 2010 1:08 pm",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=94396&sid=12cfdcd35656625058d9263b35450f66#p94396"
  },
  {
    "author": "suomii  Guest Posts: 1 Joined: Tue Jun 08, 2010 1:21 am Gender: Female",
    "title": "hurthle cell recurrence",
    "content": "How often does a hurthle cell tumor recur? I was diagnosed and dissected (haha) on March of 2003, and since then practices have become a little less conservative when it comes to removing one versus both sides of the thyroid gland.  How will i know if it has recurred, or if it is present somewhere else in my body? I can palpate my neck, but I'm not sure what I'm feeling for. According to the chart I found, I was stage 2. Please let me know if I should see a specialist.  Thank you.\n\n",
    "posted_time": "Post  by suomii » Tue Jun 08, 2010 1:26 am",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=93500&sid=12cfdcd35656625058d9263b35450f66#p93500"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "Re: hurthle cell recurrence",
    "content": "Dear suomii, Thank you for your great question. Hurthle cell carcinoma does have a tendency to spread to the local lymph nodes. However, in your case it has been a very long time and the danger of recurrence is very small. Still it is prudent to see a specialist. Current recommendations would require an annual physical exam, TSH and Thyroglobin assessment. A periodic neck ultrasound may also help in your case. Depending on your initial staging you may or may not require periodic radioiodine scan assessment.   Could you tell me more about the recent difficulty in singing or vocalization that you mention. Was this investigated? It could be a significant finding.  As I mentioned earlier, it is likely that you will not require aggressive follow up and a physical, lab as well as an ultrasound may be all that is needed. Please keep us updated!\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Tue Jun 08, 2010 9:43 am",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=93514&sid=12cfdcd35656625058d9263b35450f66#p93514"
  },
  {
    "author": "catinahat  Guest Posts: 1 Joined: Tue Nov 10, 2009 8:52 pm Gender: Female",
    "title": "Fatal Phaeochromacytoma (little sister)- low IGF- link?",
    "content": "Hi, may I firstly thank all the Doctors and healthcare-givers, who give their time and share their knowledge to help us. From my heart, thank you. I wonder if I may seek your advice please? 2 years ago, my younger sister died very suddenly and unexpectedly, at the age of 34. Within less than 12 hours from being brought into A & E, she had a cardiac arrest, was resuscitated and put on life support, went into a coma, then began complete organ failure and her 2nd cardiac arrest. At which point she could not be resuscitated. Her autopsy found primary cause of death to be phaeochromacytoma (which the M.E estimated she'd had, undiagnosed, for approx 9 years.) On advisement from the M.E. that my family members should be tested too and   owing to some symptoms that seemed 'vague' that I was having, I was referred to an endocrinologist. The most troublesome symptoms were headaches, fainting spells, feeling faint without any obvious reason, disturbed vision; again, no obvious precursors, no rhyme or reason as to why my vision would become 'blotted out' or the faint attacks or headaches. However, as I have Narcolepsy, I put a lot of the symptoms down to this. A couple of years ago, I started to have a black, slightly sticky, discharge from both breasts. Again, the onset was apparently sudden and random... I was showering one morning and what I'd first mistaken as 'dust', was this strange discharge. I was sent for a mammogram, which didn't show any sign of breast cancer and although the doctor at the clinic couldn't say what probable cause was, didn't seem to be concerned and suggested it was possibly because of the cigarettes I smoke (approx 10 a day). Two years on and it hasn't stopped. although it is both breasts affected, the discharge is very black from the right side but slightly less darker from the left. I have no pain or any other discernible changes other than this. Whilst tests from endocrinology found my igf levels to be low and a 24 hour ambulatory ecg found  ' sinus tachycardia; my rate was between 153- 176 beats per minute with 'occassional extra beats'. However, I was told this was probably a result of stress or exercise and was a result seen in many of the population and nothing to worry about. A recent MRI didn't show a pituitary tumour and my endocrinologist is ready to sign me off as he's satisfied its unlikely I have phaeo. He can't explain the breast discharge but again, doesn't seem to think its anything to be concerned about. I just feel that I have no answers to my symptoms also, that to pursue it, appears to be 'making a fuss over nothing'. I know my sister had different symptoms over the years prior to her death (including a history of high blood pressure, headaches, disturbed vision and she was pretty much dismissed by her own GP as being 'neurotic' or 'depressed'. I can only imagine the sense of helplessness she must've felt and despair (despite never getting answers, she knew at heart there was something terribly wrong, as she made arrangements and paid for her own funeral, in full, over the 2 years prior to her death... yet without any medical diagnosis or answers. I can't help but feel there is something not right with me and perhaps the doctors at endocrinology are missing something. Perhaps I am being paranoid, yet I don't feel the anomolies within my test results have been explained. Or rather, why they aren't of any significance when all other medical information appears to say to the contrary. My own GP is brilliant; but I don't feel reassured at this juncture by my endocrinologist. I don't want to be a nuisance, or a ' hypochondriac', but neither do I wish my family to lose another sister/daughter/mother as a result of apathy or oversight. Any advice would be appreciated. I am open to the possibility that perhaps I am being a bit 'paranoid' because of my sisters death. Should i accept that these symptoms are something I'll have to live with and just drop it with seeking answers and accept I probably am just being paranoid? Feel very confused and at a loss what to do. And no energy to fight. Thanks in advance for taking time to read this/listen; also for any opinion, input/advice you may have. Apologies for being long-winded. Kind Regards, Cat\n\n",
    "posted_time": "Post  by catinahat » Tue Nov 10, 2009 10:16 pm",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=86544&sid=12cfdcd35656625058d9263b35450f66#p86544"
  },
  {
    "author": "emilybronte  Guest Posts: 1 Joined: Wed Oct 14, 2009 1:34 pm Gender: Female",
    "title": "Post-Thyroid Removal: Widely Fluctuating TSH",
    "content": "Hello,   I hope someone can offer some insight into any possible reasons for my problems. My endocrinologist retired and there are no others here that take my insurance (it used to be excellent but the past few years have been more difficult, and I am now unemployed). My family doctor has been very helpful, as has been my oncologist, but my situation is confusing to me. I see my family doctor again on Monday.  In 1988, as a juvenile, I had very aggressive thyroid cancer (papillary and follicular, mixed) that had infiltrated a lot of my neck. I had a total thyroidectomy and 3 of my 4 parathyroids were removed in a radical neck dissection. I also had radioactive iodine. In 1989, I had a second radical neck dissection because all of the remaining lymph nodes in my neck were badly enlarged. This was benign. I've had a few other surgeries to remove lymph nodes, which are \"fibrocystic\" but benign.   I was monitored very carefully with full body CT scans and ultrasounds, on a replacement dose of .125 mcg of Synthroid per day, which left me with a high TSH for cancer suppression. My T4 and T3 have basically been normal. These numbers remained 100% stable from 1988 to 2006. I'll return to this, since this is my primary concern now.  But just to be thorough:  I've had a few problems with my health here and there, most significantly, a bad case of polymyoclonus that doesn't seem to be related to my calcium levels. It's managed with alprazolam and a sleeping medication. It seems to be under control.  I also had my gallbladder removed for gallstones discovered while I was pregnant. I've had horrible pain and diarrhea since then after eating and think I have post-gallbladder syndrome, which many other people who have had their gallbladder out that I've spoken to also have. I manage this by avoiding eating fat, although I have very bad cramping pain quite frequently.  I occasionally have atrial fibrillation and have seen a cardiologist. It fluctuates and I have a beta blocker for when it recurs.   Returning to my concern that brings me to this board today:  Since 2006, my thyroid levels (mainly my TSH, but sometimes also my T4) have begun swinging widely without any change in my medication. TSH levels have measured, over the course of weeks, from nearly zero to about 70. Generally they're on the high side these days, which is a shift from the previous situation of being clinically hyperthyroid.   I have absolutely NO thyroid left. Because the shifts were so wide, at first they thought it was a lab error. I began having tests every 4 weeks and my doctor started also tracking my T4. They're both all over the place (although they have yet to actually contradict each other, something that happened slightly once when I was pregnant).   I paid to see an endocrinologist out of pocket about a year ago and had a PET/CT scan, which was normal, but cost 3K. I can't afford that.  The endocrinologist was confused by my test results, especially the TSH levels in the 60's and 70's. She thought perhaps, since I have bouts of diarrhea (maybe from the gallbladder removal) that it was due to bad absorption of the levothyroxine pills. However, I haven't had any diarrhea since then, since I took her suggestion seriously and went on a lower-fat diet.  My most recent four tests, since early summer, showed my TSH at (roughly, from memory) 17, 7, 0, and now 3.6 (the doctor just called and wanted to see me again). My T4 is 1.something.   Also, he tested my vitamin D level and said it was really low. I don't know why he tested it, to be honest.   He also tested my cholesterol since it's been high in the past. It was 248. I am a 102 lb. vegetarian woman in my early 30's who has good nutrition. I've never been able to lower it, and have no idea if it's connected, but thought it worth mentioning.   That's it.   I don't know why these levels are all over the place but I'm having symptoms from them and can tell when they start really swinging. I get hot flashes, sweats, chills, my weight has been funny recently where I'm gaining and then losing 10 lbs. fairly quickly, and I've had terrible panic attacks at times with racing heart, which is unusual for me. I've also had times where I have so little energy that I can barely function for weeks and start sleeping 12 hours a night.   What might cause this sort of thing?  Have you ever heard of anything like this, after a thyroid has been removed?   I'm considered \"in remission\" for cancer.  Why would my thyroid levels start swinging around on a full-replacement dose of synthroid?   I take my medication religiously every single night before bed with a half glass of water. Same as always.  Haven't changed brands.  The only online research I can find for these kind of thyroid swings is with Hashimoto's Thyroiditis -- but I don't have a thyroid to inflame! However, I have no idea if you can get Hashimoto's AFTER a thyroidectomy? And have it influence the levels? I don't have a pituitary tumor, I'd guess, because my T4 is also showing low thyroid levels. It does seem like I'm not absorbing the pill properly, but maybe it's something else?  Thank you for absolutely any light you can shed on this situation. Sincerely.\n\n",
    "posted_time": "Post  by emilybronte » Wed Oct 14, 2009 2:09 pm",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=83805&sid=12cfdcd35656625058d9263b35450f66#p83805"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: Post-Thyroid Removal: Widely Fluctuating TSH",
    "content": "Hi, Your problem is quite perplexing. I understand that you had undergone a sub-total parathyroidectomy as well in 1988. How are your calcium levels? You are not on calcium supplements i suppose.Calcium supplements may adversely affect absorbtion of thyroxin. This may be the reason why your doctor requested vitamin D levels.  Estrogens increase serum thyroxine-binding globulin levels, thereby decreasing the unbound fractions of T3 and T4. Administration of estrogen-containing preparations (such as oral contraceptives) to hypothyroid patients may cause an increase in their levothyroxine requirements.Are you by chance using oral contraceptives?  Your problem is quite complex and needs periodical clinical examination and laboratory studies.  Hope this information is useful to you.Good luck!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Sun Nov 01, 2009 8:58 am",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=85487&sid=12cfdcd35656625058d9263b35450f66#p85487"
  },
  {
    "author": "Paula Halvorson  Guest Posts: 1 Joined: Fri Apr 08, 2005 10:11 am Location: Maryland",
    "title": "chronically low tsh",
    "content": "I was diagnosed with thyroid cancer (papillary) and had most of my thyroid removed followed by oblation with radioactive iodine.  Since that time, my tsh has always been low, lower than the Dr's want.  I am now down to .1 of synthroid and no cytomel and my tsh levels are still low.  I am tired and sluggish and battling depression and  concerned about further reducing my thyroid medication.  At what point might a doctor check to see if my tsh is functioning correctly?\n\n",
    "posted_time": "Post  by Paula Halvorson » Fri Apr 08, 2005 10:16 am",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=12048&sid=12cfdcd35656625058d9263b35450f66#p12048"
  },
  {
    "author": "Debr33  Guest Posts: 2 Joined: Wed Apr 20, 2005 10:32 pm Location: FL",
    "title": "[no title]",
    "content": "I am not a doctor. I am a papillary thyroid cancer survivor. Diagnosed when I was 18, in 1990.   My case may be different then yours as I have no thyroid gland left. All of it was removed. I know in my case, my doctor wants my tsh low. She gets supset with me (i miss my synthroid) when my tsh is up. From way I understand things- tsh will feed the cancer, help it grow so the lower the tsh the better to prevent more growth. My synthroid isnt just used a thyroid replacement its also being used to slow the cancers growth. Thyroid medication takes time to build in your system. So you will find blood testings spaced out-maybe 2 weeks + until they find your level.\n\n",
    "posted_time": "Post  by Debr33 » Wed Apr 20, 2005 10:49 pm",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=12654&sid=12cfdcd35656625058d9263b35450f66#p12654"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: chronically low tsh",
    "content": "HI Paula Halvorson, Some of the thyroid cancers are TSH dependent- ie:TSH stimulates growth & function of these tumors.Papillarycarcinoma is one of them. After a total or near total thyroidectomy +/_ radioactive iodine therapy, to prevent further growth of the tumor,Thyroxin is administered in suppressive doses(suppressive vs supplementory dose) to suppress the TSH. This should not cause you any undue harm.Best wishes!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Tue Oct 13, 2009 2:49 am",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=83673&sid=12cfdcd35656625058d9263b35450f66#p83673"
  },
  {
    "author": "janjus76  Guest Posts: 1 Joined: Thu Apr 16, 2009 7:13 am Gender: Female",
    "title": "weight loss after thyroid cancer",
    "content": "I am on synthroid due to thyroid removal 5 years ago.  My thyroid levels are in normal range.  I go to the gym 2 x a week - I eat sensible but yet I cant lose any weight.  Is there a save supplement to help me / Does Jenny Craig/Nutrisystem work?\n\n",
    "posted_time": "Post  by janjus76 » Thu Apr 16, 2009 7:19 am",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=74431&sid=12cfdcd35656625058d9263b35450f66#p74431"
  },
  {
    "author": "tboisey  Guest Posts: 1 Joined: Tue Mar 24, 2009 12:42 pm Gender: Female",
    "title": "adrenal nodule",
    "content": "I had a mri of my kidney and renal arteries and they found a 10mm nodule on my left adrenal gland .the report says that on the in and out phase sequence the nodule is intermediate signal intensity on in phase and incresaed signal intensity on the out of phase .therefore it does not follow the significance of a benign adeoma.so does this mean they think it can be malignent ?   also a year ago i had a 5mm complex cyst in my left kidney that they coouldn t promise for sure wasn t cancer but because of it s location could nt biopsy,so they decided to just watch it,well not it is 10mm and there is another 5mm cyst in the left kidney.i am concerned that maybe it was cancer and now has spread to my adrenal gland,do you think that is possible.i have to get a ct scan this week .   any input would be greatly appresiated thanks tracy\n\n",
    "posted_time": "Post  by tboisey » Tue Mar 24, 2009 12:45 pm",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=71689&sid=12cfdcd35656625058d9263b35450f66#p71689"
  },
  {
    "author": "bmac423  Guest Posts: 1 Joined: Wed Jan 28, 2009 1:54 pm Gender: Male",
    "title": "Elevated metanephrines, possible adrenal tumor?",
    "content": "First off, I'm a 23 year old male in good shape (6'1\" 173) and have always been relatively healthy until the last few years.  For the past couple of year I have suffered from some very strange symptoms.  I have constant varying amounts of cold sweats, very noticeable in the armpits, but also hands and feet.  When the sweats are bad, I have times where I seemingly can not retain liquids, when I drink I immediately have to urinate.  Along with this comes a dry mouth (sounds like I am slurring words), debilitating fatigue and a fuzzy head.  About the same time this started happening, I noticed that I would have facial blushing at the drop of a hat.  Things that would never bother me before would make me beet red and sweaty.  Social interactions, a big meal or just extreme focus (like working on a test or project) will do the trick.  I'm in college and if a teacher asks me a difficult question I often will just break out in a sweat.  It's very embarrassing.  This would have never happened to me before.  I also have feelings of anxiety, but I don't know if this is because of the possibility of facial blushing and gas or something physiological.  I took accutane and I've read that facial blushing is a possible side-effect, but I'm not sure.  My blood sugar levels have been tested multiple times and they always come up normal.  I do have a history of bowel problems (gas, bloating, constipation, occasional diarrhea) and have been diagnosed with systemic mastocytosis of the colon.  The bowel problems started a few months before the sweats and accompanying symptoms.  Recently, I was referred to an endocrinologist by my gastrointerologist.  I did a 24 hour urine test and had several samples of blood taken.  My results were the following:  Early Morning Gastrin level was 19 Thyroid Stimulating immunoglobulin was 85 ANA was negative Thyroglobulin and thyroid peroxidase antibodies were absent TSH was 2.8  Vasoactive intestinal polypeptide was 39.7 Vitamin b12 was 326  All of these are said to be normal, however these are the abnormal results:  Metanephrine was 270 Normetanephrine was 495 Total Metanephrine 765  Cortisol was 25.6  24 hour urine for 5 HIAA was 12  I've read that the 5 HIAA results can be affected by mastocytosis.  I've also read that the elevated metanephrine may be a sign of an adrenal tumor, such as pheochromocytoma.  I really think there may be something going on with my endocrine system, based on my symptoms and these results.  I also have a bit of vitiligo on the left side of my scrotum which points to a possible autoimmune response to something in the endocrine system.    What do guys think?  I fully appreciate any input.  Thanks in advance.\n\n",
    "posted_time": "Post  by bmac423 » Wed Jan 28, 2009 2:23 pm",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=70091&sid=12cfdcd35656625058d9263b35450f66#p70091"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Elevated metanephrines, possible adrenal tumor?",
    "content": "Hello --  I think you've done your research and come to a pretty sound understanding of the possibiities. While there's no certainty that there's anything malignant going on, that should be eliminated as well. Your endocrine system is certainly out of balance, but since the cortisol is elevated the root problem may not be adrenal but pituitary instead. While some  of what you describe does sound  like  pheochromocytoma, the elevated cortisol  strongly suggests the underlying cause if further upstream. In any case you need to have a thorough endocrinological evaluation to determine just what is going on, and  that should have been set up once the abnormal test results were returned, since they align well with your symptoms.   I hope you will arrange for a consult with an endocrinologist and get this clarifies.  While  mastocytosis is unlikely, it is one possibility among many that needs to be ruled out.   Best of luck to you. Please follow up with us as needed.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Mon Mar 02, 2009 9:31 pm",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=71134&sid=12cfdcd35656625058d9263b35450f66#p71134"
  },
  {
    "author": "map820  Guest Posts: 1 Joined: Wed Jan 14, 2009 5:57 pm Gender: Female",
    "title": "Adrenal Tumor / Cushings?",
    "content": "Hello. I had a recent blood work up as my cortisol levels were elevated (mildly) and I have not been feeling good. Results showed that my ACTH was normal - having Dex test to see if everything is still normal) but my adrogan levels are high, testosterone, DHEA-S and androstenadiones all high. I also had a 24 hour urine test. Metanephrines and normetinephrines are normal as well as dopamine. Epinephrine however came back incomplete for some reason. Question is, if all others are normal does this seem like it can still potentially be a phaeochromocytoma or adrenal cancer. I am having the epinephrine retested but I will have to have to wait a while and I am nervous. Any other idea what this can be? I know being nervous is a vicious cycle with adrenal related stuff. Could it be PCOS even though I do not have ovarian cysts (confirmed with ultrasound?) Thank you for your input.\n\n",
    "posted_time": "Post  by map820 » Wed Jan 14, 2009 6:15 pm",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=68337&sid=12cfdcd35656625058d9263b35450f66#p68337"
  },
  {
    "author": "KAnnD5  Guest Posts: 1 Joined: Thu Aug 28, 2008 9:02 pm Gender: Female",
    "title": "Total Thyroidectomy - Overkill?",
    "content": "I was initially diagnosed with a 3.1 X 1.9 X 2.2 cm \"cold nodule\" on my right thyroid lobe.  I had a biopsy and the results came back benign.  I chose to have the nodule removed.  While in surgery to remove the large nodule in question, my doctor said that he noticed a \"speck\" (his words) which was less than 3 mm on the isthmus.  Therefore, he decided to remove the isthmus along with the right lobe.  The frozen section that came back from the surgery confirmed that the large nodule was benign, but the \"speck\" contained micropapillary carcinoma cells.  My doctor assured me that I would just need to take hormone therapy from here on out and that the \"speck\" was cut out.  I have decided to be \"super aggressive\" and have the rest of my thyroid removed AND receive radioactive iodine.  My doctor says this is \"overkill.\"   1.  Is this \"overkill\"....even if it offers me peace of mind? 2.  Am I considered \"cancer free\" when he removed the small cancer from the isthmus? 3.  I'm scared.  I have three small children (all under five yrs.).  Does this impact my life expectancy?  Do I have a reasonable expectation that I could live to see my granchildren?   Thanks, Kim\n\n",
    "posted_time": "Post  by KAnnD5 » Thu Aug 28, 2008 9:21 pm",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=59480&sid=12cfdcd35656625058d9263b35450f66#p59480"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "Re: Total Thyroidectomy - Overkill?",
    "content": "Hello,  Many studies showed that subtotal thyroidectomy is associated with double the recurrence rate and a lower survival rate than total thyroidectomy for papillary and follicular cancers. However, a large recent study has proved equal survival for those undergo lobectomy or total thyroidectomy whether they are categorized as low or high risk papillary cancer thyroid patients.  Prominent thyroid cancer specialists advocate subtotal thyroidectomy rather than total excision and consider it sufficient for the majority of patients who fulfill the low risk criteria.  Indeed the National Comprehensive cancer network NCCN recommend total lobectomy for patients with papillary microcarcinomas and consider this an adequate treatment for patients who have not been exposed to radiation, have a unifocal tumor smaller than 1 cm, without vascular invasion or small (< 1 cm) papillary carcinomas found incidentally on the final pathology sections in the course of thyroid surgery for benign disease; no contralateral lesion, and no suspicious lymph node. Positive isthmus margins to the contrary is considered a risk factor and total thyroidectomy is recommended.  Postoperative radioactive iodine therapy is performed when the patient has a tumor with high risk features for recurrence after total thyroidectomy.   The most feared complications of thyroidectomy are hypoparathyroidism and recurrent laryngeal nerve injury with much higher frequency after total thyroidectomy. Radioactive iodine therapy at conventional doses rarely cause serious long term effects on other parts of the body (salivary glands affection have been reported).  Total thyroidectomy and radioactive Iodine are associated with complications that are better avoided when their benefit under weigh their risks.  If the pathology report proved that the nodule has been removed with negative margin, not of high risk variants, unifocal, less than 1 cm and your physician has seen no other suspicious focal lesions in the other lobe, lobectomy and isthmectomy would be enough with close follow up.  I would advise you to follow up with your doctor and to discuss with him all the benefits and risks from being on FU or from more radical approaches to be more reassured and convinced with your final decision.  Hope you find this information useful. Best regards.\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Wed Oct 15, 2008 11:51 am",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=62208&sid=12cfdcd35656625058d9263b35450f66#p62208"
  },
  {
    "author": "christie321  Guest Posts: 10 Joined: Thu Oct 27, 2005 6:45 pm Location: IL",
    "title": "Recurrent thyroid cancer ultrasound versus whole body scan?",
    "content": "I am 20 years post near total thyroidectomy/RAI ablation for papillary thyroid cancer. I just found out that my last thyroglobulin level (with TSH stimulated) was 23.0. I am now scheduled for a neck ultrasound. After doing a lot of research, I've pretty much figured out that a level that high has to be indicative of a recurrence.  I am wondering why the doctor is bothering with the ultrasound.  Wouldn't it be more prudent to start with a whole body scan so that way he can see all the possible places the cancer might be?  Even if the neck ultrasound is negative, I still feel I should ask for the whole body scan with a Tg level that high.  Do you agree this would be the correct action for me to take?  Thanks in advance!\n\n",
    "posted_time": "Post  by christie321 » Thu Feb 07, 2008 4:54 pm",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=53605&sid=12cfdcd35656625058d9263b35450f66#p53605"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "Re: Recurrent thyroid cancer",
    "content": "Hello,  I hope all is well. It has to do with the degree of accuracy and the advantages of each techniqe. Ultrasonography of the neck is more sensitive than a whole body scan at detecting neck recurrence. On the other hand, the scan would be able to detect extrathyroid recurences and distant metastases, something that ultrasonography cannot do.  Please keep us updated about your condition.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Wed Sep 17, 2008 10:37 am",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=60784&sid=12cfdcd35656625058d9263b35450f66#p60784"
  },
  {
    "author": "me720  Guest Posts: 1 Joined: Mon Feb 25, 2008 3:18 pm Gender: Female",
    "title": "Body odor",
    "content": "Hello,    I have been dealing with body odor since I was about 8, I'm now 21. I think this is hormone related but I cannot prove it because I don't know what kind of test to take. I think it is because of I went through puberty at such a young age. I know it isn't a  matter of personal hygiene because I spend alot of money trying to slove this problem. What kind of hormone problem can cause this and how could I get it tested and  treated? I went to the doctor for this before and took a thyroid test and the results were okay. I don't know if this is correct because I ate before the test. I considering retaking  the throid test and also maybe adrenal or pituitary.  Another doctor told me to take a diabetes test but I do not think I have this condition because I do not have these symptoms and do not have the sweet scent that diabetes patients have. The odor, I noticed comes mainly from my underarms and underneath my breasts, which is mainly where I sweat from. I sweat through these areas even when I am l cold. CAn you give me the right steps to take to solve this problem?\n\n",
    "posted_time": "Post  by me720 » Mon Feb 25, 2008 3:37 pm",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=54355&sid=12cfdcd35656625058d9263b35450f66#p54355"
  },
  {
    "author": "Debbie Miller, RN  Nurse Posts: 4746 Joined: Mon Apr 16, 2007 2:41 pm Gender: Female Location: USA",
    "title": "Re: Body odor",
    "content": "Hello, I would recommend a dermatologist to begin with.  There are some conditions aside from heredity that can cause this and there are some treatments a doctor can try and have varying success rates, including prescription antiperspirants, iontophoresis, botox, anticholinergic drugs, and rarely surgery to remove some sweat glands.    Of course it is important to rule out underlying problems but the thyroid testing should be adequate because fasting is not usually required.  If your dermatologist suspects another endocrine concern, he/she could request any needed labs.  Good luck.\n\n",
    "posted_time": "Post  by Debbie Miller, RN » Fri Mar 07, 2008 12:44 pm",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=55332&sid=12cfdcd35656625058d9263b35450f66#p55332"
  },
  {
    "author": "averroes  Guest Posts: 1 Joined: Sun Nov 11, 2007 8:54 am",
    "title": "Strange pain in my throat related to thyroid",
    "content": "Hello,  I am 21 year-old male. One or two years ago, I had a strange pain in my throat, somewhere I think where the thyroid lies, I'm not a doctor but that's my guess from the picture of thyroid location.  Since then, this pain comes every several weeks, sometimes months and then fades away. It is like a burning pain, a strange sort of pain that sometimes comes strong and I feel a flow of extra Saliva in my mouth.  I am very worried in this regard, I don't have any particular symptom. I am slim in weight since childhood (currently 68 Kg with height of 177 cm).  Please give me all the possible diagenesis.  Thanks a lot.\n\n",
    "posted_time": "Post  by averroes » Sun Nov 11, 2007 9:19 am",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50062&sid=12cfdcd35656625058d9263b35450f66#p50062"
  },
  {
    "author": "Sandy Tracy RN  Nurse Posts: 60 Joined: Wed Nov 07, 2007 6:57 pm",
    "title": "Re: Strange pain",
    "content": "hi averroes,  The symptoms you describe may be caused by several factors.  Have you had your thyroid levels checked?  Sometimes people with hypothyroidism (underactive thyroid) can have transient pain in the thyroid area.  Do you have any problems with reflux?  This pain may be caused by Gastroesophogeal reflux disease.  Do you suffer from heartburn or indigestion?    These are a few of the possible causes, if symptoms persist I encourage you to see your doctor for a complete evaluation.  Thanks for writing in  Sandy Tracy RN\n\n",
    "posted_time": "Post  by Sandy Tracy RN » Mon Jan 21, 2008 11:23 pm",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=53316&sid=12cfdcd35656625058d9263b35450f66#p53316"
  },
  {
    "author": "neala  Guest Posts: 7 Joined: Tue Jul 10, 2007 6:26 am",
    "title": "Calcified thyroid nodule /w enlarged lymph nodes",
    "content": "I am a 28 year old female and have been having many health issues. The first health issue started when I was 17 years old with many episodes of renal colic. The stones are calcium oxalate and nothing my urologist asked me to do helped. Recently I have been diagnosed with Celiac Disease and have been gluten-free for almost a year now. In the past year and a half I have been having chest pain, rapid heart rate, fatigue and high blood pressure. The blood pressure and heart rate are not as severe anymore, just borderline now. The chest pain is becoming more and more prevelant. For the past year and a half I have had enlarged cervical lymph nodes that increase then decrease in size within weeks. I am being sent to an ENT in Jan. I just had an xray of my cervical spine as I have been having back/neck pain for over 10 years. The xray showed a calcified thyroid nodule. Can this be linked to the enlarged lymph nodes and the symptoms I have been having for so long?\n\n",
    "posted_time": "Post  by neala » Mon Nov 19, 2007 8:36 am",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50602&sid=12cfdcd35656625058d9263b35450f66#p50602"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "Re: Calcified thyroid nodule /w enlarged lymph nodes",
    "content": "Hello,  Calcification of a solitary thyroid nodule in a young patient should call for further investigations. Whether or not this is related to the cervical lymph node enlargement depends on many factors. Rather than research a possible link between the two findings I think you should invistigate the calcified nodule in its own right.  Please keep this thread updated.  Best wishes and Merry Christmas!\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Mon Dec 24, 2007 3:28 pm",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=51961&sid=12cfdcd35656625058d9263b35450f66#p51961"
  },
  {
    "author": "celeste  Guest Posts: 6 Joined: Tue May 29, 2007 3:51 pm",
    "title": "Pituitary?",
    "content": "I am a 43 yr. old female:  Hashi. Thyroid disease 11 yrs. Uterine Fibroid Embolization: last month. Being treated for reactivated Epstein Barr. Increased thyroid 45% last year as my tests indicated the need. 120 mg. Treated for Dry Eye (and severe eye headache) with Restasis for last 7months, never had any issues with eyes before this time (do not wear contacts). Sleep study: No stage 3 or 4 sleep. Take lunesta. Tilt test: Failed[/list][/list] Test results:  IGF-1: 289 H Immunoglobulin M 432 H (48-271) In May it was 345. FSH: 1.2 L  ACTH, 10 (Don't have lastest Thyroid panel, will have those next week.)  Are these all pointing to a Pituitary issue? Am trying to get into see the endocrin. but would like some feedback.  Thank you for any input.\n\n",
    "posted_time": "Post  by celeste » Fri Oct 05, 2007 12:22 pm",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=48678&sid=12cfdcd35656625058d9263b35450f66#p48678"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Celeste,  Based on these tests I don't think this will turn out to be a pituitary problem.  I say this primarily because your IGF-1 level is elevated.  IGF-1 is a hormone released in response to growth hormone made by the pituitary.  If your pituitary was underactive, one would expect your IGF-1 levels to be low.  The elevated IgM level may correspond to having a recent infection.  Seeing an endocrinologist is a good idea to be able to sort through all this information better.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sat Oct 06, 2007 1:30 am",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=48698&sid=12cfdcd35656625058d9263b35450f66#p48698"
  },
  {
    "author": "celeste  Guest Posts: 6 Joined: Tue May 29, 2007 3:51 pm",
    "title": "Pituitary?",
    "content": "Thanks Dr. Lowe:  My GP mentioned possible hypothalamic insufficiency.  Will let you know outcome.\n\n",
    "posted_time": "Post  by celeste » Sat Oct 06, 2007 10:21 am",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=48714&sid=12cfdcd35656625058d9263b35450f66#p48714"
  },
  {
    "author": "Mom28  Guest Posts: 7 Joined: Sun Apr 29, 2007 11:23 pm",
    "title": "tumors around thyroid",
    "content": "My mom is a 65 yr old woman of good health.  She is currently taking no medications and has a family history of underactive thyroids.  She recently noticed a swelled area on her neck and had a nuclear test and from what she told me, it said her thyroid was working as it should be.  She also had an ultrasound of her neck and found 3 hard masses surrounding her thyroid.  She told me the doc said they were large, but I don't now the exact size.  Her doctor is sending her to a specialist to get a biopsy.  If it turns out to be cancerous, would that be considered thyroid cancer?  Thank you so much for your time!\n\n",
    "posted_time": "Post  by Mom28 » Thu Jun 28, 2007 3:13 pm",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=43839&sid=12cfdcd35656625058d9263b35450f66#p43839"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Hello,  A variety of techniques are used to diagnose thyroid cancer. These include: thyroid isotope scans, ultrasonography and fine needle aspiration cytology (FNAC) or biopsy.  Thyroid isotope (nuclear) scans cannot differentiate absolutely a benign from a malignant nodule but can tell us about the probability of malignancy.  “Hot” thyroid nodules, which are able to concentrate radioiodine, represent functioning nodules and are less likely to be malignant. “Cold” nodules are nonfunctioning lesions that do not concentrate the isotope. Most thyroid cancers occur in cold nodules; however, only 10% of cold nodules are cancers.  Ultrasound imaging can detect nodules as small as 2 mm and is useful for determining the number of thyroid nodules and measuring their size.  A nodule in a gland with multiple other nodules of similar size is unlikely to be malignant. However, a dominant nodule in a multinodular gland carries a risk of malignancy similar to that of a true solitary nodule.  Ultrasonography can be used to determine whether a nodule is cystic or solid. Although most solid nodules are benign, thyroid carcinomas usually present as solid nodules. A cystic nodule or a “mixed” (cystic-solid) lesion is less likely to represent a carcinoma and more likely to be a degenerated colloid nodule.  Certain characteristics in a hypoechoic nodule increase the chance for malignancy. These include microcalcifications, central blood flow, or irregular border.   FNAC should be the initial diagnostic test for the evaluation of thyroid nodules. The accuracy of cytologic diagnosis from FNAC is 70%-80%.  From what you have said it appears unlikely that your mom has thyroid cancer. The fact that she has neck tumors around the thyroid could be due to enlarged neck nodes. Depending on the ultrasonographic findings these tumors may or not be due to something serious. It is of course difficult for me to assert but if they were enlarged lymph nodes they can be due to many things, most of which are benign.  A pathological examination, as her doctor ordered, will determine the real significance of these tumors.  Please keep us updated on your mom's condition and don't hesitate to ask more questions regarding her condition.  Best regards,\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Tue Jul 03, 2007 9:21 am",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=43893&sid=12cfdcd35656625058d9263b35450f66#p43893"
  },
  {
    "author": "Mom28  Guest Posts: 7 Joined: Sun Apr 29, 2007 11:23 pm",
    "title": "[no title]",
    "content": "Thank you so much for your reply!  I have the actual results from my moms tests  Thyroid imaging and multiple uptake exam  The thyroid gland is overall asymmetrically enlarged w/ the right lobe being larger than the left.  Tracer distribution is significantly irregular throughout both lobes.  There is a suggestion of a focal absence of tracer in the mid-lateral portion of the left lobe.  Radioactive iodine uptake values are within the very lower euthyroid range.  The image findings suggest the possibility for either multinodular/multicystic degeneration or significant thyroiditis.  Ultrasound   1. A complex mixed cystic and solid nodule is demonstrated in the mid right thyroid lobe.  There is a hypoechoic partially cystic complex lobulated and well defined 2.6cm x 1.6cm x 2.6cm diameter nodule in the mid potion of the right thyroid lobe.  The right parenchyma is otherwise slightly heterogenous.  2.  There is a solid nodule within the anterior aspect of the mid left thyroid lobe.  There is a smaller cystic nodule just dorsal or posterior to the solid nodule in the mid left thyroid lobe.  There is a solid sharply circumscribed nodule in the anterior aspect of the mid thyroid lobe which measures 10mm x 8mm x 10mm in diameter.  Just dorsal to this solid nodule a cystic nodule is demonstrated which measures 4mm in diameter.  If you could help me make sense of this, I would really appreciate it!    Thank you soooo much!\n\n",
    "posted_time": "Post  by Mom28 » Tue Jul 03, 2007 10:04 am",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=43895&sid=12cfdcd35656625058d9263b35450f66#p43895"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Hello,  Sorry for the delay. Actually your doctor is right to request a biopsy / FNA from the thyroid. Several characteristics, while not conclusive, warrant further investigation just to be sure. Of particular importance is the complex mixed cystic and solid hypoechoic nodule. This COULD be a thyroid cancer.  Please keep us updated as to the results of the biopsy.  Good luck!\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Fri Jul 06, 2007 11:48 am",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=44136&sid=12cfdcd35656625058d9263b35450f66#p44136"
  },
  {
    "author": "Mom28  Guest Posts: 7 Joined: Sun Apr 29, 2007 11:23 pm",
    "title": "[no title]",
    "content": "Thank you so very much for your response.  The mass on her neck is visably larger and I am really worried.    I will keep you updated.\n\n",
    "posted_time": "Post  by Mom28 » Fri Jul 06, 2007 2:53 pm",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=44147&sid=12cfdcd35656625058d9263b35450f66#p44147"
  },
  {
    "author": "Mom28  Guest Posts: 7 Joined: Sun Apr 29, 2007 11:23 pm",
    "title": "[no title]",
    "content": "A complex mixed cystic and solid nodule is demonstrated in the mid right thyroid lobe. There is a hypoechoic partially cystic complex lobulated and well defined 2. 6cm x 1. 6cm x 2. 6cm diameter nodule in the mid potion of the right thyroid lobe. The right parenchyma is otherwise slightly heterogenous.    Could this be a characteristic of anaplastic thyroid cancer?\n\n",
    "posted_time": "Post  by Mom28 » Mon Jul 09, 2007 12:27 pm",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=44427&sid=12cfdcd35656625058d9263b35450f66#p44427"
  },
  {
    "author": "Shells  Guest Posts: 5 Joined: Wed May 11, 2005 8:15 pm Location: Cali",
    "title": "Small inhomegeneous thyroid gland",
    "content": "Does Synthyroid cause your thyroid gland to shrink?\n\n",
    "posted_time": "Post  by Shells » Thu Jun 16, 2005 3:31 pm",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=15243&sid=12cfdcd35656625058d9263b35450f66#p15243"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Dear Shells,  Synthroid, is a synthetic thyroid hormone.  Synthetic thyroid hormones are given in many medical conditions in which deficiency of the thyroid hormone is the main problem.  Synthetic thyroid hormones are given in any of the following conditions: - to replace the decreased blood level of thyroid hormones  - to decrease the size of enlarged thyroid glands (goiter) and  -as part of the medical treatment in some patients with thyroid cancer.   Best regards,\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Fri Jul 14, 2006 4:54 pm",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=33415&sid=12cfdcd35656625058d9263b35450f66#p33415"
  },
  {
    "author": "blueribbon  Guest Posts: 2 Joined: Tue Nov 29, 2005 10:56 am Location: georgia",
    "title": "supraclavicular lymphadenopathy hx thyroid cancer",
    "content": "I am 32, have history of recurrent metastatic papillary thyroid carcinoma, urothelial(bladder) papilloma, colon polyps (tubular adenoma).  A few months ago, had neck pain and noticed lump on left side just above collarbone.  Still feels like a pulling, tight sensation in neck when I look to the right. Now there is more than one lump, pain is intermittent, whole area above and below collarbone appears slightly swollen, have sore spot below collarbone and another lump.  Pain radiates thru to back.  Recently had thyroid workup and all appeared to be okay.  Physician can feel lumps as well but says that since they are not very large he is not concerned.  Because of my history I am just a little bit paranoid about waiting and watching.  Maybe it's just scar tissue from previous surgeries?  (throid surgery in 7/91 and 12/91: node biopsy 92 benign:  I131 ablation therapy in 96 recurrence in neck, mets. to left femoral head) scan 2 yrs ago was negative.  Any thoughts or advice would be appreciated.  Thanks in advance.\n\n",
    "posted_time": "Post  by blueribbon » Tue Nov 29, 2005 11:19 am",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=25839&sid=12cfdcd35656625058d9263b35450f66#p25839"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Dear blueribbon,  According to your description, you probably have left supraclavicular and or lower cervical Lymph node (LN) enlargements.   They are also painful so, an inflammatory element is present. If these swellings did not subside in size or if they are increasing in size or number, definitely more investigation should be done.  The thyroid scan and investigations checking for thyroid recurrence or metastases were negative.  But this does not exclude further investigation for these enlarged LNS.  A conventional US study with or without Doppler can help in confirmation of their nature. US guided FNAC can also be done for the pathological diagnosis.  My advice is to follow up with your doctor and update him with any change in the size or the number of these swellings or any new symptoms.  Best regards,\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Fri Jul 14, 2006 4:29 pm",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=33414&sid=12cfdcd35656625058d9263b35450f66#p33414"
  },
  {
    "author": "gianna05  Guest Posts: 1 Joined: Sun Feb 12, 2006 6:24 pm",
    "title": "Nodule?",
    "content": "Hello-   I am a 33 yr old female. I have a nodule to the left of my thyroid. I had a biopsy done at the end of Dec of 05. They had to stick me 7 times to get enough cells. I was told the nodule is tiny. After doing thr biopsy, I was told a few days later that it was inconclusive. He said what they did find was benign but not enough cells. What does this mean?   I was told that I need to do another U/S and possibly another biopsy. Just some history. I was pregnant when they found this nodule. I believe it was last April of 05 that it was found. I was borderline Hyperthyroid and my doctor didnt want to do a biopsy while I was pregnant. I had my daughter in Sept and my u/s was done to see if the nodule had grown it didnt. So he scheduled the biospy and here we are, no answers. Is this normal?   Thanks,   Michelle\n\n",
    "posted_time": "Post  by gianna05 » Sun Feb 12, 2006 7:10 pm",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=30559&sid=12cfdcd35656625058d9263b35450f66#p30559"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Dear gianna05,  Changes in the Thyroid gland are common during pregnancy and may include hyperthyroidism, simple goiter or malignancy.  A thyroid nodule or thyroid enlargement is usually noticed by the patient or detected on a routine examination.  Although most of these nodules are benign, diagnostic evaluation is mandatory.  I would like to know the exact levels of the thyroid function tests and if the thyroid function tests were repeated after labor, or any other investigations that have been done.   The most common approaches for the diagnostic evaluation of solitary thyroid nodules include: complete history taking, clinical examination, measurement of the serum TSH level, and FNAC.   Radioactive scintigraphy is no more routinely recommended for all patients with thyroid nodules. However, it is of help in certain situations like: When suspicious or inconclusive cytology on FNA, and  When thyrotoxicosis is suspected or  Thyroid stimulating hormone (TSH) is suppressed.  Fine-needle aspiration (FNA) is the diagnostic procedure of choice. Inadequate cells may be due to problems in the aspiration technique, and commonly seen in cystic lesions. Ultrasound-guided FNAC is recommended in euthyroid patient to provide better yield of cells and for more accuracy.  FNA can determine whether the lesion is cystic or solid. Provided that adequate cellular material is available, the accuracy of cytologic diagnosis from FNA is 70%-80%. The experience of the person who performs the aspiration and the pathologist are the main factors affecting the accuracy of FNAC results.  Further management for solitary thyroid nodule depend on the results of the FNA cytology. For a solid lesions, FNAC gives one of the following results: benign, malignant, or indeterminate.  When findings from the aspirate are not diagnostic: -The aspiration can be repeated and preferably using, ultrasonographic guidance.  - If results are still indeterminate in a cold  nodule, surgical removal of the nodule for histological evaluation should be done.  Removal of the nodule for pathological diagnosis is done using a total lobectomy approach, in which removal of the suspicious nodule, hemithyroid, and isthmus.   The specimen then is sent for frozen-section analysis during surgery. Treatment is decided according to the pathology results from the frozen section.  I advise you to keep on follow up with your doctor and to try understand from him the situation and the further approaches he is planning to follow.  Best regards,\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Fri Jul 14, 2006 3:14 pm",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=33411&sid=12cfdcd35656625058d9263b35450f66#p33411"
  },
  {
    "author": "dony62  Guest Posts: 1 Joined: Wed Feb 15, 2006 5:05 am",
    "title": "thyroid cancer",
    "content": "I am 43 female in the menopause for the past year, i had my thyroid completely removed in 2001 radioactive iodine treatment. currently i am off my thyroxin awaiting another scan as I feel i have a lump again at the back of my throat.  I have also for the last few months experienced a pain in my left upper abdomen, losing weight, feeling exhausted and my ribs are painful to touch, i cannot bear my husband giving me a back massage as it hurts too much and makes me cry out.  I have been to my doctors and had loads of tests which have come back clear.  for anemia, rheumatisism, thyroid(which came back high) abdomen scan which was negative, not sure what she was looking for.  I still have the abdominal pain and steadily losing weight on 23.01.06 I was 10st 4 today 15.02.06 I weigh 9st 11   my friend seems to think that my thyroid has grown back, can this happen?  Not sure whether to go back to doctors can you advise?\n\n",
    "posted_time": "Post  by dony62 » Wed Feb 15, 2006 5:18 am",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=30709&sid=12cfdcd35656625058d9263b35450f66#p30709"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Dear dony62,  Since you have been treated with radio active I-131, I assume that the pathology of the removed thyroid showed either Papillary or Follicular thyroid carcinoma.  Papillary and follicular cancers develop in follicle cells of the thyroid gland and represent the great majority of thyroid cancers.  Treatment include complete surgical removal. Radioactive Iodine 131 (I-131) is given according to the pathology and the results of the postoperative radioactive Iodine scan .   The severe pain you have described in your ribs is very  considerable and the risk of distant metastases is to be ruled out.  In these tumor types, Bone metastases is the second common site for distant metastases.  They tends to occur after many years especially in follicular carcinoma.  Definitely, it is advisable to do now the radioactive I-131 scan for investigating the possibility of recurrence or distant metastases.  Fortunately, most lesions show radioactivity and can be treated with I-131. The long-term survival of distant metastasis with active treatment is relatively good.  Although, most lesions take up radioactivity negative scan doesn’t exclude the possibility of bone lesions and imaging with X-ray or CT is recommended for exclusion of bone lesions.  Palliation of bone metastases using external radiation therapy is useful in relieving pain from bone metastasis.  Regarding, the throat pain and the left sided abdominal pain, although they can be part of the suspected recurrence and metastases, it can be also a separate GI problem like GERD.   Keep on follow up with your doctor, for further investigations and proper management.  Best regards,\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Fri Jul 14, 2006 1:10 pm",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=33410&sid=12cfdcd35656625058d9263b35450f66#p33410"
  },
  {
    "author": "JMcC  Guest Posts: 1 Joined: Sat Feb 18, 2006 7:58 pm Location: New Zeaand",
    "title": "Heredity and Thyroid Cancer",
    "content": "I am 56, female, Caucasian. I share some physiological characteristics with my mother who died at the age of 56  in 1969 of cancer -- primary in the thyroid gland, secondary encephalitis and heart tumor. First manifestation was cloudy vision.       My mother had acute appendicitis at age 15, as did I. She had recurrent bursitis in her left elbow, bursa pad removed at age 23. So did I. She suffered from depression and anxiety, as do I. I enjoy the benefits of modern drugs, and take Celepram (hydrobromide) 20 mg daily. My general figure type is like my mother's -- tendency to overweight, hourglass figure.      However, I am unlike my mother in colouring (I am blonde, blue-eyed, very fair, she was dark, green-eyed) And I suffer from severe reactive hypoglycaemia (GTT tests, doctor diagnosed) and my mother had no blood sugar problems. My father was the blonde and an insulin dependent Type I diabetic.      Also unlike my mother, I had glomerular nephritis at age 21 (fully recovered), a hysterectomy at age 43 (large fibroids -- only the uterus removed) I'm not sure if I'm menopausal ... If I am, I'm having an easy time of it. My mother was very late going into menopause, but suffered badly.      I feel well. I have low blood pressure. I am reasonably fit, have a full time job, exercise regularly. eat well, take some vitamins.      My question is whether I should be checked for any problem in the thyroid gland at this point given my family history. Is there any test available that would detect cancer in its early stages?      I am not overly concerned, but I want to feel I am doing everything I can in the way of prevention.      Thank-you very much for your time and concern, JMcC\n\n",
    "posted_time": "Post  by JMcC » Sun Feb 19, 2006 7:49 am",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=30960&sid=12cfdcd35656625058d9263b35450f66#p30960"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi JMcC, Risks for certain types of malignancies are increased when there is a familial history of such disorders. Regular physical evaluations will assist your physician in identifying any abnormalities. He/she will palpate (feel) your thyroid gland to identify any abnormalities in size, nodules, etc. Lab studies to evaluate thyroid function may also be included. Be sure your physician is aware that you have a family history of this disorder. Sincerely, Theresa Jones, RN\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Wed Jun 07, 2006 6:14 am",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=32907&sid=12cfdcd35656625058d9263b35450f66#p32907"
  },
  {
    "author": "Befallingdusk  Guest Posts: 20 Joined: Tue May 17, 2005 2:08 am Location: Raleigh, NC",
    "title": "Supraclavicular Edema, but no enlarged node?",
    "content": "Hi.  I've been posting in the Lymphedema forum, tying to get to the bottom of a sudden onslaught of unusual symptoms.  But setting these other symptoms aside, I want to ask about this obvious swelling above my left collarbone, tucked up against my neck.  I only found out what it was called through my PCP.    Can \"Supraclavicular Edema\" indicate a problem somewhere even though CT scans show no enlarged nodes nor masses in abdomen or pelvis?  I also have petechiae (blood spots) mostly over my stomach area and a few spots over my breasts and left arm.  Does anyone have any idea what this could indicate?  The edema fluctuates and is always more pronounced in the evenings, if that means anything.  Any opinions or advice is appreciated.....\n\n",
    "posted_time": "Post  by Befallingdusk » Sat Jun 11, 2005 3:20 pm",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=14973&sid=12cfdcd35656625058d9263b35450f66#p14973"
  },
  {
    "author": "Dr. Shank  Medical Doctor Posts: 40 Joined: Mon Sep 05, 2005 3:46 pm Location: 715 W. North St., Lima, OH   45801, USA",
    "title": "[no title]",
    "content": "Dear  Befallingdusk:  You may be describing more than one problem, but I am very concerned about the \"sudden onslaught of unusual symptoms\" that you did not describe.  The first issue is the petechiae.  There are a variety of possible causes, but they can be grouped into abnormalities of platelet number or function (such as from leukemia, enlargement of the spleen, or multiple myeloma) and abnormal leakiness of blood vessels (such as from a vasculitis or severe vitamin C deficiency=scurvy).  I would start with a hematologist/oncologist.  If the hematologist/oncologist does not find an explanation, I would try a rheumatologist.  The second issue is the swelling.  I question the diagnosis that you have been given.  There are connections in the head between the blood circulation on the right and left, but not between the lymphatic vessels.   Without alternate routes for lymph fluids to drain, I would expect supraclavicular lymphedema to extend into the head and neck or into the shoulder and upper extremity--neither of which you seem to be describing.  Since the lymph system is largely dependent upon gravity and muscle contraction to get the lymph fluid back to the chest (where it joins the blood circulation), I would also expect lymphadema of your head, neck, shoulder, or supraclavicular areas  to get better during upright posture and muscle activity, not worse.  You specifically mentioned that you had no masses or enlarged lymph nodes in your abdomen or pelvis, but said nothing about your chest or neck, nor why anyone was looking for masses or enlarged lymph nodes in your abdomin and pelvis.  Without more history, a chance to examine you, or more information about diagnostic tests that I have been performed, the possibilities are pretty broad.  Given the petechiae and the \"sudden onslaught of unusual symptoms,\" my first concern would be for a lymphoma.  Other possibilities include a lung cancer (Pancost tumor), a thyroid nodule (benign or malignant), a thyroid cyst, a brancheal cleft cyst, a parathyroid nodule (benign or malignant), a parathyroid cyst, a fatty tumor, an aneurysm of either the common carotid or brachealcephalic artery, or venous obstruction in either the jugular or subclavian vein.  One word of caution:  Like the rest of us, radiologists usually see what they are looking for, and they do not look for fat.  I saw a woman who had very painful left sided supraclavicular and neck swelling that worsened as the day went on.  After careful examination, I realized that she had a markedly distended and extremely tender left jugular vein just above a soft neck and supraclavicular mass.  I suspecteded that the mass was partially obstructing her veins, her pain was caused by abnormal stretching of the veins that could not drain all the blood flowing into them, and that her symtoms improved overnight because the blood could easily backflow from the left to the right when she was lying down.  I personally performed an ultrasound.  It confirmed my exam, but showed that the mass extended into the upper chest and was largely constricting the junction of the jugular and subclavian veins.  The mass had the ultrasonic characteristics of adipose (fat) tissue.  I ordered an MRI of the neck and chest, told the radiologist about my findings, and received a report that there was no mass or obstruction whatsover.  One glance at the actual films showed me a obvious, large, irregular, mass with the MRI characteristics of adipose tissue.  Comparing the right and the left confirmed the partial obstruction and prominent dilation of the left jugular and subclavian veins.  Although the reading radiologist is very good, he reflexively ignored anything with the density of fat and did not systematically trace the veins or compare the veins on the left with those on the right.   Because of the radiologists' reading, the surgeon was reluctant to operate.  When he finally did operate, however, he found exactly what I told him that he would (and the patient got dramatic relief!).  I have mentioned several endocrine possibilities for the supraclavicular and neck mass.  Although I am more concerned about non endocrine possibilites in your case, I would add that endocrine diseases do often present with a variety of symptoms that may seem unrelated.  Endocrinologists are the specialists in abnormal endocrine function and in endocrine tumors and cancers.  If you need to find an endocrinologist near you, you can search the website of the American Association of Clinical Endocrinologists (http://www.aace.com).\n\n",
    "posted_time": "Post  by Dr. Shank » Sat Sep 24, 2005 1:49 pm",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=21507&sid=12cfdcd35656625058d9263b35450f66#p21507"
  },
  {
    "author": "Befallingdusk  Guest Posts: 20 Joined: Tue May 17, 2005 2:08 am Location: Raleigh, NC",
    "title": "[no title]",
    "content": "Dear Dr. Shank,  Thank you so much for such an indepth, knowledgable reply!  That meant the world to me and the time you spent is much appreciated!  I originally posted in the Lymphoma section of the forums, back in March/April.  There I listed the \"sudden onslaught.\"  It all began with excruciating breast pain in a localized area of the left breast.  The pain was not constant, but the site reacted horribly to sudden movement, touch or palpitation.  Then, in order of their occurrence (keeping in mind symptoms began overlaping): entire upper left quarter of body swelled (left breast, left arm and left supraclavicular area); nodes would swell and burn in left inner-arm, neck and elsewhere; burning, creeping sensation in skin along the swollen areas; intense itching; nodes would recede and stop burning, to rise and burn again at another time; multiple patches of broken capillaries arose on breast; \"itchy pimples\" appeared among the capillaries; then tiny pin-prick, bright red spots appeared on upper abdomen, left arm and upper chest (petechiae? Not tons of them but certainly 30 or so); bled spontaneously into inner-arm 3x (purpura? But then it went away); developed high blood pressure; left-sided chest pain that came and went; now I have pain in my left armpit as though a rock is wedged up there.  I have two other weird rashes no one is able to identify, and just recently developed a third on my right leg of all places (just a patch of redness the size of a silver dollar/may be unrelated).  My PCP believes I have lymphadenapthy due to my nodes, but a CT scan of my neck and chest showed: \"Essentially within normal limits,\" which surprised me greatly, because the nodes burn and hurt.  The severe breast pain has disappeared, but the entire left side of the breast still burns pretty badly.  Screening mammogram and ultrasound came back normal in the beginning, early April.  A CT scan of lungs found a .5 mm nodule in upper right lobe, but docs think it's scar tissue.  A 3 mo. follow-up scan showed no change.  My left aureole now gets bright pink and hot.  But it comes and goes, just like the edema.  I mean, none of it goes away, it just wanes in severity throughout the day and night.  I've read that nodes that swell and recede are called Lymphamatous, which would certainly describe mine, but I don't know what it means or indicates.   I do believe I have some in the axilla now that are definitely swollen and hurts more often than not.   I couldn't feel these back in March/April.  A recent MRI of my breasts showed a lump in right breast (a reoccurrence of a fibroadenoma, so the docs believe), a lump in the left breast they think is a fatty something AND two areas in each breast of increased blood flow, upper-outer quadrants. A follow up ultrasound was done which confirmed the MRI findings, except the the ultrasound noted 5 nodes that were \"enlarged\" but apparently benign in appearance.  Breast docs are dismissing it all as a severe case of fibrocystitis but want everything rechecked in 3-6 months, yet offer no explanation for the supraclavicular and arm edema, or the rashes.  This has been going on since March 28; and no one will do a begged-for biopsy or FNA of a node.  Very frustrating for me.    I've been doing tons of research myself and I'm fearful I have Inflammatory breast cancer lurking around in there, as now, my right breast, arm and supraclavicular area is becoming involved also.  BUT, I'm not ruling anything out at this point, because my symptoms are so unusual and varied.  I do believe I'm exhibiting the vasculitis but it's milder now than in the beginning.  PCPs have noted all of it -- the edema, high blood pressure, spontaneous bleeding and skin and breast changes -- and they keep referring me out to breast doctors who still don't believe it's coming from my breasts.  I had multiple CBC's in the beginning -- all normal but two.  One showed slightly elevated Hemoglobin and Hematocrit, then normal results for awhile, then high white blood cells and neutrophils.  Then, this too returned to normal but almost everything at this point was pushing high normal.  I haven't had another CBC in months.    I too, am very concerned about my health.  This certainly isn't anything that's going away and it does not come and go with my period.  I don't even have periods!  The only thing that has improved with significance is the breast pain.  I still have pain, but it's of a different nature than from the beginning.    I'm going to NC in November where I have some oncologists waiting to see me.  They are offering to do the biopsies, and a pet scan.  In other words, they want to get to the bottom of it, umlike the doctors I'm now seeing.  But I also think I should see a hematologist or an endochronologist.  I just need help and I hope I don't drop dead while waiting for it.    OH!  And yes, I tire very easily and am now having intense spells of dizziness (as though I'm drunk or seasick and I don't drink).  After I sleep a good 8-10 hours, the edema recedes and is better in the mornings.  As the day progresses, regular activity, by noon and early afternoon, I'm all swollen again.  Exercise does seem to help but only if it's rigorous.  Considering all of the above, if you have any further suggestions or insight for me, I would be ever grateful.  I thank you again for your reply.  bdusk\n\n",
    "posted_time": "Post  by Befallingdusk » Tue Sep 27, 2005 12:04 am",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=21688&sid=12cfdcd35656625058d9263b35450f66#p21688"
  },
  {
    "author": "Dr. Shank  Medical Doctor Posts: 40 Joined: Mon Sep 05, 2005 3:46 pm Location: 715 W. North St., Lima, OH   45801, USA",
    "title": "[no title]",
    "content": "It seems clear that your breast has been a distraction from a number of systemic symptoms.  I wish you the best and hope that you will share what you learn.\n\n",
    "posted_time": "Post  by Dr. Shank » Sat Nov 19, 2005 4:42 pm",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=25415&sid=12cfdcd35656625058d9263b35450f66#p25415"
  },
  {
    "author": "penelope  Guest Posts: 1 Joined: Mon Apr 04, 2005 6:58 pm Location: Texas",
    "title": "Palpable nodule, negative Ultrasound?",
    "content": "I have been on synthroid for two years for hypothyroidism. There has been a noticable lump in my throat for quite some time. Now it causes me breathing and swallowing problems at times. Three different doctors found a single nodule, but the ultrasound didn't show any abnormalities. What happens now?\n\n",
    "posted_time": "Post  by penelope » Mon Apr 04, 2005 7:06 pm",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=11905&sid=12cfdcd35656625058d9263b35450f66#p11905"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi penelope, I hope by this point other diagnostics, for example, a FNA (fine needle aspiration) of the nodule has been completed especially if your physician's opinion considered it suspicious in nature. Sincerely, Rntdj\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Wed Oct 26, 2005 7:35 am",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=24069&sid=12cfdcd35656625058d9263b35450f66#p24069"
  },
  {
    "author": "ciera111111  Guest Posts: 3 Joined: Fri Jul 29, 2005 3:10 pm Location: USA",
    "title": "Thyroid Gland, Many Symptoms",
    "content": "First of all I would like to say thank you to everyone responsible for this forum. It is a God send. I am a 38 year old female who had thyroid cancer and had the whole thyroid removed and had radiation treatment for it. I am now on Levothyroxine 0.175 mg a day I take it on an empty stomach in the morning, I take no other pills with this med and I don't eat afterwards for at least 2 hours.  I am losing my hair on my scalp, my hair is dry and brittle, I sweat extremely bad, I have acne and oily skin, increased hair growth on my face and body, I am now infertal, (I have 5 children alive) haven't been able to get pregnant been trying for one full year now, the man I am with has 4 children already...  I am depressed, have extreme fatigue, and now am develpoing spaces between my teeth also. My hair is falling out so much I am going bald, (all over my head) and the spaces between my teeth are new, and is getting bad) I have floaters in my eyes now and can't stay asleep when I sleep even though I am fatigued all the time. I also wanted to say that my periods/cycles are normal and right on time each and every month,. and they last 7 to 10 days each time, I'm just not ovualting I guess because I can't get pregnant for some reason.  I am told my dose of thyroid replacement is fine, all the tests they run come back normal as far as thyroid tests go.. what is wrong with me?\n\n",
    "posted_time": "Post  by ciera111111 » Fri Jul 29, 2005 3:23 pm",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=17729&sid=12cfdcd35656625058d9263b35450f66#p17729"
  },
  {
    "author": "Dr. Shank  Medical Doctor Posts: 40 Joined: Mon Sep 05, 2005 3:46 pm Location: 715 W. North St., Lima, OH   45801, USA",
    "title": "[no title]",
    "content": "Dear ciera111111:  The fact that you are being told that your thyroid tests are \"normal\" tells me that you are not seeing an endocrinologist.  Furthermore, your current dose of levothyroxine is no more than I would expect (without knowing your height and weight) you to need to replace what your thyroid gland used to make, but you actually need much more than that.  Furthermore, your symptoms strongly suggest that you are not getting enought levothyroxine even for replacement.  You had a complete thyroidectomy followed by what sounds like radioactive iodine ablation therapy.  To that point, you evidently received the standard of care.  However, the medical literature unambiguously shows that levothyroxine therapy in a patient who has had thyroid cancer should be designed to make her mildly hyperthyroid with an undetectable thyroid stimulating hormone (TSH) level.  It is critical that there not be any TSH stimulation of any remaining thyroid cells.  In other words, if your thyroid function tests are normal, you are currently not receiving appropriate care.    Follow-up is lifelong and should include one or more of the following at least annually:  (1) whole body scan after withdrawal of levothyroxine for at least six weeks or after two doses of synthetic TSH (Thyrolar); (2) ultrasound of the thyroid bed (where the gland used to be) by an experienced physician (not by a radiology technician); or (3) serum thyroglobulin levels, preferably either while hypothyroid or after injection of synthetic TSH.  Expert opinion is trending toward doing ultrasound plus thyroglobulin levels, instead of whole body scans.  You did not say what your thyroid function test results were.  Laboratories establish their \"reference ranges\" by sampling their employees.  No effort is made to ensure that their \"normals\" are truely healthy.  For rare conditions, that works, but for common conditions, like thyroid disease, it is a disaster.  The American Thyroid Association, the Endocrine Society, and the American Association of Clinical Endocrinologists agree that a TSH of 2 or more is definitely abnormal and strongly suggests hypothyroidism.  Despite this, I never seen a laboratory anywhere in the country with a TSH upper limit less than 4, and many are much higher.  In my experience, a TSH between 1.5 and 2 should be considered borderline, because I find that it usually represents mild clinical hypothyroidism.  My guess is that you are getting even less levothyroxine than you would need if you had not had thyroid cancer.  Your menstrual periods are not normal, even if they are regular.  They  last twice as long as they should.  This is probably due in part to abnormal thyroid hormone levels, althugh I suspect that that you have an excess of \"male\" sex hormones, as well (See below.).  My guess is that you also have heavy menstrual flow and clots.  Your dry and brittle hair also suggests hypothyroidism.  Hypothyroidism can cause hair breakage, and I have seen two cases in which it probably caused mild-to-moderate excesses of facial and body hair, but I get the impression that an additional problem is responsible in your case.  On the other hand, \"extremely bad\" sweat might due to too much thyroid hormones, but I am more suspicious of other causes (See below.)  Oily skin and acne could be due to way too much thyroid hormones, but in your case is more likely to be due either to an excess of \"male\" sex hormones or of glucocorticoids.  You said that you are developing baldness all over your head.  Since you also said that you have increased hair growth on your face and body,  this is not alopecia totalis (which occurs when the body attacks the hair follicles), but either damage to the hair shafts by hair care practices, \"male-type\" pattern baldness, or an excess of glucocorticoids.  In view of your oily skin, acne, increased hair growth on your face and body, your abnormal menses, and your infertility, it is highly likely that your \"male\" sex hormone or your cortisol levels are too high.  Although similar changes sometimes occur with normal \"male\" hormone levels combined with low \"female\" hormone levels, they are seldom as severe as what you seem to be describing.    At 38-years-of-age, your ovaries may be failing you.  This would contribute to your infertility and your abnormal menstrual periods.  You may even be perimenopausal.  I am not sure if your description of \"extremely bad\" sweat represent perimenopausal  hot flashes, or not.  You should also have a prolactin level checked, because it could cause infertility and abnormal menstrual periods without any other symptoms.  High levels of prolactin can occur with any of a variety of medications, from a pituitary tumor, or from an injury or abnormality of the part of the brain that controls the pituitary gland.  On the other hand, even a small pituitary tumor could cause headaches, and a large one could even cause partial loss of vision, which might be confused with floaters.  Unless you are taking glucocorticoids, the most common cause of too much glucocorticoids is a pituitary tumor that stimulates the adrenal glands to make too much cortisol.  Rarely, excess male hormone levels are caused by tumors, usually in the ovaries or adrenal glands.  Since your infertility is new and you are trying to get pregant, we can exclude both an inherited enzyme deficiency in the adrenal glands (congenital adrenal hyperplasia) and androgenic (\"male\" hormone-like effects) of certain progestins (synthetic progesterone-like compounds often used in oral contraceptives and in menopausal sex hormone replacement therapy).  I will assume that you are not a female body-builder taking illegal \"male\" hormones and that you are not exposed to high levels from contact with a man who is.   The most common cause of excess \"male\" hormones in women is PCOS (Before we knew that it had absolutely nothing to do with \"cysts\" (follicles) on the ovaries, it was incorrectly known as \"polycytic ovarian syndrome,\" but now the letters do not stand for anything.).  Nearly all cases of PCOS are due to high levels of insulin being required to overcome resistance to the glucose-lowering effect of insulin.  This, in turn, is made worse by weight gain or lack of physical activity.  It is also associated with a greatly increased risk of developing diabetes.  The high insulin levels sitmulate the ovaries to make too much testosterone and other \"male\" hormones, causing a number of abnormalities, including infertility, miscarriages (you made a cryptic reference to the number of children you had who were alive), hair where you do not want it, loss of hair where you do want it, oily skin, acne, and sometimes even masculinization.  I have seen one case in which acromegaly (a disease caused by excess production of somatotropin or \"growth hormone\", almost always by a pituitary tumor) stimulated excess production by the liver of insulin-like growth factor type 1 (IGF-1, which is called \"insulin-like,\" because it has effects like insulin); only half-a-dozen cases have been reported in the medical literature, so this would hardly be worth mentioning, except for some of the observations that you have made.  You said that you are developing large spaces between your teeth.  Unless your teeth are severely decayed, I do not know of any condition other than acromegaly that can cause this.  When you said that you had \"extremely bad\" sweat, you did not specify whether you meant the quantity or whether you meant that it was foul-smelling and difficult to wash off (which could also be a sign of acromegaly).  You also said that you were developing floaters, which, as I have noted, can be a misinterpretation of partial losses of vision from pressure on the optic tracts (\"nerves\") by a large pituitary tumor.  Are you also developing an under bite?  Are your tongue, chin, nose, ears, ridges above and below the eyes, feet, or hands enlarging?  Has your ring size changed or have your fingers and toes become wider between the knuckles?  Do you have headaches?  Are you developing a stooped posture or \"humpback\"?  As compared to old photographs of yourself, have you begun to develop \"coarser\" facial features.  Do you look \"funny\" (\"Neanderthal\")?  Fatigue is a very complex problem.  It may reflect too much or too little thyroid hormones, almost any other endocrine or metabolic problem, anemia, sleep apnea, narcolepsy, restless legs or periodic limb movement, depression, having nine children in the house, and so on.  The fact that you are unable to stay asleep coud be due to depression, but the abnormal thyroid hormone levels that I suspect could be playing a role.  You did not mention it, but what you have told me leads me to wonder if you gained weight your thyroid surgery and radioactive iodine treatment, which would aggrevate any tendency you might have toward obstructive sleep apnea (So would acromegaly, for that matter.).  If you are premenopausal, hot flashes may be interfering with your sleep.  I have only touched upon the issues raised by your plea for help.  While it would be impossible for me to give you and your physician a whole fellowship in endocrinology, diabetes, and metabolism in this forum, I can refer you to the American Association of Clinical Endocrinologists website (http://www.aace.com).  There, you can read about many of the things that I have mentioned and find someone with the training and experience to properly evaluate and manage your problems.  I cannot stress stronly enough how important it is that you seek out an endocrinologist.  Remember:  Endocrinologists are the specialists in endocrine cancers and in hormones.\n\n",
    "posted_time": "Post  by Dr. Shank » Sat Sep 24, 2005 5:31 pm",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=21529&sid=12cfdcd35656625058d9263b35450f66#p21529"
  },
  {
    "author": "lanesharon  Guest Posts: 2 Joined: Sun Feb 16, 2003 11:45 am Location: AZ  Contact:   Contact lanesharon       Website   Yahoo Messenger",
    "title": "Thyroid cysts - previous Adenoid Cystic Carcinoma/Breast",
    "content": "In 1998, after 4 years of being told that the lump in my breast was a benign cyst (based on mammogram images and FNA's), I chose to voluntarily have it removed.  It was adenoid cystic carcinoma (cylindroma, adenocystic) of the breast.  It was a large tumor by then and I wanted to kick myself in the butt for not insisting on having it removed four years earlier (my instincts kept telling me it was cancer).  I was told that it must have been popping out of the way when the FNA's were done, but I have since been told that FNA's may not be a large enough sample to diagnose this particular cancer.    Over the last couple of years I have had periods of having a sensation of a lump in my throat and at times I have esophageal restrictions (dilation was done with no resolution).  I had cervical spine fusion done this year to correct cervical spine fractures and hoped that the lump feeling would go away.  It did not.  Over the last couple of months I have had a recurring sore throat and in the last few weeks a hoarseness has developed.  I was recently put on synthroid for symptoms of a thyroid condition based on family history and systemic symptoms, not blood test results.  At the same time the doctor told me she felt a lump in the left side of my thyroid and ordered an ultrasound.    Report reads \"A 5-mm simple cyst of the right lobe is noted.  The left lobe of the thyroid has two small cysts with the largest measuring 3 mm.  Normal Doppler signal is seen.  IMPRESSION:  Small cyst-negative for malignancy.\"    I know that thyroid cysts are common and that I shouldn't be concerned, but my past history of misdiagnosis does concern me.  I know that to have AdCC in the thyroid after having it in the breast, has only been reported once before in the literature.  But, I have seen lightning strike twice in my job as a cancer advocate.  When I asked my PCP today what I should do, he said that I should not worry because the ultrasound can distinguish a cyst from a carcinoma.  He also said that the cysts are far too small to biopsy anyway.    I need to ask what you would recommend in this situation if this were your daughter or wife.  And I need to ask if cysts are clearly seen in ultrasound?  Are they ever misinterpreted?  Am I missing something?    Thank you for any insight you can give me.\n\n",
    "posted_time": "Post  by lanesharon » Wed Feb 19, 2003 9:23 pm",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=382&sid=12cfdcd35656625058d9263b35450f66#p382"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Thyroid cysts - previous Adenoid Cystic Carcinoma/Breast",
    "content": "Dear Sharon,  Thank you very much for using our website.  Symptoms of hypothyroidism can be caused by other diseases. That's why to be started on syntroid, you have to have a blood test for the thyroid functions to make sure that you are hypothyroid and that's the symptoms you are having are secondary to hypothyroidism. The importance of obtaining blood tests lies also in the fact that if you will be taking thyroid hormone replacement, this should be monitored and the synthroid dose adjusted accordingly.  About thyroid cysts, the ones that you have are small to be considered for biopsy. The cut off for the size is usually 10 mm for any thyroid lesion to be considered for biopsy even if ultrasound guided. Usually the ultrsound is good at telling if this is a benign looking cyst or not as there are ultrasonographic signs of malignancy that can be detected.  About metastatic disease to the thyroid gland, it is a rare occurence and there are tumours that are known to cause metastases, at top of the list is kidney cancer, breast cancer is one of the malignancies that can cause metastases to the thyroid as well.   You have a history of breast cancer and thyroid disease, how to tell whether the thyroid disease that you have is because of the breast cancer or not?   There are tumour markers that are used to follow-up the recurrence of cancer and they are usually good at that, so if you recurrence of the tumour whether locally in the breast or outside the breast at any site, these markers which can be detected by blood tests are usually elevated. In addition there are more sophisticated x-ray techniques that can be used to check the thyroid gland for any abnormality such as c.t. scans and m.r.i. as well. Recently, the addition of p.e.t scans to the armimentarium of x-ray techniques has served as a great tool to discover metastatic disease to anywhere in the body.   My advice to you is that if you are really worried, wait till you see your oncologist (or go earlier) and ask him about the possibility of you having blood tests for tumour markers for the breast cancer which i suspect you most probably are already having every year or so to make sure that breast cancer is not back and according to what he thinks your risks are (according to the blood tests and other clinical impression) of the cysts in the thyroid being cancer from the breast. If you want to make sure i think the best tool available now is the pet scan which is usually very good at detecting malignancy in the body.  Once more, thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Mon Mar 03, 2003 9:16 am",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=432&sid=12cfdcd35656625058d9263b35450f66#p432"
  },
  {
    "author": "Guest",
    "title": "Sugar vs sugar alcohols re: immune suppression",
    "content": "Hello,  I notice there has been a lot of research lately regarding the effect sugar has on the immune system.  I am just wondering if sugar alcohols such as Maltitol etc. have the same suppressing effect.   Thank you.\n\n",
    "posted_time": "Post  by Guest » Fri Jan 10, 2003 12:27 pm",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=111&sid=12cfdcd35656625058d9263b35450f66#p111"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "Maltilol safety",
    "content": "Dear Martin, Maltilol is a commonly used sugar alchohol (used as a dietary sweetner). A petition to affirm the GRAS (Generally Recognized as Safe) status of maltitol has been accepted for filing by the U.S. Food and Drug Administration. This petition describes the use of maltitol as a flavoring agent, formulation aid, humectant, nutritive sweetener, processing aid, sequestrant, stabilizer and thickener, surface-finishing agent and texturizer. In particular, the petition addresses the use of maltitol at levels of up 99.5% in hard candy and cough drops, 99% in sugar substitutes, 85% in soft candies, 75% in chewing gum, 55% in non-standardized jams and jellies and 30% in cookies and sponge cake.  The safety of maltitol as a food ingredient is substantiated by numerous studies in both humans and animals. The Joint Food and Agriculture Organization/World Health Organization Expert Committee on Food Additives (JECFA) has reviewed the safety data and concluded that maltitol is safe. JECFA has established an acceptable daily intake (ADI) for maltitol of \"not specified,\" meaning no limits are placed on its use. An ADI \"not specified\" is the safest category in which JECFA can place a food ingredient. Many countries which do not have their own agencies to review food additive safety adopt JECFA’s decisions.  The Scientific Committee for Food of the European Union (EU) published a comprehensive assessment of sweeteners in 1985, concluding that maltitol is acceptable for use, also without setting a limit on its use.  As with other polyols, maltitol may produce a laxative effect when consumed at very high levels. An information statement similar to the one required for other polyols is recommended in the GRAS petition for foreseeable consumption of greater than 100 grams per day of maltitol.  Finally, and to summarize: According to available research the current status is that maltilol does not have an immune suppressor effect. Ofcourse research is changing the way we understand everything, every day.  If you are doing a research on the topic then I would refer you to the following references:  Commission of the European Communities. Reports of the Scientific Committee for Food concerning sweeteners. Sixteenth Series. Report EUR 10210 EN. Office for Official Publications of the European Communities, Luxembourg, 1985.  European Economic Community Council (EEC). Directive on food labeling. Official Journal of the European Communities. No. L 276/40 (Oct. 6, 1990).  Joint FAO/WHO Expert Committee on Food Additives, IPCS Toxicological evaluation of certain food additives and contaminants: Maltitol, WHO Food Additives Series: 32, 1993, pp. 101-104.  Life Sciences Research Office. Evaluation of the net energy value of maltitol. April 1999. (unpublished)  Modderman JP. Safety Assessment of Hydrogenated Starch Hydrolysates. Regulatory Toxicology and Pharmacology, 18:80-104, 1993.  Petition to Affirm Generally Recognized As Safe (GRAS) Status of Maltitol As A Food Ingredient, by Towa Chemical Industry Co., Ltd., filed December 23,1986 with the United States Food and Drug Administration.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Fri Jan 10, 2003 1:17 pm",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=113&sid=12cfdcd35656625058d9263b35450f66#p113"
  },
  {
    "author": "Martin",
    "title": "Thanks!",
    "content": "Thank you for your prompt and informative reply!\n\n",
    "posted_time": "Post  by Martin » Fri Jan 10, 2003 4:12 pm",
    "category": "Oncology",
    "sub_category": "Endocrine Cancers",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=114&sid=12cfdcd35656625058d9263b35450f66#p114"
  }
]