[
  {
    "author": "cperezx16  Guest Posts: 1 Joined: Thu Apr 02, 2009 1:30 pm Gender: Female",
    "title": "Chest Discomfort when Swallowing.",
    "content": "Hi I am 21 yrs old and a couple days ago I developed a strange pain in my chest right under my left clavicle, when I swallow, especially when eating food or drink. I thought it may be heart burn because I occasionally get heartburn but the usual Rolaids I take didn't help much! I also thought I had something to do with the workout exercise I was doing because I noticed the discomfort shortly after working out. I have no throat pain or itchiness so I am afraid it might be something serious. I was reading about esophageal cancer and the symptoms are  Pain in your throat, in your midchest or between your shoulder blades. Although not common, you sometimes might have pain when you swallow or discomfort or burning behind your breastbone. So therefore I am a little worried!! Please let me know what you think. Thanks!!!!!!!\n\n",
    "posted_time": "Post  by cperezx16 » Thu Apr 02, 2009 1:50 pm",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=72848&sid=085434dc42f4e235962b2508376ffd8a#p72848"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: Chest Discomfort when Swallowing.",
    "content": "Hi, Cancers of the esophagus frequently present with a sensation of food getting held up in the neck or midline chest and curiously the patient may pinpoint the site of holdup which corresponds to the site of narrowing of the esophagus! But the pain that you are experiencing is below the left clavicle.Again, you don't seem to have any dysphagia(swallowing difficulty).Therefore your symptom does not have the typical charecteristics of pain due to esophageal cancer. In all likelihood, this pain is a muscular pain, mostly exertional.Hopefully this should go away, but in case it should persist,please consult a surgeon. Good luck!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Wed Oct 07, 2009 12:21 pm",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=83496&sid=085434dc42f4e235962b2508376ffd8a#p83496"
  },
  {
    "author": "whatsupdoc  Guest Posts: 1 Joined: Tue Jan 13, 2009 7:40 am Gender: Male",
    "title": "Damage to Esophagus",
    "content": "Hi,  I am attempting to post on these forums a second time. It seems my previous post is not in tact.   I am a 42 yr old Male who is wondering what to expect or if some of the following issues are related to an ongoing problem.  Starting at about the age 16 I have had regurgitation problems resulting in everything I eat or drink to back up into my mouth. It is almost immediately after I swallow that this occurs.   After a while it seems to stop but will continue if I lie down, bend over or do physical activity. It is very common that hours after eating I have very strong acidic product backing up into my mouth. My throat has always felt harsh and dry. I often get a feeling as if there is something stuck.  This has been a daily occurrence several times a day for about 26 years.   I have had severe heartburn and a pretty uncomfortable stomach for quite some time.  The situation was noticed by a few family members and peers when it started and I was teased greatly for it. I have always been embarrassed about the situation and have never seen a Doctor.  In the past 3 months I have noticed at the bottom of my neck right where the collarbone is located that both sides are swollen like two little balloons or sacs. There is no pain associated with them. Additionally I have been having a numbness and cold feeling on the left side of my neck from the back of my jawbone down to the left side where it is swollen.  I am not sure if it is associated but have been having severe constipation with stool that is very hard and looks like a bunch of grapes clumped together. (sorry for the description of that)  For the past 5-6 months I have had extreme lower back pain left and right side that seems to most prevalent at night. I often feel the need to urinate at night. It feels like I am poisoned or very toxic at night or when I wake in the mourning. Urination sometimes seems like it relieves the feeling at times.  Aside from all of this I have recently had severe fatigue.   As for past history I have always been pretty healthy. I did however have a period of about 8 years of alcohol and prescription (opioid) addiction.   I have not engaged in either for just over seven years now.  Any suggestions would be appreciated.  Thank you\n\n",
    "posted_time": "Post  by whatsupdoc » Tue Jan 13, 2009 3:20 pm",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=68179&sid=085434dc42f4e235962b2508376ffd8a#p68179"
  },
  {
    "author": "S.WILLIAMS,RN  Nurse Posts: 51 Joined: Wed Jan 14, 2009 5:56 pm Gender: Female",
    "title": "Re: Damage to Esophagus",
    "content": "You have been enduring this problem for 26 years, that's a long time so to you now it's your norm.  but it's not normal.  Chronic reflux can cause not only inflammation in the tissues of the esophogus it can also cause strictures to form.   Reflux if severe and left untreated can also lead to a precancerous condition called Barretts esophogus.  I really think that you should see a gastroenterologist so they can do a EGD if you have not already had one recently.  It also sounds like you may have a hiatal hernia (this is when a portion of the stomach pops up through the diaphragm into the chest cavity) the only way to determine the actual condition and the state of severity is to see the GI doctor.   Some things you can do to help alleviate some of the symptoms are to not eat or drink for 4 hours before bed.  Elevate the head of your bed.  Avoid carbonated beverages, alcohol, caffiene and foods that you know cause you to have increased indigestion ( most people complain from peppers, onions, acidic foods like tomato sauces etc.)  You can also try some Prilosec OTC to help with the symptoms but you still need to see the doctor.    I really don't know what to tell you about your swelling....I'm not familiar with that, nor with your back pain.   Please follow up as I've suggested, it is very important !   Please let us know how you're doing peace,\n\n",
    "posted_time": "Post  by S.WILLIAMS,RN » Fri Jan 23, 2009 8:48 pm",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=69556&sid=085434dc42f4e235962b2508376ffd8a#p69556"
  },
  {
    "author": "JustMe  Guest Posts: 7 Joined: Fri Jul 22, 2005 6:54 pm Location: Georgia",
    "title": "Lump in throat",
    "content": "Brief history...I smoke.  I smoked for 10 years, quit for 5 and have been smoking again for about 4 years.  I am a white female, age 39.  I have what feels like a lump in my throat.  I went to the doc back in February and discussed the lump as well as cronic heart burn.  I underwent an Upper GI which came back clear,(no peptic ulcer, no damage to my esophagus, no hernia)  but showed I have reflux.  The doc put me on Prevacid and my sympoms cleared up, however....the lump has returned.  I started getting a little breakthrough acid, so I started supplementing with Pepcid AC, which I have OK'd with my doctor.  I also take Flonaise and sometimes a decongestant or Alavert  as I have allergies.  I have been under some stress and recently quit my job, as that was the primary cause of my stresses.  The family and I took a vacation and the lump went away while we were on vacation, but has since returned.  The lump was so bad this morning that I vomited, because I felt I was being gagged.  I found this information on the internet and was wondering if someone could read it and tell me if this could be what it is.  I do not have any symptoms of cancer (I used to suffer from some minor hoarseness, but that has since cleared up and I haven't had that problem in several weeks) no unexplaned weight loss, no coughing up blood or anything like that.  My mother thinks it is post nasal drip, but I can't be sure.  Can you check out this web sight and let me know if this is legit, as it describes my symptoms to a T.  The lump disappears when I sleep and when I eat, it comes back after eating and shortly after I wake up in the morning.  http://www.voicedoctor.net/therapy/cps.html  Thanks for any information.\n\n",
    "posted_time": "Post  by JustMe » Thu Jun 28, 2007 3:54 pm",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=43840&sid=085434dc42f4e235962b2508376ffd8a#p43840"
  },
  {
    "author": "Marceline F, RN  Nurse Posts: 229 Joined: Wed Feb 28, 2007 1:54 am",
    "title": "[no title]",
    "content": "Dear JustMe, Very well written information.  I am always happy to acknowledge skilled and caring medical professionals!   Based on what you posted, it is indeed possible that you may be experiencing cricopharyngeal spasms.   It is also possible that the added stressors you have been having lately has caused this flare up of incidences.  ( Of special note in this favor is the fact that while being away on vacation - having fun - and relaxing, you did not have an episode.) You may wish to explore stress relieving techniques, and if an underlying anxiety plagues you, ask your Doctor if an anxiolytic may be of value.  I applaud you for doing your best to work with your primary care physician in managing your reflux!\n\n",
    "posted_time": "Post  by Marceline F, RN » Mon Jul 02, 2007 2:50 am",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=43880&sid=085434dc42f4e235962b2508376ffd8a#p43880"
  },
  {
    "author": "jojokdz  Guest Posts: 1 Joined: Sat Dec 27, 2008 8:21 am Gender: Female",
    "title": "Re: Lump in throat",
    "content": "I found this very interesting.  I am 56 yrs. old and have suffered with Gerd/ acid reflux for 15 yrs.  I can remember back in the \"80's sometime complaining of this lump in my throat thing.  But as I have gotten older it seems to come on moreso.  I had a upper/lower scope done 4 yrs. ago.  I have IBS and they suspected Barrett's but after the pathology report came back it was negative to the Barrett's.  Now Jan. 9th I am going back for both once again and I am terrifed because of the Barrett;s thing.!  I have a lump sensation all the time.  My food does occasionally get stuck.  It never comes back up but it takes a while sometimes to go down.  I was suppose to go for motiltiy testing but never did.  I am under extreme stress here.  My husband was diagnosed with lung cancer and is not doing good.  I have a child with handicapps which keeps me moving all the time.  And I work with children with handicapps all day long.  I can't help but think of the \"C\" word when it comes to my symptoms..  JO\n\n",
    "posted_time": "Post  by jojokdz » Sat Dec 27, 2008 9:00 am",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=66013&sid=085434dc42f4e235962b2508376ffd8a#p66013"
  },
  {
    "author": "joahsmom  Guest Posts: 2 Joined: Wed Oct 29, 2008 4:34 pm Gender: Female",
    "title": "Desperate for answers:Dad diagnosed with Esophageal Cancer",
    "content": "Hello. Just recently (Oct. 28th 2008) My 49 year old father went in for an endoscopy and a colonoscopy. The endoscopy was due to difficulty swallowing food. He has had the symptom for about a month. The colonoscopy was just routine, due to a high incidence of stomach/lymphoma cancer in the family. (Dad's oldest brother died several years ago from cancer, his next oldest brother found out that he had cancer about 4 years ago, and has undergone chemo and a few lymph node removals. He is cancer free right now but they keep close check on him and he visits his doctor regularly. My grandmother, was diagnosed with lung cancer 4 months ago at the age of 78, and she passed away last month.)      After my dad was brought back from the procedures we waited for the doctor. She came in and told us that she was not able to dilate the Esophagus because she found two hard masses close the the gasterointestinal junction. She said it looked like cancer. She said that while she was in there she took a biopsy. Of course my mother and I were devastated. My dad on the other hand has peace. He is a Baptist minister and knows that it's all in God's hands. Dr. Richardson said that there were two steps that she wanted daddy to take. 1) CT/Pet scan. (she wanted it done that day but they weren't able to schedule it that day. so they scheduled it for next monday. when we got home she called and said that she got daddy scheduled at another place for this Thursday instead.) 2) Special ultrasound of the Esophagus. We asked about his colon and stomach and she said that the stomach looked fine. Nothing at all in there, and she removed 3 minor polyps from his colon.       I guess my question is, does this sound very bad? I mean to us (my mother and I), it's the end of the world. Can a Gastro Dr. be certain of cancer? Is she rushing these tests because it looked very bad in there? I am grasping at any kind of reassurance I suppose. Some direction. I believe that God can heal my father as well, but he may use the Dr's to do it. What do we do? I am 31 years old and my daddy is my world. I have a 4 year old son that worships the ground my dad walks on. They are buddies. My son's father gave up his parental rights long ago, so my dad is the only father my son knows. He wants to be around to see him grow up and we need him so much. I'm sure this story is far from unique, but please can you help us? Tell us something? I am desperate.   We want the best for daddy and I have researched many many hours trying to find the best location for his treatment. I'm sure you wouldn't be able to be specific about his condition without the test results/labs, but is this something that  can  be treated even if it has spread? All of the research that I have done makes this cancer look very deadly, and the prognosis for most people is very poor. I am looking for a champion. Please can you help us?\n\n",
    "posted_time": "Post  by joahsmom » Wed Oct 29, 2008 4:39 pm",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=62622&sid=085434dc42f4e235962b2508376ffd8a#p62622"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "Re: Desperate for answers:Dad diagnosed with Esophageal Cancer",
    "content": "Hello, I understand your worry and hope that my answer to your questions will be helpful.  First, with endoscopy your doctor can visualize lesions in the esophagus or the stomach and get an idea about how likely these lesions are of malignant origin. Biopsy taken during endoscopic study is diagnostic.  The critical part in managing patients who are proved to have malignant disease is proper staging. The treatment primarily bases on the clinical staging which means how much the tumour has spread outside its organ of origin.  Staging in esophageal or gastroesophageal cancers is done by CT scan of the chest, abdomen, and pelvis, PET CT-scan and endoscopic US in addition to evaluation of different body systems.  Patients are then categorized into two main groups resectable or unresectable (locally advanced or metastatic).The general condition affects the treatment decision in both groups.  Surgery is the treatment of choice in patients with localized resectable disease but other options like chemo-radiotherapy exists also. Systemic therapy in the form of chemotherapy is used to treat patients with metastatic disease or those with localized disease as a preoperative or postoperative therapy to improve patients’ results including their survival.  So different treatment approaches are available based on the clinical staging and the general condition. His doctor is not in rush to do these tests, as you can see staging is the primary step in management and if surgery is a possibility the sooner the better.  I assume that your father’s general condition is good enough to tolerate all these options otherwise his doctor would not be concerned doing all these tests to properly evaluate him for further management. And this is a good point to start with. Prognosis (survival and disease control) is mainly stage dependent in addition to other contributing factors. Those with localized disease are expected to have their disease controlled and survive longer than those with metastatic disease.  I would advise you to follow up with your father’s doctor; obviously she is trying her best to make sure he will receive his proper treatment soon. We all hope it turns out that the lesion is either benign or at most at its early stage.  Hope you find this information useful. Please keep us updated. Best regards.\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Fri Oct 31, 2008 6:19 pm",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=62818&sid=085434dc42f4e235962b2508376ffd8a#p62818"
  },
  {
    "author": "joahsmom  Guest Posts: 2 Joined: Wed Oct 29, 2008 4:34 pm Gender: Female",
    "title": "Re: Desperate for answers:Dad diagnosed with Esophageal Cancer",
    "content": "Thank you so much for your timely reply. We received a phone call today with the results of the CT/PET scan. She said that it had spread to the lymph nodes surrounding his esophagus, and there appeared to be tumors in other areas, but that the CT/PET radiologist that gave the report wasn't completely sure because it was hard to see, so she is sending him to an oncologist on Monday and for the Endo. Ultrasound on Tuesday. My question is, if it has spread to other areas, is this automatically a death sentence or is that treated in the same way a localized tumor would be treated...just in multiple areas? Thank you so much and I will keep you updated.  Stacey\n\n",
    "posted_time": "Post  by joahsmom » Fri Oct 31, 2008 10:28 pm",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=62837&sid=085434dc42f4e235962b2508376ffd8a#p62837"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "Re: Desperate for answers:Dad diagnosed with Esophageal Cancer",
    "content": "Hello,  Having a better idea about the disease, the treatment options and its limitations would make you more hopeful and also ready to deal with the situation and its consequences. Being hopeful will be for sure very supportive and encouraging to your father and your family, so try to keep this in mind.   There are still treatment options if his tumour has spread outside the oesophagus. Surgery is still an option even if some lymph nodes are involved (regional) and no major blood vessel or other organ involvement.  If the tumour is irresectable or metastatic to other organs, he will receive systemic chemotherapy aiming to palliate his symptoms and to control the disease from progression. Although cure is not expected there are still a variety of chemotherapeutic agents that are known to be active in oesophageal cancer.   Newly approved chemotherapeutic agents in metastatic oesophageal cancer have shown an improvement in both response rate and survival. About 15% of patients with advanced disease live for 5 years after systemic therapy and the majority survive for about a year.  Please understand that this is general information about the disease and no appropriate estimation for your father’s condition can be reached until all his complete work up results are out.  I would advise you to follow up with his doctor and to discuss with him all your concerns. Hope you find this information useful. Best regards.\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Sat Nov 01, 2008 2:55 pm",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=62888&sid=085434dc42f4e235962b2508376ffd8a#p62888"
  },
  {
    "author": "JuliaC  Guest Posts: 2 Joined: Fri Feb 22, 2008 2:18 pm Gender: Female",
    "title": "Esophageal Cancer Treatment by Radiation Only",
    "content": "My father, age 69, was diagnosed with Stage 1 esophageal cancer.  He has elected only radiation therapy, although CT/RT was recommended (he is not a candidate for surgery).  I have read in various publications that RT is considered palliative and that 3- and 5-year survival rates are 0% for patients receiving only RT.  Is this accurate even for Stage 1?  I appreciate your time and look forward to your response.\n\n",
    "posted_time": "Post  by JuliaC » Fri Feb 22, 2008 2:31 pm",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=54160&sid=085434dc42f4e235962b2508376ffd8a#p54160"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "Re: Esophageal Cancer Treatment by Radiation Only",
    "content": "Hello JuliaC,  I am sorry to hear about your father's diagnosis. Cancer usually strikes at old age and this greatly limits the options for adequate therapy, even when such therapy is available.  As you have mentioned, combined modality therapy with chemotherapy, radiotherapy and surgery is the preferred method to treat many early cases. However, as in the case of your father, they may not be optimal for all patients. That said, however, the role of radiation therapy alone in early stage esophageal cancer is not obsolete. As regards survival data, I have done my best to include references below from the literature. You fill find a survival range of approximately 30% to 20% at 3 years and 5 years respectively for early stages of esophageal cancer. Please also note that most of these landmark studies were done before the era of combined modality therapy and that, on a more optimistic note, modern methods of RT dosing, and delivery offer better therapeutic results.  Again, although stage is the most important prognostic factor for esophageal cancer, there are still many other prognostic factors that are not yet fully understood. Those include, the pathology (squamous cell carcinoma vs adenocarcinoma), location (cervical, thoracic or gastroesophageal) as well as less well understood molecular parameters. All these factors can influence prognosis as well as the incidence and pattern of recurrence (local recurrence vs metastasis).  In the preliminary results of a Chinese study presented at the American Society of Clinical Oncology (ASCO) 2006 meeting the use of modern RT alone (three-dimensional conformal RT [3D-CRT], intensity modulated RT [IMRT]) was associated with a 3 and 5 year survival of 61 and 37 percent, respectively. This was not significantly different from those in the same trial that received surgery alone (56 and 35 percent, respectively). These are promising early results and although they have not yet been advocated for general application (e.g. these patients had squamous cell carcinoma of the esophagus) they certainly emphasize the value of RT in the treatment of esophageal cancers.  I have collected for you the most important references on the subject to the best of my knowledge and I urge you to discuss this further with his doctor:  References: ========== Earlam R; Cunha-Melo JR. Oesophogeal squamous cell carcinomas: II. A critical view of radiotherapy. Br J Surg 1980 Jul;67(7):457-61.  Choi, NC. The role of radiation therapy in the management of malignant neoplasms of the esophagus. In: Current Therapy in Cardiothoracic Surgery, Grillo, HC, Austen, WG, Wilkins, EW Jr (Eds), BC Decker Inc., Toronto 1989. p.197.  Sykes AJ; Burt PA; Slevin NJ; Stout R; Marrs JE. Radical radiotherapy for carcinoma of the oesophagus: an effective alternative to surgery. Radiother Oncol 1998 Jul;48(1):15-21.  Choi, NC. Carcinoma of the esophagus. In: Clinical Radiation Oncology: Indications, Techniques, Results. Wang, CC (Ed), Wiley-Liss, New York 2000. p.333.  Shioyama Y; Nakamura K; Sasaki T; Ooga S; Urashima Y; Kimura M; Uehara S; Terashima H; Honda H. Clinical results of radiation therapy for stage I esophageal cancer: a single institutional experience. Am J Clin Oncol 2005 Feb;28(1):75-80.  Yu, J, Ren, R, Sun, X, et al. A randomized clinical study of surgery versus radiotherapy in the treatment of resectable esophageal cancer (abstract). J Clin Oncol 2006; 24:181s. (Abstract available online at http://www.asco.org/portal/site/ASCO/me ... 730ad1RCRD, accessed October 6, 2006).\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Sat Feb 23, 2008 5:36 am",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=54198&sid=085434dc42f4e235962b2508376ffd8a#p54198"
  },
  {
    "author": "kisleysa  Guest Posts: 2 Joined: Sun Sep 30, 2007 1:51 pm",
    "title": "Primary Esophagial / Mets Liver",
    "content": "My primary tumor is undifferentiated for the last 2.5 years. The secondary Liver involvement has grown from 1cm to 3cm as evidenced between quarterly CT Scans. Liver tumor is in the corner of the right lobe. PET is scheduled for tomorrow. What are the benefits from resection, possibilities? With primary under control, non-surgically, what other possibilities for control of the secondary Liver involvement are out there?\n\n",
    "posted_time": "Post  by kisleysa » Sun Sep 30, 2007 2:01 pm",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=48436&sid=085434dc42f4e235962b2508376ffd8a#p48436"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Hello,  That is a very specific and confusing question. While surgical resection for limited liver metastases in colorectal cancer has been shown to have a survival benefit, it was unclear whether this would offer patients with other cancers a similar benefit.  Recently, there is some data to suggest that resection of limited liver metastases in conditions such as esophageal cancer may offer benefit when the primary disease is under control. It would differ according to the patient's condition.  Since you appear to be a very smart person, I would suggest that you ask your doctor to supply you with more details on the reasons for his decision.  Be sure to keep this post updated.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Sat Oct 20, 2007 10:11 pm",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=49196&sid=085434dc42f4e235962b2508376ffd8a#p49196"
  },
  {
    "author": "kisleysa  Guest Posts: 2 Joined: Sun Sep 30, 2007 1:51 pm",
    "title": "Further evidence of a second liver site",
    "content": "Age - 49 Sex - M PD - EC w/mets to Liver PS - None FH - (2) cases EC (1) Heart Disease CM - Gabbapentin, Celebrex, Prevacid  Last PET showed the secondary involvement in the Liver to be a new tumor located near vena cava while initial tumor does appear dead.  Primary location with follow-up EDG shows a positive mass approximately 1cm.   Plan is to reduce liver site with chemo, resect primary site with radical esophajectpmy. Allow time for recovery and then resect tumor locations in the liver.  Although this appears to be a radical and somewhat heroic action, with no other metastic sites viewable this might offer the best chance for extended life while we continue to watch for additional disease. During the esophajectomy there will be an opportunity to first look for node involvement. If everything appears sedentary, the operation will continue.  I will keep you posted, Steve\n\n",
    "posted_time": "Post  by kisleysa » Sun Oct 21, 2007 8:55 pm",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=49272&sid=085434dc42f4e235962b2508376ffd8a#p49272"
  },
  {
    "author": "jennifer1b  Guest Posts: 12 Joined: Fri Jun 01, 2007 9:35 am",
    "title": "barrett's esophagus treatment  before cancer occurs?",
    "content": "I am a 63 year old female. I take meds for blood pressure, gerd and cholesterol.  Recently I have been diagnosed with barrett's esophagus.  My gastroenterologist says to be checked every 2 years, my primary doctor says to go back in 1 year.  Can I do something now while I am healthy enough to cure this?  How long does it take to turn into cancer?  If it was you, what would you do?\n\n",
    "posted_time": "Post  by jennifer1b » Sun Aug 19, 2007 6:08 pm",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=46575&sid=085434dc42f4e235962b2508376ffd8a#p46575"
  },
  {
    "author": "btdawgh  Guest Posts: 6 Joined: Sun Nov 13, 2005 8:50 pm Location: USA",
    "title": "Barrets treatment question",
    "content": "I am a female 60 years old. I am not a doctor. My Barrets was found by accident.Dr.was going to do Colon probe and said may as well go down throat as well. I did not have symtoms  related to Esph. He found Barrets cells but it was not cancer. I went to large cancer hospital where they wanted to do MAJOR surgery to Esph.to remove Barrets cells.I was told lots of people get Barrets but lots of people don't get cancer. I had a tube down my throat to measure acid or something .when I learned by accident of Investigational study being down out of state. I sent my records to them,they said come be part of study.The study is NOW, FDA approved.That dr. was and is VERY aggressive and believes ANY Barrets should be removed and does NOT have the wait and see attitude. This technique is using a Yag Laser to burn ONLY the Barrets tissue..where as the Cancer hospital wanted to remove the entire Esph. I go every six months to my local dr..he burns the returning Barrets in a different way. I have gone to out of town dr.over the past 12 years a few times as well.  My advice (or what worked for me since we can't  give advice here) is don't wait and see...the sooner the Barrets is removed the better and even with the Yag Laser the less Barrets present the faster the recovery. You are lucky PDT is now approved by most insurance companies. Good luck..I hope this helped a little.\n\n",
    "posted_time": "Post  by btdawgh » Sun Sep 02, 2007 4:36 am",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=47206&sid=085434dc42f4e235962b2508376ffd8a#p47206"
  },
  {
    "author": "sunny82  Guest Posts: 1 Joined: Tue Jul 24, 2007 2:33 pm",
    "title": "Spot on lung for esophogeal cancer \"survivor\"",
    "content": "My father age 55, was diagnosed with Stage IV esophogeal cancer in Aug. 2005.  Starting Sep. 05, underwent chemo/radiation treatment at the Cleveland Clinic. In Nov. 05, test came back clear, no cancer, subsequent test in Jan., Mar. Jun., and Sep. 06 also came back clear. My father moved to AZ from Cleve. OH in June of 2006, and flew back for the Sep. 06 tests.  (while there, visited with family sat around campfire, helped son with fixing up attic).  Right after the test and visiting with family in Sept., he got severly ill for two weeks with flu-like symptoms. When returned to AZ he was tested for Valley fever (results negative) and got a chest X-ray. Chest X-ray showed spot on lung.  Went to new Drs. here in AZ and they said it was cancer returned (no biopsy done - just CT and PET in Jan. 07) and has has been on Carbo/Taxol Chemo since Jan. 07. Chemo has lowered SUV counts since Jan. report, but still \"lit up\" in spot on lung and original esopho spot (this will most likely always light up, was my impression from docs). Chest X-ray has never been looked at by any of his onc. docs. Last month, sister-in-law in Cleveland was diagnosed with histoplasmosis, after dealing with pain, fatigue, soreness, for a long time. Could my father also have gotten histoplasmosis (spores kicked up from hanging around campfire, etc.?), and is being treated incorrectly for return of cancer? Also, researched internet and \"granulomatosis\" (sp?) was another diagnosis that fit his symptoms.  My understanding is that these things can only be dx by specific test, however, would that spot \"light up\" if it wasn't cancer?\n\n",
    "posted_time": "Post  by sunny82 » Tue Jul 24, 2007 2:54 pm",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=45159&sid=085434dc42f4e235962b2508376ffd8a#p45159"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Sunny82,  It is appropriate that your father was tested for valley fever (coccidiomycosis).  To formally exclude cocci, if the first blood test was negative it should be repeated in 6-8 weeks to see if it has become positive.  If it is still negative, cocci is unlikely.  Histoplasmosis can act identically to cocci and is found very commonly in the Ohio river valley area.  It may be that your father's oncologists are following tumor markers in his blood.  If they are elevated it is almost certainly going to be a cancer recurrence.  Cocci or Histo would not be expected to increase specific tumor marker levels.  To formally determine exactly what the spot is your father probably needs a biopsy of the area.  It may be that your father's oncologists have enough information from other studies that they feel the risk of the biopsy is not needed.  I would recommend your father talk with his doctor about doing some testing for Histo and repeat cocci testing if it hasn't been done.  He should also inquire about the need for a biopsy (and the risks/benefits of doing so).  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Tue Jul 31, 2007 4:15 pm",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=45557&sid=085434dc42f4e235962b2508376ffd8a#p45557"
  },
  {
    "author": "darkestdays30  Guest Posts: 77 Joined: Wed May 02, 2007 9:43 am",
    "title": "Hiccups that won't stop & puked up blood",
    "content": "Last night I went to the ER because of pain from kidney stones I have. They injected me with a pain narcotic (said to be stronger than morphine) and an anti-inflammatory. I was told it wouldn't go through my stomach. I have barrett's esophagitis, gastritis, & GERD, so I was concerned.  It gave me the hiccups. I came home & started throwing up & it had spots of blood in it. Now I have had the hiccups for 16 minutes straight. I've heard that's a sure sign of esophageal cancer but it didn't start happening until after I went to the ER last night. Though I have vomitted blood & had it in my stools for 2 mths (nasogastric lavage verified that it was from my upper GI tract). I don't have anemia so my doctor isn't going to try to find out why I'm bleeding. Is small spots of blood in vomit really nothing to worry about? It was ALOT worse in my bowels. Are these hiccups related to an esophageal problem or could it just be a side effect from the medication?  Any thoughts?\n\n",
    "posted_time": "Post  by darkestdays30 » Sun May 27, 2007 9:35 am",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=42999&sid=085434dc42f4e235962b2508376ffd8a#p42999"
  },
  {
    "author": "Marceline F, RN  Nurse Posts: 229 Joined: Wed Feb 28, 2007 1:54 am",
    "title": "[no title]",
    "content": "Dear Darkestdays30, Dilaudid has an infrequent reputation for causing hiccups for some people.  Dilaudid is frequently used for the relief of Kidney stone pain, coupled with Toradol (an IV/IM NSAID - intravenous/intramuscular non-steroidal anti-inflammatory) which also can have a side effect of hiccups in some people.  Unless you are able to definitively determine if either one of these medications was the culprit for you, you may be wise to list both of them as having adverse effect for you.  As far as the bleeding is concerned, I am guessing that the heaving and vomiting that may have been triggered either by the pain of the kidney stones or nausea from the pain medicine, may have irritated your already irritated and compromised esophagus, causing the small amount of bleeding.  I am surmising by the fact that they did not hospitalize you, that the stones must have measured <3mm.  I suggest you increase your intake of water to help float the stones out, so that you do not need to go back to the ER for a repeat episode.\n\n",
    "posted_time": "Post  by Marceline F, RN » Wed Jul 04, 2007 9:37 am",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=43921&sid=085434dc42f4e235962b2508376ffd8a#p43921"
  },
  {
    "author": "wesman200098  Guest Posts: 19 Joined: Sat Dec 09, 2006 9:24 pm",
    "title": "Bump on Back of Throat",
    "content": "I am 25 male, ideal weight, don't smoke, don't drink, and fairly healthy.  Late last week, I discovered a small bump on the back of my throat behind my tonsil.  It is the same color as my flesh; however, it is quite small, and it hasn't changed in any size over the past week.  I was wondering what this could be, whether it could be caused by allergies, a virus, or something more serious.  It is on the flesh of the wall, as it moves with my throat. I have never noticed it before, and I haven't noticed any other symptoms like difficulty with swallowing, hoarseness, etc.  There looks like there maybe some other small bumps on the other side of the throat as well, but this one is the only one that is really noticeable.   I am just recovering from allergies and a sinus infection, so I just went to the doctor 3 weeks ago.  I am headed back to the doctor in 3 weeks for a check-up on my sinuses and allergies (that he wanted to do).  I will bring this up to him if it is still there, but in the meantime, I just wanted to know if I should be concerned about this.    I am also headed to the dentist next week for a filling, so I assume that if he doesn't say anything about it, then there really isn't a concern.  Just curious, what are your thoughts and advice?  Thank you.  One other question as well.  As it may seem, I am a kind of a hypochondriac.  If anything minors occurs, I think of the worst.  What can I do about this?  Can a doctor or counseling help?  I drive myself nuts sometimes over nothing.  You always hear about all these dreadful diseases and illnesses, and then somehow I think of a correlation between my symptoms and an illness that I just heard of, and it drives me nuts because then I think that I have this illness.  You always hear that early detection is the key, and so I think that anything minor is a big deal.  I go through stages like this when sometimes I don't worry about anything, and then other times I feel as if I am dying.  Any advice would be much appreciated.  Thanks.\n\n",
    "posted_time": "Post  by wesman200098 » Fri Jun 22, 2007 8:11 am",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=43768&sid=085434dc42f4e235962b2508376ffd8a#p43768"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Your bump is probably normal.  Often, in the back of the throat, there will be some bumps as you are describing that do not cause any problems and are not considered abnormal.  It may also be that the infection you had caused a small bump to appear.  If so, it should go away in a few weeks at the most.  Your doctor should be able to evaluate this and give you an answer.  Regarding the hypochondriasis, this is quite common to some extent.  If it is interfering with your life, counseling is often quite helpful.  Medications can be used in severe forms.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Tue Jul 03, 2007 12:04 pm",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=43900&sid=085434dc42f4e235962b2508376ffd8a#p43900"
  },
  {
    "author": "WorriedTim  Guest Posts: 1 Joined: Fri Apr 27, 2007 12:43 pm",
    "title": "Hoarse Voice",
    "content": "I am a 29 year old male. I have no family history of throat cancer. I had my tonsils removed when I was 6. I have been a singer since I can remember. I got a very bad cold in October of 2006  that lasted about 1 month and my voice became hoarse. Well now it is almost May of 07 and my voice is still hoarse. I have no pain in my throat. No ear pain no weight loss just a hoarse throat. I used to smoke but I quit. I used to drink but I quit drinking a long time ago. I am healthy I run several miles a day and have no other symptoms. I am scared about my voice I would love for it to clear up but it is not. Do you have any idea what it could be and what I should do for it? Oh I am also not taking any medications.\n\n",
    "posted_time": "Post  by WorriedTim » Fri Apr 27, 2007 12:59 pm",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=41546&sid=085434dc42f4e235962b2508376ffd8a#p41546"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "I would recommend that you see an ear, nose and throat specialist.  It is possible that you have some paralysis of your vocal cords.  This can happen if there is damage to the recurrent laryngeal nerve that runs along the neck.    A severe infection could potentially cause inflammation that would do this although I would not expect it to last so long.  If there is some scarring that is pushing on the nerve it could last for a long time.    The ENT specialist may want to put a small camera down into your upper airway to look at the vocal cords and see if they are moving properly or if there is any indication of what may be going on.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Mon May 28, 2007 2:25 pm",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=43014&sid=085434dc42f4e235962b2508376ffd8a#p43014"
  },
  {
    "author": "blue5476  Guest Posts: 1 Joined: Fri Apr 27, 2007 12:36 pm",
    "title": "Swollen lymph node and ear ache",
    "content": "I am 23 year old female. Recently I have been waking up with a tight throat and dull ear pain on my left side. I also noticed that my lymph node next to my throat under my chin is swollen. It is movable and I think a bit tender. I don't think it is hard. My throat can also get soar from time to time. I do not have any sinus drainage. Can you tell me why this would be happening?\n\n",
    "posted_time": "Post  by blue5476 » Fri Apr 27, 2007 12:46 pm",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=41545&sid=085434dc42f4e235962b2508376ffd8a#p41545"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Your symptoms are consistent with a viral infection or possibly a bacterial infection of the lymph node.  If your symptoms are not improving, or are getting worse, over the next few days I would recommend you be seen by your doctor.  The bacterial infections sometimes need antibiotics to clear up.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Mon May 28, 2007 2:21 pm",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=43013&sid=085434dc42f4e235962b2508376ffd8a#p43013"
  },
  {
    "author": "babyblueeyes156  Guest Posts: 25 Joined: Sat Dec 09, 2006 10:00 pm",
    "title": "Question about Endoscopy",
    "content": "I had an endoscopy done and had been constipated for 5 days (no bowel movements whatsover), and drank some sprite before the test though I wasn't supposed to, but hadn't eat anything since the night before. Would this in anyway affect the test results as in not seeing everything clearly? I was diagnosed with Barrett's esophagitis & mild gastritis, which doesn't explain the epigastric pain I'm having (doctor said all she saw was some irritation, which has been a chronic problem anyways, it never hurt me like this before). Can't eat without getting sick, can't even drink a glass of milk as it caused bloating, pain, & regurgitation. Really need to know if this test would of been accurate. Please let me know. Thank you.\n\n",
    "posted_time": "Post  by babyblueeyes156 » Sat Feb 24, 2007 8:55 pm",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=38984&sid=085434dc42f4e235962b2508376ffd8a#p38984"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Drinking the sprite would be unlikely to cause problems with the endoscopy.  Generally, with upper endoscopies the main reason to not eat or drink is so that anesthesia is safer.  The stomach empties liquids fairly quickly so chances are it had completely passed through the stomach before the endoscopy any way.    I suspect that your GI doctor took some biopsies during the endoscopy as well.  This will be helpful to look for inflammation or other processes that may be going on.  If the direct visual exam didn't show much it is still possible that the biopsies will.    Your symptoms sound like a food intolerance, such as lactose intolerance.  Gastritis is possible also.  Sounds like your on the right track to finding the cause if you are already seeing a GI specialist.  Best wishes.  Hope this helps.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sat Feb 24, 2007 9:14 pm",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=38986&sid=085434dc42f4e235962b2508376ffd8a#p38986"
  },
  {
    "author": "babyblueeyes156  Guest Posts: 25 Joined: Sat Dec 09, 2006 10:00 pm",
    "title": "[no title]",
    "content": "Yes I had biopsies and it showed Barrett's Esophagitis and mild Gastritis. I am glad to know the test would still be accurate considering, that is very helpful. I've had reflux and chronic inflammation ongoing for 5 years but it never hurt me like this. As far as the milk goes, I rarely ever drink it. With the food intolerance, would that make me sick from everything I eat? The only thing I can manage to not hurt me worse is crackers. I do have some type of allergy because I was put on Allegra-D for my sinuses as they wouldn't clear up & I tried everything else, but this is the only medication that really helped. But it doesn't help the epigastric pain. I'm having nausea, regurgitation w) puking, pressure/pain/burning in my esophagus & chest, food starting to get stuck, epigastric pain (intensifies with food), and recently burning in my belly where the epigastric pain is. The esophagus problems didn't start until Tuesday (sometime after the endoscopy). My gastroenterologist said she thought this was from irritable bowel but the constipation has been very well controlled for quite sometime with medication I take for it. So I can't help but to find that absolutely ridiculous. Could my stomach be so irritated that it would cause these problems? That's what it feels like but it doesn't add up cause she said all she saw was some irritation and didn't seem to think this was causing my problems, I don't know how bad the Barrett's was, but the gastritis was just mild. So I figure the inflammation in my esophagus was probley no worse. I don't know why she didn't want to prescribe me any more meds other than the aciphex but I am at the point that I will not eat again considering how much pain it causes. Would it hurt to just eat crackers? Mylanta anacid helps the pain but not enough that I'd be willing to continue to eat.\n\n",
    "posted_time": "Post  by babyblueeyes156 » Sun Feb 25, 2007 6:04 am",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=38993&sid=085434dc42f4e235962b2508376ffd8a#p38993"
  },
  {
    "author": "babyblueeyes156  Guest Posts: 25 Joined: Sat Dec 09, 2006 10:00 pm",
    "title": "[no title]",
    "content": "I have one more question. I really hope you don't mind. Just curious about drug allergies. Could that be a possible problem and not to die from it? When this epigastric pain started, I overdosed 4 mths ago on a bottle of Promethazine. Then 2 mths ago, got to where I couldn't eat without getting sick. The reason I wonder about this is because I went to the ER last night and they gave me 3 shots of medication, which dried my nasal passages up really bad and gave me a dry cotton taste in my mouth. Last night when I woke up with epigastric pain & burning, I took the Mylanta and it calmed the pain down but not long after started having spasms which made it all worse. I have a tendancy to get nauseas from my meds but never thought it may be a problem. I figured I just take too many and it doesn't settle well with my tummy. My nasal passages are still really dry and the Allegra typically stops all of my sinus problems as long as I take it on schedule. It's because of a pain narcotic that I developed reflux (fentanyl).\n\n",
    "posted_time": "Post  by babyblueeyes156 » Sun Feb 25, 2007 6:44 am",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=38994&sid=085434dc42f4e235962b2508376ffd8a#p38994"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "There are a few things about your biopsy/endoscopy that make me think your pain is in fact reflux related.  While you may have only mild gastritis, the presence of Barrett's esophagus indicates a relatively larger degree of reflux is occuring.  Barrett's esophagus is essentially a change in the esophageal mucosa into mucosa more like the stomach in response to being \"washed\" in stomach acid repeatedly.    Your symptoms being exacerbated by eating as well as the mylanta helping some also support more severe reflux.  Generally, an acid blocker known as a proton pump inhibitor (PPI) is the appropriate treatment for acid reflux.  (Aciphex is a PPI.)  Occasionally, the PPI is simply not sufficient enough.  In those cases, one may wish to try a different PPI with the possibility that it may work better (probably not, but it may be worth a try).  Also, there is a surgical procedure known as a fundoplication in which the stomach is wrapped around the esophagus to help prevent reflux.  Patients may get a significant amount of relief with this procedure; however, it is a surgery and does have some important side effects that must be considered.  So, generally surgery is a last option when medications fail.    You may want to talk with your GI doctor about having a 24 hour pH probe done.  This is the \"gold standard\" for measuring reflux and can help determine how severe reflux is and if surgery may be needed.  Most surgeons will want a pH probe before doing a fundoplication.  After reconsidering your symptoms I think food allergies are less likely as are things like lactose intolerance.  In reference to your medicine question, some medicines can exacerbate reflux as well as gastritis.  This would be good to discuss with your doctor as well.  Hope this helps.  Keep us updated.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sun Feb 25, 2007 5:02 pm",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=39006&sid=085434dc42f4e235962b2508376ffd8a#p39006"
  },
  {
    "author": "babyblueeyes156  Guest Posts: 25 Joined: Sat Dec 09, 2006 10:00 pm",
    "title": "[no title]",
    "content": "I'll ask about the 24 hour pH so if the acid is severe, at least I'd know why I feel this way. I don't see surgery happening not that I would care but I think if they took this seriously, they'd admit me in the hospital instead of leaving me like this. I'd really rather not sit here and die from starvation. I can't even hardly tolerate liquid now. Everything hurts my belly. But thank you very much for the help. It's causing me alot of anxiety & is really relieving to be able to talk to someone about it that responded with a logical answer. Thanks so much.\n\n",
    "posted_time": "Post  by babyblueeyes156 » Sun Feb 25, 2007 6:53 pm",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=39010&sid=085434dc42f4e235962b2508376ffd8a#p39010"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Glad to be of help.  With issues like this persistence is key.  Keep following up with your doctor until you get the answers you need.  Sometimes we are able to better recognize a cause when we have the benefit of seeing the illness develop/progress.  I hope you feel better soon.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sun Feb 25, 2007 11:38 pm",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=39019&sid=085434dc42f4e235962b2508376ffd8a#p39019"
  },
  {
    "author": "babyblueeyes156  Guest Posts: 25 Joined: Sat Dec 09, 2006 10:00 pm",
    "title": "[no title]",
    "content": "I started burning in my epigastric area and decided to quit taking Aciphex since it wasn't helping and started using Zantac 75. This extremely reduces my pain. It still hurts to eat but I can tolerate certain small snacks. The regurgitation is coming from the epigastric area (starts in if it's pressed on / or if I lay on it). Too much acid there, right? You was right about reflux being the problem. I'm going to keep my calorie intake low for awhile since it makes the reflux so bad and maybe this will get better in time. It is amazing to just be feeling this much better. I still hurts but I can tolerate it now. Thank you again for the help. It made the difference.\n\n",
    "posted_time": "Post  by babyblueeyes156 » Tue Feb 27, 2007 12:09 pm",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=39042&sid=085434dc42f4e235962b2508376ffd8a#p39042"
  },
  {
    "author": "babyblueeyes156  Guest Posts: 25 Joined: Sat Dec 09, 2006 10:00 pm",
    "title": "Bleeding?",
    "content": "My bowels have turned very dark over the past 3 days. My abdominal pain is coming back (in epigastric area). Zantac is still helping but not quite as well as the begin with. The only thing I know I took that may have caused a problem is Medrol (after 2 days, I stopped using it). I can't help but think my esophagus may be bleeding now. If it is, is it something that will go away on it's own?\n\n",
    "posted_time": "Post  by babyblueeyes156 » Tue Mar 13, 2007 4:28 pm",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=39559&sid=085434dc42f4e235962b2508376ffd8a#p39559"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Dark stools are certainly concerning for bleeding in the upper part of the intestines (esophagus, stomach or upper intestine).  Medrol can cause the stomach lining to be more susceptible to the acid in the stomach, potentially causing a bleed.  I would recommend that you see your doctor.  If this is bleeding it may be mild and will heal on its own; however, GI bleeds can be quite severe and can be persistent.  You may benefit from a medication called sucralfate which is supposed to bind to irritated areas in the stomach and help them heal.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Wed Mar 14, 2007 12:45 am",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=39563&sid=085434dc42f4e235962b2508376ffd8a#p39563"
  },
  {
    "author": "purplerose  Guest Posts: 1 Joined: Thu Dec 14, 2006 10:57 am",
    "title": "Having a hard time eating",
    "content": "Hi, I am a 28 year old female with no known medical problems. I am not on any medication. I am a smoker and have been for 16 years and I am also over weight. This started about a year ago and in the last few monthes has gotton worse. I cant seem to eat meat or bread with out chocking, i have perfected the self hymlik because now it seems that whatever i eat unless in verry small protions i cant seem to get down. Its like it gets stuck not in my troat but at the bottom of the neck. I have stoped eating meat all togeather for fear of chocking to death. I don't have the money to go to the doctor but i was wondering if anyone knew what could cause this. I don't know if this is any way related to the above issue but i am also very tired all the time and seem to be short of breath when i do eat or do anything at all some days i don't even have the energy to get out of bed. Any advise would be greatly appreciated.\n\n",
    "posted_time": "Post  by purplerose » Tue Jan 30, 2007 3:27 pm",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=38224&sid=085434dc42f4e235962b2508376ffd8a#p38224"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Hello,  There are many causes of esophageal dysphagia. You can view a list of causes for this condition on our dysphagia page: click here!.  This is a serious symptom that requires immediate and direct medical attention. This is especially the case when the symptoms are progressive.   Please keep us updated.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Tue Jan 30, 2007 5:59 pm",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=38229&sid=085434dc42f4e235962b2508376ffd8a#p38229"
  },
  {
    "author": "Emit444  Guest Posts: 1 Joined: Fri Oct 21, 2005 7:40 pm Location: Millbury MA.",
    "title": "Bad Taste in Mouth",
    "content": "I am a 57 year old female, I am not on any Med's. But I continue having this problem. My mouth feels like I am sucking on a lemon all the time.If I bite into food, it feels like I just bit into a lemon. I did a little research online and I don't have dry mouth, but I do have more saliva than usual. Thank you\n\n",
    "posted_time": "Post  by Emit444 » Fri Oct 21, 2005 7:44 pm",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=23845&sid=085434dc42f4e235962b2508376ffd8a#p23845"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Dear Emit444,  Episodic hypersalivation and abnormal taste can be seen in many conditions including: - Gastroesophageal reflux (GER).  - Hiatus hernia. The mechanism is believed to be through the esophagosalivary reflex mediated by vagal afferents and the stimulus is the irritant content of the stomach on the esophagus. This aims to neutralize the acidic contents of the stomach with the alkaline secretions of the salivary glands  In addition to, -Most of the  problems in the mouth such as dental decay, ulcers or tonsillitis result in increased production of the saliva .  -CNS control plays an important role in the regulation of salivation, thus psychological factors like anxiety or excitement also play a role in the increased production of saliva.  A small stone in the duct of the salivary gland gives a similar picture.  I advise you to be checked by your consultant to receive the proper medical care.  Best regards,\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Fri Jul 14, 2006 7:55 pm",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=33421&sid=085434dc42f4e235962b2508376ffd8a#p33421"
  },
  {
    "author": "Bobby Darin  Guest Posts: 1 Joined: Sun Nov 27, 2005 5:46 pm Location: canada",
    "title": "I need help",
    "content": "Hello.  About 2 weeks ago I had the \"Flu\".  It was very violent, and I vomited for 8 days, at least 5 times a day.  the week later, I noticed my throat had developed some \"Lumps\" .   Last week I noticed a foul smell.  I rubbed a Q-Tip on one, and was shocked because the lumps now have holes in them that are filled with a white puss.  Once I rubbed it out of the holes they began to bleed.  The scarey thing is they do not hurt.  I went to the Dr's on friday, and she said its just \"strep\" throat, but she didnt even swab them or nothing.       So could anyone please tell me what might be wrong with me, and what to do?  I am very nervous, and afraid right now, so any help is greatly appreciated.\n\n",
    "posted_time": "Post  by Bobby Darin » Sun Nov 27, 2005 6:00 pm",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=25735&sid=085434dc42f4e235962b2508376ffd8a#p25735"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Dear Bobby Darin,  White lesions on the tonsils, are most probably due to either an infection with a bacteria named group A streptococci  or a virus Epstein-Barr virus (EBV).  - These conditions are usually associated with fever, and in the case of the bacterial infection, obviously a coarse of antibiotic would help in treating the condition. In the case of streptococcal infection, a simple throat swab and culture would define the causative agent.   - Exudative pharyngitis due to  EBV is usually confusing with group A streptococcal pharyngitis, to add more difficulty in the diagnosis concomitant infection of both agents occurs in 30% of people. Sore throat, perhaps a strep throat that doesn't get better with antibiotics is due to EBV infection.  However other physical and clinical signs are characteristic to EBV infection would help the physician to differentiate between these two causes. Moreover, specific serological tests,(detection of antigens and or antibodies to a specific antigen from the infecting agent  like as the monospot and heterophile antibody tests can help in the diagnosis of CMV infections.  I advise you to follow up with your doctor, and update her with any symptoms. You can discuss with her also the possible benefit of doing specific investigations if the condition did not improve or recurred.  Best regards,\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Fri Jul 14, 2006 7:23 pm",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=33420&sid=085434dc42f4e235962b2508376ffd8a#p33420"
  },
  {
    "author": "orangebird  Guest Posts: 1 Joined: Sun Jan 01, 2006 7:49 pm Location: DC",
    "title": "over a year...",
    "content": "Last October I went to the doctor w/ a swollen lymph node behind my ear, fatigue, nausea, weight loss, and bruising. Within a couple of weeks I wasn't able to swallow solid food (food would get stuck in my throat and it would take several swallows and lots of liquid to get it down). I was unable to eat solid food from Nov-March. I had ENT, blood work, two barrium swallows, and visits with a speech pathologist, gastrointerology, neck/throat, etc. All they could find was that there was no obstruction and for some reason things (including water) weren't going down normally. I got frustrated and started doing herbal cleanses, immune boosters, etc. Eventually I could swallow food and I just tried to move on. It went ok for a couple of months and then started back up again. I have numerous swollen lymph nodes, I'm cold all the time, very tired all the time, achy, nauseous, and am starting to have trouble with solid food. It's going down but I cough and choke when I try to eat normal portions. My doctor ran blood tests again and they were normal. But I'm having trouble keeping up at work now, and I feel miserable. Should I go to another doctor? Or is this not something I should be worried about? I don't know if this is relevant at all (or it might just be a fluke as I don't drink usually) but last night (New Years) I had two martinis and since then I have a soreness under my ribs on the left side. I have a glass of wine here and there at dinners but it has been a month or so. I would appreciate any advice as I'm getting desperate to get my life back. Thank you. Oh btw, I'm a 24 year old female.\n\n",
    "posted_time": "Post  by orangebird » Sun Jan 01, 2006 8:01 pm",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=27535&sid=085434dc42f4e235962b2508376ffd8a#p27535"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Dear orangebird,  The commonest causes of swallowing  difficulty include:  - Spastic esophageal motility disorders due to a spasm or In appropriate contraction of the esophagus.  - People with GERD will experience one or more of these symptoms,  swallowing problems  Chest pain,  Pain in the throat,  Morning hoarseness, and  Discomfort in the chest  Others may experience a feeling like the food stuck in their throat or tightness in the throat, dry Cough and Shortness of breath. These symptoms are mainly due to inflammation of the esophagus(esophagitis).  Diagnosis is made by complete history taking, physical examination, investigations like Upper endoscopy, Manometric studies, and other lab tests that can be recommended by the doctor accordingly.   You have done twice the barium swallow, and nothing was found. Endoscopy and  Esophagogastroduodenoscopy are very important to visualize the esophagus and the stomach and to take biopsy if needed.. The fact that you also have Lymph node enlargements and general constitutional symptoms of fatigue weight loss and nausea are indicative of an inflammatory, infectious or malignant cause. Which may be due to repeated or chronic pharyngitis or associated with any inflammatory or malignant GI disease.  One of the most difficult disease to be diagnosed is  Mucosa-associated lymphoid tissue (MALT) lymphoma of the esophagus. A condition that even with endoscopy does not show any particular lesions early in the course of the disease.  Complete blood picture as well as blood chemistry are very helpful and should be done.  One of the most common causes of dysphagia is - Sore throat, it causes throat pain that can be severe and sometimes is felt as a lump or tightness in the throat with difficult swallowing and bad breathing.  Experts says that a sore throat that lasts for longer than a week or recurrent pharyngitis is often caused by allergies, or exposure to humidity, smoking, irritation from heating and cooling systems.  Allergic pharyngitis usually occurs seasonally or all year long and the allergic individual wake up early in the morning with sore throat.  The principal in treatment in such cases is to avoid exposure to the expected allergens as possible.  - Psychological or emotional stress and anxiety, in these cases the diagnosis is made by exclusion of other causes.  My advice to follow up with your doctor, update him with your symptoms, and discuss with him the possible utility of the mentioned investigation in your condition.  Best regards,\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Fri Jul 14, 2006 6:30 pm",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=33419&sid=085434dc42f4e235962b2508376ffd8a#p33419"
  },
  {
    "author": "d_vinity  Guest Posts: 1 Joined: Sat Jan 21, 2006 3:26 pm Location: UTAH",
    "title": "Trouble Swallowing & Swollen Lymph Nodes",
    "content": "Hello, I am a 22 year old female. I had noticed a tightness in my throat and trouble swallowing about a year and a half ago. I had an upper GI barium swallowing study and CT scan. I was told that both looked normal. Then I was given an allergy test to see if I was allergic to any foods, but the only thing I am allergic to is pollen and cats. Not much after these tests I noticed that my lymph nodes were quite swollen. They are still swollen and they have not reduced in size in over a year, yet I haven't really had any colds or sicknesses. It doesn't hurt, but the trouble swallowing has increased. It constantly feels like there is something stuck in my throat. My doctor doesn't really have any other ideas. I am wondering if anyone has any ideas of what this could be and if there are any other tests that I should pursue.   Thanks a lot for your help.  P.S. I don't know if this could be related, but I was a smoker for about 3 years in my teens.\n\n",
    "posted_time": "Post  by d_vinity » Sat Jan 21, 2006 3:57 pm",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=28886&sid=085434dc42f4e235962b2508376ffd8a#p28886"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Dear d_vinity,  Sore throat causes throat pain that can be severe and sometimes is felt as a lump or tightness in the throat with difficult swallowing and bad breathing.   Experts says that a sore throat that lasts for longer than a week or recurrent pharyngitis is often caused by allergies, or exposure to humidity, smoking, irritation from heating and cooling systems.   Allergic pharyngitis usually occurs seasonally or all year long and the allergic individual wake up early in the morning with sore throat.   The principal in treatment in such cases is to avoid exposure to the expected allergens as possible.   Regarding the enlarged lymph nodes LNS,  enlarged LNS due to inflammatory process may decrease in size with time or remain of the same size but they do not disappear completely.  Other possible causes for the swallowing difficulty and the sensation of lump in the throat include:  - (Spastic esophageal motility disorders) Sometimes the same symptoms represents a spasm and In appropriate contraction of the esophagus.  - People with GERD will experience one or more of these symptoms,  swallowing problems  Chest pain,  Pain in the throat,  Morning hoarseness, and  Discomfort in the chest   Others may experience a feeling like the food stuck in their throat or tightness in the throat, dry Cough and Shortness of breath. These symptoms are mainly due to inflammation of the esophagus(esophagus)   Certain foods are known to aggravate the condition, and you better avoid them. These include chocolate, beverages containing caffeine, fatty and fried foods, garlic and onions, spicy and tomato containing foods.   Diagnosis is made by complete history taking, physical examination, investigations like Upper endoscopy, Manometric studies, and other lab tests that can be recommended by the doctor accordingly.  - Psychological or emotional stress and anxiety, in these cases the diagnosis is made by exclusion of other causes.  My advice to follow up with your doctor, update him with your symptoms, by complete history and physical examination, he can recommend the proper medical approach.  Best regards,\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Fri Jul 14, 2006 5:36 pm",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=33416&sid=085434dc42f4e235962b2508376ffd8a#p33416"
  },
  {
    "author": "Carperez  Guest Posts: 1 Joined: Fri Oct 21, 2005 4:05 pm Location: ny",
    "title": "gastroesohageal cancer",
    "content": "I am an MD  not oncologist  with a recurrence of gastroesophageal cancer to bone ater  3 years  I am paralized  by the shock        Dr can u comment   I am in a rial using avastin carboplatin and s1 is tnere anythingnew out there\n\n",
    "posted_time": "Post  by Carperez » Fri Oct 21, 2005 4:37 pm",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=23837&sid=085434dc42f4e235962b2508376ffd8a#p23837"
  },
  {
    "author": "Dr. A. De la Guerra  Medical Doctor Posts: 70 Joined: Fri Aug 26, 2005 8:00 pm Gender: Male Location: Lima, Peru  Contact:   Contact Dr. A. De la Guerra       Yahoo Messenger",
    "title": "[no title]",
    "content": "Dear colleague,  Clinical trials in metastatic gastroesophageal cancer have consistently shown a survival benefit with chemotherapy. Chemotherapy can be given as a single agent or in combination, usually in a cisplatin-containing regimen (like Carboplatin). New drugs that target angiogenesis has been successful in other tumors and is now being tested in esophageal cancer. Bevacizumab (Avastin) is the first anti-angiogenic agent proven to significantly extend survival in a Phase III trial.  I think you are getting the best treatment currently available.  I wish the best for you,  Dr_Torax\n\n",
    "posted_time": "Post  by Dr. A. De la Guerra » Thu Nov 17, 2005 4:54 am",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=25294&sid=085434dc42f4e235962b2508376ffd8a#p25294"
  },
  {
    "author": "sammy777  Guest Posts: 3 Joined: Tue Feb 15, 2005 11:37 am Location: ohio",
    "title": "swallowing problems",
    "content": "I have had problems swallowing for about two years- I've been to the doc's and they did a barrium swallow and x-rays- i've lost 50 pounds because of it and now weigh only 90 lbs- when this started I weighed 140.  When i can eat- I can chew my food - but as soon as I try to swallow- I choke on it/regurgitate- and I get a feeling of combination swollen glands and allergic reaction- a full feeling in the tissues of my neck and fullness in my glands - as well as pain -fullness in chest and extreme weakness/tiredness in my whole body- (every time I try to eat)- it feels like I ran the boston marathon- and all I did was try to get a couple of bites of food down me-( I do not have an eating disorder) and I can only eat during a certain part of the day- (what little amount I can) and \"my window\" is usually 5-6 PM- after that- or before that- it gets really bad and I sometimes cannot drink- I can't drink milk or soda or eat any of my favorite foods- like choc- it chokes me- and the doc's are stumped at what it could be- could you help? thanks !  PS  I'm hungry and I'd like to be able to eat like a normal person\n\n",
    "posted_time": "Post  by sammy777 » Tue Feb 15, 2005 12:16 pm",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=9448&sid=085434dc42f4e235962b2508376ffd8a#p9448"
  },
  {
    "author": "Kathy C, RN  Nurse Posts: 84 Joined: Tue Jan 25, 2005 5:57 am Location: Titusville Florida",
    "title": "[no title]",
    "content": "Hi Sammy, You did not mention what your xrays or barium swallow showed? Ha your physician discussed with  you  any interventions to help  with nutrition? I know it sounds extreme but unless\\untill an answer is found a tube inserted for nutrition may be a way to keep you from loosing anymore weight. Let me know.\n\n",
    "posted_time": "Post  by Kathy C, RN » Wed Feb 16, 2005 6:13 pm",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=9535&sid=085434dc42f4e235962b2508376ffd8a#p9535"
  },
  {
    "author": "sammy777  Guest Posts: 3 Joined: Tue Feb 15, 2005 11:37 am Location: ohio",
    "title": "problems swallowing",
    "content": "Hi- the x-rays and barrium came out normal- and all my lab and bloodwork came back as normal- so I've basically just gotten used to this whole situation- but I'm loosing more weight every week- I've been getting real dizzy and passing out when I stand up and I get very weak and tired -but my doc's say that as long as I can get \"Some\" fluids in me- I'll be fine- I actually ordered IV fluids online so if I get bad- I can just hook up to an IV- but other than that- the docs can't figure it out and don't seem too concerned. I love to eat and have no psyco-or emotional problems and I lead a very happy, healthy lifestyle- I've never had problems swalowing before- but I have had alot of exposure to carbon monoxide- it sounds funny- but somel of the places I've lived  have been found out to have very high concentrations of either black mold or gas leaks/cm.  I've heard that this could be a contributor to these symptoms- is this true?\n\n",
    "posted_time": "Post  by sammy777 » Fri Feb 18, 2005 11:21 am",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=9635&sid=085434dc42f4e235962b2508376ffd8a#p9635"
  },
  {
    "author": "adriana  Guest Posts: 2 Joined: Sun Sep 25, 2005 6:50 pm Location: toronto",
    "title": "Problems Swalllowing-Sammy",
    "content": "Hi Sammy, I had a very similar problem recently, where all of a sudden every time I ate I had a lot of difficulty swallowing and kept choking on my food. My glands would get swollen and it was awful. I started not being able to eat at all. The doctors offered no help and told me that everything appeared fine when I had tests done. I began eating very little, and kept note of times when the swallowing was worse than others.  It has turned out that my swallowing difficulties only arised when I was eating food which contained gluten eg, wheat, pasta, bread etc..BE careful, wheat is in ALOT of foods you wouldnt expect.. like soya sauce, candy etc..  Since i came up with this discovery I have been living gluten free and I've never felt better. I don't know if you've ever considered this, but if you havent, you should really try and cut all gluten/wheat containing products from your diet. Things like Rice and corn are alright, and ther's lots of alternatives and good food to eat for people with this problem. Apparently this is a allergy that you can develop any time in your life. Please let me know what you think about this idea, and if it works for you at all.\n\n",
    "posted_time": "Post  by adriana » Sun Sep 25, 2005 6:57 pm",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=21609&sid=085434dc42f4e235962b2508376ffd8a#p21609"
  },
  {
    "author": "jayson222  Guest Posts: 2 Joined: Fri Aug 26, 2005 12:00 pm Location: florida",
    "title": "Worried about having esophageal cancer",
    "content": "Hello, My wife has had this bump on the left side of her neck on the side of her adams apple area.  she's been having it there for about 4 to 5 days now.  its the size of the tip of my pinky.  not too big and not too small.  when i push it it seems to move a little bit and my wife says it hurts a little bit if i push it hard.  she had a sore throat before noticing this bump.  we are worried it could be some type of cancer.  does anybody know what this could be?  because of hurricane katrina we were told not to leave the house unless it is an absolute emergency.  so we are to wait here until further notice.  if anybody has any idea what this could be please reply to this post.  any information will be of great help.   Thank you very much.\n\n",
    "posted_time": "Post  by jayson222 » Fri Aug 26, 2005 12:17 pm",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=19503&sid=085434dc42f4e235962b2508376ffd8a#p19503"
  },
  {
    "author": "Dr. A. De la Guerra  Medical Doctor Posts: 70 Joined: Fri Aug 26, 2005 8:00 pm Gender: Male Location: Lima, Peru  Contact:   Contact Dr. A. De la Guerra       Yahoo Messenger",
    "title": "Neck bump",
    "content": "Hi jason222,  If your wife had a sore throat, and now she has a little nodule in the neck, and hurts when you touch it, the most probably thing is that you found a reactive lymph node;these are seen frequently with or after head or neck infections. Sometimes, depending on several factors (like type and severity of infection), the reactive lymph nodes can be found in the neck even weeks after the cause is gone. You may be concern if the bump starts growing fast. I don't think you have to worry about it. Hope Katrina goes far away from you.\n\n",
    "posted_time": "Post  by Dr. A. De la Guerra » Fri Aug 26, 2005 9:53 pm",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=19531&sid=085434dc42f4e235962b2508376ffd8a#p19531"
  },
  {
    "author": "darrenthe747  Guest Posts: 2 Joined: Tue Jun 07, 2005 2:05 am Location: Frankfurt, Germany",
    "title": "Feeling when I swallow",
    "content": "In early January I caught the flu that was going around work. During this time I developed a sore pain in the right side of my throat every time I would swallow. The flu cleared up after a week but the pain in my throat remained. It was a very localized pain on my tonsil. After 6 weeks I went to a doctor and they put me on 10 days of an amoxicillan treatment. Very soon after starting the treatment my symptoms disappeared until the treatment ended and the symptoms returned a few days later. The only thing was that the symptoms that returned weren't nearly as bad as before I started the antibiotics. All it was was just a feeling like there was something in or on my tonsil that i could only feel when i swallowed. The doctor said that my tonsil looked a bit \"deformed\" but not swollen. The doctor also said I had a post nasal drip that might be causing it so I was put on clariton. I had general blood tests done and everything came back normal. The symptoms were almost gone but if I stopped taking the clariton they would return. Now (6 months later) I can still feel it a little bit ONLY when I swallow, and for days it might not be there at all, then it will return a little bit for a few days and disappear again for a week or so. Any ideas what this might be? It's starting to really worry me that there are still some symptoms 6 months later. Thanks for any ideas.\n\n",
    "posted_time": "Post  by darrenthe747 » Tue Jun 07, 2005 2:15 am",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=14733&sid=085434dc42f4e235962b2508376ffd8a#p14733"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi darrenthe747, Since your symptoms stay relatively clear while you are taking the clariton and return when you stop taking the medication...I would associate your symptoms to exposure and reactions to allergins. However, if you were to continue to have problems or the symptoms increase in frequency do not hesitate to have a re-evaluation. Sincerely, Rntdj\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Tue Jun 07, 2005 5:23 am",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=14734&sid=085434dc42f4e235962b2508376ffd8a#p14734"
  },
  {
    "author": "darrenthe747  Guest Posts: 2 Joined: Tue Jun 07, 2005 2:05 am Location: Frankfurt, Germany",
    "title": "[no title]",
    "content": "Rntdj, Thanks for your input. I will try going back on the clariton full time, but I am still worried that i never had these problems prior to cathing the flu in january. one doctor speculated that perhaps my tonsil remained infected for so long (6 weeks before going on antibiotics) that perhaps it scarred and the feeling i was having was bacteria caught in tricky places in my tonsil, or perhaps just scarring tissue alone. I can't really seem to find any posts on any forum with the same problems. I have an appointment with an ENT at the end of this month but I would like to have some idea whats going on before I go in so I can not worry so much, or just at least be prepared for something. Thanks. darrenthe747\n\n",
    "posted_time": "Post  by darrenthe747 » Wed Jun 08, 2005 4:04 am",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=14796&sid=085434dc42f4e235962b2508376ffd8a#p14796"
  },
  {
    "author": "Malou Concordia  Guest Posts: 1 Joined: Fri Apr 15, 2005 11:37 am Location: Philippines",
    "title": "Barrett's Esophagus",
    "content": "I just had gastrocolonoscopy.  2 intestinal polyps were removed.  The doctor said that I might have barrett's esophagus so it is now being biopsied.  The doctor gave me Ulcepraz. My question is--is this cancerous?\n\n",
    "posted_time": "Post  by Malou Concordia » Fri Apr 15, 2005 12:09 pm",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=12383&sid=085434dc42f4e235962b2508376ffd8a#p12383"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Hello, Long-term irritation can increase the risk of esophageal cancer. Tissues at the bottom of the esophagus can become irritated if stomach acid frequently \"backs up\" into the esophagus -- a problem called gastric reflux. Over time, cells in the irritated part of the esophagus may change and begin to resemble the cells that line the stomach. This condition, known as Barrett's esophagus, is a premalignant condition that may develop into adenocarcinoma of the esophagus.  Barrett's esophagus leads to adenocarcinoma of the esophagus. It's incidence is increasing worldwide. It is apparently more frequent in white males. The presence of Barrett's esophagus while not a malignant condition in itself increases the risk of developing esophageal cancer 30 to 125 folds the normal population.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Mon Apr 18, 2005 4:26 pm",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=12535&sid=085434dc42f4e235962b2508376ffd8a#p12535"
  },
  {
    "author": "benjimest  Guest Posts: 4 Joined: Tue Jan 25, 2005 9:19 pm Location: Portsmouth, Hampshire, UK",
    "title": "Scared about having Esophageal Cancer",
    "content": "Please help, I'm really confused and scared and worried about having Esopheagal Cancer, I started having an itching feeling in my throat about two weeks ago along with a full feeling in my chest. This started after I was vomiting for a period of 12 hours. I've been diagnosed with depression and I am cancerophobic so maybe I am worrying too soon. I also have increased belching, throat pain (only sometimes) and a fast heart beat.  I'm 24 years old, overweight, non-smoker, non-drinker... I'm really scared.  Thank you.\n\n",
    "posted_time": "Post  by benjimest » Tue Jan 25, 2005 9:26 pm",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8568&sid=085434dc42f4e235962b2508376ffd8a#p8568"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "benjimest, All the symptoms you have described with the exception of vomiting are nonspecific ones. Please refer to this page to learn more about esophageal cancer. You will notice that many of the risk factors do not match with your medical profile. If the vomiting continues then you should consult your doctor right away.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Wed Jan 26, 2005 12:25 am",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8579&sid=085434dc42f4e235962b2508376ffd8a#p8579"
  },
  {
    "author": "steveseek  Guest Posts: 4 Joined: Wed Aug 04, 2004 12:11 pm Location: United States",
    "title": "Can you have barretts without first getting GERD?",
    "content": "Question, can you get Barretts esophagus without getting GERD first? And once you have Barretts, can you get GERD or relapse into GERD?  Thanks!\n\n",
    "posted_time": "Post  by steveseek » Wed Dec 08, 2004 9:29 pm",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6944&sid=085434dc42f4e235962b2508376ffd8a#p6944"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi steveseek, Conditions that might have Barrett's esophagus as a complication, might be potential underlying conditions. The list of conditions listing Barrett's esophagus as a complication includes: Gastroesophageal Reflux Disease ,heartburn ,and hiatal hernias. So yes, in answer to your question from what I've read it is possible to have this condition without first having GERD. GERD needs to be treated to avoid complications.  Sincerely, Rntdj\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Mon Dec 13, 2004 8:44 am",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=7034&sid=085434dc42f4e235962b2508376ffd8a#p7034"
  },
  {
    "author": "tmoonshine  Guest Posts: 2 Joined: Tue Mar 16, 2004 4:13 pm Location: Vassar, MI  Contact:   Contact tmoonshine       Yahoo Messenger   AOL",
    "title": "Esophagogastrectomy with spleen removal",
    "content": "My mother had an esophagogastrectomy in June of 2003. We just recently found out that the majority of her spleen was removed during this surgery. It was never put into any of her records that it was removed, and now the doctor is trying to say that she still has it... but the catscan was reviewed again and it was shown that it was actually removed. My question is one...is it normal for the spleen to be removed in this fashion? And two... isn't it against the law to not put this in her records? Thank you, Tina Spoon\n\n",
    "posted_time": "Post  by tmoonshine » Tue Mar 16, 2004 4:21 pm",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2814&sid=085434dc42f4e235962b2508376ffd8a#p2814"
  },
  {
    "author": "Dr. Jeffrey Gordon  Medical Doctor Posts: 127 Joined: Sun Jan 05, 2003 5:22 pm",
    "title": "Records",
    "content": "Thanks for your question here at The Doctor's Lounge.  First, sometimes the stomach or suroundiong organs are removed if the cancer is involving them or if for safety reasons during the surgery such needs to be done.  I would ask the doctors more questions about the surgery and why the spleen was removed.  I'll defer to my Surgery colleagues here at The Doctor's Lounge to answer this item in more detail than I can do (I am not a Surgeon).  Second,  usually surgery records are detailed, outlining the many steps involved int he surgery.  If you have questions about the surgery records, then again talk with the doctors involved.  I hope that your Mother is recovering well from her surgery.\n\n",
    "posted_time": "Post  by Dr. Jeffrey Gordon » Sun Mar 21, 2004 9:00 am",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2873&sid=085434dc42f4e235962b2508376ffd8a#p2873"
  },
  {
    "author": "tmoonshine  Guest Posts: 2 Joined: Tue Mar 16, 2004 4:13 pm Location: Vassar, MI  Contact:   Contact tmoonshine       Yahoo Messenger   AOL",
    "title": "[no title]",
    "content": "Thanks for the reply. This whole thing is really a mess.  Before surgery, nothing of the spleen was mentioned, not once. And it's my understanding that if they are going to do something with the spleen they need to either have you sign for it before hand, or have a husband (relative)'s permission during surgery. There was none of that.  During the after care, there was also no mention of the spleen. The doctor was a very very bad doctor when it came to the after care and saw my mom for a total of 2 weeks after the surgery... saying that she shouldn't be hurting anymore. They ripped open her tummy and her back for the surgery yet she shouldn't be hurting anymore.  She just went to her surgeon to ask him about the spleen, and basically he tried to sugarcoat everything. He then pointed at some random thing and quickly said it was her spleen. It wasn't because both of the reports that came back said her spleen was barely there and appeared to be removed. He then said he had to cut part of the spleen out for the surgery (the other side of what he said is what was removed), but once again, quickly said that she'd be just fine and she had enough spleen to operate. Basically the whole doctor's visit was a joke and you could tell the doctor was lying and trying to cover things up. He normally has this \"I'm god\" type of personality and this time he had a sense of nervousness in him.  We wouldn't have any problems with this whole thing if he had messed up. If he would have just said... hey we took something out we didn't need to but this is what you need to do to stay healthy... but that didn't happen.  As for her family doctor, he said to talk to a lawyer as soon as possible.  My mom doesn't care about the lawsuit at this point in time, she just wants to know what's wrong with her.\n\n",
    "posted_time": "Post  by tmoonshine » Mon Mar 22, 2004 8:45 am",
    "category": "Oncology",
    "sub_category": "Esophageal Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2884&sid=085434dc42f4e235962b2508376ffd8a#p2884"
  }
]