[
  {
    "author": "Scottishmedic1  Guest Posts: 1 Joined: Thu Jan 08, 2009 8:30 pm Gender: Male",
    "title": "Medical Student seeks advice re gap year(s)",
    "content": "Hey all,  I'm a UK medical student currently half way through my penultimate year.  Increasingly I'm begining to feel over worked and have less break than ever. Times in hospitals are very demanding and I've got exams roughly every 6 weeks and 'portfolio' cases + an essay deadline intersperced even between them. Hollidays have become so short that I'm exiting them feeling I've barely stopped and am so fearful of messsing up my sleeping (due to the shortness of the hollidays) for the early starts that I can hardly do anything during the tiny amount of time I've got off.  Long and short of it is I'm feeling utterly burned out with the workload and the prospect of qualify and stepping into the killer hours of an FY1 and then FY2 doctor over here and getting on the travellator of continuing CSPPD....Kind of feels like I'll step on the trvellator and my youth will evapourate before my very eyes. Not to mention the fact that my father is in his late 70s and I don't know how much time I'll have left to spend with him.  Anyway I've got to the point that I'm seriously considering a gap year after my medical degree. The thing is I'm not sure if the medical career structure permits such things. It would be easy enough with any other degree but can I simply take a year out get a part time job for a few hours a week or something? Will it be possible to get back on the ladder? What steps are necessary to take a gap year/career break from medicine and come back to it later, and what's necessary to facilitate doing this? Will there be long-term career repercussions?  It's not that I don't enjoy medicine - I do - it's just that I'm not ready to give up so much time in what remains of my youth. I want to head out and be young. It's passing, and it won't last forever. I've only got now to do it.  I've thought about perhaps going to visit some bangladeshi doctors I've met here and working at their clinics and hospitals for a month or two, would that do by way of medical experience should it be necessary to show continuing PPD? Certainly I'd get hands-on experience there?  Perhaps I could take a postgraduate(or just enter as an undergraduate) degree in a medical-related subject in a university nearer home when I qualify? Maybe even a differed entry. Mind you I won't get funding from the SAAS to do so for a second degree I think. And fees can cost £16,000 per year....so that's probably out too. Maybe PG fees or some of the part-time diploma qualifications in diabetes and things take a lot less time?  But would not doing much clinical cause problems? I know bangladeshi doctors who spend legthy periods of time over here, the thing is they are studying for MRCS.  And probably worked for a few years first....still perhaps it suggests this is possible?  Anyway I'd be very glad of any and all advice on these matters.  A Scottish Medic.\n\n",
    "posted_time": "Post  by Scottishmedic1 » Thu Jan 08, 2009 8:53 pm",
    "category": "Job Center",
    "sub_category": "Finding a Job",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=67497&sid=4f3548183c405b3523b0a56043008fcb#p67497"
  },
  {
    "author": "recruitment",
    "title": "Recruitment -MNC Speciality Hospital Dubai -U.A.E.",
    "content": "The Client - A MNC speciality Hopsital in Dubai -U.A.E.  A] Medical Consultants  Senior Radiologists -With nuclear ,Interventional Exp.  Infectious Diseases Consultant  Plastic Surgeon .  Senior Resident - Cardiac Surgery  Applicants with post American Board certification or Canadian FRCPC or UK FRCS , 4 to 6 years of experience at a full Consultant level only need apply .Locum tenens or Permanent contracts available for most specialties.  On offer a superb tax free relocation package, benefits generous leave, free hospital accommodation, air tickets and end of service payments .   B] Administration   Medical Secretaries   Director Material Management  Director Marketing & Sales   Director Out patients Clinics   Manager-Sales & Business development .  C] Technical   Cardiology Technicians - EEG technicians .   Applicants to have minimum of 6 yrs of exp in [Govt] Registered Hospitals with relevant educational background .  Do email resume [Word Doc] with your name ,post and current location ,in the  subject line of your email .  Mr Kamal M Mehta  Recruitment Manager/CEO  Reach Consulting  Dubai - U.A.E.  Email   kmehta@experts.ae  Off tel 00971 3350620 [+4 HRS gmt ]  9 TO 5   Saturday to  Wednesday    9 TO 1   Thursday\n\n",
    "posted_time": "Post  by recruitment » Mon May 17, 2004 3:33 am",
    "category": "Job Center",
    "sub_category": "Finding a Job",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3328&sid=4f3548183c405b3523b0a56043008fcb#p3328"
  },
  {
    "author": "sasi_kb36  Guest Posts: 1 Joined: Tue Nov 15, 2005 10:27 pm Location: New Delhi",
    "title": "Medical Secretary",
    "content": "K.B.Sasi Kumar H-5/108, Sector-16, Rohini,  Delhi – 110 085. Mobile No Roaming: 91-9871502198 Office Phone       : 91-11-52999981 E-mail: sasi_kb36@hotmail.com        : sasi_kb36@rediffmail.com  Profile:  More than 15 years of experience as Secretary, Executive Secretary / Medical Secretary in health care and other organizations..  A brief outlook into my personal as well as professional assignments.   Date of Birth\t\t\t\t :\t\t22-06-1966  Place of Birth\t\t\t\t :\t\tKerala, India.  Sex\t\t\t\t\t        :\t\tMale  Nationality\t\t\t\t        :\t\tIndian  Whether valid passport Holder\t\t\t\t\t:\t\tYes (Expiry Date :2010)  EDUCATIONAL QUALIFICATIONS:  1.\tA Bachelor Degree of Arts in Economics from Kerala University 2.\tA diploma holder of Computer applications from Indian Software College, Delhi. 3.\tA certificate holder of Executive Quick Information Technology Program in Computer from Software Technology Group, Delhi. 4.\tAttended Secretarial Practice course at Royal College of Studies, Delhi. 5.\tA diploma holder of Medical Transcription from American Institute of Medical Transcrption.   KNOWLEDGE IN COMPUTER  WindowsXP operations in the area of MS Word, MS Excel, MS PowerPoint Presentation/Slides, MS Photoshop and web related jobs like surfing internet sites, download / upload various information, checking emails and the technical know-how of using Scanner & Fax Machine and CD backup system.   KNOWLEDGE IN TYPING & SHORTHAND  Typing speed in MS Word is 60 words per minute and Shorthand speed is 90 w.p.m.   HealthCare Company “Delhi Heart & Lung Institute”. June,2002 till date.  The Delhi Heart & Lung Institute brings forth to its clients, area physician, and the community state-of-the-art programs in cardiopulmonary disease prevention, urgent cardiopulmonary care, full cardiopulmonary consultative services, complete cardiovascular and pulmonary diagnostic testing and sophisticated cardiac and pulmonary treatments.  •\tWorking as Secretary to Chairman & Managing Director (Director of Cardiothoracic & Vascular Surgery). •\tDealing with office correspondence independently. •\tReminding Chairman about upcoming conference /seminars both domestic and international and its exact schedule month, date,& time. •\tArranging flight tickets to destination of his tour and coordinating with embassy to get visa issued. •\tTo open the Internet sites to check-up e-mails and to ensure important e-mails are put up to the Chairman for his remarks and information. •\tTo ensure all correspondence papers are filed in proper manner and according to proper coding system •\tTo ensure presentation CD done on MS PowerPoint is handed over to the Chairman along with his Laptop before he leaves for any conference or CME. •\tCoordinating with patient, their attendants, fixing appointments, and preparing discharge summaries with utmost compassion & care. •\tAll seminars/conferences pertaining to Chairman’s office are noted and written on a planner in front of his desk as well as upload and download various articles pertaining to diseases from Google search engine for clinical update and all.   •\tAttending heavy telephone calls and making slides on MS PowerPoint and taking print out of day-to-day actionable emails. •\tAdditionally holding the charge to look after External Audit of KPMG for converting the Hospital under ISO 9001-2000.  Also taking supplementary charge of assisting Management Representative to verify the process of IQA and to make sure that all conditions for the ISO requirements are met. •\tAdditionally holding the Accountant charge of Mani Heart Care Pvt.Ltd., chairman’s own company operated at home.  Dealing with money transactions, issuing cheques, deducting TDS, Service Tax from the professional fees of doctors and the employees at home and a lot more.  •\tDiscipline, punctuality, confidentiality, management tactics, loyalty to boss, and customer friendly are the things  a secretary to follow here.  Salary drawing Rs.18,000 + conveyance.      “Company Master Mechanical Works Private Limited. Jan’1999 to May 2002  This company has its birth way back in 1975.  They are the pioneer manufacturers in the field of Automatic & Semi Automatic Bottling Plant, Packaging Machinery for Pharmaceutical Distillery, Pesticides, Foods, Oil Industries and Mineral Water.  They have various branches in India and its headquarter is based at Bombay.    •\tWorked as Executive Secretary to General Manager  •\tMaintained Management Information System and prepared company’s forecast of sales for every year and also maintained all records in connection with sales and purchases and a bit of accounts matter.  •\tAttended telephone and co-ordinated with clients and customers, prepared quotations for various customers etc.  Job was done by way Internet, Telefax, Scanner, MS Word, MS Excel and PowerPoint, Visiting Card Reader entry etc.   Rs.11,000/-  Government Organization Central Reserve Police Force. 1989 to 1999  •\tServed as a Personal Secretary to Dy. Director Administration .   •\tDid all the clerical jobs that were assigned to me. •\tDealt with all official correspondence independently and systematically by maintaining files and took dictation whenever requirement arose.  •\tMaintained all office protocols.    •\tMaintained a diary in which all pending works were noted.   •\tAttended phone calls and liaised with other departments to get the work done. •\tDealt with High Court and Supreme Court Legal cases pertaining to the department in consultation with Deputy Director (Legal), Govt.Counsel and Ministry of Law and lower court cases like Motor Accident Tribunal Cases and District Court cases like filing written statement and dealing with summons etc.  All legal issues were dealt with according to the interest of Union of India and the Central Reserve Department.  •\tDealt with correspondence relating to tour and travel of Officers and arranged their flight tickets and made a planner for their future itinerary etc.   Rs.14,000/-  AN OPTIMISTIC  “Nothing is impossible everything is possible”.  If one is served an opportunity and if he is Workholic, definitely he will prove his ability and quality in a short span of time.  To face challenges boldly and to execute work on a philosophy of \"Excellence\" is my moto and my every deed depends on “Action” and not on “Words”  K.B.Sasi Kumar Date: 14-11-2005 Place: New Delhi\n\n",
    "posted_time": "Post  by sasi_kb36 » Tue Nov 15, 2005 10:31 pm",
    "category": "Job Center",
    "sub_category": "Finding a Job",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=25220&sid=4f3548183c405b3523b0a56043008fcb#p25220"
  },
  {
    "author": "charllie1  Guest Posts: 2 Joined: Fri Feb 09, 2007 6:48 am",
    "title": "Doctor Vacancys World Wide",
    "content": "Professional Placement is a Medical Recruitment company specializing in finding suitable positions for doctors / physicians in all medical fields.  For up-to-date vacancies, please visit our website:   http://www.professionalplacement.co.uk or emails us you CV at info@professionalplacement.co.uk\n\n",
    "posted_time": "Post  by charllie1 » Fri Feb 09, 2007 7:08 am",
    "category": "Job Center",
    "sub_category": "Finding a Job",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=38567&sid=4f3548183c405b3523b0a56043008fcb#p38567"
  },
  {
    "author": "charllie1  Guest Posts: 2 Joined: Fri Feb 09, 2007 6:48 am",
    "title": "Re: Recruitment -MNC Speciality Hospital Dubai -U.A.E.",
    "content": "For up-to-date vacancies, please visit our website:   http://www.professionalplacement.co.uk  or emails us you CV at info@professionalplacement.co.uk  Obstetrics and Gynaecology  Company  Corniche Hospital   Salary  TBA   Location  Abu_Dhabi   Job Ref  UNMD8691   Job Description    Consultant – Obstetrics and Gynaecology   Job Summary The post holder will be required to:  1. Provide patient focused obstetric and gynaecology services and ensure optimal clinical care of patients in the department.  2. Work within a multidisciplinary team with a personalised and caring attitude.  3. Provide leadership, supervision and support to the senior registrars, registrars and residents medical officers (RMOs).  4. Develop, and participate in, a postgraduate training program for the junior medical staff\n\n",
    "posted_time": "Post  by charllie1 » Tue Mar 11, 2008 1:41 am",
    "category": "Job Center",
    "sub_category": "Finding a Job",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=55631&sid=4f3548183c405b3523b0a56043008fcb#p55631"
  },
  {
    "author": "aadams  Guest Posts: 5 Joined: Sat Jun 25, 2005 9:39 am Location: Akron, Ohio  Contact:   Contact aadams       Yahoo Messenger",
    "title": "Tired All the Time",
    "content": "Hi There!  I am a 28 yr. old female. I used to work nights but I have recently switched to a day job. My problem is that I am tired all the time! It's been a little better since I switched to the day job, but I still don't have the energy that I should. I've had this problem ever since I started my period when I was 13. Of course, it's worse when I have my period, but I already know that's becuase I am losing blood. I was tested when I was 14 and again when I had my son at age 20 for anemia and both times they said I was \"Borderline Anemic\", but every time they test my iron, I am just fine, and I haven't taken my iron pills in years. Is there anything else that could possibly be causing me to be so tired all of the time? I get about 7 hours of sleep ea. night, but I don't eat right, and do not exercise....could that be it? Just poor health habits or could it be chronic fatigue? I really hope someone responds to this....this is a constant concern of mine. Thank you for your time.  Sincerely,  Mandy\n\n",
    "posted_time": "Post  by aadams » Sat Jun 25, 2005 10:10 am",
    "category": "Job Center",
    "sub_category": "Finding a Job",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=15811&sid=4f3548183c405b3523b0a56043008fcb#p15811"
  },
  {
    "author": "medicalman  Guest Posts: 17 Joined: Thu Jun 23, 2005 1:41 pm Location: Pittsburgh, PA",
    "title": "[no title]",
    "content": "2 things top the list when thinking about chronic fatigue in a young female. Anemia and Hypothyroidism. As you say you have been tested for anemia and found to be borderline anemic... i would suggest you get another such test for anemia. this could explain your tiredness. also you did not mention if you were losing more blood with your menstrual cycles or not.  in addition do you feel that you have gained weight even though you are eating less? do you feel cold all the time? and have people or yourself noticed that you have some kind of swelling of your neck? these are things that would happen if you were having low thyroid hormones. this is a condition called hypothyroidism. it is fairly common in females of young ages and can be seen with swelling of the thyroid gland. after both of these are ruled out we can think of other problems including depression that can cause chronic fatigue. for now i would suggest that you proceed on these lines. also talk to your physician about yourconcerns. hope this helps.\n\n",
    "posted_time": "Post  by medicalman » Sat Jun 25, 2005 3:39 pm",
    "category": "Job Center",
    "sub_category": "Finding a Job",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=15827&sid=4f3548183c405b3523b0a56043008fcb#p15827"
  },
  {
    "author": "aadams  Guest Posts: 5 Joined: Sat Jun 25, 2005 9:39 am Location: Akron, Ohio  Contact:   Contact aadams       Yahoo Messenger",
    "title": "RE: Tired all the time",
    "content": "Thank you for responding....I hope I am responding in the right place. YES - First of all, I am ALWAYS cold! If it's 65 - 70 degrees, I am freezing! Also, there is a history of some sort of thyroid disease or problems on my Mom's side....my grandmother had problems with that, and she had to have some sort of surgery, I believe for it. Also, yes....I loose a LOT of blood during my mestrual cycles. I usuall spot for about the 1st 2 days, then I bleed so heavy for the next 2 days, that I have to change my tampon about every half hour (and I use the Super-Plus). Then I spot for about a day (sometimes 2 days) after that.  I used to have normal periods, but I went off of the pill about 2 years ago, they've just gotten heavier since then, so I just figured the heavy bleeding was due to that.  And YES - I keep gaining weight no matter what I do. I blew up with my pregnancy gaining 66 pounds, and I've never lost it. I was 120 lbs. when I got pregnant (8 yrs ago), I was 186 lbs. by the time I delivered. I went back down to about 165 lbs. stayed there for a few years, but within the past 2-3 years, I've been gaining, and now I am at about 185 - 190. I have not noticed any swelling in my neck, and neither has anyone else, but I do swell a lot around my calves, ankles and feet. I retain A LOT of water there for some reason, and this has been more recent - like within the past 3-4 months or so. Does this help any? What do you think it could be? And is chronic fatigue not real common in women my age?  Mandy\n\n",
    "posted_time": "Post  by aadams » Sat Jun 25, 2005 5:23 pm",
    "category": "Job Center",
    "sub_category": "Finding a Job",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=15833&sid=4f3548183c405b3523b0a56043008fcb#p15833"
  },
  {
    "author": "medicalman  Guest Posts: 17 Joined: Thu Jun 23, 2005 1:41 pm Location: Pittsburgh, PA",
    "title": "[no title]",
    "content": "I think you should be worked up for Hypothyroidism. That means an underactive thyroid gland. it is measured by a simple test ... the TSH level in the blood.. Meet your doctor as soon as you can and discuss this with him/her. hope this helps\n\n",
    "posted_time": "Post  by medicalman » Sun Jun 26, 2005 9:14 pm",
    "category": "Job Center",
    "sub_category": "Finding a Job",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=15883&sid=4f3548183c405b3523b0a56043008fcb#p15883"
  },
  {
    "author": "beefmerciful  Guest Posts: 3 Joined: Sat Apr 30, 2005 1:03 am Location: leclaire  Contact:   Contact beefmerciful       Website",
    "title": "selective service will draft medical workers",
    "content": "\"An article in The New York Times titled “U.S. Has Contingency Plans for a Draft of Medical Workers” appears, revealing that Widemeyer Communications was hired during the summer to help the SSS prepare an enormous draft of doctors, nurses, and 61 medical specialties. What is not mentioned is that the Medical Draft will be expanded to include medical equipment repairpersons and even medical form processors. SSS spokesman Flavahan says that 36,000 doctors and nurses, more than 1% of the total 3.4 million men and women in the U.S. under the age of 44, are planned to be inducted in the first batch once the Skills Draft is activated, showing the current great need or possibly a future need from new invasions and conquests.\"  Link 1\n\n",
    "posted_time": "Post  by beefmerciful » Sat Apr 30, 2005 1:15 am",
    "category": "Job Center",
    "sub_category": "Finding a Job",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=13138&sid=4f3548183c405b3523b0a56043008fcb#p13138"
  },
  {
    "author": "Rhonda P, CEP  Paramedic Posts: 252 Joined: Wed Mar 16, 2005 8:37 am Gender: Female Location: USA",
    "title": "draft",
    "content": "Hello Beefmerciful,   Thank you for your interest and desire to share your findings. This could be a possibility or maybe not, I encourage anyone interested in the details to do research themselves to verify the details. There are controversies on both sides and you will find pros and cons leaning to right and the left.\n\n",
    "posted_time": "Post  by Rhonda P, CEP » Sat Apr 30, 2005 10:30 am",
    "category": "Job Center",
    "sub_category": "Finding a Job",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=13153&sid=4f3548183c405b3523b0a56043008fcb#p13153"
  },
  {
    "author": "NightOwl  Guest Posts: 1 Joined: Thu Dec 23, 2004 5:35 pm Location: Tx.",
    "title": "Staying up at night,and sleeping during the day",
    "content": "Someone may have already posted a message like this,but i just need some advice on what to do,for some reason i like to stay up late it ranges from sometimes 12-like around 3or4am and i'll sleep all morning until 3pm has been my latest i slept in,and after i get up around that time,i don't feel very energetic,but not sleepy,i have headaches and my eyes really hurt bad,i end up having lines under them,i'm 20 years old,i don't understand why i'm having this problem,please help me on what to do,i want to sleep again at night;this has been happening for a long time now.........thank you i appreciate it if you responded\n\n",
    "posted_time": "Post  by NightOwl » Thu Dec 23, 2004 5:45 pm",
    "category": "Job Center",
    "sub_category": "Finding a Job",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=7306&sid=4f3548183c405b3523b0a56043008fcb#p7306"
  },
  {
    "author": "Emerald  Guest Posts: 3 Joined: Thu Dec 23, 2004 12:26 am Location: Pakistan",
    "title": "[no title]",
    "content": "Dear NightOwl, Nights are for sleeping and Days for working. You say that you don't feel energetic after getting up in the afternoon. This is because the Hormore Cortisol , responsible for making the body able to bear most stress and strains of the day, has its highest concentrations in the morning and lowest in the evening. So naturally you don't feel at your best with low levels of Cortisol.  Also you don't feel sleeping because you still are getting enough sleep, although not at an appropriate time. You did not mention the reason for your being a Night Owl. Is it work, TV, internet or what?  Changing habits takes time. The best way in my opinion is that try not to sleep for 24 hours straight. Then try to sleep at night around 10 pm. In this way since you wil be really sleepy ( cause you have not slept for the last 24 hours), there are great chances that you will got to sleep.  Do not sleep at 3-4 am even if you are really sleepy. Try to sleep at night. I hope that helps. Do tell your progress. I'll be glad to know.\n\n",
    "posted_time": "Post  by Emerald » Fri Dec 24, 2004 12:16 am",
    "category": "Job Center",
    "sub_category": "Finding a Job",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=7311&sid=4f3548183c405b3523b0a56043008fcb#p7311"
  },
  {
    "author": "tata  Guest Posts: 1 Joined: Sun Mar 27, 2005 4:21 am Location: Sweden",
    "title": "not sleeping during the nights",
    "content": "Hi I have this kind of sitiation too. And it makes me very worried about my health and performance. The reason of my not sleeping during tha days is work. And after work  i am going to study at the university. So usually i sleep from 18-00  to 0:00 (6 hours). Could you please write what kind of problems can cause this way of sleeping. Thank you in advance\n\n",
    "posted_time": "Post  by tata » Sun Mar 27, 2005 4:33 am",
    "category": "Job Center",
    "sub_category": "Finding a Job",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=11423&sid=4f3548183c405b3523b0a56043008fcb#p11423"
  }
]