[
  {
    "author": "satadeep  Guest Posts: 1 Joined: Wed Nov 18, 2009 11:10 am Gender: Male",
    "title": "cholangiocarcinoma",
    "content": "My father is 53 years old and has been diagnosed with obstructive jaundice and a stricture in common bile duct. He has been advised to undergo a ca 19-9 test and the result was initially >1000. After about a week he had undergone the test again and the result was >25000. Then a stent was successfully placed in his bile duct to facilitate the flow of bile which had caused his bilirubin to rise to 15. While the stenting was being done the doctor found a stone struck in his bile duct and also found the bile duct narrower than it should be, so he took a brushing from the region  which was sent for a histo-pathology test the result to which was negative. We were then advised to discharge him and bring him back for further treatment after a month and go for regular ca 19-9 and bilirubin tests during the period. As advised we had his blood sample tested and the result showed bilirubin to be 4.2  and ca 19-9 to be >5500 which is less than the previous value. I would be ever indebted if you find time out of your busy schedule to reply me and tell me what inference can be drawn from the above mentioned facts. Thank you\n\n",
    "posted_time": "Post  by satadeep » Wed Nov 18, 2009 11:17 am",
    "category": "Oncology",
    "sub_category": "Gall Bladder Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=87262&sid=51e8c14f77c6886615001cb033442fa5#p87262"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: cholangiocarcinoma",
    "content": "Hi,  You have not indicated if your father has primary sclerosing cholangitis or if he has had any past biliary surgery.   Diagnosing early cholangiocarcinoma (CC) in patients with primary sclerosing cholangitis (PSC) with available radiological modalities is very difficult. This type of tumor is the second most common cause of mortality after liver failure in these patients. One special variety, the 'Klatskin’s tumor', or perihilar cholangiocarcinoma involving the bifurcation of the hepatic duct, accounts for approximately 70% of all bile duct cancers. The recognition of CC is important for the selection of patients for, and the prognosis following liver transplantation.   Tumor markers as a diagnostic tool in diagnosing CC in patients with PSC are unfortunately not as valuable as previously thought. One such tumor marker,Carbohydrate Antigen 19-9 (CA 19-9), has also been studied.   Elevated levels of CA 19-9 are most commonly seen in patients with pancreatic cancer, though it can also be elevated in colonic and gastric cancers. Other non-cancer medical conditions, such as  pancreatitis, cirrhosis, cholangitis, SLE and gallstones can also cause an elevated CA 19-9.    The serum levels of CA 19-9 often rise temporarily in association with episodes of biochemical relapse of PSC (often associated with increased levels of serum alkaline phosphatase).You have not mentioned his 'alkaline phosphatase' levels.    The marker product of CA 19-9 and Carcinoembryonic antigen (CEA) have been found to have a low sensitivity but a relatively high specificity for the detection of CC in PSC patients.  Studies have investigated the use of CA 19-9 in detecting cholangiocarcinoma. However there have run into several problems. It has been difficult to determine how high a CA 19-9 needs to be in order to indicate if a malignancy is present. Part of this difficulty is caused by the fact that biliary stasis, & cholangitis (infection of the bile ducts), which is caused by blockage of the bile ducts, can be associated with both cholangiocarcinoma & benign medical conditions, Hence, in studies of people who do not have active cholangitis or biliary stasis, a cut off of level of 37 U/ml has been proposed by some. However, in people with active cholangitis or biliary stasis a cutoff level of 300-400 U/ml has been used.   Currently, the best use for CA 19-9 may not be as a screening test for cholangiocarcinoma but rather as a means to check if the disease is responding to treatments(by comparing with base-line values).It has a 'negative predictive value' of approximately 90% (meaning it is more useful to exclude cancer).  Patients with unresectable cholangiocarcinoma have been noted to have significantly greater mean CA 19-9 concentrations compared to patients with resectable cholangiocarcinomas. The highest levels of CA 19-9 are generally seen in cancers of the exocrine pancreas.  In your father's case,the levels were certainly very high. CA 19-9 concentration has been seen to be highly correlated to the tumor size in most pancreatic cancers. Did they find any suspicious lesion in his pancreas? As the levels had been very high, although the brush biopsy was 'benign', follow up is needed to see how that 'stricture' behaves and also the pancreas needs watching.  18F-FDG PET/CT has been reported to be highly useful by some in this kind of situation.   Best wishes!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Sun Dec 20, 2009 7:33 pm",
    "category": "Oncology",
    "sub_category": "Gall Bladder Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=89515&sid=51e8c14f77c6886615001cb033442fa5#p89515"
  },
  {
    "author": "GeeGee05  Guest Posts: 1 Joined: Fri Mar 11, 2005 7:04 pm Location: Ind",
    "title": "Gall Bladder  polyps",
    "content": "I had a couple test done last week on my gall bladder  ,the ultra sound showed a polyp in my gall bladder & a thickening of the walls what exactly does this mean?     I go back to my Dr next week .\n\n",
    "posted_time": "Post  by GeeGee05 » Fri Mar 11, 2005 7:21 pm",
    "category": "Oncology",
    "sub_category": "Gall Bladder Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=10689&sid=51e8c14f77c6886615001cb033442fa5#p10689"
  },
  {
    "author": "pinkprincess1055  Guest Posts: 3 Joined: Sat Sep 24, 2005 10:42 am Location: manassas va  Contact:   Contact pinkprincess1055       AOL",
    "title": "tired of feeling like this...",
    "content": "hi everyone, my name is Amy and i am 19. I just had an upper GI series done because i have been feeling sick for almost 5 months now. Its a horrible nausea/pain feeling and it just wont go away no matter what meds. im on or anything. i was wondering if anyone has or know someone who has gone through this. i also have excema on my hands and wrists and get headaches really often. someone please help!!!!!\n\n",
    "posted_time": "Post  by pinkprincess1055 » Sat Sep 24, 2005 10:47 am",
    "category": "Oncology",
    "sub_category": "Gall Bladder Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=21498&sid=51e8c14f77c6886615001cb033442fa5#p21498"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: Gall Bladder  polyps",
    "content": "Hi Amy,  The first thing you should do is to exclude food allergies as you have head aches as well as eczema.  Some of the foods which should be under  immediate suspicion are alcoholic drinks(especially red wine), mono sodium glutamate,nuts, cheeses, chocolates,pineapple,malt whiskeys,wheat, caffine and sugar.  Give it a serious thought and try excluding one by one.... needs patience! No harm in trying!!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Wed Nov 04, 2009 11:25 am",
    "category": "Oncology",
    "sub_category": "Gall Bladder Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=85876&sid=51e8c14f77c6886615001cb033442fa5#p85876"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: Gall Bladder  polyps",
    "content": "Hi GeeGee05, Most polyps of the gall bladder are benign.If they are larger than 1 cm, then the risk of a malignant change is higher. Adenomyomatosis & Cholesterolosis are two prominent causes of polyps of the gall bladder. From your description, adenomyomatosis of the gall bladder is more likely. Adenomyomatosis is due to proliferation of subsurface cellular layer of the gall bladder mucosa, characteristic finding being of 'Rokitansky-Aschoff sinuses', which are out pouching of the mucosa into the  muscle layer .. So, once again most polyps of the gall bladder are benign, most polyps less than 1 cm are likely to be benign. Polyps more than 1cm and polyps occuring in persons over 50 years of age should be viewed with suspicion. Good day!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Wed Nov 04, 2009 11:52 am",
    "category": "Oncology",
    "sub_category": "Gall Bladder Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=85879&sid=51e8c14f77c6886615001cb033442fa5#p85879"
  },
  {
    "author": "Abe Gipson  Guest Posts: 1 Joined: Mon Apr 16, 2007 9:03 pm",
    "title": "weight loss, boyles on scalp and green looking vomite",
    "content": "My mother-in law is 64 and over the past 3 weeks has had several unexplained symptoms. First of she has very high blood pressure which she is on medication for and has been for years. She is tired all the time and very weak. Two weeks ago she has 3 or 4 boyles in the top of her head which the doctor lanced and put her on antibiotics. Then she started losing weight and appetite. Today she vomited green looking stuff and her bowl movement was black looking. She holds her stomach alot like she is in pain but tells us it doesn't hurt. I think she doesn't want us to worry about her. Let me know if any of these symptoms ring a bell with you. thanks Kim[\n\n",
    "posted_time": "Post  by Abe Gipson » Mon Apr 16, 2007 9:41 pm",
    "category": "Oncology",
    "sub_category": "Gall Bladder Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=40883&sid=51e8c14f77c6886615001cb033442fa5#p40883"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "I would strongly recommend that your Mother-in-law follow up with her doctor soon.    Her green vomiting may be indicative of an intestinal blockage.  The black stools may also be indicative of bleeding in her intestinal tract.  This would also explain the fatigue if she has been loosing enough blood.  Her symptoms are concerning and she should probably have some imaging studies and blood tests to help figure out what is going on.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sun Apr 22, 2007 10:21 pm",
    "category": "Oncology",
    "sub_category": "Gall Bladder Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=41234&sid=51e8c14f77c6886615001cb033442fa5#p41234"
  },
  {
    "author": "jypsy_rose_lee  Guest Posts: 17 Joined: Sat Jan 14, 2006 9:47 pm Location: Missouri",
    "title": "Gallbladder / High Dose Chemo",
    "content": "Dear doc,                   I was wondering if high dose chemo that consists of { Decadron,high-dose ara-c,and cisplatinum with rituximab givin for four straight days 24 hours aday can cause the gallbladder to shut down? If so are there any websites that I can find any information pertaining to this? Thank you very much.\n\n",
    "posted_time": "Post  by jypsy_rose_lee » Tue Apr 04, 2006 9:19 pm",
    "category": "Oncology",
    "sub_category": "Gall Bladder Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=32290&sid=51e8c14f77c6886615001cb033442fa5#p32290"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Hello,  What exactly do you mean by gall bladder shut down? There are hepatic (liver) toxic effects to many chemotherapeutics. Liver toxicity is reported in some of the drugs you mentioned.  Best regards,\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Fri Dec 22, 2006 6:50 am",
    "category": "Oncology",
    "sub_category": "Gall Bladder Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=36638&sid=51e8c14f77c6886615001cb033442fa5#p36638"
  },
  {
    "author": "wendy logan  Guest Posts: 3 Joined: Tue Sep 07, 2004 6:27 am Location: australia",
    "title": "spleenectomy",
    "content": "I HAD A SPLEENECTOMY AFTER A CAR ACCIDENT LAST YEAR. THIS YEAR TO DATE I HAVE HAD 12 COURSES OF ANTIBIOTICS. I HAVE HAD THE NECESSARY VACINATIONS, BUT I SEEM TO BE SICK ALL THE TIME . HAS ANYONE ANY IDEAS?\n\n",
    "posted_time": "Post  by wendy logan » Wed Sep 08, 2004 6:04 am",
    "category": "Oncology",
    "sub_category": "Gall Bladder Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5194&sid=51e8c14f77c6886615001cb033442fa5#p5194"
  },
  {
    "author": "LITLBIT  Guest Posts: 1 Joined: Mon Jan 24, 2005 8:13 am Location: AUSTIN, KY",
    "title": "SPLEENECTOMY",
    "content": "HI WENDY, I HOPE YOU FIND AN ANSWER. MY SON HAD DONE THE SAME THING AND HE IS A NURSE, HE HAD  HIS REMOVED AND ALL THE VACCINATIONS ALSO. HE SEEMS TO GET SICK EASY. IF YO FIND AN ANSWER LET ME KNOW. HE THINKS HE NEEDS TO GET OUT OF THE MEDICAL FIELD BUT I WAS TOLD YOU CAN LIVE A NORMAL LIFE IF YOU KEEP UP WITH YOUR SHOTS, IF YOU FIND OUT LET ME KNOW. THANKS SHANNON EMAIL---    LITLBIT5654@AOL.COM\n\n",
    "posted_time": "Post  by LITLBIT » Mon Jan 24, 2005 8:33 am",
    "category": "Oncology",
    "sub_category": "Gall Bladder Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8494&sid=51e8c14f77c6886615001cb033442fa5#p8494"
  },
  {
    "author": "sladecol  Guest Posts: 1 Joined: Sun Jan 23, 2005 7:53 pm Location: Louisiana",
    "title": "Polyps found while removing gall bladder",
    "content": "Hi,    I was trying to find out some information on a word that I can only figure out part of.  The word is cyclodocoli....  I recently had my gall bladder removed and while the doctor was removing it orthoscopicly he noticed a polyp.  He said that he could not tell if it was coming off of the small intestines or the pancreas or pancreatic duct.  He said if it was the small intestines that it was common and nothing to worry about.  He said it was called diverticulitis.  On the other hand, if it was on the pancreas or pancreatic duct that it would have to be removed, because it would turn into cancer.  Could you please tell me what the word is above that I can't read the rest of the writing on.  And also what does that mean?  How serious is this?  Thanks so much for your time and may God Bless You for what you are doing for people.\n\n",
    "posted_time": "Post  by sladecol » Sun Jan 23, 2005 8:02 pm",
    "category": "Oncology",
    "sub_category": "Gall Bladder Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8460&sid=51e8c14f77c6886615001cb033442fa5#p8460"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "The term refers to gallstones. Could you post the context in which it appears. You can find more info on gallstones by clicking here!.  What does your doctor intend to do about the polyp? Has he taken a biopsy? Has he scheduled you for one?  Best regards,\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Mon Jan 24, 2005 1:14 am",
    "category": "Oncology",
    "sub_category": "Gall Bladder Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8472&sid=51e8c14f77c6886615001cb033442fa5#p8472"
  },
  {
    "author": "Guest",
    "title": "Calcified mass in Gall bladder",
    "content": "Hi,  What do we know about calcified masses in the gall blader?\n\n",
    "posted_time": "Post  by Guest » Wed May 21, 2003 2:35 am",
    "category": "Oncology",
    "sub_category": "Gall Bladder Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=768&sid=51e8c14f77c6886615001cb033442fa5#p768"
  },
  {
    "author": "Dr. Jeffrey Gordon  Medical Doctor Posts: 127 Joined: Sun Jan 05, 2003 5:22 pm",
    "title": "Gallbladder",
    "content": "I am not certain what you mean to ask in your recent post.  A calcified mass in the gallbladder does not imply a cancer, but does raise suspicion as to what it is.  A gallbladder that has thickened or irregular walls with calcium in it can be seen with  gallbladder cancers (the so-called porcelain gallbladder).  Gallstones can at times contain calcium and are not cancers.  There is an association between gallstones and gallbladder cancer, especially if a solitary and large gallstone is present.  It is not uncommon for a gallbladder surgery to be performed for gallstone disease or an inflammed gallbladder and a gallbladder cancer is found.  However, the flipside of all of this is that most people with gallstones or who undergo gallbladder surgery for an inflammed gallbladder do not have cancer.\n\n",
    "posted_time": "Post  by Dr. Jeffrey Gordon » Mon May 26, 2003 6:20 pm",
    "category": "Oncology",
    "sub_category": "Gall Bladder Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=820&sid=51e8c14f77c6886615001cb033442fa5#p820"
  }
]