[
  {
    "author": "edput  Guest Posts: 2 Joined: Sun May 31, 2009 10:10 am Gender: Female",
    "title": "Podocytes leaks Protein  in the Bowman's space",
    "content": "I probably should have been more proactive in my daughter’s earlier years of health; I have been going with the flow.  Now I am becoming Google educated in Nephrology. I have a whole new appreciation and respect for your field of science. My 12 yr old daughter, Samantha, is in the 97 percentile, is in normal health, and no previous surgery.   In 2002, Samantha had routine urine test and Hematuria was reported. Later in 2002 Sam had a UTI. A VCUG was performed with results negative and an ultrasound reported as normal.  I assume all was fine.  In 2008 during a routine physical, Hematuria was reported again.  (Note: My wife had Gestational Diabetes during the pregnancy.) Four more urine tests were performed and a 24hr urine test. The urine tests consistently reported Hematuria (RBC 3-4 / HPF), mild Proteinuria  - negative traces of protein, and bacteria.  The 24 hour urine test showed protein results of 365 MH/24.   Met with a Nephrologist and the recommendation was a kidney biopsy because he couldn’t be sure it’s Postural Proteinuria. We were given two of the three biopsy results (the electronic microscope is outsourced and due in a few weeks). The light microscope showed minimal abnormalities. He reported some protein around the cell, no scaring, or sign of inflammation. The fluorescent test showed some protein deposit at the glomerulus capillary.  All of my google-mation does not help me reduce the list of possible kidney diseases. I think minimal change disease is ruled out because of the light microscope protein. I think it rules out FSGS because no scarring was found, unless the biopsy didn’t hit the focal.  It seems to indicate the Podocytes leaking into the Bowmans’ space.  I really don’t know what to rule out or rule in.  And what happened to Hematuria? Any help would be appreciated. Regards\n\n",
    "posted_time": "Post  by edput » Tue Jun 02, 2009 3:29 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Glomerulonephritis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=80348&sid=5db97697d2d9162063e7af977f42b7ce#p80348"
  },
  {
    "author": "droamen  Guest Posts: 3 Joined: Wed May 20, 2009 9:08 am Gender: Female",
    "title": "APSGN",
    "content": "I have a 7 year old son who a few years ago had poststrep glomerulonephritis, well that is originally what they doctors thought.  Following that infection they noticed blood and protein in the urine that was still present a year later.  They sent him to nephrologist that did some tests and saw that he had a low C3 level.  I guess the doctor assumed that it would clear up on its own.  Well it has been a 1 1/2 years since that and we went back to specialist as he has continued to have abnormal UA's.  Most recently he had large amount microscopic hematuria, trace protien, and low C3 level.  So now the doctors are ruling out the original diagnosis as this has been going on for years.  I am wondering what they are thinking this could be, and I also wonder if a child could have all this going on and it turn out to be nothing.  He doesn't seem to have any other sypmtoms (ie: HTN, edema, etc...) other than frequent lower abdominal pains, and some trouble swallowing (which I think might be psychological).  Could all of this be normal for him?\n\n",
    "posted_time": "Post  by droamen » Wed May 20, 2009 9:47 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Glomerulonephritis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=78945&sid=5db97697d2d9162063e7af977f42b7ce#p78945"
  },
  {
    "author": "crystalbabe2809  Guest Posts: 1 Joined: Wed Jan 14, 2009 7:00 am Gender: Female",
    "title": "Urine Albumin",
    "content": "My 8 year old daughter has just had a test result come back and it was 1099 ( normal range is 0-30) could someone please tell me what this could mean, she has FSGS for about 4 years now\n\n",
    "posted_time": "Post  by crystalbabe2809 » Wed Jan 14, 2009 7:04 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Glomerulonephritis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=68257&sid=5db97697d2d9162063e7af977f42b7ce#p68257"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Urine Albumin",
    "content": "Hello --  Since your daughter is already known to have FSGS for some time, and since the albumin level was so elevated, it would seem that at the time of the test either she was unusually dehydrated (a common cause of gross albumin in proteinuria) or was either beginning a phase of nephrotic syndrome (kidney failure). The latter can be transitory or progressive, depending on many factors unknown in  this case. I would think, however, that in either case her doctor would react to this finding with concern and want to follow up to determine just what was going on, and probably repeat the test.   Since so little is known about the circumstances of this finding, other than the presence of FSGS, which could predispose to nephrotic syndrome, you'll have to depend on the doctor to follow this development and please do let us know what you find out. Best of luck to you and your daughter.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Fri Mar 13, 2009 11:59 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Glomerulonephritis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=71378&sid=5db97697d2d9162063e7af977f42b7ce#p71378"
  },
  {
    "author": "kcteach  Guest Posts: 8 Joined: Mon Aug 08, 2005 5:30 pm Location: Texas",
    "title": "Prednisone",
    "content": "I've been on prednisone for nearly 3 years now;  it's the only thing that promotes remission for me, but as soon as I begin to taper off of it I flare right up and have a relapse-it happens every time. I've relapsed atleast 5 times within the course of  nearly 3 years. So I was wondering, if it's the only thing that seems to keep me in remission- why am I being tapered off.\n\n",
    "posted_time": "Post  by kcteach » Sat Sep 24, 2005 6:32 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Glomerulonephritis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=21533&sid=5db97697d2d9162063e7af977f42b7ce#p21533"
  },
  {
    "author": "DeLWolcott  Guest Posts: 293 Joined: Fri Jun 24, 2005 5:47 pm Location: Texas",
    "title": "[no title]",
    "content": "Prednisone can cause damage throughout the body when taken for a long period.  Steroids in general should only be used for limited times.  I understand it is frustrating to have the one things that works to be taken away, but in the long run it is much safer.  Hopefully another alternative can be found for you.\n\n",
    "posted_time": "Post  by DeLWolcott » Sat Sep 24, 2005 11:28 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Glomerulonephritis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=21559&sid=5db97697d2d9162063e7af977f42b7ce#p21559"
  },
  {
    "author": "andim  Guest Posts: 4 Joined: Sat Feb 23, 2008 1:05 pm Gender: Female",
    "title": "Re: Prednisone taper?",
    "content": "I am wondering how to taper my prednisone.  I am currently on 5mg qd in the am for 6 weeks, and I can't deal with this drug, so I am going to stop. I am also on cellcept for MG, which I much prefer.  I am not seeing any added benefit by adding the prednisone, so I would rather not have the side effects of prednisone. Do I need to taper to avoid adrenal insufficiency at this level? I was planning on 5 qod, for 1 week, then 2.5 qod for one week, then 1qod for one week and off.  Is this reasonable?   My doctor highly favors prednisone and minimizes the side-effects, so I cannot address this with him, but I do want to stop in a safe way. Any advice would be very helpful.\n\n",
    "posted_time": "Post  by andim » Sat Mar 22, 2008 1:52 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Glomerulonephritis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=56648&sid=5db97697d2d9162063e7af977f42b7ce#p56648"
  },
  {
    "author": "desiree  Guest Posts: 8 Joined: Sat Sep 08, 2007 2:36 pm",
    "title": "Transplant patient with protein in urine",
    "content": "Hi, I am 31yr old female 199lbs, I had a kidney transplant 2yrs ago because of FSGS. My last urinalasis shows that i have protein in my urine. the results are as follows:  TEST RESULTS                                NORMAL RANG Creatinine      61 mg/dl                        1.0 - 346.5 mg/d  Urine protein  30 mg/dl                        5 - 200 mg/dl *24hr urine protein  660 mg/24hr           42 - 225 mg/24hr  24hr urine Creatinine 1355 mg/24hr    800 - 2800 mg/2hr  I am worried that the FSGS could affect the transplanted kidney and that i may loose it. My serum creatanine is 1.3 and Bun is 17\n\n",
    "posted_time": "Post  by desiree » Sat Sep 15, 2007 6:56 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Glomerulonephritis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=47816&sid=5db97697d2d9162063e7af977f42b7ce#p47816"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Desiree,  Protein in the urine following a kidney transplant is a bit of a complex thing.  It is possible that the FSGS can affect the new kidney.  I strongly recommend you see your nephrologist to have this further evaluated.  If there is concern a biopsy of the kidney may be needed.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Thu Oct 25, 2007 5:47 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Glomerulonephritis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=49528&sid=5db97697d2d9162063e7af977f42b7ce#p49528"
  },
  {
    "author": "kriswal  Guest Posts: 1 Joined: Thu Apr 12, 2007 11:44 pm",
    "title": "Protein in Urine and Pregnancy",
    "content": "I am a 25 year old female. I had nephrotic syndrome in my first pregnancy and then had a kidney biopsy 6 weeks after the birth.  The biopsy showed endocapillary glomerinephritis (not sure on spelling). At my last checkup it showed my kidneys are now functioning perfectly but I am still losing high levels of protein in my urine.  I don't understand if they are functioning ok, why am I losing protein?  Also I am wanting to have another baby, is it safe to fall pregnant with high levels of protein already in the urine?  What is the chance my previous illnesses will come back?\n\n",
    "posted_time": "Post  by kriswal » Thu Apr 12, 2007 11:54 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Glomerulonephritis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=40695&sid=5db97697d2d9162063e7af977f42b7ce#p40695"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "It is quite possible for the kidney to be \"functioning\" properly but still be loosing protein.  With certain types of nephrotic syndrome this may be a frequent occurence.  The kidney is quite complex and can manage to maintain kidney function even with significant disease.     Regarding your question about pregnancy there are many factors that play into this, including the state of your kidney function, the medications you are on, your blood pressures, etc.  I would suggest that you talk with your obstetrician and nephrologit to get the best advice specifically for you.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Wed Apr 18, 2007 11:44 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Glomerulonephritis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=40979&sid=5db97697d2d9162063e7af977f42b7ce#p40979"
  },
  {
    "author": "KDCwv32  Guest Posts: 14 Joined: Sat Mar 03, 2007 6:16 pm",
    "title": "Protein in Urine",
    "content": "I'm a 21 yr old female and I've had protein in my urine on and off for the past three years. This started about 6 months after taking birth control pills so I don't know if they are causing this or not. I also take allegra for my allergies. I've had urine analysis every 6 months the past 3 years or so and this past year they've done microalbium tests also.  It keeps fluctuating. One time it'll be barely above normal, then back to normal, another time it will be high, and my last test i had done was back to normal. My doctor just said to drink plenty of water which i have been doing and its helped alot. I also had a blood tests done and it shows my kidney functions where normal. My question is could any of medication be causing this? And is this something I should get further evaluation on?\n\n",
    "posted_time": "Post  by KDCwv32 » Sat Mar 17, 2007 12:06 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Glomerulonephritis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=39671&sid=5db97697d2d9162063e7af977f42b7ce#p39671"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Generally the medications you are taking are not described as causing proteinuria.  There are several causes of proteinuria.  They range from harmless, such as orthostatic proteinuria where protein shows up in the urine after standing for a while to severe causes such as nephrotic syndrome.  With things such as nephrotic syndrome the amount of protein in the urine is very large.  Your amounts are not consistent with this.  Most likely you have an incidental finding.  It is a good idea to continue to follow this to ensure it does not get worse.  Staying hydrated is important.  As long as your protein amounts remain minimal and your kidney function/blood pressure are OK you are likely to be fine.  If there is concern, you may wish to see a nephrologist (kidney specialist).  A 24 hour urine collection can be done to formally assess the amount of protein in the urine.  I hope this helps.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sat Mar 17, 2007 6:20 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Glomerulonephritis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=39677&sid=5db97697d2d9162063e7af977f42b7ce#p39677"
  },
  {
    "author": "KDCwv32  Guest Posts: 14 Joined: Sat Mar 03, 2007 6:16 pm",
    "title": "[no title]",
    "content": "I had a Micro/Cr ratio and it was 14.9 in a 0-30 range. Ive noticed that portein only shows up when my urine is concentrated, but once im hydrated (pale yellow-clear) it comes back negative so I also wanted to ask that since this has been happening for the past 3 yrs could this be some kind of kidney disease? When they first found the protein it was 2+ but now hasn't been above a trace since ive been drinking water. My primary GP just says unless the protein gets high that she just wants to watch it. Im just scared I may have some kidney damage already!\n\n",
    "posted_time": "Post  by KDCwv32 » Tue Mar 27, 2007 5:26 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Glomerulonephritis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=40048&sid=5db97697d2d9162063e7af977f42b7ce#p40048"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "It is very common to have protein in the urine when dehydrated.  Your level of protein sounds as if it is in the normal range.  I would recommend that you continue to follow up with your doctor for regular evaluations.  If there is concern you can request evaluation by a nephrologist; however, I think it is very likely that you are OK and your kidneys have not sustained any damage at this point.  Again, my advice is limited by the internet setting so I cannot make any definitive statements.  If there is concern I recommend you see a kidney specialist.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sat Mar 31, 2007 12:19 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Glomerulonephritis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=40221&sid=5db97697d2d9162063e7af977f42b7ce#p40221"
  },
  {
    "author": "jmanqr  Guest Posts: 1 Joined: Wed Mar 07, 2007 9:56 pm",
    "title": "Possible Glomerulonephritis",
    "content": "My mother is white, 65 yo woman with a history of HTN managed by ACEI (Altace) and hyperthyroidism (now normal) that has had left flank and left mid back pain since May of 2006. In June 2006 she had a urinary tract infection which  was treated with bactrim. However, this intensified the pain. She stopped taking the antibiotic and her acute pain lessened. Her left side pain has increased gradually over the insuing months. Her right mid back  has now begun to hurt as well although not as bad as the left. She describes her left side pain as extreme soreness with occassional sharp, stabbing bursts which can wake her from sleep with SOA. She has had abdominal MRI and cardiolite stress test in the last two months that were unremarkable. She recently went to the ER when advised by her immediate care center during one of her flares ups.   Her blood test revealed the following: (2/11/07) Occult blood 1.0 + abnormal epithelial cells 5-10 abnormal  D-dimer 564 abnormal CO2 33 slightly high (end of normal 32) K+ 3.4 slightly low (3.5-5.0) Cl- 95 low (end of normal 100) Folic acid 20 abnormal (3.3-12.4) Neutrophils 79.1 slightly high (49-79) BUN 19  creatinine 0.8 BUN/creatinine ratio 23.8  The chronic pain makes it difficult to sleep and she is getting frustrated with the various physicians/NPs that have not seemed to diagnose/treat the problem. Lately, she has felt a general malaise and fatigue with occassional +1 pedal edema at night. She occassionaly complains of leg pain as well.  It seems to me that she has a clinical presentation of glomerulonephritis or pyelonephritis. Could there be any other possible diagnoses likely, for example abdominal arotic aneurysm?   If is renal what can be done to help relieve the pain?  Thanks\n\n",
    "posted_time": "Post  by jmanqr » Wed Mar 07, 2007 10:38 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Glomerulonephritis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=39340&sid=5db97697d2d9162063e7af977f42b7ce#p39340"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "There are a few possibilities of your mother's pain.  The blood in her urine may be due to infection that has not cleared or possibly kidney stones.  I would tend to favor kidney stones over infection as generally infections going on for that long would be quite severe and have other symptoms of fever and dysuria.  Her electrolytes are essentially normal.  I would not be concerned about these.  Her kidney function appears to be normal based on her creatinine and BUN.  I would recommend a few tests.  1) A complete urinalysis and culture to assess for infections.  2) a spot calcium/creatitine urine test to look for elevated urine calcium which can cause blood/pain even without overt kidney stones.  3) If the pain continues to be severe a renal ultrasound may be helpful but the best test for kidney stones is a CT scan.  Continued follow up with her doctor is important.  She may also want to see a kidney specialist or urologist to help guide the work up.  Hope this helps.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Thu Mar 08, 2007 2:05 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Glomerulonephritis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=39356&sid=5db97697d2d9162063e7af977f42b7ce#p39356"
  },
  {
    "author": "kcteach  Guest Posts: 8 Joined: Mon Aug 08, 2005 5:30 pm Location: Texas",
    "title": "Itchy Skin!!!! Help!",
    "content": "Hi!  I'm a 23 yr old woman with chronic glomerulonephritis.  I was diagnosed nearly 3 years ago with childhood nephrotic syndrome.  I have extremely itchy skin only when I shower.  I was hoping someone could explain why and if it's somehow related to my disease.  How can I be relieved?\n\n",
    "posted_time": "Post  by kcteach » Thu Sep 15, 2005 2:21 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Glomerulonephritis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=20733&sid=5db97697d2d9162063e7af977f42b7ce#p20733"
  },
  {
    "author": "R. Zein, Pharm D  Pharmacist Posts: 157 Joined: Tue Jul 12, 2005 9:16 pm Location: USA",
    "title": "[no title]",
    "content": "Hello, As nephrotic syndrome progresses, itchy skin may develop as toxic metabolites, normally filtered out of the blood by the kidneys, build up to harmful levels.  Have you tried to use benedryl (diphenhydramine) or other over the counter anti-itch creams? They might help with your itching.  Thank you and I hope you feel better.\n\n",
    "posted_time": "Post  by R. Zein, Pharm D » Sat Dec 10, 2005 10:53 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Glomerulonephritis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=26486&sid=5db97697d2d9162063e7af977f42b7ce#p26486"
  },
  {
    "author": "angelforever34  Guest Posts: 33 Joined: Fri Dec 31, 2004 10:38 am Location: Hurricane, West Virginia",
    "title": "question about kidney tests",
    "content": "Can a renal biopsy be performed during a retrograde pyelogram? And are there any other tests less evasive that can diagnose nephritis?\n\n",
    "posted_time": "Post  by angelforever34 » Tue Sep 20, 2005 11:35 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Glomerulonephritis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=21129&sid=5db97697d2d9162063e7af977f42b7ce#p21129"
  },
  {
    "author": "R. Zein, Pharm D  Pharmacist Posts: 157 Joined: Tue Jul 12, 2005 9:16 pm Location: USA",
    "title": "[no title]",
    "content": "A renal biopsy is a means to obtain a sample of the kidney tissue. The sample is then examined in the laboratory.  This test is done in the hospital, usually in the radiology suite in ultrasound. You will be expected to follow the instructions given during the test. You will be lying face down on a firm surface. Firm pillows or a rolled towel may be placed beneath the abdominal area to give support.   The kidney is located under ultrasound, and then the health care provider will mark the biopsy site (usually the right side). A local anesthetic will be given to numb the skin at the biopsy site. A tiny incision is then made in the skin.   You will be asked to take a deep breath, hold it, and remain still as the locating needle (a needle that is used to locate the proper location in the kidney) is inserted through the incision and into the kidney under ultrasound guidance. You will then be asked to take several deep breaths to help verify the position of the needle.   The locating needle depth is measured and then removed. The biopsy needle is inserted following the path of the locating needle. Again, the position of the needle will be verified. The sample is taken, and the needle is removed. Pressure is applied to the biopsy site to stop the bleeding, and a bandage is applied. You will remain in the hospital after the test and lie on your back for 12 to 24 hours.   Meanwhile,  Retrograde PyelogramA cystoscopy (i.e., a procedure in which a telescopic instrument is inserted into the urethra) is performed to locate the opening from the ureter to the bladder. The contrast agent is injected directly into this opening and an x-ray is taken to locate the kidney stone.   This procedure eliminates the risk for an allergic reaction to the contrast agent because the dye does not reach the bloodstream, but it may require anesthesia. While retrograde pyelogram is the most reliable method for visualizing the urinary system and detecting stones, it is generally used only when other imaging methods are inadequate or unsuccessful.   overall it is ok to have both proceedures at the same time, those are the gold standard for the diagnosis of nephritis.\n\n",
    "posted_time": "Post  by R. Zein, Pharm D » Tue Sep 20, 2005 12:07 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Glomerulonephritis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=21132&sid=5db97697d2d9162063e7af977f42b7ce#p21132"
  },
  {
    "author": "angelforever34  Guest Posts: 33 Joined: Fri Dec 31, 2004 10:38 am Location: Hurricane, West Virginia",
    "title": "Renal Scan",
    "content": "Is a renal scan very good about detecting uncomplicated Nephritis. A biopsy just sounds too invasive. (Thanks!)\n\n",
    "posted_time": "Post  by angelforever34 » Tue Sep 20, 2005 3:28 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Glomerulonephritis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=21159&sid=5db97697d2d9162063e7af977f42b7ce#p21159"
  },
  {
    "author": "MomOf4  Guest Posts: 18 Joined: Sat Mar 05, 2005 3:55 am Location: PA  Contact:   Contact MomOf4       Website   Yahoo Messenger",
    "title": "My 10 Yr Old Girl w/Strep",
    "content": "Hello my name is Amy and I have a few concerns about my 10 yr old girl. My ex got custody of her in Oct. and she has gained 20lbs in less than a year and today she has strep throat, and she has been hospitalized for guenonephritis(kidney problem?) in the past and she always has real rosy cheeks all the time. She lives 4 hrs away from me now and I am wondering why she has gained so much weight in such a short period of time.....She gained all of this weight while visiting last summer and going to live in Ohio in October with dad. So she has gained all of this weight in about 7 months. What should I be concerned about with all of the information I have given? Today her father said she is on antibiotics and I understand that.....for the strep..AND also he said she was taking steroids...WHAT DOES THAT MEAN? I have told my ex to keep an eye on her urine samples because she has had protein in her urine in the past and I do know that it is connected to her kidney problems she has had and that strep can bring about kidney problems. What can you tell me about the weight gain and the rosy cheeks and the steroids? Any advice is welcomed.......I would love your input! Thanks everyone!\n\n",
    "posted_time": "Post  by MomOf4 » Sat Mar 05, 2005 8:58 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Glomerulonephritis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=10391&sid=5db97697d2d9162063e7af977f42b7ce#p10391"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi MomOf4, I can understand your concern about the strep. The use of steroids is usually to reduce inflammation etc. However, has the reason for the glomerulonephritis been investigated? That's my concern. Has there been any kidney function studies etc. done?  Sincerely, Rntdj\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Sun Mar 06, 2005 3:59 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Glomerulonephritis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=10403&sid=5db97697d2d9162063e7af977f42b7ce#p10403"
  },
  {
    "author": "MomOf4  Guest Posts: 18 Joined: Sat Mar 05, 2005 3:55 am Location: PA  Contact:   Contact MomOf4       Website   Yahoo Messenger",
    "title": "Dear Rntdj,",
    "content": "Hello.........Thank you for responding!  Well...I have had custody of my girls(Cassidy and Christina) their whole life until Oct 31st when my ex won custody of them...ANYWAYS..In the summer of 2003 Cassidy my 10 yr old was peeing like red brown so I took her to the ER and they admitted her saying her kidneys werent working right--something about the little tubes that go(well you know)ANYWAYS...She stayed for one day and they said she had hat long G word--(the topic above--LOL) so then her Dr. just kept track of her urine and she seemed ok....a couple weeks before that ER visit I remembered she was sick...and they said it was strepto---something something nephritis...Then this past Oct 2005 she got strep and I told the ER to check her urine because of what happened in 2003 summer and she had protein in her urine....So this was just before my ex husband got them and moved to Ohio and I am worried that the Dr in Ohio doesnt know everything about her--and I have told my ex what to watch for in Cassidy......SO NOW she has strep again(and her sister Christina too) and all I can think of is that her kidney \"mishap\" is going to happen again.  I am in PA and she had a great Dr. who knew her whole history and now she has this Dr. with her dad and I hope they got ALL of her medical records.  So right now that was it.....no other testing.....I am just worried because I have cared for her for her whole life and know I cant.  THANK YOU SO MUCH FOR BEING CONCERNED\n\n",
    "posted_time": "Post  by MomOf4 » Sun Mar 06, 2005 4:43 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Glomerulonephritis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=10450&sid=5db97697d2d9162063e7af977f42b7ce#p10450"
  },
  {
    "author": "bruin75  Guest Posts: 5 Joined: Sat Sep 10, 2005 6:29 pm Location: United States",
    "title": "[no title]",
    "content": "Sore throat is one of the most  common complaint of older children and adults seeking medical attention.  While Group A Streptococcus or Streptococcus pyogenes is an important cause of sore throat, viruses are by far more common. The fact that your daughter is on antibiotics in no way assures that she has a strep throat.  Unfortunately physicians will prescribe antibiotics emperically without adequately reviewing the criteria that make streptococcal pharyngitis more likely than viral or other pharyngitidies.  Sore thrat with inflammed enlarged tonsils and a purulent exudate (pus) and fever suggests a 80-90 percent chance that the presenting symtoms and signs are that of  strep throat . Sore throat alone, with tender swollen tonsils suggest  a less than a 30 percent chance of having a strep pahryngitis.  I have to assume that the physician who started her on antibiotics appropriately screened for evidence of Group A Strep.   Given the likelihood that she has Strep pharyngitis, then she is at a small but siginificant risk of developing complications from her infection.  These complications were common prior to the development of antiobiotics, but have declined in their prevalence. However they continue to be problematic even in developed countries. These problems are Acute Rheumatic Fever, which I am certain she did not have or else you would have mentioned her symptoms.  Toxic Shock Syndrome, which she did not have, and third, Acute Post Streptococcal Glomerulonephritis, the occurrence of which is markedly ameliorated by antibiotic treatment  . Poststreptococcal Glomerulonephritis is typically an acute disease, with spontaneous recovery occurring in almost all patients, even those who develop renal insufficiency during the acute episode.  Irreversible renal failure probably occurs in less than 1 percent of children and perhaps a slightly higher percentage of adults.  It occurs in roughly 5-10 percent of patients with Strep pharyngitis and 25 percent of patients with Strep skin infections.   The clinical presentation can vary from asymptomatic, microscopic hematuria (small amounts of blood in the urine undetectable to the eye),  to the full-blown acute nephritic syndrome, characterized by red to brown urine, proteinuria (protein in the urine-which can reach the nephrotic range or greater than 3 grams per day, normal being less than 150 milligrams per day), lower extremity or total body swelling,  hypertension(high blood pressure) , and acute renal failure.  The prognosis is generally favorable.   The fact that she has been hospitalized precviously for glomerulonephritis suggests she has another form of glomerulonephritis. One of the most common glomerulonephritides in children is what is called \"Nil disease\"  or also known as Minimal Change Glomerulonephritis. It is so named because the kidney biopsy appears normal under the light microscope but we see changes under the electron microscope and with immunologic fluorescence testing.  That may be why she is on chronic steroids.   Her weight gain, may well be related to steroids, or in fact may be due to diet and growth in combination with steroid use.  The rosy cheeks may also have its etiology in the use of steroids but may also suggest she's a healthy, robust 10 year old child.\n\n",
    "posted_time": "Post  by bruin75 » Sat Sep 10, 2005 8:56 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Glomerulonephritis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=20311&sid=5db97697d2d9162063e7af977f42b7ce#p20311"
  },
  {
    "author": "J-Med Student",
    "title": "Membranoproliferative Glomerulonephritis",
    "content": "Hi! Good Day! Im researching and would like to know more about membranoproliferative glomerulonephritis. My aunt is sick with this disease. But still the doctors here is baffled about her diagnosis. She is a 57y/o female,executive. With a history of hypertension. She has hematuria though no proteinuria. She is asymptomatic, with no edema or the usual signs. Accdg. to her doctor, clinically she has chronic renal failure, though the etiology is unknown, histopath findings shows she has membranoprolifeartive glomerulonephritis and benign nephrosclerosis. Her other laboratory results are also contradictory according to her nephrologist here. Thats why no definite diagnosis can be stated yet. Please help me to know more about it, or direct me to websites that cane help me about this disease. Since her case is very rare, and her nephrologist says thats its a very good study case since its very rare and the laboratories results is puzzling. Im a medical student, and im worried for my aunt. Please help. thanks.\n\n",
    "posted_time": "Post  by J-Med Student » Fri Mar 07, 2003 8:56 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Glomerulonephritis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=464&sid=5db97697d2d9162063e7af977f42b7ce#p464"
  },
  {
    "author": "malagatta",
    "title": "Membranoproliferative",
    "content": "Dear J-student,  This is an interesting case indeed but as usual I would like more information  1- you mentioned she has no proteinuria and no edema which is congruent ... why did she have a biosy in the first place? I would like to know the results of a 24 hour collection for protein in mg/day and creatinine clearance in ml/min  2- you mentioned that there are \"puzzling lab results\" yet you have not revealed these.   Please submit your aunt's race, complete past medical surgical and family history as well as social habits. Include prior hospitalizations and any medications she might be taking either prescribed or over the counter. In addition I would ask to know the results of her kidney ultrasouns with regard to size and echogenicity as well as all of her lab work in chronological order. I would like to know the reason for her biopsy and the area of the world that you live in. Was the reason for biopsy isolated hematuria (in other words blood in the urine with minimal protein)?   I am interested in this case and if you reply I hope to be able to at least share some of what I know   Dr. L\n\n",
    "posted_time": "Post  by malagatta » Fri Mar 07, 2003 9:02 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Glomerulonephritis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=466&sid=5db97697d2d9162063e7af977f42b7ce#p466"
  }
]