[
  {
    "author": "Link_pad  Guest Posts: 4 Joined: Fri Nov 13, 2009 1:52 pm Gender: Male",
    "title": "Early Signs Of heart Failure",
    "content": "Hi,  I am a 25 Year old fit Male, 4 Months ago i was diagnosed with Severe TR. Worrying itself i didn't recieve any symptoms. But in Last month i have had onset of Chest pain i went to A & E had ECG and blood test both were Ok. But now i have noticed sometimes rapid heartbeats, occasional Chest Pain, constant indigestion. I am beggining to suspect the early signs of heart failure i have a cardio Surgeon who will replace my valve should i make him more aware of how i am now feeling ??  Thanks  Patrick Lee\n\n",
    "posted_time": "Post  by Link_pad » Fri Nov 13, 2009 2:01 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=86853&sid=d415cdddd88c219557a15b32392c93ba#p86853"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Early Signs Of heart Failure",
    "content": "Hello Patrick -- While the symptoms may be coincidental, they also could be related to right heart failure, so yes, I think it would be prudent to let the doctor know about this. If he feels it's irrelevant it probably is. If not then he'll want to take a closer look. Its difficult to say from a distance whether or not this is actually related to the defective valve, but it could be, and that's reason enough to let your doctor know.   Hope this helps. Good luck to you and please keep us updated.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Mon Nov 30, 2009 9:23 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=87813&sid=d415cdddd88c219557a15b32392c93ba#p87813"
  },
  {
    "author": "Link_pad  Guest Posts: 4 Joined: Fri Nov 13, 2009 1:52 pm Gender: Male",
    "title": "Re: Early Signs Of heart Failure",
    "content": "Hi,  Thanks taken it up with the doctor he sent me straight to A & E which was a bit of a wait then they said no evidence of heart attack and sent me home. Again i saw doctors after chest pain so they did x ray though it might be pocket of air after i had my lung drained 4 years ago but nothing on that.  Its been over a year now and i still haven't seen a cardiologist even after being diagnosed with severe TR 8 months ago. I'm still getting the occasional onset of chest pain and wary as you that this is onset of heart failure what should i do ?  Thanks Patrick Lee\n\n",
    "posted_time": "Post  by Link_pad » Fri Dec 18, 2009 12:17 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=89339&sid=d415cdddd88c219557a15b32392c93ba#p89339"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Early Signs Of heart Failure",
    "content": "Heart failure isn't often heralded by chest pain, but some of the other symptoms could possibly be related. However, when one develops CHF the most significant features would be profound fatigue, shortness of breath and swelling in the calves, ankles and feet. Watch out for this triad of symptoms to be sure, but the rest is unlikely to be CHF related. It's great a heart attack was ruled out, but the real concern is potentially progressive failure of that valve, which should be followed by a specialist. I'm not sure how you'd go about instigating the next level of care, since no one is looking at what should be the center of attention right now. However, absent the three major symptoms listed above, you're probably not in CHF, so rest easy for now. Again, if all three should show up -- and persist -- then by all means bring this to the attention of your doctor promptly.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Fri Jan 01, 2010 10:20 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=90487&sid=d415cdddd88c219557a15b32392c93ba#p90487"
  },
  {
    "author": "Link_pad  Guest Posts: 4 Joined: Fri Nov 13, 2009 1:52 pm Gender: Male",
    "title": "Re: Early Signs Of heart Failure",
    "content": "Hi,  Thanks so much for your help, After some persuasion from my doctor the echo has been bought forward to this week (08/01/10). I personally thingk they need to knock this on the head and replace the valve with a prosthetic one ASAP.   I am under due care form the NHS (UK) so somethings can be timely over here !!  But once again thanks for your support and i will keep you posted on any happenings.  Patrick Lee\n\n",
    "posted_time": "Post  by Link_pad » Tue Jan 05, 2010 4:15 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=90606&sid=d415cdddd88c219557a15b32392c93ba#p90606"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Early Signs Of heart Failure",
    "content": "We'll be looking forward to any updates. Good luck and please stay in touch.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Sun Jan 31, 2010 1:48 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=90788&sid=d415cdddd88c219557a15b32392c93ba#p90788"
  },
  {
    "author": "Davidx  Guest Posts: 1 Joined: Tue Nov 03, 2009 2:04 am Gender: Male",
    "title": "Will swallowing 20 grams of cocaine be lethal?",
    "content": "I've had several suicide attempts in the past that were obviously unsuccessfull, I'm extrememly mentally ill and my parents have recently past away leaving me with my grandmother who is very old, I must die before she does so my next attempt will be to swallow the 20 grams of cocaine in a hotel room where there is no medical assistance. I'd just like to get a professional opinion as to how certain this is... once before i was admitted to hospital and my heart stopped three times from cocaine overdose and I was in ICU for 3 days. Will 20 grams definately kill me? how painfull will it be etc?\n\n",
    "posted_time": "Post  by Davidx » Tue Nov 03, 2009 2:19 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=85733&sid=d415cdddd88c219557a15b32392c93ba#p85733"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Will swallowing 20 grams of cocaine be lethal?",
    "content": "Hello -- Cocaine is highly unpredictable, which means, from a medical point of view it is impossible to tell you whether or not this attempt would be certain to succeed. What you must also understand, however, is that we are sworn to keep people well and work to preserve lives, not end them. We are not in the business of giving advice on how to commit suicide. That said, it's clear you are deeply distraught and acknowlege mental illness. This is a serious-enough situation and first off I must tell you, for your own welfare (assuming you were to go through with this attempt) that because of the unpredictability of cocaine effect on any given individual, this amount might only achieve for you what's happened with previous attempts, it may not even get you to that point, or it could, worst case, cause a sufficiently prolonged heart stoppage to leave you alive but in a brain-damaged, perhaps vegetative, state. You could well wind up conscious and aware but unable to communicate or otherwise express your feelings or wishes. This obviously is a non-starter for someone seeking to escape life's problems via suicide. The risk of failure or worse is far too great. The very fact you have been successfully resucitated in the past proves the current idea has a great chance of not only failing but of possibly making your situation infinitely worse. As an alternative I'd suggest a deal wherein you agree to a new arrangement for treatment of your mental illness (I assume you've been through therapy and other disciplines already and haven't had much success). The fact that it's called mental illness implies the potential for a cure, which could result in a happy or at least satisfactory life. I would strongly urge you to engage with us here in some steps toward finding a better solution to the pain you're feeling right now. The cocaine approach really is a wildly unpredictable one and as I said earlier, could result in a situation far worse than you can even imagine. Please do us the kindness of talking to us here about what's been tried in the past and what seems to be the central mental issue, given you have been through enough real-life stressors to make you feel despondent and hopeless recently anyway. What you must realize is that we all have things like this we deal with. Taking your own life doesn't make the world a better place. This is your challenge. I hope you'll take it up and at least consider the potential horrors of a failed cocaine overdose.  My best to you. Please stay in touch here. We do this work for a reason. Right now you are the reason.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Tue Nov 10, 2009 10:01 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=86540&sid=d415cdddd88c219557a15b32392c93ba#p86540"
  },
  {
    "author": "skm777  Guest Posts: 1 Joined: Wed Oct 28, 2009 1:37 pm Gender: Male",
    "title": "testosterone replacement therapy and congestive heart failur",
    "content": "I am 33 yrs old and in last 2 years ive used testosterone/steroid supplements to enhance my physique for training purposes.also my cycles were generally 10 wks on and 2 wk off cycles. approx. 2 mos ago i was diagnosed with congestive heart failure and an enlarged heart. I believe this condintion is due at least in part to the steroid use. I now have low testosterone levels and wanted to know would it be safe for me to use replacement therapy doses of testosterone now with congestive heart failure? I am on medication for high blood pressure and everything seems to be under control\n\n",
    "posted_time": "Post  by skm777 » Wed Oct 28, 2009 1:50 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=85094&sid=d415cdddd88c219557a15b32392c93ba#p85094"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: testosterone replacement therapy and congestive heart failur",
    "content": "Hi there -- While testosterone generally is safe for most people to use, given your unusual cardiac history and how you got it, I would definitely recommend you have clearance by a cardiologist before resuming use of testosterone. If this is a problem then it is really a problem, since testosterone was a companion to other hormones (steroids) which caused the very serious problem you now have \"under control.\" You can't afford to embark on any self-medication. You need to let yourself be guided by a cardiologist when considering embarking on any new chemical enhancements.  Straight up. Don't fool around. Hope this is helpful. Good luck to you.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Mon Nov 02, 2009 9:39 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=85709&sid=d415cdddd88c219557a15b32392c93ba#p85709"
  },
  {
    "author": "moonlight_caster  Guest Posts: 1 Joined: Thu Sep 10, 2009 1:40 pm Gender: Female",
    "title": "Strong, squeezing pain in the centre of my chest?",
    "content": "I am a 21 year old female with an average BMI, however I should become more fit.  I was playing tennis, my heart was beating faster due to the exercise. I went to pick up a ball from the ground but instantly after I rose back up I experienced a strong, squeezing pain in the centre of my chest and it spread deep around the middle of my chest. It lasted for about 10 seconds. There was a lot of pressure in the chest area where I felt the pain and afterwards I felt a slight burning sensation in my left outer ear.  Was this a heart attack? Could I get a heart attack with these symptoms?\n\n",
    "posted_time": "Post  by moonlight_caster » Thu Sep 10, 2009 1:46 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=82384&sid=d415cdddd88c219557a15b32392c93ba#p82384"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: Strong, squeezing pain in the centre of my chest?",
    "content": "Hi, Cardiac pain is pain typically radiates to the lower jaw or the left upper limb.But, atypical presentations do occur ofen. As ischemic heart disease is tending to affect more and more younger individuals of late.i suggest that you must get a check up with a specialist in cardiology and exclude any cardiac cause. Good luck!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Tue Oct 13, 2009 4:53 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=83677&sid=d415cdddd88c219557a15b32392c93ba#p83677"
  },
  {
    "author": "finnerfag  Guest Posts: 3 Joined: Wed Sep 17, 2008 2:42 am Gender: Male",
    "title": "Can prolonged abuse of \"Ritalin\" cause gradual heart failure",
    "content": "I have been prescribed methylphenidate since I was 8 years old. It started a 5 mg,  and now I am being prescribed 20 mg sr and 10 mg immediate release. I am 32 years old and have basically been abusing it since I was around 17. I snort it up my nose everyday - all day. I don't take the prescribed amount; I take about 40 to 50 milligrams everyday up my nose. This has been going on since I first started college. Besides the anxiety attacks that I'm positive this abuse is responsible for, I've been diagnosed with cardiac arrhythmia at about 24. My father was a cardiovascular surgeon at that time and wasn't aware of my abuse of Ritalin. I told no one. When I was diagnosed, my Dad prescribed me Atenolol (50 mg). The only time I ever use it is when I periodically visit my GP because the nurse always checks my blood pressure (which almost always turns out to be 120/80). Although I know the blood pressure machines in grocery stores and drugstores aren't very accurate, it usually turns out to be around 175/115.I've even had an EKG and angiogram done recently because my doctor, after some testing, said I might have had a heart attack in the past.  I took Atenolol before both tests when taken again and the results turned out normal.  I write you this because I just checked my pulse today and my heart rate (without Ritalin) is “skipping beats.” Bump - bump - nothing for 5 seconds, then bump - bump again. I have also had trouble breathing (periodically) for years. I have to take deep breaths and hold it in for a while and exhale - although I don't if know that has anything to do with the cardiovascular system. Anyway, besides the obvious advice - stop abusing methylphenidate, do you think this is the main cause of the symptoms I've described? The breathing trouble is starting to concern me. Your time and advice is much  appreciated.\n\n",
    "posted_time": "Post  by finnerfag » Mon Jul 20, 2009 2:28 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=80958&sid=d415cdddd88c219557a15b32392c93ba#p80958"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "Re: Can prolonged abuse of \"Ritalin\" cause gradual heart failure",
    "content": "Hi finnerfag, Some of the more serious side effects of Ritalin are angina or chest pain, hypertension, irregular heart beats, shortness of breath and anxiety just to name a few. My suggestion to you is go to your primary care provider without taking the atenolol to cover up the symptoms and be perfectly honest with him or her about what's going on with you. The only way for anyone to help you is if you are straight up and honest with them. The result of your continued use of the medication in the manner you are using it could end up much more serious than the symptoms you are experiencing. You have to take the first step in admitting that you have a problem and seriously reach out for help. For me or anyone else to say \"quit\" is easy and not the answer. I would suggest that you also call a prescription drug abuse help line in your area of residence for assistance. Best wishes! Sincerely, Theresa Jones, RN\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Mon Sep 28, 2009 6:33 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=83318&sid=d415cdddd88c219557a15b32392c93ba#p83318"
  },
  {
    "author": "edsbrod4ever  Guest Posts: 1 Joined: Fri May 01, 2009 5:24 pm Gender: Female",
    "title": "ruptured congenial aneurysm in the left renal artery",
    "content": "What does cause of death due to a ruptured congenial aneurysm in the left renal artery mean.  My sister dies about 6 weeks ago in her sleep at the age of 42 and never had any health problems except for a fallen bladder.  I am confused does this have to do with the heart or the kidneys. Thanks for your help\n\n",
    "posted_time": "Post  by edsbrod4ever » Fri May 01, 2009 5:46 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=76571&sid=d415cdddd88c219557a15b32392c93ba#p76571"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: ruptured congenial aneurysm in the left renal artery",
    "content": "Hello --  First, my sincerest sympathies regarding the loss of your sister. This had to be a tremendous shock and I am terribly sorry.   What happened to your sister was that an abnormality in a renal artery, probably present early in life, caused a problem that would rarely produce any symptoms and so would not have likely been discovered except by accident or blind luck. These things are very rare, and so virtually impossible to predict. It is not a heart problem, but also not a problem of the kidney, but rather a vascular one, a defect of the renal artery that happened to service one kidney, and which branches directly off the aorta, the largest blood vessel in the body. This could be due to a familial trait of some sort, and just to be safe, any siblings, you included, should be screened by ultrasound for a possible aortic aneurysm, which is where most of these form, with the very rare exception of one in one of the renal branches.   I hope this helps answer your question and please follow up here with any other questions you may have. Again, my deepest sympathies for your loss. Good luck to you.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Tue May 12, 2009 10:32 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=77923&sid=d415cdddd88c219557a15b32392c93ba#p77923"
  },
  {
    "author": "neyr  Guest Posts: 1 Joined: Thu Jan 15, 2009 3:32 pm Gender: Male",
    "title": "Constant back pain after enlarged heart diagnosis",
    "content": "My mother, now 48, had a minor heart attack nearly three years ago.  She was not overweight, nor did she have high cholesterol or hypertension.  She was treated and released.  Ever since then she has complained of constant fatigue and a constant pain, in her back, between her shoulder blades.  Subsequent EKGs came out normal.  A few months ago she experienced an incredible amount of pain in her chest, felt faint but did not go to the hospital. During those months she has been going to sleeping around twelve or so hours a day but still wakes up fatigued. She went to her cardiologist and had an EKG done.  The office called her back and claimed everything was fine except for some plaque buildup.  A few days later her family doctor called her and said her heart is enlarged (left side) and questioned why her cardiologist did not find this in the EKG.  He prescribed lisinopril.  She claims to be feeling better, no more pressure on her chest or chest pain, but still has constant pain between her shoulder blades and on her left shoulder blade, that subsides when she lies down but persists after being in a standing or sitting position for what anyone would consider a normal or moderate amoutn of time. She thinks it could be related to work (she is a CNA) but I disagree.   I am literally at wit's end.  I worry to a ridiculous disagree about her condition and her cardiologist not catching her enlarged heart terrifies me.  She is going for a sleep study tonight and I demanded she ask her doctor about congestive heart failure and all of her persistent symptoms.   I guess my question or questions are: is she experiencing congestive heart failure? what more can be done in terms of treatment or therapy?  should she see another cardiologist? could she be experiencing the beginnings of another heart attack? Help.\n\n",
    "posted_time": "Post  by neyr » Thu Jan 15, 2009 3:49 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=68472&sid=d415cdddd88c219557a15b32392c93ba#p68472"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Constant back pain after enlarged heart diagnosis",
    "content": "Hi there -  Your mother is experiencing some very suggestive symptoms, both  of probable ischemia due to some coronary artery disease (that \"plaque buildup\" her cardiolgist didn't seem very concerned about, even though she's already had one myocardial infarction -- MI), and possibly of congestive heart failure (CHF) as well. While the latter is one possibility -- and with an enlarged left ventricle it is fairly likely -- the pain is  not even especially atypical (women often experience heart pain in more diffuse and  atypical ways and areas) and should be a red flag especially in someone with a prior MI.   The cardiologist's cavalier assessment (he knows she has some \"plaque buidup\" because of having looked at an EKG?) and failure to make the connection between established heart disease (which he apparently acknowleges, but hasn't tested for adequately) and new chest pain (any thoracic pain suspected of being caused by heart disease may be  called \"chest pain\" as shorthand for cardiac pain) really concerns me. Your mother's fatigue and need for extra sleep could be due to something else, but with that apparently enlarged left ventricle it's probably at least in part due to CHF, which should be treated. She  also needs to have an angiogram (even if she had one during her original heart attack) to determine the extent of her disease and to help put together a treatment plan. She should probably be on a beta blocker at least, and if she's in CHF there are more choices in terms of which beta blocker, as some work  better for this than the usual ones.  I hope this is helpful to you. I'm very glad your mother has you as an advocate. It's important,  especially since medical people are often the most likely to deny a serious problem because of their work ethic. Please do continue to encourage her to get this fully worked up. Something is definitely wrong. What it is and to what extent it's wrong is all that's left to determine. Then it can be treated.   Good luck to the both of you, and please follow up with us here.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Fri Jan 23, 2009 9:53 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=69567&sid=d415cdddd88c219557a15b32392c93ba#p69567"
  },
  {
    "author": "fayme  Guest Posts: 2 Joined: Mon Jan 12, 2009 5:59 am Gender: Female",
    "title": "congestive heart failure and hyperparathyroidism",
    "content": "hI there  My mother (73) in the last 4 months has had a cough, nausea, loss of appetite, weight loss, fatigue adn some loss of interest and unreliable memory. About 4 months ago a very minor exertion resulted in a broken bone and in the last month also a further break for a minor incident. In october she was diagnosed to have osteoporosis and given calcium that she couldn't take as it made her sick so she now stopped.  The cough, weight loss, nausea etc has continued and worsened. About november blood tests came back broadly normal but with signs of start of stones in kidney. Symptoms continued and she ended up in hospital on boxing day for a week almost comatose at first and with this nasty fluidy cough.  They now say she has congestive heart failure (CHF) and have her on furosemide and bisoprolol to which she is responding but I think the congestive heart failure is a symptom or result of a long term untreated hyperparathyroidism (HPT).  However neither she nor her doctors will look into HPT but only are treating the CHF. I understand that in 7-12 % of cases of HPT disease the patients' blood tests never show significantly elevated HPT or calcium but they are hard to diagnose. Am I right to suspect HPT? How do we get people to look into HPT as well as only looking at CHF.\n\n",
    "posted_time": "Post  by fayme » Tue Jan 13, 2009 8:39 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=68127&sid=d415cdddd88c219557a15b32392c93ba#p68127"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: congestive heart failure and hyperparathyroidism",
    "content": "Hello -  Your mother certainly does fit the profile for HPT, and has many of the collective signs and symptoms. As to why this hasn't been explored, it's difficult to know, but it is often overlooked, especially in patients who are seen as \"older\", even though your mother isn't especially old by  today's standards. Unfortunately, physical condition is often used as the measure of \"age.\" Since your mother came in already in rough condition, she may be seen as older than she actually is, and HPT may not be considered worth the effort, since the only thing that isn't being done for her now that would be done otherwise would be surgery on the hyperthyroid, which in the past was generally neglected as a therapy. It's done more often now, and though it is difficult to guess how this might affect the course of her illness, it seems not unreasonable, and  since everything else being done would be done for someone with HPT, it should be almost the default diagnosis.   All that considered, I would think the best way to get someone to consider HPT would be to be a pest and advocate for your mother and aggressively insist on a PTH immunoessay being done to find out if she has it or not. Then, if positive, the potential for surgery would have to at least be discussed.   I hope this is helpful to you. Please follow up with us as needed, and update us if anything changes. Good luck to you and to your mother.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Wed Jan 14, 2009 9:10 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=68364&sid=d415cdddd88c219557a15b32392c93ba#p68364"
  },
  {
    "author": "Dynamix  Guest Posts: 1 Joined: Tue Jan 13, 2009 2:04 pm Gender: Male",
    "title": "Atherosclerotic lesion under chin due to endarterectomy?",
    "content": "My father recently suffered a hypertension stroke and underwent an endarterectomy on the right carotid 95%blockage (left side pending 85% blockage). Everything seems to be fine except for an isolated red patch under his chin about four inches in diameter.   He tells me that this patch of skin feels somewhat numb and he does not see it but I beleive it is getting worse. He's a very stubborn man and since this incident he has not seen a doctor in close to fifteen years. I would appreciate any information from a vascular surgeon or someone who is familiar with the post-op complications of the procedure. Thank You.\n\n",
    "posted_time": "Post  by Dynamix » Tue Jan 13, 2009 2:19 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=68170&sid=d415cdddd88c219557a15b32392c93ba#p68170"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Atherosclerotic lesion under chin due to endarterectomy?",
    "content": "Hello -  This numb spot is very likely related to the endartectomy, but when it happens (which is rarely) it is usually due to injury to a nerve during the procedure and I can't imagine how it could physiologically be a vascular complication. If it is a nerve injury it shouldn't worsen, but should be checked anyway, just for the sake of making sure everything is right. There's no reason to have to deal with this sort of problem if it can be corrected (the biggest hazard I can think of is injuring one's self while shaving, due to lack of sensation in the area), but it should  be recorded anyway as part of the medical record, even if it winds up being a permanent issue.  I hope this is helpful. Please keep us updated.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Wed Jan 14, 2009 8:08 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=68353&sid=d415cdddd88c219557a15b32392c93ba#p68353"
  },
  {
    "author": "easycomplications  Guest Posts: 1 Joined: Sat Jan 10, 2009 1:41 pm Gender: Male",
    "title": "Is it possible to Code while on life support?",
    "content": "A friend of mine lost her father last year after a heart attack. She was told he coded while on life support, but has been unsure about it. I'm pretty sure it's possible but i think she needs more assurance then that. I've searched up and down the web for a medical answer and haven't found one. If you could help me out with an answer i could provide her to answer her concerns, i'd greatly appreciate it. Thankyou for your time.\n\n",
    "posted_time": "Post  by easycomplications » Sat Jan 10, 2009 1:47 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=67748&sid=d415cdddd88c219557a15b32392c93ba#p67748"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Is it possible to Code while on life support?",
    "content": "Hello -  It is technically possible to code while on life support, although it's kind of a grey area. If the heart stops producing its own sinus impulse, eventually, over a period of anywhere from a few seconds to a few hours, the heart will stop beating on its own. \"Life support\" generally means maintaining artificial mechanical respiration, which tends to give the heart an atrial \"kick\" and keep it beating, but if the sinus node fails, and the ventricles then slowly fail also, once cardiac activity stops and is unexpected and unplanned (depending upon whether the patient had a \"do not resucistate\" -- DNR -- or not) the code is called. Otherwise it's considered that the patient simply \"expired.\" The result is the same if there is a DNR order or if the heart's electrical system simply won't respond anymore.   If there is no DNR and the patient's heart is restarted, it is a code with successful resucitation.  As I said, it's something of a grey area, as some people mean by \"coded\" that the heart stopped, which is entirely possible while on life support.   I hope this answers your question and reassures your friend.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Sat Jan 10, 2009 9:30 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=67810&sid=d415cdddd88c219557a15b32392c93ba#p67810"
  },
  {
    "author": "melhelms  Guest Posts: 1 Joined: Tue Jan 06, 2009 5:18 pm Gender: Female",
    "title": "Amount of Cocaine in system cause Heart Failure?",
    "content": "A loved one recently failed a urine screening for cocaine.  The results were nearly 9,000 ng/ml.  I have 2 questions.  1)  Is 9,000 ng/ml an extremely high level that could be serious cocern for heart or kidney failure?  2)  Based on the level of cocaine in his screening, how much cocaine could one assume he does on a daily basis (preferably in grams)  FYI,  he is 6' down to 140lbs, daily user for 5 years, progressed from cocaine to crack cocaine in past year, and drinks alcohol with crack/cocaine.  I already know that any cocaine use is cause for serious concern, and I already know he needs help.  What I don't know is he a walking time bomb?  Knowing the level of cocaine in his system could one expect him to go into cardiac arrest at anytime?\n\n",
    "posted_time": "Post  by melhelms » Tue Jan 06, 2009 5:51 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=67174&sid=d415cdddd88c219557a15b32392c93ba#p67174"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Amount of Cocaine in system cause Heart Failure?",
    "content": "Hello -  The figure you provide is necessarily taken out of context, since we can't know with certainty when the last time was that cocaine was used. I can tell you that a surgical dose (for purposes of local anesthesia) will peak at 6700 ng/ml within one hour in lab test subjects. The same dose is almost gone in 48-72  hours. So we can conclude either a nasal dose greater than 1.5 mg had been (probably) inhaled within an hour previous, or that a much larger amount was used at a somewhat earlier time. At any rate, tolerance of the drug varies from one individual to the next, and while overwhelmingly high doses can be patently lethal, any dose can, at any given time (but especially after chronic use) cause severe and life-threatening medical problems. The more often it is used, the greater the statistical risk of a coronary event or other dangerous medical situation. Sudden cardiac arrest is an ever-present risk with any cocaine user. It is more random than Russian roulette.  A good example of the unpredictability of idiosyncratic response to cocaine use would be the tragic death of college star and NBA 1st-round draft pick Len Bias, in 1986, who,  after his first use of cocaine (although it may have been taken more than once during the evening) was also his last. Some people tolerate it for varying lengths of time. Some,  however, will suffer a terminal event the first time. So every cocaine user is a potential \"time bomb.\" There is no safe limit, there are only more unsafe ones.   Since the person in question has been developing a tolerance for (or increased yen for the pleasure of) cocaine to the extent of now using the crack form, and because he is drinking with it, he is probably on a terminal course already. The various potential dangers multiply with time, increase in use, etc. An intervention would be not only appropriate but possibly life-saving.  I hope this is helpful to you in evaluating your plans to deal with this individual's problem. This is always an emergency; let us hope it doesn't become a sudden medical crisis or worse. Good luck to you. Please follow up with us here as needed.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Wed Jan 07, 2009 8:59 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=67346&sid=d415cdddd88c219557a15b32392c93ba#p67346"
  },
  {
    "author": "GKovacs1982  Guest Posts: 2 Joined: Wed Jan 02, 2008 3:45 pm",
    "title": "Chest pain, sudden feeling of cold",
    "content": "I am a 26 year-old male. Two times in the last couple of months, I experienced strange heart problems. The symptoms are the following:  - my heart once or twice beats a large one that I can clearly feel as abnormal - soon after I feel cold, like if I had a fever, but my temperature is normal - and sometimes I'm short on breath  The first time I experienced this I went to the emergency room right away, and they told me I have pericarditis. The prescribed medication kind of worked; for a long time I felt good. A few weeks ago, however, the symptoms of pericardtitis came back; with the exception that now it effects my entire left side, including my arm. Most of the time it results in a dull uncomfortable feeling around my heart and in my left armpit.   Today, however, I experienced the same abnormal heart beat and cold-sweat kind of symptoms as once before. It went away in about an hour, but it worries me if it is something serious.  Just for the record, I often feel weak, though it may be the result of the lack of proper exercise. I also have high blood-cholesterol and I am under a lot of stress. The positive side of things are that I am not overweight, and I do not drink alcohol, nor smoke. Also, I had three EKG in the past few months, since I started having problems, and all three were good.  My question is that what can cause my symptoms and how can I prevent it? Also, if someone has high blood cholesterol, can that person reverse the damage with proper life changes, or only prevent it from worsening?  Thank you very much!\n\n",
    "posted_time": "Post  by GKovacs1982 » Thu Jan 17, 2008 1:10 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=53220&sid=d415cdddd88c219557a15b32392c93ba#p53220"
  },
  {
    "author": "Dr. A. Madia  Medical Doctor Posts: 207 Joined: Fri Jan 06, 2006 6:50 am Gender: Male Location: India",
    "title": "Re: Chest pain, sudden feeling of cold",
    "content": "Hi,  Sorry for a late answer but yours is a good question and I feel I can clear a lot of air here about cholesterol, chest pain and irregular heart beats.  Almost every human being on this earth gets an occasional Skipped beat or what you call a 'large one' once in a while. It is entirely benign and does not indicate any serious heart disease. So apart from its nuisance value of causing undue anxiety in the person, it is of no importance.  How were you diagnosed to have a 'pericarditis? Pericarditis is an inflammation of the covering membrane of the heart, often associated with a fluid collection too. Most common cause is Viral infection, second one is tuberculosis. The patient would be having severe chest pain, increased in getting up from bed or bending forward while sitting. There would be fever. Shortness of breath. severe fatigue. The EKG will show classic upward concave ST elevation. The Echo will show fluid collection if any. The treatment of pericarditis is a long drawn out one. Viral pericarditis involves administration of strong anti inflammtory drugs, Cholchicine, steriods etc. Tubercle pericarditis calls for 9-12 month course of anti tubercle drugs in addition to steroids.  Your high cholesterol. It is true that high cholesterol is a predisposing factor for development of coronary heart disease. However not every person with high cholesterol will have it. Secondly, the definition of high cholesterol. It is recommended that a person with a history of heart disease should have his LDL cholesterol below 100 mg/dl. A person with two risk factors but no history of heart disease it should be below 130. And a healthy person with no hostory neither risk factors it should be below 160.   So where do you fall in this pattern? Sometimes people unnecessarily get worried because of their percieved ilnesses, largely contributed by the media and in no less manner the pharmacologic industry.   An occasional 'large one' as you say will cause some transient discomfort. But it should be ignored. Try some regular aerobic exercises. This will go a long way to improve your heart muscle, your vagal tone and a generalised sense of well being.  Take care,   Apurva\n\n",
    "posted_time": "Post  by Dr. A. Madia » Sun Mar 16, 2008 6:51 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=56083&sid=d415cdddd88c219557a15b32392c93ba#p56083"
  },
  {
    "author": "Yuki  Guest Posts: 1 Joined: Sun Jan 04, 2009 8:46 am Gender: Female",
    "title": "Re: Chest pain, sudden feeling of cold",
    "content": "I'm only 17 years old but I'm kinda having problems in my chest. Whenever i lie flat in my bed i feel uncomfortable. something in my chest is aching. i cant breath easily and the difficulty can be felt from my neck to upper abdomen and in my chest. after that i feel so weak and cold.  what should i do? what might be the cause of this? how can you explain me having this unnecessary chest pain?  please answer me.. I'm afraid that something might have been happening to me.\n\n",
    "posted_time": "Post  by Yuki » Sun Jan 04, 2009 8:58 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=66874&sid=d415cdddd88c219557a15b32392c93ba#p66874"
  },
  {
    "author": "sidtf  Guest Posts: 1 Joined: Wed Nov 12, 2008 9:19 pm Gender: Male",
    "title": "endocardial fibrosis by high-tryptophan diet",
    "content": "Hello,   I've been eating about a cup of sunflower seeds a day and I've read that it's possible that high serotonin diets can cause endocardial fibrosis.   I know this is kind of a ridiculous question, but I enjoy the benefits of a serotonin rich diet and I plan on continuing it for a few years, I'm just wondering if it's possible that seemingly such a simple thing could lead to heart failure?   If that's not a risk, is there anything I should be worried about?   Ok final question, recently I've had blood in my stool. :-/ I'm guessing this is because the magnesium in the sunflower seeds thickens it and the sunflower seeds cut... Does this sound sound right? Anything I can take to loosen my stool?  Sorry about the ridiculous thread. :)\n\n",
    "posted_time": "Post  by sidtf » Wed Nov 12, 2008 9:33 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=64091&sid=d415cdddd88c219557a15b32392c93ba#p64091"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: endocardial fibrosis by high-tryptophan diet",
    "content": "Hello -  The primary reason for concern regarding serotonin in sunflower seeds is the observation of cardiac valvular fibrosis in animal models. While serotonin is not in all cases free in the blood (for instance with SSRI family of drugs), some substances do release free serotonin, and sunflower seeds, based on the animal models, may be one such substance. however, animal studies are notorious for their having recieved amounts of any given substance vastly higher than what a normal human would consume. A cup of sunflower seeds daily is hardly unusual, so is unlikely to present too much of a risk. If any untoward symptoms (other than those noted by you already) should arise, you probably should discontinue the sunflower seeds, and they may or may not be causing the blood in the stool. It's certainly possible, although when taken with a regular diet (instead of exclusively), this should be moderate.  The most common substance-caused form of endocardial fibrosis, and an often catastrophic one, is associated with the once-popular diet drug combination known as fen-phen. Sunflower seeds are nowhere near as dangerous as fen-phen.  While I can't recommend ingestion of such a large amount of a single dietary supplement, I don't think it is, by itself, especially risky.   I hope this is helpful. Best of luck to you.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Thu Nov 20, 2008 9:20 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=64722&sid=d415cdddd88c219557a15b32392c93ba#p64722"
  },
  {
    "author": "andreajane  Guest Posts: 1 Joined: Sat Sep 06, 2008 8:21 pm Gender: Female",
    "title": "cardiac arrest...... can this happen with Mitral Valve leak",
    "content": "My niece is 19 healthy, was in class the other day and suddenly went into Cardiac arrest, luckily was revived 7 times thanks to mouth to mouth and also the classroom had a  defibrillator. she is now in ICU it took awhile to stabilize her, she was running fevers and was having numerous seizures My concern is my daughter had MRSA a few weeks ago, should I feel concerned that maybe this is what caused this to happen to her? My sister was told that my Niece has a Mitral Valve Leak and thats what caused it. is it possible that MRSA had ANYTHING to do with this? I would feel horrible or can a Mitral Valve Leak actually cause her this much devistation and damage she is now facing Thank You ANYONE who can help\n\n",
    "posted_time": "Post  by andreajane » Sat Sep 06, 2008 8:49 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=60005&sid=d415cdddd88c219557a15b32392c93ba#p60005"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: cardiac arrest...... can this happen with Mitral Valve leak",
    "content": "Hello -  MRSA will not cause sudden cardiac arrest, so let yourself be easy about that. While mitral valve abnormalities are usually benign (as in mitral valve prolapse, the most common cause of leakage), there is a small but discrete subset of patients who, for unusual reasons, do experience sudden cardiac arrest. I want to stress that it is rare, especially with MVP, but there are some cases, especially where there is a notable leakage or regurgitation where yes, this is a possibility.   Your daughter is in no danger of having something catastrophic happen because of the MRSA infection. She will  simply need to be aware of it, since it can recur, and is a nuisance more than anything else (except in the very elderly and very sick). It has nothing to do wtih the incidence of cardiac arrest, but mitral regurgitation definitely can cause this in select, unfortunate individuals. I hope your  daughter stays well and that your neice is able to recover fully from this terrible mishap.  I hope this eases your mind. Best of luck to you and your family.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Tue Sep 30, 2008 8:54 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=61661&sid=d415cdddd88c219557a15b32392c93ba#p61661"
  },
  {
    "author": "sunkist123  Guest Posts: 1 Joined: Mon Aug 25, 2008 2:32 pm Gender: Male",
    "title": "chest pressure",
    "content": "25 male hypertension nexium 45 mg  i am feeling tightness on the right side of my chest and sometimes goes on the left side and my throat feels like a burning sensation also when working i feel out of breath like my lungs are burning and i started to have a dry cough now every once in a while my legs feel like they are trembling could this be symptons of heart failure thanks david\n\n",
    "posted_time": "Post  by sunkist123 » Mon Aug 25, 2008 2:50 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=59277&sid=d415cdddd88c219557a15b32392c93ba#p59277"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: chest pressure",
    "content": "Hi David -  The symptoms you describe do not fit the clinical picture of heart failure. Since you apparently have a history of GERD (presumed based on the Nexium prescription), the discomfort is probably exercise-induced acid reflux with possible secondary asthma. This should be explored (and now there is a test to determine if exercise is inducing either acid reflux and/or asthma secondary to exercise-induced reflux; it involves placing a tiny capsule with micro-electronics inside it, which detect and measure stomach acid entering the esophagus. A small portable monitor is carried like a heart monitor, and records the findings).  All that being said, you really should bring this problem to the attention of your doctor. While it is highly unlikely to be heart-related, it is not impossible, and if it's not you'd want to know, same as if it were. Probably more importantly,  you could find out if it is due to an increase in acid reflux  and if it is causing some asthma (it sounds very possible this is happening). Adjustment of your GERD medication might be in order.   I hope this is helpful. Please stay in touch with us. Good luck to you.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Fri Aug 29, 2008 10:48 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=59546&sid=d415cdddd88c219557a15b32392c93ba#p59546"
  },
  {
    "author": "HappyLady27  Guest Posts: 24 Joined: Sun Nov 25, 2007 10:47 am",
    "title": "congestive heart failer",
    "content": "my mom has been saying she was stuffy and chest congested, she just has a stuffy noise no need to go to the dr.  We were worried becuse last year, she was hospitalized  becuse she had nemonia and her throught closed up fingernails turned blue and was very sick.        This happend again tonight. We have been trying to get her to the dr all week she wouldnt. They told us she had congestive heart failer. Is this from diabeties? one of her arteries in her neck are clogest, and they think she has a murmer in her heart as well. Tommrow they take her for a ekg.  I am worried she has empazema she smoked for a long time. This is from her smokeing correct. Should I be extreamly worried?\n\n",
    "posted_time": "Post  by HappyLady27 » Sun Dec 09, 2007 9:49 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=51455&sid=d415cdddd88c219557a15b32392c93ba#p51455"
  },
  {
    "author": "HappyLady27  Guest Posts: 24 Joined: Sun Nov 25, 2007 10:47 am",
    "title": "[no title]",
    "content": "Im sorry im so nervouse im shakeing we took her to the emergencey room tonight she finally decided it was ok to go and thats when we found out all of this.\n\n",
    "posted_time": "Post  by HappyLady27 » Sun Dec 09, 2007 9:52 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=51457&sid=d415cdddd88c219557a15b32392c93ba#p51457"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: congestive heart failer",
    "content": "Hello happylady27 -  Your mom suffers from chronic obstructive pulmonary disease (COPD); emphysema accounts for a good deal of COPD, and smoking accounts for most but not all emphysema cases. People with COPD are far more prone to recurrent bouts of pneumonia. Pneumonia also \"looks\" a lot like congestive heart failure at times, since both involve the lungs having stuff (either pus or fluid) in them that makes them not work as well. Often they can coexist as well, although CHF is usually a chronic problem whereas pnuemonia will flare up from time to time. Even there, however, the two can be confused because CHF can be well managed, then get worse suddenly.   Diabetes is not a direct cause of CHF nor pneumonia, but it can in some ways contribute to the development of either one, and either one distracts from the usual diabetic care, so diabetic patients with either will get closer scrutiny inside a hospital than at home.  By symptom description alone it is difficult in this case to tell whether your mother was having another case of pneumonia (most likely due to history) or CHF (which would be a new development). In either case getting her to a hospital was the absolute right thing to do. Hopefully she subsequently responded to treatment and got better. Managing the diabetes carefully is one big part of this complex treatment plan. Also taking care of the COPD as well as possible is another. Recognizing pneumonia symptoms early is a third important thing for her. You seem to be aware of how all this works, so she is in good hands with you, but of course it is difficult to force another person to seek medical care even if you know they need it. This poses a stress for you as part of the cargiving team, so do be sure you take good care of yourself as well, and do not worry unnecessarily. You are doing your best to help your mom and that's the best anyone can do.   Please let us know how things have gone. Best of luck to you.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Sat Jul 19, 2008 12:53 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=58886&sid=d415cdddd88c219557a15b32392c93ba#p58886"
  },
  {
    "author": "dadof6  Guest Posts: 4 Joined: Sun Sep 16, 2007 7:44 pm",
    "title": "enlarged right ventricle",
    "content": "37yr old male, used to be an athlete but no serious   exercising in several years marked bradycardia 45 mother had mi at 55 no meds recent echo said mild mitral regurge, a trace of tricuspid regure, enlarged right ventricle, ejction fraction of 64%, all other findings were within normal limits no physical symptoms what is going on with my heart and what should be done next, should I be exercising?\n\n",
    "posted_time": "Post  by dadof6 » Tue Sep 18, 2007 9:18 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=47947&sid=d415cdddd88c219557a15b32392c93ba#p47947"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Dadof6,  I would recommend that you continue to follow up with your cardiologist to further evaluate this.  Your ejection fraction is normal and trace tricuspid regurge is probably a non-issue.    If you're having other symptoms you may need some further testing to see if everything is OK.  It is probably OK to exercise but I would advise you to ask your cardiologist about this first since he has all the details of your case.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Thu Nov 29, 2007 8:57 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50988&sid=d415cdddd88c219557a15b32392c93ba#p50988"
  },
  {
    "author": "dadof6  Guest Posts: 4 Joined: Sun Sep 16, 2007 7:44 pm",
    "title": "enlarged right ventricle",
    "content": "I had a stress test that was negative, also no sign of pulm hypertension, my right ventricle is 3.3cm, my cardiologist said that I should not be concerned about the enlarged right vent at this time, I am concerned about cardiomyopathy related to the enlrged right vent later in life, is this finding very common and is it likely that cardiomyopathy lurks in my future thanks\n\n",
    "posted_time": "Post  by dadof6 » Mon Dec 10, 2007 7:31 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=51485&sid=d415cdddd88c219557a15b32392c93ba#p51485"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: enlarged right ventricle",
    "content": "Hello dadof6 -  I just wanted to catch up on your appended question here. While an enlarged right ventricle is not a normal finding, it is neither terribly unusual nor always problematic. Cardiomyopathy can of course affect the RV, but generally has a more serious effect on the LV. There are one or two congenital conditions involving a thin RV free wall and some enlargement, but it often causes the patient no problem, although it should be followed over time. I think the concern over cardiomyopathy can probably be safely put on a back burner for now, and quite possibly for good. Just be sure you have an occasional look taken at this. It could also be an anomaly which will not show up next time.   Hope this will ease your concerns.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Sat Jul 19, 2008 12:01 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=58881&sid=d415cdddd88c219557a15b32392c93ba#p58881"
  },
  {
    "author": "ddavey  Guest Posts: 9 Joined: Wed Mar 09, 2005 7:20 am Location: michigan",
    "title": "coreg and ejection fraction",
    "content": "my 21 yr old has dilated cardiomyopathy, diagnosed in march 05.  at that time her ef on echo was 35-38%.  she was started on low dose of coreg and vasotec.  her amount of coreg is now at 50mgs day, it was increased when she began having palpitations. she recently underwent an transesphogeal echo to study an anuerysmal bulge near the mitral aortic junction and her ef was 35% (on regular echo it was 43%) she has had this mass since birth, but since her diagnosis of cardiomyopathy, her mitral regurg has increased from mild to moderate, and there is possiblilty of replacement soon   i am concerned about her ef, that there is no real improvement in her ef since diagnosis, in spite of coreg.  should we expect an increase.                     thank you                             ddavey\n\n",
    "posted_time": "Post  by ddavey » Fri Dec 01, 2006 7:48 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=35461&sid=d415cdddd88c219557a15b32392c93ba#p35461"
  },
  {
    "author": "singinRN  Guest Posts: 3 Joined: Fri Dec 08, 2006 1:52 pm",
    "title": "ejection fraction & coreg",
    "content": "I am a registered nurse, certified in Critical Care Nursing, and will try to give you some insight into this topic. Having a child with genitic cardiac problems, you probably already know quite a bit, but bear with me. The relative unchaging Ejection Fraction (EF) numbers you are referring to, despite the relatively high dose of Coreg that your child is taking is probably due to the fact that her mitral valve is further compromised. Until this valve is repaired (or, most likely, replaced surgically), the heart will continue to have to compensate for this leaking or regurgitation of blood at the valve juncture, no matter what medication is used. So, the fact that her EF has not significantly deteriorated further is probably a good sign, depending upon how she is physically tolerating this. Many people can tolerate even lower EF's, but this is something that requires regular monitoring. Things she should be doing to keep herself healthy include watching sodium intake (2000 mg per day is generally accepted limit), monitoring and keeping a record of her weights every morning after using the toilet, reporting any increase of 2-3 pounds in one day, or whatever her MD/NP suggests, eating a balanced and healthy diet, maintaining a healthy body weight,  and controlling blood pressure. Good luck!\n\n",
    "posted_time": "Post  by singinRN » Fri Jan 05, 2007 4:57 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=37286&sid=d415cdddd88c219557a15b32392c93ba#p37286"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: coreg and ejection fraction",
    "content": "Hello ddavey -  I think we've discussed other aspects of your daughter's problem in another thread, but wanted to check in here and second what singinRN has said. Hopefully by now the problem has been successfully dealt with. We'd like to hear from you if should check in here in the future.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Sat Jul 19, 2008 11:56 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=58880&sid=d415cdddd88c219557a15b32392c93ba#p58880"
  },
  {
    "author": "alana820  Guest Posts: 1 Joined: Sun Apr 06, 2008 10:07 am Gender: Male",
    "title": "transplant or LVAS ?",
    "content": "I am a 20 year old male dx mid 2006 with idiopathic dilated cardiomyopathy and ejection fraction then of 25% , over the following year meds raised the EF to 35% and had no symptoms.  In September of 2007 I started to get out of breath very easily and began coughing had my checkup with another echo and EF was down to 18% it was then discused about a transplant.  I am now in the process of being evaluated for one but have come across some articles about left ventricular assist system which has been approved in Europe and Canada for long term use in heart failure instead of just a bridge to transplant.  Just last week there was something about a Texas woman recovering completely after having the pump in for a year. What are your views on this ?  The hospital I will be having the transplant in is doing a study /clinical trial on the use of the LVAS I don't know if I would meet all the criteria for it but when I asked my cardiologist he just said that it would be better to go with something we already know works.  I also had a defibrillator put in 1 month ago, sorry I am asking so many questions but the thought of the transplant and the follow up after really scares me and I would like them to think about another way to do this  thanks in advance for your time\n\n",
    "posted_time": "Post  by alana820 » Sun Apr 06, 2008 11:06 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=57738&sid=d415cdddd88c219557a15b32392c93ba#p57738"
  },
  {
    "author": "Dr. A. Madia  Medical Doctor Posts: 207 Joined: Fri Jan 06, 2006 6:50 am Gender: Male Location: India",
    "title": "Re: transplant or LVAS ?",
    "content": "Hi,  Dilated cardiomyopathy with severe left ventricular dysfunction is difficult to treat. Even after optimal antifailure treatment with ACE inhibitors, Beta Blockers, diuretics and digitalis there remains a large body of patient with effort intolerance and decreased qaulity of life not to mention increased mortality.  Novel pharmacologic therapies therapies have evolved consisting of L arginine, Co Enzyme q 10, sildenafil citrate, etc. However hard evidnce is lacking on effectiveness of these therapies.  Next comes your heart transplant and LV assist device. LVAS was till now considered a bridge therapy in patints on transplant list. However recent evidence is encouraging as to its benefit for medium term  as a stand alone therapy.   One more option is Cardiac Resynchrinization Therapy, also known as bi-ventricular pacing. Its effectiveness has been shown in cases of heart failure who meet the criteria like EF less than 25 %, NYHA class III plus symptoms, EKG showing left bundle branch block with QRS duration more than 0.12 secs.  Its best to discuss out all these options with your cardiologist before reaching a decision. I have attached some references for your perusal.  Apurva.  References:  1. http://content.nejm.org/cgi/content/short/345/20/1435 2. http://jtcs.ctsnetjournals.org/cgi/cont ... 122/6/1186 3. http://www.ahrq.gov/clinic/tp/resyntp.htm\n\n",
    "posted_time": "Post  by Dr. A. Madia » Thu Apr 10, 2008 6:02 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=57917&sid=d415cdddd88c219557a15b32392c93ba#p57917"
  },
  {
    "author": "chrisr23  Guest Posts: 1 Joined: Thu Apr 03, 2008 6:17 pm Gender: Male",
    "title": "Always feel heart beat in throat/Strong with exertion...",
    "content": "Hello doc, I am 20 and suffering from Strong pulse and always feeling sensation of my heartbeat. I always feel my heart in my throat too most of the day now. I had 2 echos, a stress test, 3d thalium ct scan of heart, and all the holter monitors and event monitors. Everythign has come out perfect. Except i just checked my records lately and noticed on one of the echos in early 2006 i had a trace of mild valve regurgitation. I am worried. Because i panic all the time and i have been to 3 cardiologists and even a elctrophysiologist and they say not to worry. they all say tis anixety but i can still feel my heart in my throat. I am scared to exercise and when i do things that cause exertion i have to take a deep breathe and my heart is beating strong. I am very scared of this strong heartbeat and always feeling it in my throat. My latest test I just had a 30 day holter monitor 5 months ago and it came out fine. and i had a chest xray done 2 months ago that was fine. I am very worried and I am scared please help. Do you think i could have heart failure now or early sings of it. Or is this anxiety from just worrying so much everyday for the last couple of years. Is it bad to always feel your heartbeat in your throat? Can worrying all the time brought this on? please not this all came from when i had a huge panic attack on new years eve of 2005 and never been the same since...\n\n",
    "posted_time": "Post  by chrisr23 » Thu Apr 03, 2008 6:25 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=57576&sid=d415cdddd88c219557a15b32392c93ba#p57576"
  },
  {
    "author": "Dr. A. Madia  Medical Doctor Posts: 207 Joined: Fri Jan 06, 2006 6:50 am Gender: Male Location: India",
    "title": "Re: Always feel heart beat in throat/Strong with exertion...",
    "content": "Hi,  Many healthy young individuals do feel palpitations and strong pulse feeling, especially in thin and lean persons. Once you get a little conscious of this it causes anxiety. Anxiety will cause the heart to beat even faster and stronger. And the vicious cycle goes on.  Trace regurgitation is never an abnormality and many healthy individuals in general population have it on their Echo.  For your kind of symptoms you have undergone a battery of very advanced cardiac tests and many of this will show some irrelevant or inconsequential findings that will unnecessarily add to you anxiety. Feeling the force of pulse in one’s throat is not a cause of worry.  Forget heart failure. It is a complex entity wherein the heart has lost its force to pump out the blood. It will show as low Ejection Fraction on your Echo.    A simple advice for you. Calm down. Don’t be too health conscious. Remember at any given time a large majority of world population is healthy and free of disease. This is called concept of ‘wellness’. Occupy your mind with things you enjoy. Do vigorous physical exercises. Do some yoga and meditation. Forget doctors!  Apurva\n\n",
    "posted_time": "Post  by Dr. A. Madia » Wed Apr 09, 2008 10:23 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=57909&sid=d415cdddd88c219557a15b32392c93ba#p57909"
  },
  {
    "author": "mpmama294  Guest Posts: 13 Joined: Sat Jul 07, 2007 12:24 am",
    "title": "DIAGNOSED WITH MVR (please help anyone)",
    "content": "Hi  I;m 28 yrs old and have pvc's  anxiety attacks every once in a while...I am currently on paxil and toprol once a day....torprol i take 25 mg...and paxil the same...i had a routine echo and it came back showing that I had a mild leaky valve....I thinnk he said it was mitro valve regurgitation.......I panicked my head off to say the least.....My doctor didn't tell me much at all about it...he told me to don't worry ..that its mild...and that he wanted to keep my heart as relaxed as possible....i asked him should i go to a cardiologist ..he said i could ..but that would only be to put me at ease.....i asked him how often should i get an echo now..he said once a yr....but thats what i get now...but since i have this now..shouldn't i get an echo at least twice a yr or something.....I also wanted to know ./.i read that you hear a click or something in the heart for mitro valve regurgitation.........and my doctor didn't mention anything to me when he checked my heart during routine checkup......  I also wanted to know...i had a couple of pvc's during the echocardiogram could this have made it seem that i had  because of the skipping heartbeat....can this go away at all...please help me.....I would appreciate the advice....  thank you\n\n",
    "posted_time": "Post  by mpmama294 » Sun Dec 30, 2007 4:03 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=52358&sid=d415cdddd88c219557a15b32392c93ba#p52358"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "Re: DIAGNOSED WITH MVR (please help anyone)",
    "content": "Hi Mpmama294,  Mitral valve regurgitation is very common.  Regurgitation means leaking backwards through the valve.    If the leak is small (as is most commonly the case) it really is not a concerning issue.  It only becomes an issue if the heart begins to fail from a large leak.    It is recommended that people with mitral valve regurg. take endocarditis prophylaxis.  This means that before certain procedures that can introduce bacteria into the blood stream, such as dental work or cleanings, you should take an antibiotic.  Just one dose before these procedures is usually enough.  Your regular doctor can prescribe this for you.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Wed Jan 16, 2008 9:10 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=53214&sid=d415cdddd88c219557a15b32392c93ba#p53214"
  },
  {
    "author": "mat  Guest Posts: 1 Joined: Sun Dec 02, 2007 8:42 am",
    "title": "Is it possible to have S1+S2+0 in the PE of patient with AF?",
    "content": "The ecg findings also showed AF. Thank you very much.\n\n",
    "posted_time": "Post  by mat » Sun Dec 02, 2007 8:49 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=51080&sid=d415cdddd88c219557a15b32392c93ba#p51080"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "Re: Is it possible to have S1+S2+0 in the PE of patient with AF?",
    "content": "Hi Mat,  I apologize but I do not understand the notation \"O\" in your title.  It is possible for a patient in atrial fibrillation to have an S1 and S2 on their physical exam.  S1 is made by the closing of the tricuspid and mitral valves.  S2 is made by the closing of the atrial and pulmonic valves.  Even though the atria are not pumping in a coordinated method during atrial fibrillation blood still flows through the valves due to pressure of the bloodstream, allowing for an S1.  The ventricles pump normally creating S2.  If, by chance, the \"O\" refers to a gallop these are created by bloodflow so they can still be present with atrial fibrillation as well.  If I haven't fully answered your question please feel free to post a follow up.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sun Jan 06, 2008 10:17 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=52872&sid=d415cdddd88c219557a15b32392c93ba#p52872"
  },
  {
    "author": "RAWEYA  Guest Posts: 7 Joined: Mon Dec 24, 2007 5:42 pm Location: qairo  Contact:   Contact RAWEYA       Website   AOL",
    "title": "I cant walk more than 10 minutes without chest pain, dyspnea",
    "content": "Hello doctor im iris im 20. years old. recently i have noticed that i cant walk more than 10 minutes becoze after that i feel thaht my heart will explode..my heart start to beat very fast.. also i cant use the stares i always use the elevator for the same reason..i breath too fast as if i was climbing a mountain. now i can do nothing even the simple things  coz i get tired easily..some times i woke up because i feel also have the same things however i did not anything im just sleeping!! and now i started to feel a strange pain in my chest that make me cant breath. and some times i have a sharp apin in my chest and the centre of my back at the same time.. i went to a doctor  last years and he told me to make i think it was the  ekg  and my heart rates was 125 in a minute so he gave me an indral 40 but i did not feel ok..sometimes i take 2 pills in a day but im still not ok. so what should i do?im young to have a heart condition or it doesnt matter? ps: my mother's father had a heart condition.  thank you so much iris\n\n",
    "posted_time": "Post  by RAWEYA » Mon Dec 24, 2007 6:02 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=51965&sid=d415cdddd88c219557a15b32392c93ba#p51965"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "Re: I cant walk more than 10 minutes without chest pain, dyspnea",
    "content": "Hello Iris,  Sorry to hear about your condition. Have you consulted a cardiologist. Heart disease can occur in young patients and the shortness of breath on exercise as well as the chest pain require a careful assessment. Is this condition progressive?  What heart disease did your parents have? and at what age did they start having it?\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Mon Dec 24, 2007 10:46 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=51970&sid=d415cdddd88c219557a15b32392c93ba#p51970"
  },
  {
    "author": "RAWEYA  Guest Posts: 7 Joined: Mon Dec 24, 2007 5:42 pm Location: qairo  Contact:   Contact RAWEYA       Website   AOL",
    "title": "Re: I cant walk more than 10 minutes without chest pain, dyspnea",
    "content": "peace be upon you doctor tamer and happy eid..  well thanks for the quick reply..i forgot to say that it is with a chest pain actually ..that doctor that i was talking about told me to go to a cardiologist but i thoght that time that he did not understand anything because he didnt tell me what to do that day he just took my pulse and blood pressure and told me to do the ekg i thing  and he even didnt tell me what may i have and he didnt ask me any question ..so i thought im just tired and thats it..but when i started to feel that pain again and harder than before i started to worry..i told my mom once and she couldnt believe that i have anything in my heart coz im young so thats why im asking first in the internet and i will  work alone in my case without any help from them thats why i need to know before i go to a doctor alone..and yes it is progressive.. it my grand mom who had it neither my mom nor my dad..i will ask about it and tell you..  thank you so much doctor for the help and sorry for any disturb.  و كل عام و حضرتك بخير\n\n",
    "posted_time": "Post  by RAWEYA » Tue Dec 25, 2007 11:23 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=51979&sid=d415cdddd88c219557a15b32392c93ba#p51979"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "Re: I cant walk more than 10 minutes without chest pain, dyspnea",
    "content": "Thank you very much Raweya and happy Eid to you and your family.  Young age and female gendre offer protection from the most common heart disease (coronary artery disease) but does not eliminate any other cause for heart disease. Again the likelihood that you have any of these diseases is decreased by young age.  The thing that concerns me more is your description of progressive exertional dyspnea. I would follow your doctor's recommendation and seek the assessment of a cardiologist as soon as possible.  Best regards,\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Wed Dec 26, 2007 8:18 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=52010&sid=d415cdddd88c219557a15b32392c93ba#p52010"
  },
  {
    "author": "RAWEYA  Guest Posts: 7 Joined: Mon Dec 24, 2007 5:42 pm Location: qairo  Contact:   Contact RAWEYA       Website   AOL",
    "title": "Re: I cant walk more than 10 minutes without chest pain, dyspnea",
    "content": "Thank you doctor tamer so much and happy eid to you too..  well ok i will try to go to a doctor soon i will try after my exams ..do you recommend any hospital..i did not live in egypt so i know nothing about the good hospitals and you seems egyptian right? so any advice about that issue??  i don't know if this information may help but i will say it any way i was born before my time (5 months only and i my weight was 500 gram) my mom was in turky when chernopel exploded in russia so she went back to kuwait because it was dangerous to stay there while carrying me..and once she return i came to this life .. is there any chance that this incident may czuse anything??? well i thought it may help in something.  thanx again and best wishes to you and your family..\n\n",
    "posted_time": "Post  by RAWEYA » Wed Dec 26, 2007 11:26 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=52072&sid=d415cdddd88c219557a15b32392c93ba#p52072"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "Re: I cant walk more than 10 minutes without chest pain, dyspnea",
    "content": "Hello again,  I think we should take this step by step and first determine what it is you have before we consider the possible causes. I am not really in a position to make a recommendation - I presume there are many good cardiologists in Egypt.   I think there is a hospital affiliated to the Cleveland Clinic called Dar El-Fouad. They mainly specialize in the treatment of heart disease.  Good luck with the exams!\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Thu Dec 27, 2007 4:57 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=52086&sid=d415cdddd88c219557a15b32392c93ba#p52086"
  },
  {
    "author": "RAWEYA  Guest Posts: 7 Joined: Mon Dec 24, 2007 5:42 pm Location: qairo  Contact:   Contact RAWEYA       Website   AOL",
    "title": "Re: I cant walk more than 10 minutes without chest pain, dyspnea",
    "content": "salam akaikom dr tamer..  ok then i will try to go as soon as possible..but i just asked you coz i don't know anything here and as i told you before i will work on this alone so i cant ask them about anything they will not let me go and they wont go with me so its complicated but i don't want to go to the same hospital that i went before i want feel so comfort that day...sorry i cause i diurb for you but i didnt mean it i just asked bcoz of what i told you about..  and manyyy thanx for the wishes i really need it so pls make do3a2 for me and my friends english literature is soo hard (but not comparing with medecine) LOL!!  thank you sooo much for the help..your time and the information..  raweya(iris)\n\n",
    "posted_time": "Post  by RAWEYA » Thu Dec 27, 2007 12:56 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=52104&sid=d415cdddd88c219557a15b32392c93ba#p52104"
  },
  {
    "author": "RAWEYA  Guest Posts: 7 Joined: Mon Dec 24, 2007 5:42 pm Location: qairo  Contact:   Contact RAWEYA       Website   AOL",
    "title": "Re: I cant walk more than 10 minutes without chest pain, dyspnea",
    "content": "quick question:  i emailed cleveland clicic and they replyed that i may have arrhythmia is that similar to dyspenea?? i googled both of them but im not a doctor to understand or to defferinciate between them?? so is there any difference??  thanx alot\n\n",
    "posted_time": "Post  by RAWEYA » Thu Dec 27, 2007 3:12 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=52112&sid=d415cdddd88c219557a15b32392c93ba#p52112"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "Re: I cant walk more than 10 minutes without chest pain, dyspnea",
    "content": "Hello,  Dyspnea means shortness of breath while arrhythmia means abnormal rhythm of the heart. Arrhythmia can sometimes lead to dyspnea. All of these are possibilities which I don't think you should get into since no one will be able to diagnose you without an examination.  Good luck and keep this thread updated.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Fri Dec 28, 2007 8:06 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=52164&sid=d415cdddd88c219557a15b32392c93ba#p52164"
  },
  {
    "author": "RAWEYA  Guest Posts: 7 Joined: Mon Dec 24, 2007 5:42 pm Location: qairo  Contact:   Contact RAWEYA       Website   AOL",
    "title": "Re: I cant walk more than 10 minutes without chest pain, dyspnea",
    "content": "thanks alot dr tamer for the information i like to know what are the possibilities bsfore i go to any doctor and to know some information incase he said on of these names so..thank you so much again and i will tell you what happened when i go ta a doctor..  pls make do3a2 for me coz i really need it...  thanx iris\n\n",
    "posted_time": "Post  by RAWEYA » Mon Dec 31, 2007 3:27 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=52432&sid=d415cdddd88c219557a15b32392c93ba#p52432"
  },
  {
    "author": "HOT4KIDROCK  Guest Posts: 1 Joined: Sun Nov 11, 2007 6:18 pm",
    "title": "feeling heaviness in chest",
    "content": "age 41 sex female past dia. none past sur. none family his.  unknown meds. norco, xanax, and celexa  for about the last month i have had almost a constant heaviness in my chest area. also the feeling of my chest feeling squeezed. Is that a sign of heart diesase? What could it be?\n\n",
    "posted_time": "Post  by HOT4KIDROCK » Sun Nov 11, 2007 6:25 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50105&sid=d415cdddd88c219557a15b32392c93ba#p50105"
  },
  {
    "author": "Debbie Miller, RN  Nurse Posts: 4746 Joined: Mon Apr 16, 2007 2:41 pm Gender: Female Location: USA",
    "title": "[no title]",
    "content": "Heaviness and squeezing of the chest both can be signs of heart problems.  It may not be.  But, it would be wise to have it checked out by a doctor.  Do not delay in case it is a heart condition.  Take care.\n\n",
    "posted_time": "Post  by Debbie Miller, RN » Sun Nov 11, 2007 9:35 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50134&sid=d415cdddd88c219557a15b32392c93ba#p50134"
  },
  {
    "author": "canaveral  Guest Posts: 2 Joined: Sun Oct 21, 2007 10:20 pm",
    "title": "Bi Ventricular Pacemaker / ICD",
    "content": "I am 56 years old.  Male  I have dilated cardiomyopthy.  I am being evaluated for a heart transplant next week.  In preparation for this evaluation I currently am on  Zocor, Lanoxin, Coreg, Amioderine, Asprin.  They have taken me off Lasix, Avapro, Niaspan and cut my Coreg to 6.25 MG twice a day.  My question is if at any point (Low EF, ect), does the Biventricular Pacemaker / ICD that I have cease to perform any real function?  Also, what is the opion of the medical communites opion of truning thes off, if requested bu a patient.  Thanks!\n\n",
    "posted_time": "Post  by canaveral » Thu Nov 08, 2007 10:00 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50016&sid=d415cdddd88c219557a15b32392c93ba#p50016"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Canaveral,  I would recommend against turning off the pacemaker/ICD.  There are a few reasons.  Even though your heart isn't squeezing as well as it should, if the rhythm becomes abnormal (which is more prone to happen in cardiomyopathy) the ICD part may be able to shock it back into a normal rhythm.  Also, since the heart isn't pumping well, it is important that the heart rate not drop too low.  This is where the pacemaker part kicks in.  It can help prevent the pulse from dropping below a set point.  Even though your heart is having trouble it is still doing some work so the key is keeping it going until the transplant.  The pacemaker/ICD may be able to help this happen.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Thu Nov 08, 2007 10:06 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50017&sid=d415cdddd88c219557a15b32392c93ba#p50017"
  },
  {
    "author": "carol3  Guest Posts: 3 Joined: Sun Nov 04, 2007 10:40 am",
    "title": "can vitamins cause heart failure",
    "content": "i'm 27 years old, i'm a female i never had any past diagnoses or surgeries, i grandmother did past away from breast canceri'm not currently taking any medications. my question is if i take biotin at 1000mcg, can i also take prenatal vitamins and multi vitamins without overdosing on those vitamins\n\n",
    "posted_time": "Post  by carol3 » Sun Nov 04, 2007 10:56 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=49855&sid=d415cdddd88c219557a15b32392c93ba#p49855"
  },
  {
    "author": "Debbie Miller, RN  Nurse Posts: 4746 Joined: Mon Apr 16, 2007 2:41 pm Gender: Female Location: USA",
    "title": "[no title]",
    "content": "You do not mention why you take the biotin.  Deficiency of this vitamin is rare and you should not need to take additional amounts unless prescribed by a doctor.  Your prenatal vitamin would contain all you should need and overdosing on some vitamins can be a problem so I would avoid, especially in pregnancy.  In some cases the extra vitamin is mostly excreted and it's just money down the drain, but when you are pregnant, there are unknown factors and it's best not to take any chances.  Obviously we do not test on pregnant women so we can't say that double-blind studies have shown problems, but it's best to be safe.  You definitely should not need an additional multi vitamin unless perhaps you are carrying multiples (twins, triplets)\n\n",
    "posted_time": "Post  by Debbie Miller, RN » Sun Nov 04, 2007 1:45 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=49869&sid=d415cdddd88c219557a15b32392c93ba#p49869"
  },
  {
    "author": "canaveral  Guest Posts: 2 Joined: Sun Oct 21, 2007 10:20 pm",
    "title": "Alternative Medications Or Surgery",
    "content": "I am a 56 year old male.  I was diagnosed with dilated cardiomyopthy in March, 2001.  I have a biventricular pacemaker & ICD.  I have no history of heart attack or blockage.  I have an EF of 25% (it was 39%) a year ago.  I currently have extreme dizziness (which the cariologist says is because my heart isn't pumping enough blood to my brain)  I had a gall bladder removed in Septermber, a cardioversion for AF in September.  I had a blood clot in my heart that had to be disolved in August to do the Cardioversion.  There is a history in witn my mother siblings, but not her.  I am currently taking:  Coreg 6.25 MG twice a day Amioderone 200MG Twice a day. Lanoxin .025MG once a day Zocor 40MG Once a day Coumadin 2MG once a day Lasix 40MG twice a day Klor-Con M20 twice a day Niaspan 1000ER Twice a day 325 Mg Asprin Once a day  I had been taking Avapro, but the doctor took me of of it because of low blood pressure.  Do you think that there are any medication or surgical options for me?  I am thinking about gettin a second opinion.  Thanks You!\n\n",
    "posted_time": "Post  by canaveral » Sun Oct 21, 2007 10:53 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=49298&sid=d415cdddd88c219557a15b32392c93ba#p49298"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Canaveral,  This is a difficult problem.  Regarding surgical issues it is likely that the only surgical solution will be a heart transplant.  To my knowledge there is no other surgical corrective procedure available.  The best thing for dilated cardiomyopathies is to try to maximize the cardiac function and minimize future complications.  In some cases medical management is not successful in preventing future problems and a transplant may be necessary.  Specific issues related to your case may no fit this exactly.  This is general information about dilated cardiomyopathies.  Follow up with your cardiologist is very important.  Your cardiologist can give you better information directly related to your situation.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sat Nov 03, 2007 5:35 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=49841&sid=d415cdddd88c219557a15b32392c93ba#p49841"
  },
  {
    "author": "saintric_21  Guest Posts: 7 Joined: Thu Jul 05, 2007 12:04 pm",
    "title": "sharp pains on sides of breastbone, between shoulderblades",
    "content": "Hi Doctors, I have posted here today as I don't know where to turn to. I have been suffering for the last 3 months from various pains in my body along with twitches and spasms.  I have had many blood tests,x-rays,and ECG tests  these all coming back normal except for high creatinin in my kidneys in 2 of the last blood tests.My doctor said it was nothing to worry about and that the rest of my symptoms is Anxiety related.I accepted this and hoped it would go if I relaxed but it has got worse and now my Doctors wont help me as they think its my anxiety.The symptoms I have are sharp pains on either side of my breastbone, pains in my stomach/chest, when I push in the left side of my stomach area gives me sharp shooting pains elsewhere. But the worst pains are the ones in the center of my back between the shoulder blades,and spasms that are very big inside the center of my chest below the breastbone, Breathlessness and also I get very painful sharp shooting pains in my neck that make me feel nauses.I think that I might have a heart problem? or most possibly a clot in my chest or a pulmonary embolism? do these symptoms sound like anything you know of doctor??Code: Select all\n\n",
    "posted_time": "Post  by saintric_21 » Sun Sep 09, 2007 10:35 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=47569&sid=d415cdddd88c219557a15b32392c93ba#p47569"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Saintric_21,  Your pain does not sound consistent with heart pain or a pulmonary embolism.  I am more suspicious that you may have a diffuse pleurisy (inflammation of the lining of the lungs).    Following up with your doctor is important in helping figure out what is going on.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Tue Oct 09, 2007 5:49 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=48871&sid=d415cdddd88c219557a15b32392c93ba#p48871"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "I agree with Dr. Chan that your symptoms are not consistent with either pulmonary embolism or pain due to cardiac ischemia.  I understand your concerns as well as your frustration. However, the only way to solve this is to get a second opinion and have another doctor examine you.  Other causes of sudden chest pain include aortic dissection. That may present with pain between the shoulder blades or with renal problems depending on its location. Let me stress however, that statistically speaking this would be very unlikely to be your condition (it happens at a late age 50-70). The fact that you do not have any risk factors for dissection (hypertension, Marfan's syndrome, bicuspid aortic valve or coarctation of the aorta) make it even less likely. This condition is usually diagnosed by CT, MRI or transesophageal echo.   Please keep this post updated with your condition.  Best regards,\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Fri Oct 12, 2007 2:34 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=48909&sid=d415cdddd88c219557a15b32392c93ba#p48909"
  },
  {
    "author": "nakinyemi  Guest Posts: 2 Joined: Sat Sep 22, 2007 5:28 am",
    "title": "Heart pain",
    "content": "Hello all  I am 25, a Nigerian male with occasional heart pain. I have not been the hospital as that is expensive here. I am currently on no medications.  For the last three months I have these heart aches that come and go and sometimes could last for hours. It feels like someone is squeezing my heart and the pain is not in the center of my chest rather in my heart area. Its like the feeling of when you are depressed just that theres the pain.  Thank you and God bless.\n\n",
    "posted_time": "Post  by nakinyemi » Sat Sep 22, 2007 5:51 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=48066&sid=d415cdddd88c219557a15b32392c93ba#p48066"
  },
  {
    "author": "Marceline F, RN  Nurse Posts: 229 Joined: Wed Feb 28, 2007 1:54 am",
    "title": "[no title]",
    "content": "Dear Nakinyemi, How long have you been in the US?  l get the impression that you are acquainted with depression, and the \"feelings\" thereof. Is your presence here for pleasure, or for business, or related to family choices outside of your control?  Depression can indeed cause chest pain/pressure. The process for determining if a problem is cardiac related or depression, is generally one that follows a \"rule-out\" for cardiac first - after all it is wisest to make sure the pump is working properly,  Then one can decide what emotional ailments may be causing pain. For the cardiac workup there are simple blood tests, and an EKG (electrocardiogram) that can show it there are any cardiac enzyme elevations indicative of heart damage.  Even a young man can have cardiac problems.  And even a young man can have emotional distresses that can cause chest pain.  There are community clinics in nearly every town in America that offer free or low cost health evaluations.  You may ask at the local hospital emergency room for a referral, or even ask them for a reasonable payment play and be evaluated there.  I strongly suggest you look into this as soon as you are able - better to know now if you have any serious heart problems, than to find out after suffering a major heart event!\n\n",
    "posted_time": "Post  by Marceline F, RN » Mon Oct 01, 2007 6:46 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=48512&sid=d415cdddd88c219557a15b32392c93ba#p48512"
  },
  {
    "author": "nakinyemi  Guest Posts: 2 Joined: Sat Sep 22, 2007 5:28 am",
    "title": "noted",
    "content": "Hello Thank you very much for your response.  I am actually in Nigeria and I will adhere to the advice given to me. The pain has actually now moved the lower  and now is just beneath my heart area. The frequency has reduced as I try to get occupied with work or family.  I am really grateful to this help and pray for good things to come your way. Thank you Marcelin\n\n",
    "posted_time": "Post  by nakinyemi » Mon Oct 01, 2007 2:57 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=48531&sid=d415cdddd88c219557a15b32392c93ba#p48531"
  },
  {
    "author": "christuggle  Guest Posts: 1 Joined: Sat Sep 22, 2007 12:40 am Location: Olympia, Washington",
    "title": "High Blood Pressure ... When should I get Help?",
    "content": "I realize that these blood pressure machines in stores are not right on the money. Would I be right to believe that if I use the same one... I should have a ballpark number? Anyways I've had a history of my bp spiking and I\"m never sure if I should go to the hospital. I'm male, 35 years of age with some bp problems on my dads side.   To the point. At times (rather when my head hurts alot) I check my bp. I've used this same bp manchine for a year or so. Heres the results about a hour ago, 171/113 with a pulse rate of 123. Yes My Head Hurts pretty bad. Other than that I feel OKAY. Finances have made this hard to deal with.  The odd thing is that my bp will stay normal-high (140/90) range for months.   I know theres no set number to go get help, but when should I be thinking that way?  THANK YOU so very much for your time! Chris\n\n",
    "posted_time": "Post  by christuggle » Sat Sep 22, 2007 2:15 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=48058&sid=d415cdddd88c219557a15b32392c93ba#p48058"
  },
  {
    "author": "Marceline F, RN  Nurse Posts: 229 Joined: Wed Feb 28, 2007 1:54 am",
    "title": "[no title]",
    "content": "Dear Christuggle,  High blood pressure is dangerous because if left untreated it can contribute to serious complications such as stroke, cardiomyopathy, kidney problems, vision problems, and so much more.  While it is accepted that life stressors can contribute to hypertension (the technical term for high blood pressure), it is also understood that a person with a family history of hypertension has an increased possibility of inheriting this disorder. The numbers you mention (170 + over 110+) are clinically of great concern.  Whether or not this pressure is driven up due to stress, or is elevated due to your own physiology can only be determined by a doctor, with lab work, possibly Echocardiogram, possibly stress test, and an EKG.  If you are checking your pressure as frequently as you portray, it seems you have some concerns.  Please address them to you PCP (Primary care Physician) and follow through on his or her recommendations.\n\n",
    "posted_time": "Post  by Marceline F, RN » Mon Oct 01, 2007 6:26 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=48511&sid=d415cdddd88c219557a15b32392c93ba#p48511"
  },
  {
    "author": "Judith53  Guest Posts: 2 Joined: Mon Jul 23, 2007 4:56 pm",
    "title": "Do I need a cardiologist?",
    "content": "I am a 53 year old female who is overweight and had bilateral knee surgery. I am unable to exercise in a way that causes me to burn calories. I recently have been short of breath, sometimes from activity and sometimes not. I am having chest pressure that radiates to my back. I am on a blood pressure med but has been running 188/77 and pulse is staying from 115-120. Chest xray showed slight enlargement of the heart. EKG showed I had already had a heart attack. Echo was ok. My family docs will not refer me to a cardiologist which there are 22 at my hospital. Should I pursue this? I am afraid of doing nothing. My doc stated I was stressed and upped my meds of effexor and klonopin and told me to exercise more. I am going to go to biofeedback but honestly don't feel it's stress.\n\n",
    "posted_time": "Post  by Judith53 » Mon Jul 23, 2007 5:22 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=45027&sid=d415cdddd88c219557a15b32392c93ba#p45027"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Judith53,  I would be concerned about your elevated blood pressure.  Your symptoms of shortness of breath and chest pressure could be heart related.  I would think it would be reasonable for you to see a cardiologist for an evaluation.  You may need a stress test to evaluate your heart condition better.  Your doctor may have a reason that he is not wanting to refer you.  I would recommend you discuss your concerns with him and see if you are able to come to an agreeable solution.  It is also always reasonable to request a second opinion.  As a reminder to all our readers, this website should not be considered a source of a second opinion since we cannot directly evaluate you.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Thu Jul 26, 2007 2:28 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=45328&sid=d415cdddd88c219557a15b32392c93ba#p45328"
  },
  {
    "author": "Judith53  Guest Posts: 2 Joined: Mon Jul 23, 2007 4:56 pm",
    "title": "Do I need a cardiologist?",
    "content": "Thank you for your reply and just know that I appreciate it. I got a second opinion but at the same facility. My friend that works at this large hospital I go to told me that the doctors are cutting back on referrals and tests because of insurance. Doesn't seem ethical. I am trying to get an appt. at  another hospital in town to see a cardiologist.  Sincerely,  Judith\n\n",
    "posted_time": "Post  by Judith53 » Sat Aug 04, 2007 9:56 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=45669&sid=d415cdddd88c219557a15b32392c93ba#p45669"
  },
  {
    "author": "carmstrong03  Guest Posts: 3 Joined: Fri Jul 06, 2007 2:58 pm",
    "title": "Pitting Edema, Lowering EF, Shortness of Breath",
    "content": "I am a 34 year old female. I have severe pitting edema of my lower legs and ankles mainly my left side, muscle weakness and fatigue.    I was recently rushed to an ER for left leg swelling and was told possble Congestive Heart Failure. I visited a Cardiologist for an Echo and Stress test. My ejection fraction is 54 compared to 59 four years ago and the stress test was normal. Lab work shows my sugar is normal, no protein in my urine. I do however have a positive ANA, anemia and high Sed Rate.  I am very confused about all of this. If my symptoms are not heart related what other possiblities should I address? Should I be concerned with the lowering ejection fraction or is it normal to decrease with age?\n\n",
    "posted_time": "Post  by carmstrong03 » Fri Jul 06, 2007 4:10 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=44155&sid=d415cdddd88c219557a15b32392c93ba#p44155"
  },
  {
    "author": "Marceline F, RN  Nurse Posts: 229 Joined: Wed Feb 28, 2007 1:54 am",
    "title": "[no title]",
    "content": "Dear carmstrong03, From the fact that you had an echo done 4 years ago leads me to believe you have had concerns about your health for some time.  While you understand correctly that the heart plays a large part in circulation, and that congestive heart failure can give you the symptoms you describe, there is another major organ of the body that plays a huge role in fluid retention - especially evident in dependent extremeties. (The symptoms show up particularly noticeable in legs since they are \"down\", or in a dependent position, most of the time.)  Have you had any tests done concerning kidney health?  The kidneys have the incredible task of being the garbage trucks for the body, eliminating wastes and toxins. If the body has an infection that affects the kidneys, they can cause problems like back up of fluid in the legs and hands. Having an abnormal ANA or SED rate would be worth asking your doctor for further information.  There are simple tests that may help clarify these findings.  In any event the swelling in your legs is not normal, and deserves a closer look.\n\n",
    "posted_time": "Post  by Marceline F, RN » Sat Jul 07, 2007 4:26 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=44202&sid=d415cdddd88c219557a15b32392c93ba#p44202"
  },
  {
    "author": "carmstrong03  Guest Posts: 3 Joined: Fri Jul 06, 2007 2:58 pm",
    "title": "\"Pitting Edema, Lowering EF, Shortness of Breath\"",
    "content": "Marceline Thank you for your quick response. I have had concerns, the swelling in my legs has been going on for quite some time. I have had testing done on my kidneys and my kidneys are normal. Any other ideas?\n\n",
    "posted_time": "Post  by carmstrong03 » Sat Jul 07, 2007 8:56 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=44216&sid=d415cdddd88c219557a15b32392c93ba#p44216"
  },
  {
    "author": "Marceline F, RN  Nurse Posts: 229 Joined: Wed Feb 28, 2007 1:54 am",
    "title": "[no title]",
    "content": "Dear Carmstrong03, Are your legs reddened and warm to touch?  Does the skin look normal?   What are the rest of your lab values on your CBC (you mention anemia)? More importantly, what does your primary doctor think?  You apparently are being followed by a practitioner - what is she/he suggesting may be the problem?  Sounds like your concerns would be best addressed by a physician who can assess your edema directly, and order appropriate tests.\n\n",
    "posted_time": "Post  by Marceline F, RN » Sat Jul 07, 2007 12:22 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=44225&sid=d415cdddd88c219557a15b32392c93ba#p44225"
  },
  {
    "author": "daughterconfused  Guest Posts: 1 Joined: Mon May 14, 2007 10:26 am",
    "title": "death from heart failure",
    "content": "male 65 with diabetes, on dialysis, liver disease, conjestive heart failure result of past heartattack, NO valve bolckages. Was currently taking Pacerone. My father did not take his dosage of pacerone the day he died and he had dialysis the same day could the missed dosage have contributed to his death?\n\n",
    "posted_time": "Post  by daughterconfused » Mon May 14, 2007 10:43 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=42437&sid=d415cdddd88c219557a15b32392c93ba#p42437"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "I am very sorry to hear of your loss.  In cases such as this it is very difficult to determine what caused the death.  It may have been the missed dose of pacerone; however, it could have just as easily been something else.    Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Mon May 14, 2007 12:08 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=42444&sid=d415cdddd88c219557a15b32392c93ba#p42444"
  },
  {
    "author": "saira  Guest Posts: 2 Joined: Fri Feb 10, 2006 2:25 pm",
    "title": "collapse and trouble breathing",
    "content": "recently i collapsed in my office, i was having menstrual pain but not to a great extent. anyways, i had trouble moving and breathing. it lasted for about 15 mins.   i was wheeled to a doctor who took my blood test. After a few days i was told there was nothign wrong and my blood report just indicated that i had a SLIGHTLY higher count of white blood cells. He gave me tons of vitamens though.   Now i usually feel exhausted and Today,im having trouble breathing.\n\n",
    "posted_time": "Post  by saira » Fri Feb 10, 2006 2:57 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=30376&sid=d415cdddd88c219557a15b32392c93ba#p30376"
  },
  {
    "author": "saira  Guest Posts: 2 Joined: Fri Feb 10, 2006 2:25 pm",
    "title": "[no title]",
    "content": "please advise whts wrong with me?\n\n",
    "posted_time": "Post  by saira » Fri Feb 10, 2006 2:58 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=30377&sid=d415cdddd88c219557a15b32392c93ba#p30377"
  },
  {
    "author": "MaryAnn N, RN  Nurse Posts: 47 Joined: Sun Jan 22, 2006 7:53 am Location: USA",
    "title": "[no title]",
    "content": "You need to see your primary care doctor as soon as possible.  It is impossilbe to guess what may be wrong with just elevated WBC.  Not sure what tests that doctor did or did not do.  Hope you start feeling better, write us and let us know how you are doing.  MaryAnnRN\n\n",
    "posted_time": "Post  by MaryAnn N, RN » Sat Feb 11, 2006 4:55 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=30417&sid=d415cdddd88c219557a15b32392c93ba#p30417"
  },
  {
    "author": "LunaLover  Guest Posts: 1 Joined: Mon Jul 18, 2005 9:15 am Location: Wisconsin",
    "title": "Toprol's impact on Ejection Fraction",
    "content": "I'm 42.  Nine months ago my doctor put me on 25mg of Toprol for SVT's.   The SVTs are gone, but since then my Ejection Fraction (the percent of blood my left ventricle is pumping out) has dropped from 59% to 47%. My doctor told me, since I don't have diabetes or coronary artery disease, it must be alcoholic cardiomyopathy and ordered me to no longer drink alcohol. From my research on the internet, it sounds like you have to be a pretty heavy drinker to have alcoholic cardiomyopathy.  I drink one bottle of wine a week.   I can't imagine that little alcohol is causing such a big drop in my ejection fraction. I  wonder if it's the Toprol that has caused my cardiac output to drop.  My doctor says 25mg is too small to have that effect. Has anyone heard of Toprol XL lowering the left ventricle's ejection fraction?\n\n",
    "posted_time": "Post  by LunaLover » Mon Jul 18, 2005 9:48 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=16997&sid=d415cdddd88c219557a15b32392c93ba#p16997"
  },
  {
    "author": "dv1  Guest Posts: 1 Joined: Wed Jul 27, 2005 12:39 pm Location: USA",
    "title": "[no title]",
    "content": "Actually, it's the opposite.  Beta Blockers, such as Toprol, are prescribed (in part) to improve EF.  I've read a number of anecdotal reports to support that it does.\n\n",
    "posted_time": "Post  by dv1 » Wed Jul 27, 2005 12:43 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=17587&sid=d415cdddd88c219557a15b32392c93ba#p17587"
  },
  {
    "author": "R. Zein, Pharm D  Pharmacist Posts: 157 Joined: Tue Jul 12, 2005 9:16 pm Location: USA",
    "title": "[no title]",
    "content": "Drinking alcohol in excessive quantities has a direct toxic effect on the heart muscle cells. Alcoholic cardiomyopathy is a form of dilated cardiomyopathy caused by habitual alcohol abuse.  Alcoholic cardiomyopathy causes poor heart function because the heart muscle becomes too weak to pump efficiently. The condition leads to heart failure. Lack of blood flow affects all parts of the body, resulting in damage to multiple tissues and organ systems.  So generally speaking the causes of dilated cardiomyopathy could be the chronic use of alcohol. It can also occur as a complication of child birth and pregnancy. In addition there are some infectious causes, including mainly viruses, and even hereditary cause and toxins like cobalt, which was once used in beer.  Long term use of alcohol can result in a number of histological and cellular changes in the cardiomyoctyes, contractile proteins, intracellular organelles, and calcium homeostasis.  In your case the use of beta blockers should be beneficial. In fact studies have shown that addition of beta blockers reduce morbidity and mortality in some cases of heart failure.  Often in patients with mild stages of CHF, congestive heart failure (meaning ejection fraction less than 50 %), when patients are given a beta blocker, they experience an increase, and improvement in the ejection fraction within a few months.  I do not believe that Toprol may have caused this decline in your ejection fraction. I believe that you probably do have alcoholic cardiomyopathy based on what I have already mentioned above and on your doctor's diagnosis. You should really abstain from alcohol use.   Thank you very much, and I hope you always feel better.\n\n",
    "posted_time": "Post  by R. Zein, Pharm D » Sun Oct 30, 2005 9:35 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=24324&sid=d415cdddd88c219557a15b32392c93ba#p24324"
  },
  {
    "author": "Dr. A. Madia  Medical Doctor Posts: 207 Joined: Fri Jan 06, 2006 6:50 am Gender: Male Location: India",
    "title": "[no title]",
    "content": "Hi Lunalover  The amount of alcohol you consume can bever cause cardiomyopathy, on the other hand it is cardioprotective. Toprol can never cause EF to drop. Infact it is the treatment for low EF. If you do have cardiomyopathy, which I can only comment on if I have the Echo report at my disposal, the causes are many and most common are Idiopathic [meaning without known cause] and ischemic [meaning gradual lowering of blood supply to heart muscle over a period of time.  Meanwhile do not unnecessarily deprive yourself of your weekly quota of a bottle of red wine!!!:-)\n\n",
    "posted_time": "Post  by Dr. A. Madia » Wed Jan 25, 2006 8:09 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=29147&sid=d415cdddd88c219557a15b32392c93ba#p29147"
  },
  {
    "author": "dmamacher  Guest Posts: 7 Joined: Tue Dec 07, 2004 6:38 am Location: South Carolina",
    "title": "Pulmonary Arterial Hypertension due to Pulmonary Venous Htn",
    "content": "In the beginning of this year I had two mild strokes.  Minimal damaged occurred.  In September I was diagnosed with Pulmonary Arterial Hypertension (mild) and later learned that it was due to Pulmonary Venous Hypertension, left dystolic failure. Echo shows dialated left ventricle .  The left ventricular end systolic diameter is 4.0 cm and the LVED is 5.8 cm.  Ejection fraction is preserved at 60%.  The left atrium is dialated at 4.4 cm.  My physicians seemed very unconcerned over these finding although I continue to become more symptomatic.    My question is, is this something I should worry about.  Other than diet, exercise and the meds that I'm already on, should there be more treatment?  I've been told I was ok, just diet, exercise, quit smoking (of course) and come back next year.  I'm on CCBs and read they are not good for heart failure patients.  I certainly don't feel ok and seem to be slowly spiraling downward.  I'm very concerned.\n\n",
    "posted_time": "Post  by dmamacher » Tue Dec 07, 2004 6:52 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6911&sid=d415cdddd88c219557a15b32392c93ba#p6911"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Pulmonary hypertension and diastolic dysfunction",
    "content": "Dear dmamacher,  The causes of diastolic dysfunction are:  1. Hypertension. 2. Aging. 3. Coronary disease. 4. Cardiomyopathy including:     a. Hypertrophic cardiomyopathy.     b. Restrictive cardiomyopathy caused by Infiltration of the heart muscles by abnormal substances.  You mentioned a few things only out of the echocardiogram report, but you did not mention the left ventricular different walls' thicknesses.  If you have thick walls, this could be secondary to hypertension which is one of the commonest causes of diastolic failure.  You are already taking an antihypertensive medication. It is a combined medication with a calcium channel blocker and an ace inhibitor. Personally, i don't like combination medications because sometimes you can not tritrate up to the maximum dose of each medication if needed, but if this what your primary care provider thinks is best for you, that's fine with me. The treatment of diastolic heart failure is treatment of the cause in addition to targeting the impaired relaxation and filling.  Certain types of calcium channel blockers are not sometimes good for heart failure patients because they decrease contractility but you have a good ejection fraction so there is noting to worry about from that point.  What are the symptoms that you have been developping that are making you concerned?  Please, stop smoking all together and be very compliant with your medications and your blood pressure (if it is high) has to be very well controlled.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped and waiting for your reply.  Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Tue Dec 07, 2004 10:24 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6914&sid=d415cdddd88c219557a15b32392c93ba#p6914"
  },
  {
    "author": "dmamacher  Guest Posts: 7 Joined: Tue Dec 07, 2004 6:38 am Location: South Carolina",
    "title": "[no title]",
    "content": "Thank you for responding Dr. Mokhtar.    To answer your question, the left ventricular wall thickness and calculated mass index are normal.  What has me concerned is how I feel now.  I fear the progression and wonder how bad it can get  and still allow me to come to work.  Just several months ago I was highly active.  Even though I have been obese since I was 8 years old, I've always maintained high activity.  But...It was like a switch was turned off.  One day I woke up and all I could do was sleep.  This is not an exageration.  Even though the CCBs seem to give me some goods days now,  I am short of breath on minimal exertion have extreme weakness at times.  I also have periods of dizzyness where I feel that I will surely pass out.  The palpatitions are getting worse with periods of pounding.  Holter showed that I had PVCs with Bigeminy runs about two months ago. Also,during one 6 minute walk test my O2 went down to 81.  During the next test at a different Dr's office, my Blood Pressure rose to 175/158.  But, I completed the test with no periods of resting.  I did not ask what my respiration rate was but it was high enough to cause around my lips to go numb.  I  moved my 75 year old mother in with me 3 months ago.  SHE has more stamina than I do on many days.  She has emphysema and is on O2.    I know my body and can appreciate some changes due to aging, strain of weight, smoking etc.  But this does not seem like a natural progression in the least.\n\n",
    "posted_time": "Post  by dmamacher » Tue Dec 07, 2004 11:31 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6917&sid=d415cdddd88c219557a15b32392c93ba#p6917"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Pulmonary hypertension and diastolic dysfunction",
    "content": "Dear dmamacher,  Thank you very much for the update.  The easiest explanation to your symptoms is the lotrel. It is known to cause fatigue and somnolence.  There are other explanations though. What you are suffering from might not have anything to do with pulmonary hypertension and the pulmonary hypertension might have nothing to do with the left ventricular diastolic dysfunction that you have or there may be other factors contributing to the development of pulmonary hypertension.  What you are describing is very consistent with sleep apnea which is a condition that affects a large portion of the obese population. Please, talk to your doctor about this possibility and see what he thinks.  If your oxygen sats dropped during exercise, may be you need oxygen during exercise.  Patients who have pulmonary hypertension might be dependant on blood coming back to the heart to generate enough blood pumped out to the tissues and thus feeling that you have enough energy, so the 80 mg of lasix that you are getting might be a little bit too much for you.  Palpitations might be caused by the fact that your potassium level in the blood is low even though you are getting potassium and the lotrel has a medication that might increase the potassium level in the blood. i would recommend checking your electrolytes including magnesium, calcium and phosphorus and thyroid function tests.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped and waiting for your reply.  Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Tue Dec 07, 2004 12:54 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6919&sid=d415cdddd88c219557a15b32392c93ba#p6919"
  },
  {
    "author": "dmamacher  Guest Posts: 7 Joined: Tue Dec 07, 2004 6:38 am Location: South Carolina",
    "title": "[no title]",
    "content": "Well I finally had my sleep study and although I do not yet have the offical report, the tech told me that I did stop breathing during REM sleep and that my 02 dropped to 84%. I will get the official results when I see my Pulmonologist on the 11th of January.  I imagine this explains my decline in to Left Diastolic Disfuntion and Pulmonary Hypertenstion.  I would like to pose another question.  With Left Ventriclular End Diastolic diameter dialtated at 5.8, systolic diameter of 4.0 and left atrium dialated at 4.4, does this mean the diagnosis would be dialated cardiomyopathy?  Or would it still be heart failure since my ejection fraction is normal?\n\n",
    "posted_time": "Post  by dmamacher » Tue Dec 14, 2004 7:08 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=7063&sid=d415cdddd88c219557a15b32392c93ba#p7063"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Pulmonary hypertension and diastolic dysfunction",
    "content": "Dear dmamacher,   Thank you very much for the update.   The upper normal diastolic diameter is 5.6 cm, i don't think that 0.2 cm is a great deal. About your left atrium, it is enlarged (most probably secondary to the diastolic dysfinction), and the only draw back is that some patients with left atrial enlargement develop atrial fibrillation (an abnormal heart rhythm) and it is sometimes difficult to cardiovert them back to a normal rhythm.  Regarding cardiomyopahty, it is a heart muscle disease associated with heart dysfunction. Distinction between various types of cardiomyopathy relies on the echocardiographic evaluation, the echo is a good tool to detect various types of cardiopmyopathy, in your case, if you have cardiomyopathy it is going to be of the dilated type since you have left ventricle dilatation. In the early stages of dilated cardiomyopathy, sometimes it is difficult for the echo to immediately spot dilated cardiomyopathy as it is usually able to. For the time being, i assume that you don't have cardiomyopathy as your ejection fraction is normal.  Having sleep apnea, causes hypertension and this in turn can cause diastolic dysfunction, so if you are diagnosed with sleep apnea, you will be offered some treatment options according to what your doctor sees of benefit and this will help in the control the high blood pressure and of the diastolic dysfunction as well.  If obesity is a problem, i think it is best to try losing weight as sometimes patients with mild sleep apnea get cured with weight loss.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped and waiting for your reply.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Mon Dec 20, 2004 7:55 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=7212&sid=d415cdddd88c219557a15b32392c93ba#p7212"
  },
  {
    "author": "dmamacher  Guest Posts: 7 Joined: Tue Dec 07, 2004 6:38 am Location: South Carolina",
    "title": "Should Inappropriate Sinus Tach be, when Atrium is enlarged?",
    "content": "It's been some time since I've posted but I have an appointment with my Cardiologist and would appreciate some advice.  I am hoping this post will include my other history but briefly, I am 47 years old and have Pulmonary Arterial Hypertension due to Pulmonary Venous Hypertension, Left Diastolic Dysfunction.  I can add to the other posts that my Sleep Study revealed that I had extremely mild Sleep Apnea which the Pulmonologist decided was not significant enough to warrant treatment.  I've been wearing a 30 Day Event Monitor due to PVCs.  My Cardiologist's office called and said they've found \"a lot of PVCs with bigeminy, trigeminy and Inappropriate Sinus Tachycardia\".    My question would be, should Inappropriate Sinus Tachycardia be considered when my Left Atrium is 4.6 cm?  And would you please advise me of questions that I could ask my Cardiologist during my visit or tests that should be considered under these circumstances?  I can not take Beta Blockers due to a history of allergy to this medication.  I appreciate your time.  Diane\n\n",
    "posted_time": "Post  by dmamacher » Sun Aug 21, 2005 6:51 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=19168&sid=d415cdddd88c219557a15b32392c93ba#p19168"
  },
  {
    "author": "dmamacher  Guest Posts: 7 Joined: Tue Dec 07, 2004 6:38 am Location: South Carolina",
    "title": "Correction - Atrium is enlarged at 4.4 cm (Cath in 2004)",
    "content": "Correction to my post.....Left Atrium measured 4.4 cm during my Heart Cath in 2004.\n\n",
    "posted_time": "Post  by dmamacher » Sun Aug 21, 2005 6:56 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=19169&sid=d415cdddd88c219557a15b32392c93ba#p19169"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Inappropriate sinus tachycardia",
    "content": "Dear Diane,  Thank you very much for the update.  i don't think that there is a relation between your mildly enlarged left atrium and inappropriate sinus tachycardia.  Chronic inappropriate sinus tachycardia has been described in otherwise healthy persons, possibly secondary to increased automaticity of the sinus node (the pacemaker of the heart) or an automatic atrial focus located near the sinus node. The abnormality can result from a defect in nerve control of sinus node.  Treatment of inappropriate sinus tachycardia requires beta blockers, but since you are allergic, calcium-channel blockers, or digitalis, alone or in combination can be tried. In severe cases, sinus node radiofrequency or surgical ablation may be indicated.  If your cardiologist is not an electrophysiologist (cardiologist specialized in arrhythmias), may be you can ask him if it is worth it for you to be evaluated by one.  If most of the arrhythmias occur by night, and if you gained some weight, may be your sleep apnea has gotten worse and you need to be treated for it.  If you have not had a thyroid profile, i think it is a good idea to have one done.  If still, a definitive cause for the pulmonary hypertension is to be found, and if you have a history of smoking, may be a lung function test is in order.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Tue Nov 01, 2005 3:14 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=24433&sid=d415cdddd88c219557a15b32392c93ba#p24433"
  },
  {
    "author": "ghm121662  Guest Posts: 1 Joined: Fri Oct 14, 2005 5:06 pm Location: Fairfax",
    "title": "Chest Pain and swollen ankles",
    "content": "I'm a 42 yr old Male with a long history of heart problems on my fathers side. I'm  74\" tall and 282 lbs.  I tend to carry the majority of my weight around the waist. Recently, I have noticed  swollen ankles and I have been experiencing tightness in chest, specifically around the heart  area and prolonged headaches.  I have been taking aspirin and ibuprophen for the headaches.    I have a stressfull and demanding job.   I do not smoke or drink much alcohol.  How concerned should I be, and what steps and tests should I have done.\n\n",
    "posted_time": "Post  by ghm121662 » Fri Oct 14, 2005 5:16 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=23370&sid=d415cdddd88c219557a15b32392c93ba#p23370"
  },
  {
    "author": "Shannon Morgan, CMA  Medical Assistant Posts: 530 Joined: Fri May 06, 2005 6:28 pm Location: Dallas, Texas. USA.",
    "title": "[no title]",
    "content": "People who gain their weight in the abdominal area are very high risk for heart disease and diabetes.   Swelling of ankles can be a sign, worst case scenario of congestive heart failure, but it could be just too much sodium in your diet.   Do you have other risk factors such as family history of high blood pressure, diabetes or heart disease?  A stressful job is a very high risk factor, the excess cortisol produced under stress can cause blocked arteries.   You are also very overweight, and I imagine you don't excercise.  I strongly suggest you get to a doctor for a full physical, blood workups, ECG, chest x-ray, and treadmill or nuclear test for your heart.\n\n",
    "posted_time": "Post  by Shannon Morgan, CMA » Sat Oct 15, 2005 8:36 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=23404&sid=d415cdddd88c219557a15b32392c93ba#p23404"
  },
  {
    "author": "michelle80  Guest Posts: 1 Joined: Tue Apr 05, 2005 4:35 pm Location: burton on trent",
    "title": "Heart failure prognosis relating to the ejection fraction",
    "content": "Hi, Is there anybody who can give me any information on the prognosis of heart faliure relating to the calculated ejection fraction from echocardiogram please. I am in the process of writing a research project on the modes of calculating ejection fraction and their reliability.  Somebody told me that the ejection fraction banding of mild, moderate and severely impaired LV systolic function can help determine prognosis of heart failure.  Do you know of any published data for this?  Thankyou very much  Michelle.\n\n",
    "posted_time": "Post  by michelle80 » Tue Apr 05, 2005 4:50 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=11928&sid=d415cdddd88c219557a15b32392c93ba#p11928"
  },
  {
    "author": "R. Zein, Pharm D  Pharmacist Posts: 157 Joined: Tue Jul 12, 2005 9:16 pm Location: USA",
    "title": "[no title]",
    "content": "During each heartbeat, the heart contracts and relaxes. When your heart contracts (systole), it ejects blood from the pumping chambers (ventricles). When your heart relaxes (diastole), the ventricles refill with blood. No matter how forceful the contraction, it doesn't empty all of the blood out of a ventricle. The term ejection fraction refers to the percentage of blood that is pumped out of a filled ventricle with each heartbeat. This measures the capacity at which your heart is pumping.  Because the left ventricle is the heart's main pumping chamber, ejection fraction is usually measured in the left ventricle. A normal ejection fraction is 55 percent to 70 percent. The ejection fraction may decrease when the heart muscle has been damaged, such as due to: Heart attack , or Heart muscle disease (cardiomyopathy), and   Heart valve problems   so ejection fraction of less than 50 indicates a form of heart failure, of course once it is the 20 range or less, this might indicate severe CHF  THANK YOU\n\n",
    "posted_time": "Post  by R. Zein, Pharm D » Tue Sep 20, 2005 3:02 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=21151&sid=d415cdddd88c219557a15b32392c93ba#p21151"
  },
  {
    "author": "media2mike  Guest Posts: 1 Joined: Fri Jan 31, 2003 10:43 am",
    "title": "Latest treatment of congestive heart failure?",
    "content": "Would anyone know the latest medication for the treatment of congestive heart failure besides diuretics to rid the body of excess water? Any information about this debilitating condition would be appreciated. Thanks.\n\n",
    "posted_time": "Post  by media2mike » Fri Jan 31, 2003 10:44 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=190&sid=d415cdddd88c219557a15b32392c93ba#p190"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Therapy for heart failure",
    "content": "Dear Guest,  Thank you very much for using our website.  Congestive heart failure has a bad prognosis if left untreated. WIth treatment, prognosis improves markedly.  The newest development that happened over the last 2-3 years is the addition of a beta-blocker type drug to the regimen of patients who have congestive heart failure as in the past years it was found in several clinical trials their beneficial effects on the quality of life as well as survival in patients with congestive heart failure.  The main stay of treatment in congestive heart failure is: 1. Diuretics: Fluid pills, lasix for example. 2. Vasodilators: Angiotensin converting enzyme inhibitors, lisinopril for example. 3. Beta blockers: toprol xl for example. 4. Medications that make the heart pump stronger: digoxin for example. 5. Adjuvant treatments:  a. Well organized exercise program. b. Loss of weight if the patient is overweight (if possible). c. Good and balanced diet with no added salt. d. Oxygen if needed. e. Pace maker if the patient has certain conduction defects.  Once more, thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Wed Feb 05, 2003 11:43 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=235&sid=d415cdddd88c219557a15b32392c93ba#p235"
  },
  {
    "author": "R. Zein, Pharm D  Pharmacist Posts: 157 Joined: Tue Jul 12, 2005 9:16 pm Location: USA",
    "title": "Treatment of congestive heart failure",
    "content": "The main goal of treatment of congestive heart failure is  1) maintainance of fluid balance: and this is implemented by using diuretics: lasix, hydrochlorothiazides,  and spironolactone . these help promote water and sodium excretion.  2)maintaining a theraputic blood pressure, this is accomplished via the use of antihypertensives and/or vasodilaters: like ace inhibitors: lisinopril, or beta blockers: atenolol, metoprolol., or angiotensin receptor blockers: diovan, calcium channel blockers: ditiazem verapamil.  3)Drugs which can improve the contractility of the heart: digoxin  4)diet: maintaining a sodium balanced diet; sodium restriction, because sodium overload promotes water retention.  5)excercise  6) patients with congestive heart failures should get used to obtain their weight daily. this practice is very important, as it tells health care professionals or the patient's doctor how well your body is responding t duiretics, therefore, how your fluid status is. overall, depending on the stage of congestive heart failure (class i being the mildest, and IV being the worst), patients might be in monotherapy( one drug), or combination to reach optimal treatment.    if all medical treatments fail, patient with severe congestive heart failure, might be a candidate for heart transplantation, depending on the criteria.  it is very advisable to check with your doctor on regular basis, and discuss any issues or concerns that you might have.  thank you, and hope that helped.\n\n",
    "posted_time": "Post  by R. Zein, Pharm D » Wed Jul 27, 2005 11:31 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=17580&sid=d415cdddd88c219557a15b32392c93ba#p17580"
  },
  {
    "author": "colleenjh  Guest Posts: 1 Joined: Thu Jul 14, 2005 11:42 pm Location: Washington",
    "title": "Pulmonary embolism",
    "content": "I recently had a friend die suddenly of a pulmonary embolism. She was 55 in good health. I was wondering if there might be any connection to environmental conditions that could cause or make her suseptable to this. Could diesel fumes or exhaust contribute to the blood clot forming? She was in a room that had fumes in it from a boat.\n\n",
    "posted_time": "Post  by colleenjh » Thu Jul 14, 2005 11:50 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=16827&sid=d415cdddd88c219557a15b32392c93ba#p16827"
  },
  {
    "author": "Najah  Medical Doctor Posts: 26 Joined: Mon May 30, 2005 11:49 pm Location: Iraq",
    "title": "[no title]",
    "content": "Diesel fumes may cause death by anoxia if they are concentrated in a closed space because they contain many noxious gases. I can not guess from guess given the limitations of the internet as to whether the cause of her death was pulmonary embolism.   Best regards.\n\n",
    "posted_time": "Post  by Najah » Fri Jul 15, 2005 3:38 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=16832&sid=d415cdddd88c219557a15b32392c93ba#p16832"
  },
  {
    "author": "raluca  Guest Posts: 5 Joined: Wed Jun 08, 2005 1:50 pm Location: united kingdom",
    "title": "Magnesium defeciency",
    "content": "Well, I'm romanian living in the UK. I moved here in February. In Romania my doctor gave me a treatment with calcium and magnezium injections .After that I was feeling quite well,getting better. Than they started again . I've been going to this doctor for...almost 4 month and she didn't recomend me anithing ,only last week I did some blood tests and on monday I will have the results. I have severe fatigue, weakness, numbness, somethimes I feel on my right hand niddles and pins sensation, I have a ringing in my ears, quite often. Lots of times I feel that my body is so heavy... especially my legs and my chest hurts. I eat a lot, I'm 1.67m, I'm not anorexic. I smoke quite a lot and ocassionally drink alcohol. I don't know about phyhical problems .... before my first panic attack (if it was one) I was really stressed about lots of things happening. But now I have no reason to be. I should be very happy, I have the best boyfriend, we are getting married, we moved to a nice flat, the funniest pet ever.... exept this illness stops me sometimes to enjoy.  Thank you so much for replying!  It really means a lot to me.\n\n",
    "posted_time": "Post  by raluca » Fri Jun 24, 2005 2:42 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=15728&sid=d415cdddd88c219557a15b32392c93ba#p15728"
  },
  {
    "author": "Shannon Morgan, CMA  Medical Assistant Posts: 530 Joined: Fri May 06, 2005 6:28 pm Location: Dallas, Texas. USA.",
    "title": "[no title]",
    "content": "Hi, Raluca  You do have many symptoms of magnesium deficiency - what do you typically eat every day?  Do you take any magnesium supplements?  Magnesium is commonly found in diabetics, I hope you had a full chemistry blood test to check for that (glucose and Hgb A1c).  Magnesium affects glucose (blood sugar), the heart and nervous system, that may be where your breathlessness, fatigue and tingling are coming from.  Magnesium also controls the calcium, severe defiency in magnesium will result in calcium deficiency also.  You should be eating plenty of vegetables (dark leafy greens such as spinach), beans and nuts every day, these foods contain the highest amounts of magnesium.    Caution:  if you have any kidney disease, magnesium supplements could make you retain too much, and if you do, it can become toxic and actually cause the same symptoms you have, so have your doctor check that, too if he/she didn't.  Talk to your doctor before you take them.  Is this the same doctor?  You may indeed be panicing due to the severity of your illness, but I imagine IF you are, it should subside when you start feeling better.  I hope you get this resolved quickly and feel better very soon.  Sincerely,  Shannon\n\n",
    "posted_time": "Post  by Shannon Morgan, CMA » Fri Jun 24, 2005 6:58 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=15736&sid=d415cdddd88c219557a15b32392c93ba#p15736"
  },
  {
    "author": "raluca  Guest Posts: 5 Joined: Wed Jun 08, 2005 1:50 pm Location: united kingdom",
    "title": "[no title]",
    "content": "than you Shannon! I will wait for the test results on monday ,I changed my doctor as well. I will write u all about it. Thank you again for your help and yes,tonight I'm cooking spinach !\n\n",
    "posted_time": "Post  by raluca » Fri Jun 24, 2005 8:29 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=15749&sid=d415cdddd88c219557a15b32392c93ba#p15749"
  },
  {
    "author": "raluca  Guest Posts: 5 Joined: Wed Jun 08, 2005 1:50 pm Location: united kingdom",
    "title": "Trouble breathing and dizziness",
    "content": "I'm 24, 50kg. Since new years eve ,when I had a panick attack due to calcium and magnesium missing from my organism,or so I was told. Since then I have big  troubles breathing and I feel really, really dizzy ,somethimes to the point that I can't even see in front of me! I was told by my doctor ,wich I would like to change , that I have a really low blood presure ,after she said that I have panics attacks ,after she said maybe it's an allergy .... After 6 mounth I still don't know what is wrong with me .... still I'm feeling worse and wprse everyday and I'm teriffied . Please help with an advice ...\n\n",
    "posted_time": "Post  by raluca » Thu Jun 23, 2005 10:34 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=15673&sid=d415cdddd88c219557a15b32392c93ba#p15673"
  },
  {
    "author": "Shannon Morgan, CMA  Medical Assistant Posts: 530 Joined: Fri May 06, 2005 6:28 pm Location: Dallas, Texas. USA.",
    "title": "[no title]",
    "content": "Have you had any tests done to rule out physical causes?  EKG? Echocardiogram (sonogram of the heart),  bloodwork (full body chemistry and blood count, thyroid level) or chest x-ray?  Granted, panic attacks can cause symptoms similar to yours, and the worse the symptoms, the worse the anxiety, and  so on.  But it's crucial that every serious physical problem be ruled out first.  Your symptoms are too severe just for low blood pressure, and are not allergy symptoms.  Did your doctor prescribe magnesium or calcium or potassium supplements?  What did she give you, if anything?  Do you have nausea/vomiting, loss of appetite, severe fatigue, weakness, numbness, tingling, muscle cramps, seizures or anything else you didn't list?  Do you have ringing in your ears?  Are you male or female?  How tall are you?  Do you skip meals, diet or perhaps have anorexia/bulemia?   How much do you excercise, if at all?\n\n",
    "posted_time": "Post  by Shannon Morgan, CMA » Thu Jun 23, 2005 5:28 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=15703&sid=d415cdddd88c219557a15b32392c93ba#p15703"
  },
  {
    "author": "radiobill  Guest Posts: 2 Joined: Mon May 16, 2005 1:21 pm Location: Elkridge, MD",
    "title": "Pitting Edema",
    "content": "Most of what I read about pitting edema seems to focus on the feet and ankles.  What about pitting edema only on the shins?  By the end of the day, the tissue over my shins is like that \"memory foam\" you see advertised on those \"space age\" mattresses.  Then in the morning, the skin over my shins feels slightly \"tacky\".  I'll be seeing my MD in three days.  I have other reasons to suspect possible CHF, but just wondering if pitting edema limited to the shins was significant.  Thank you!\n\n",
    "posted_time": "Post  by radiobill » Mon May 16, 2005 1:24 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=13820&sid=d415cdddd88c219557a15b32392c93ba#p13820"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi radiobill, One of the symptoms of congestive heart failure is lower extremety edema. Have you been experiencing any other symptoms, rapid weight gain, shortness of breath etc.? It would be quite wise of you to keep your appointment for an evaluation. Sincerely, Rntdj\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Tue May 17, 2005 8:49 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=13846&sid=d415cdddd88c219557a15b32392c93ba#p13846"
  },
  {
    "author": "radiobill  Guest Posts: 2 Joined: Mon May 16, 2005 1:21 pm Location: Elkridge, MD",
    "title": "Thank you!",
    "content": "I've always been something of a wide load, but I do feel generally more \"puffy\" than usual.  SOB only on exertion, a walk up the stairs will have me puffing.  No chest pain, though.  And like I said, the pitting edema is only on the shins, not the calves or so much on the ankles.  When I get up in the morning, no edema, but my shins feel sort of \"tacky.\"  But the swelling reappears within a couple hours of being up and around.  Right now, sitting here, my lower legs and feet feel tight and chilly.    Will definitely keep the appointment.  Thanks again.\n\n",
    "posted_time": "Post  by radiobill » Tue May 17, 2005 11:40 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=13851&sid=d415cdddd88c219557a15b32392c93ba#p13851"
  },
  {
    "author": "concerneddad  Guest Posts: 2 Joined: Wed Apr 13, 2005 9:23 pm Location: illinois  Contact:   Contact concerneddad       Yahoo Messenger",
    "title": "Congestive heart failure in newborn",
    "content": "Can congestive heart failure and hydrops be caused from fetal alcohol syndrome due to the mother drinking while she was pregnant.  noone will give me an answer.\n\n",
    "posted_time": "Post  by concerneddad » Wed Apr 13, 2005 9:27 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=12318&sid=d415cdddd88c219557a15b32392c93ba#p12318"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Congestive heart failure in newborn",
    "content": "Dear George,  To my knowledge, alcohol does not cause hydrops, but it can cause heart failure in utero and congenital heart defects as well.  Please, visit this website http://www.acbr.com/fas/ if you have not done so already.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.  Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Wed Apr 27, 2005 5:53 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=13039&sid=d415cdddd88c219557a15b32392c93ba#p13039"
  },
  {
    "author": "mistieroze  Guest Posts: 1 Joined: Fri Mar 04, 2005 6:01 pm Location: Long Island, NY",
    "title": "Left ventricle wall thickness",
    "content": "I am 23 year old mother of one. I am overweight, am a smoker, have high blood pressure, (I don't remember which was which) but my bad cholesterol is 156.  Most of my mother's side of the family all have some sort of heart disease.  I have been having series of palpitations (which I have read a lot about on this board -- and it really eases my mind).  I went for an echo 2 years ago and in my left ventricle both my septal wall thickness and the post wall thickness were 1.1 (normal is 0.6 - 1.1).  This time my echo showed both the septal wall thickness and the post wall thickness as being 1.2.  Also that I have a MVP but that it's no big deal.  After talking to the doctor he assured me that if I ate correctly, exercised, lowered my blood pressure (with meds), lowered my cholesterol (with meds) that all would be well and I wouldn't have anything to worry about.  My question is.  If I so everything the doctor said (lost weight, quit smoking, did exercise, lowered my cholesterol and blood pressure) would the walls thin out back into the normal range or would they just not get any worse?  Also how thick can these walls get without having major complications from it?  I understand that I am not in the normal range, but it would ease my mind (A LOT) if I knew that I was still far away from having a major problem.  Thank you so much.\n\n",
    "posted_time": "Post  by mistieroze » Fri Mar 04, 2005 6:03 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=10352&sid=d415cdddd88c219557a15b32392c93ba#p10352"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Left ventricle wall thickness",
    "content": "Dear Mistieroze,  You have mild left ventricular hypertrophy and since this is worsening since your last echocardiogram, this reflects the fact that your blood pressure has not been under proper control.   With weight loss, exercising, stopping smoking, sodium restriction in the diet and medications, your blood pressure will be under better control and with proper blood pressure control, the left ventricular hypertrophy will regress (go back to normal). There are certain anti-hypertensive medications that cause regression more than other medications, you can discuss the choice of medications with your doctor and i am sure he will give the best advice.  Left ventricular hypertrophy, irrespective of any other disease that patients have, increases the risk of having heart attacks, strokes and renal failure (reflecting the fact blood pressure is poorly controlled). In addition, left ventricular hypertrophy increases the risk of sudden death.   You have a very strong positive family histopry for coronary disease and you have a high ldl and your blood pressure is not under good control, all of these, in addition to smoking as well. This means that you have 4 major risk factors for coronary disease and you are at a much higher risk for suffering from an early heart attack or a stroke.  You are a young mother and you have to take this matter very seriously to be in the best of health.  The palpitations that you have are most probably related to your mitral valve prolpse.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.  Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Sat Mar 05, 2005 12:04 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=10375&sid=d415cdddd88c219557a15b32392c93ba#p10375"
  },
  {
    "author": "srstep  Guest Posts: 2 Joined: Wed Jan 26, 2005 6:08 pm Location: Houston, tx",
    "title": "Heart Disease and MDS",
    "content": "Two years ago I had a triple bypass. I was told told I had heart disease but no heart damage. I am 59 years old. I also have MDS and was given a transfusion during the surgery. Recently my hemoglobin dropped to 8.5.  My hematologist said I should have a transfusion.  I questioned this because I had been told by several nurses that with each transfusion my blood will get harder and harder to match. I have 0+ blood type.  My hematologist said this was not true. I then went to another city to see a MDS specialist.  He said the nurses  were right and that I should limit the transfusions, as long as the low hemaglobin is not hurting my heart. He sent me back with instructions to get an echogardiogram.  I did this and have yet to hear from the local doctor.  I've talked to his nurse and she asked me why the specialist ask this question.  I told her I was not in the medical field and I did not know.  She said if he is talking about the squeezing action of the heart, it is fine.  On top of this my intenist prescribed me beta blockers although I have never ever had high blood pressure ever!  On whatever is supposed to be 60-100, I was 80.  I would appreciate it if your doctor could answer thes questions for me. Thanks\n\n",
    "posted_time": "Post  by srstep » Sun Feb 27, 2005 10:13 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=10030&sid=d415cdddd88c219557a15b32392c93ba#p10030"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Heart disease and myelodysplastic disorder",
    "content": "Dear srstep,  Thank you very much for the update.  A transthoracic echocardiogram is an ultrasound of the heart. It allows the operator to see the heart in real time and how it pumps, the sizes of its various chambers, its valves and the direction of blood flow through these valves.  It gives quite a bit of information in good hands and it is non-invasive.  If a patient who has heart disease (specially heart failure) has a low hemoglobin (anemia), he might become symptomatic due to the anemia earlier than a patient who does not have heart failure and the symptoms might be confused as these 2 conditions share some symptoms such as shortness of breath and easy fatigability.  The echo will show how strong your heart beats and if it beats normally and you are not symptomatic and you can go around doing all of your activities without problems, i don't think that you need a blood transfusion. On the other hand, if you have symptoms that hinder your daily activities, then i would recommend a blood transfusion.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.  Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Sun Feb 27, 2005 10:59 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=10033&sid=d415cdddd88c219557a15b32392c93ba#p10033"
  },
  {
    "author": "pokey  Guest Posts: 21 Joined: Sat Aug 21, 2004 7:33 pm Location: ottawa",
    "title": "Congestive heart failure in young persons",
    "content": "My mother was diagnosed with congestive heart failure 3 years ago, and i was told by a cardiologist that i have a 50 percent chance of inheriting this disease, i am a 22 year old female and today i was excercising when I noticed my heart skipping alot of beats and kept on changing rhythms, can this be related to my mothers disease and for more background her brother also has this disease and two of her cousins also had it and were given heart transplants in there 20's.\n\n",
    "posted_time": "Post  by pokey » Sat Jan 29, 2005 4:49 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8710&sid=d415cdddd88c219557a15b32392c93ba#p8710"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Congestive heart failure",
    "content": "Dear Pokey,  If your mother has dilated cardiomyopathy, there is an entity known as familial dilated cardiomyopathy. The chances of inheriting it is about 25-50% depending on the type of inheritence. If inheritence is dominant, then the chance is 50%, if it is recessive it is 25%.  Since you started to have cardiac symptoms, i would suggest that you be evaluated by a cardiologist or at least get an echocardiogram to have a base line echo where the size of the left ventricle and the ejection fraction are estimated.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.  Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Sat Jan 29, 2005 6:17 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8713&sid=d415cdddd88c219557a15b32392c93ba#p8713"
  },
  {
    "author": "Donovan  Guest Posts: 1 Joined: Wed Jan 26, 2005 8:40 pm Location: Sydney",
    "title": "Massive veins etc",
    "content": "HI Often i get sleep apnea  - esp if i lie on one side.  I also have tingling letf hand and forearm and the last couple of days after i woke up from sleep apnea i had the largest neck veins i have ever seen.  I have had a chest cough for about 3 months and cough up quite bubly phlem.  Any ideas?\n\n",
    "posted_time": "Post  by Donovan » Wed Jan 26, 2005 8:45 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8620&sid=d415cdddd88c219557a15b32392c93ba#p8620"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Massive veins",
    "content": "Dear Donovan,  Sleep apnea can cause the congested neck veins. Cough can cause congested neck veins if you saw your neck veins while you were coughing.  The phlegm is most probably some kind of a chest infection. i think it is not such a bad idea to have a chest x-ray done.  You need to be treated for sleep apnea. Have you had a sleep study? Did you try the bi-pap or the c-pap masks?  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.  Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Sat Jan 29, 2005 5:59 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8712&sid=d415cdddd88c219557a15b32392c93ba#p8712"
  },
  {
    "author": "BRETMAN101  Guest Posts: 1 Joined: Tue Jan 18, 2005 2:04 pm Location: staunton va",
    "title": "Chest pain and arm numbness",
    "content": "i am 37 yrs old and a non smoker. my fingers and my hand have been asleep for a week. i also have alot of trouble swallowing. when i swallow my chest really hurts. i'm more nervous than anything\n\n",
    "posted_time": "Post  by BRETMAN101 » Tue Jan 18, 2005 2:26 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8280&sid=d415cdddd88c219557a15b32392c93ba#p8280"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Chest pain and arm numbness",
    "content": "Dear Bretman101,  Chest pain during swallowing means that most probably you have some kind of inflammation of the esophagus or esophgeal spasm.  i recommend that you see your doctor to be examined and may be referred to a gastrointestinal specialist for an endoscopy if your doctor thinks it is indicated.  Regarding your hand and fingers being numb, there could be either a problem in the nerve going to the hand in a condition called carpal tunnel syndrome or a could be some problem with your neck like arthritis.  i suggest that you be evaluated for both of the above mentioned conditions.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.  Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Tue Jan 18, 2005 8:10 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8290&sid=d415cdddd88c219557a15b32392c93ba#p8290"
  },
  {
    "author": "eddi888  Guest Posts: 1 Joined: Tue Sep 21, 2004 3:26 pm Location: israel",
    "title": "Methcathinone consumption and new heart problem",
    "content": "I have been consuming this material methcathinone  through pills for 3 weeks (about 70 pills estimate 10-30 gram pure over all- orally)  i am fine .....  though!!!!!  my blood pressure is higher by 20% 65/95 , new - 82/120  my heart beat is higher by 20-50% 55-70, new - 80 - 120  i have stopped the usage almost 3 weeks ago,  when does this stuff get out of the system?  how long is this effect on my heart going to last?  is that a permanent damage for the rest of my life?  probabilities?  i am now taking 12.5 - 25 mg of normiten per day,  works fine by lowering back to normal, but the problem presist if i stop taking its back up to 80-120 pulse.   again i haven't touched this stuff (methcathinone) for 17 days.   please advice, or help   Thank you in advance, Eddi\n\n",
    "posted_time": "Post  by eddi888 » Tue Sep 21, 2004 3:47 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5481&sid=d415cdddd88c219557a15b32392c93ba#p5481"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Methcathinone consumption and new heart problem",
    "content": "Dear Eddi,  i don't have much experience with this drug.  It is a stimulant like amphetamines. i can not tell how long its effects are going to last.  In addition to taking the normiten, which is just symptomatic treatment, other causes of high blood pressure and fast heart rate should be excluded before giving all the credit to methcathinone.   An ecg (electric recording of the heart beats) should be done to make sure that the heart beating is normal but fast and not an abnormal irregular heart rate.  i would suggest also that you have an ultrasound of the heart (echocardiogram) to make sure that your heart is contracting in a normal fashion.  i don't think that the drug is still in your system but a drug level in the blood could be done.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Tue Oct 12, 2004 6:32 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5844&sid=d415cdddd88c219557a15b32392c93ba#p5844"
  },
  {
    "author": "pokey  Guest Posts: 21 Joined: Sat Aug 21, 2004 7:33 pm Location: ottawa",
    "title": "Cardiomyopathy and period problems",
    "content": "Hello, I'm a 45 year old woman who was diagnosed with cardiomyopathy 2 years ago and i didn't get a period for six months it has been on and off since the last time i had it, it lasted a month.  I havn't had one in over a month but two days ago I passed a blood clot about the size of a lemon and I threw up right after and i passed another clot about the same size the next day and then today also, but there is no bleeding before or after, could this have something to do with my heart disease.\n\n",
    "posted_time": "Post  by pokey » Tue Aug 31, 2004 4:37 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5001&sid=d415cdddd88c219557a15b32392c93ba#p5001"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Cardiomyopathy",
    "content": "Dear Pokey,  If your heart disease is severe, you might have any combination of menstrual abnormalities. You are 45 years old, this could be the start of menopause.   i recommend that you see your gynecologist to have this checked out. At this age, there is also a risk of cancer of the uterus which shoud be excluded.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Tue Aug 31, 2004 6:49 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5008&sid=d415cdddd88c219557a15b32392c93ba#p5008"
  },
  {
    "author": "Carolyn  Guest Posts: 14 Joined: Thu May 20, 2004 7:20 pm Location: Northern California",
    "title": "My First Cardiac episode and abnormal ECG",
    "content": "Dear Dr: I am a 54 year old female and one day before entering the hospital for a total knee replacement I had my first abnormal  ECG.  It stated I had 1. Incomplete right bundle branch block, and 2. Consider Left Ventricular Hypertrophy.  My blood pressure was 149/102.   My blood pressures usually only runs over 140/80 when under stress such as a doctors visit. After my surgery, on the 8th day while being walked by PT, I felt a crushing pain in my chest and collapsed to the floor.  My husband,who was with me at the time, said my chest was heaving as though it were going to jump out of my chest. I was told about an hour later that the cardiac ensyme test was ok and my ECG only showed Voltage criteria for left ventricular hypertrophy. During the past two years I have gained weight from 215 to 234 and I am 5'4\" tall.  I also have been sedentary as I have not been able to walk on either leg so have mainly used a wheelchair or walker.  A short walk of 30 feet using a walker will leave me winded.   Can you tell me what the ECG indicates and is there any significance of the chest pain shortly after surgery.  Both my parents died in their 60's from heart disease.  Needless to say,I am scared and could use any information you can give me on what this means and where do I go from here.  My orthopedic Dr, who did the knee replacement, refuses to discuss this with me. Thanks, Carolyn\n\n",
    "posted_time": "Post  by Carolyn » Sun Aug 08, 2004 3:53 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=4448&sid=d415cdddd88c219557a15b32392c93ba#p4448"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: My first cardiac episode and abnormal ecg",
    "content": "Dear Carolyn,  A patient who has chest pain after an orthopedic surgery in mind has either a heart attack (which was ruled out in your case by the negative ecg and the negative blood tests) or a blood clot to the lungs (which you did not mention anything about in your post. You did not mention whether you were on any blood thinners or not (the standard of care after orthopedic surgery is to give prophylactic blood thinners to patients to prevent venous blood clotting in the lower limbs and the lungs, these can be given either subcutaneous in the abdomen usually or intravenous and then followed by a medication called coumadin orally), you did not mention whether you had a ct scan of the chest to rule out blood clot to your lungs and whether or not you had a doppler scan of your legs to rule out deep venous thrombosis of the legs.  Your ecg picture is non-specific. Having a pattern of left ventricular hypertrophy does not necessarily mean that you have it because ecg is not the gold standard for diagnosis of left ventricular hypertrophy. To diagnose left ventricular hypertrophy, you have to have an echocardiogram. The incomplete right bundle branch block is a normal variant.  Regarding your weight gain and being winded with exercise, this could mean that you are just unfit because you gained all this weight. You have to have an echocardiogram to diagnose heart failure as well. It will show your heart function accurately.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped and waiting for your update.    Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Sun Aug 08, 2004 9:37 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=4451&sid=d415cdddd88c219557a15b32392c93ba#p4451"
  },
  {
    "author": "Carolyn  Guest Posts: 14 Joined: Thu May 20, 2004 7:20 pm Location: Northern California",
    "title": "[no title]",
    "content": "Dear Dr. Mokhtar: Thanks again for your reply.  In addition I have further questions. First of all, to answer your questions blood thinners were not used because I would not accept blood transfusions before, during or after surgery in accord with my religious beliefs.  A Cell Saver was used instead during and after surgery.  No doppler was used on my legs nor was any CT scan of the chest used after the incident mentioned. Rather I was discharged the next day from the hospital with no further tests being done.  Does this mean I probably had a blood clot? If so, am I still in danger?  Or could it have dissolved on its own?  I have been taking Ibuprofin for pain, on my own, since leaving the hospital.  Do you have any reccomendations as to further follow-ups on this?  I have not had any chest pain since that one episode in the hospital a week ago. Thanks, Carolyn\n\n",
    "posted_time": "Post  by Carolyn » Mon Aug 09, 2004 10:03 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=4467&sid=d415cdddd88c219557a15b32392c93ba#p4467"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: My first cardiac episode and abnormal ecg",
    "content": "Dear Carolyn,  Thank you very much for the update.  Tough question, i am not sure whether there is an absolute correct answer to it.   You are not having any more chest pain, that's a good sign. However, you are having shortness of breath, and this could point to the effect the blood clot had on your lungs.   i would recommend having:  1. Doppler exam on the veins of your legs: if a blood clot is found in your legs, then there is a higher chance that the chest pain that you had was secondary to a blood clot in your lungs. 2. Echocardiogram (ultrasound of the heart): to evaluate for the presence or absence of pulmonary hypertension (high blood pressure in the lung blood vessels) which can point to blood clot in the lung. 3. Ventilation-perfusion lung scan: If your primary care provider thinks that this is feasible.  How about a ct scan of the chest? i don't think it would be of any benefit at this time.  The real question is: if you are diagnosed with a blood clot in the legs and/or lung and knowing that the treatment is going to be blood thinners and knowing you don't accept blood transfusions and there is of course always a risk of bleeding in patients getting blood thinners. The question is would it make a difference if we know whether or not you have a blood blot in the lung knowing that you might not be agreeable to taking blood thinners (the treatment of blood clot in the lung?).  The answer might be yes. If there is a blood clot in your legs and a blood clot in the lungs and you don't agree to taking blood thinners, there is another alternative which might not be the best on the long run but it is the only one available and that is placing a device that prevents blood clots from the legs to reaching the lungs. This device is called an inferior vena cava filter.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped and if you still have any questions or concerns, please don't hesitate to post them.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Mon Aug 09, 2004 11:16 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=4471&sid=d415cdddd88c219557a15b32392c93ba#p4471"
  },
  {
    "author": "angelB  Guest Posts: 4 Joined: Wed Feb 18, 2004 10:21 pm",
    "title": "Right High Output Heart Failure",
    "content": "Dr. COuld you take a look ant my conversation with Dr. Gordon under Multiple Myloma and see if you have ever seen anything like my illness.  Im 33 with R high output heart failure with pitting edema and full body edema, Im SOB , and none of the Dr.s where I live can figure out what is wrong with me.. If you could take a look I would very much appreciate it.    I recently wint In the Hospital for 3 days and they took 18lb of flood off of me and my echo after always being normal is now showing slight  L ventrical enlargement, will it get bigger? and what will this do to my health? thank you....\n\n",
    "posted_time": "Post  by angelB » Wed Feb 18, 2004 10:56 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2564&sid=d415cdddd88c219557a15b32392c93ba#p2564"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Right high output heart failure",
    "content": "Dear Angel,  Thank you vey much for using our website.  Heart failure is caused by the inability of the heart to pump blood to the peripheral tissues. And so, the cardiac output is low as the heart is not able to pump enough blood. In certain cases, the heart is actually working harder and pumping more blood to the tissues, but this output is still not enough for the tissues which need more, so, although the cardiac output of the heart is high (in contrast to the low output of the heart in heart failure), the heart is yet failing (to meet the peripheral tissues increased needs), hence the nomenclature high cardiac output failure. In your case, i think since you had a right heart catherterization where the cardiac output of the right ventricle was figured out, most probably you were told that you have right high cardiac output failure. Now, i am not sure how high was your cardiac output then and have you had any right heart catheterization since then for follow-up or not.  The causes of high cardiac output failure are: 1. Anemia: Looks like from your history that you had anemia at a certain point. Have you ever received blood transfusion to treat that and has the cause of this anemia been figured out or looked for? 2. Beri-beri: You mentioned that you had beri-beri because of low thiamine level in the blood. Have you had other signs of beri-beri besides the heart failure like neuropathy? Have you been treated for beri-beri. 3. Bone diseases: a. Paget's disease: With a high alkaline phosphatase. This could be a possibility. Was a calcium level and x-rays of the bones ever done to rule that out? b. Multiple myeloma: Could also be a cause but looks that this has already been ruled out. c. Fibrous dysplasia of the bone. 4. Arteriovenous fistulas: Arteriovenous fistulas are abnormal connections between arteries and veins with abnomral shunting of blood from at the level of the shunt without the blood passing through the normal channels taking less time and adding a lot of stress on the heart. These could be congenital and could be located in internal organs such as the liver and others and may not be apparent on the surface of the body. They also might be acquired like people who are on dialysis. 5. Hyperthyroidism: Have you ever had a thyroid test done? 6. Renal failure. 7. Liver failure. 8. Carcionoid syndrome: Your 5-hiaa was negative. 9. Polycythemia vera: Where there is an bnormal increase in the number of red blood cells (opposite of anemia). Which obviously is not the case in your condition. 10. Cor pulmonale: Which is right sided heart failure secondary to lung causes (no left ventricle failure). 11. Morbid obesity: How much do you weigh?  The treatment of high cardiac output failure is obviously treatment of the cause. So, you have to have a second work-up for diagnosis and then treatment started.  While in the hospital the last time, have you received only diuretics to take the fluis off or did you have dialysis?  What are the medications that you are getting so far? And do you think they are helping in terms of symptoms?  Once more, thank you very much for using our website http://doctorslounge.com and i hope that this information helped and waiting for your response.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Fri Feb 20, 2004 10:08 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2574&sid=d415cdddd88c219557a15b32392c93ba#p2574"
  },
  {
    "author": "angelB  Guest Posts: 4 Joined: Wed Feb 18, 2004 10:21 pm",
    "title": "CHF",
    "content": "Thank you for your reply!  IM sorry this is lengthy.  I will try to answer all your questions. My Cardiac output was 8.2 liters per min.  No other heart cath has been performed.  At the time he was questioning constrictive pericarditis, but my echo looked good.  I have had no neuopathy, and A nepherologist that I see said Beri Beri isn't even around now, so I guess that it is ruled out .  He found one kidney smaller than the other on ultrasound and the report said possible renal artery stenosis.  But no one has ever mentioned it again.  My urine has all been norm except I had a high creatinine clearance of 164.  Calcium ok, bone scan showed only small amount of activity around ribs, Dr. said this was nothing, I could have bumped myself.    FSH & LH normal, TSH norm., Hep c- neg., Hep B-neg, liver functions normal C4 serum High 40,   C3 high 198,  Antinuclear Antibodies high  speckled pattern at 1:80    Spirometry showed small airway disease otherwise WNL and mild decreased diffusion capacity.    My weight was around 155 I am 5'8 1/2  and started gaining fast,  by 172 I noticed I had pitting edema .   From there I have continued to gain to about 195.  I have stayed here other than the 18lb loss after the hospital.  I feel like Im in an Eskimo suit all the time, tightly binded and full ike you have ate so much you cant hardly breath.  I am trying to drop the weight with weight watchers, but so far in 3 weeks I have only dropped 1 lb.  My husband started with me and has done lost 11lb.  I tearfully continue, and I will not give up.  I have a son and I want my life back...I am embarrassed by my appearance, I have always been 145 to 155.  Recent labs  Alk Phos H 195,  WBC 11.61 H, MCH 25.8L, RDWC 15.1 H,  Cardiac profile was norm except for Rapid MYO 15 L  Latest echo showed concentric Left Ventricle hypertrophy 13mm (6-11)norm  Never had blood transfusion, anemia unknown,  I have heavy clotting periods, They have mentioned this to be a possibility.  But Not every month is heavy.  I have never had dialysis,  only diuretics.  Currently on LASIX 80mg 2 daily, TOPRALXL 50 mg q d. (tackycardia),  k-dur, Just added Zeroxolyn, but I have not got it filled yet. Meds take off most of fluid, but I still pit mildly all the time.  Long trips, standing, cause ankles, feet , hands , legs to swell even more.   VENOUS SCAN normal.  HISTORY:  Irritable bowel syndrome, lyme, (erethema nodosum 2 times biopsy didn't reveal cause.  (age 16 & 20) when I had it.)  multiple food and drug allergies ( anaphylaxis) PSVT, hypoglycemia, Inflammation of joints still persist, it jumps around, locking, popping and some swelling of the joint that is affected at the time.  I was a blue baby so I had anemia al allot during my childhood. my mother as RH neg.    Could this be hereditary?  My grandmother (mom side) died suddenly with CHF, Her mother( my great grandmother) died young with DROPSY? said her legs seeped fluid, they said she had to eat liver all the time for health reasons??\n\n",
    "posted_time": "Post  by angelB » Mon Mar 01, 2004 9:47 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2677&sid=d415cdddd88c219557a15b32392c93ba#p2677"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Right high output heart failure",
    "content": "Dear Angel,  Thank you very much for the update.  A cardiac output of 8 liters is actually not that high as the upper normal is around 7 liters. Of course, we don't know what your base line was before this.   Having concentric hypertrophy of the left ventricle most probably means that you have either chronic left ventricle stress (most probably hypertension) or an infiltrative disease of the myocardium which means that there is a substance that is infiltrating your heart around the heart muscle and making your heart appear to be thicker on the echo. Usually, infiltrative diseases have a characteristic echo picture and the heart in most of the times is much thicker than just 13 mm.   Another thing that i would like to know is what was your pulmonary artery pressure. What do you mean by Rapid MYO 15 L?   Right heart failure can be caused either as a consequence of left ventricle failure or can occur on its own. This is usually secondary to high pulmonary artery pressures, a case known as pulmonary hypertension which could happen on its own (primary pulmonary hypertension) or could be secondary to a lung disease.  In your case, you underwent lots of investigations to know the reason which has not been revealed yet.   The only thing that i have to add is to make sure that you don't have sleep apnea which is not thought of often and can give this picture. Also, you might want to make sure that you don't have hyperactivity of the adrenal gland (a condition known as Cushing's syndrome).  Once more, thank you very much for using our website http://doctorslounge.com and i hope that this information helped and keep me updated.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Thu Mar 11, 2004 4:27 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2742&sid=d415cdddd88c219557a15b32392c93ba#p2742"
  },
  {
    "author": "lbenkel  Guest Posts: 5 Joined: Mon Jun 09, 2003 9:42 am Location: Michigan",
    "title": "Heart exploded",
    "content": "A friend wrote to me telling me of the death of one of her friends.  I want to know whether it is actually possible that the heart exploded. This is what she wrote; \"She only had 20 % of her heart left, so couldn't do any extensive tests on her.  It finally  just exploded in the hospital & blood was even in her stomach.  They did try to revive her though.\"\n\n",
    "posted_time": "Post  by lbenkel » Wed Jun 11, 2003 10:58 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=931&sid=d415cdddd88c219557a15b32392c93ba#p931"
  },
  {
    "author": "Dr. Russell M  Medical Doctor Posts: 650 Joined: Mon Jun 09, 2003 12:34 pm Location: USA",
    "title": "[no title]",
    "content": "Dear Ibenkel,  Myocardial [heart muscle] rupture is a clinical entity that happens after an acute myocardial infarction [aka heart attack with loss of tissue blood supply due to blocks in blood vessels supplying the heart muscles]. Catastrophic an event as it is, your friend's description of the events certainly add dramatic connotations to a layman's understanding. Concomitant rupture of the diaphragm [muscular partition between the chest and abdomen] with accumulation of blood within the abdomen has also been described with this condition. Older women, especially those with recurrent postinfarction angina [repeated chest pains in a person known to have had a heart attack], and patients with systemic hypertension [high BP] more commonly experience myocardial rupture following Acute Myocardial Infarction. So much notwithstanding, I feel Ibenkel can still sleep peacefully knowing that her aches aren’t in her chest but in her waist.  -Bill\n\n",
    "posted_time": "Post  by Dr. Russell M » Wed Jun 11, 2003 1:27 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=934&sid=d415cdddd88c219557a15b32392c93ba#p934"
  },
  {
    "author": "Tami  Guest Posts: 1 Joined: Fri Mar 28, 2003 7:25 pm",
    "title": "Congestive Heart Failure Medication Digoxin",
    "content": "My father was just diagnosed with Cogestive Heart Failure 2 month ago and he has had confusion and says that he see's Halos around things.  I read up on this drug and seems to have this side effect.  Can this drug be the cause?  And is there an alternative medication that we can discuss this with our Heart doctor about changing to see if even for a short time to see if this may be the cause? Please advise. Thanks you.\n\n",
    "posted_time": "Post  by Tami » Fri Mar 28, 2003 7:31 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=573&sid=d415cdddd88c219557a15b32392c93ba#p573"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "digoxin toxicity",
    "content": "Dear Tami, You should discuss these symptoms with your heart doctor because indeed they may be caused by digoxin toxicity. Based on your fathers examination the doctor may request a blood test to check the serum level of the drug.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Mon Mar 31, 2003 5:05 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=586&sid=d415cdddd88c219557a15b32392c93ba#p586"
  },
  {
    "author": "tamijame",
    "title": "Thanks",
    "content": "Thank you for your information.  We have just visited the heart doctor and suggested that his Digoxin level be checked and were now in the process of doing just that.  Appreciate your time and knowledge.\n\n",
    "posted_time": "Post  by tamijame » Wed Apr 02, 2003 9:11 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=589&sid=d415cdddd88c219557a15b32392c93ba#p589"
  },
  {
    "author": "sammari",
    "title": "Ipecac syrup & heart damage",
    "content": "I have used ipecac syrup on a daily basis for the past month. I have read that it can cause heart damage. Is this a rare possibility or is it a probability? And, if it is true, does it result from years of use?\n\n",
    "posted_time": "Post  by sammari » Sun Feb 09, 2003 9:27 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=296&sid=d415cdddd88c219557a15b32392c93ba#p296"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Ipecac syrup & heart damage",
    "content": "Dear Sammari,   Thank you very much for using our website.   Why are using the syrup of ipecac?   It has been FDA approved only to induce vomiting in cases of acute poison ingestion.   It has lots of side effects in cases of chronic abuse. One of those is cardiac toxicity leading to weak heart muscle and heart failure. It is not not known how long and what is the dose that can cause this toxic effect on the heart. In a case report, heart toxicity was reversible but it is not knwon whether a larger dose or a longer period of use would have led to irreversible cardiac toxicity.   Once more thank you very much for using our website http://doctorslounge.com and if you still have further inquiries, please do not hesitate to post them.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Sun Feb 09, 2003 9:28 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=297&sid=d415cdddd88c219557a15b32392c93ba#p297"
  },
  {
    "author": "CJB43love",
    "title": "Congestive Heart Failure Prognosis - 5 years to live?",
    "content": "My husband was diagnosed with congestive heart failure about 2 years ago. In the past 6 years, he has had 5 heart attacks. His doctor says that his heart muscles  are very weak, and is treating him with medication.  Back in Sept.2001, he had a stenth put in the main artery; both the left and right have 85-87 percent blockage, but the surgeon told us that he is not a candidate for a triple bypass, because he is also a insulin dependent diabetic and has been for about 20 years. Also, he has very narrow arteries.   My question is my husband believes that he doesn't have very long to live since the muscles are so weak. The doctor has also indicated that it could be 5 years. I  looked up some info on this, and the update is 2-5 yrs. I have accepted this might be true, so whatever you tell me will not upset me. My husband just turned 60.   We lost our son 6 years ago, and his health seems to have deteriorated, but he still tries to work, since we are self employed.  Any input you have, I will appreciate it.  Thanks,  Joan\n\n",
    "posted_time": "Post  by CJB43love » Sat Dec 28, 2002 6:22 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=66&sid=d415cdddd88c219557a15b32392c93ba#p66"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Congestive Heart Failure",
    "content": "Dear Joan,   Thank you very much for using our website.   First of all, you have my deepest sympathy for your husband condition and hope that he gets well.   Congestive heart failure unfortunately has no cure except heart transplantation.   Otherwise, the patients' symptoms are treated with medications. In the last few years, there was an actual jump over in the treatment of congestive heart failure.   Now, there are some medications that actually improve survival rates if the patient is maintained on them. i do not know what kind of medications is your husband taking but i think it is very important that he takes them if he can according to his doctors.   These medications are  - Beta blockers group of medication  - ACE inhibitors group of medication   The combination of these 2 groups of medications was found to have a very strong on the quality of life and the longivity of patients in all the clinical trials that were done.   In addition to other medications such as water pills and digoxin, these 2 groups should be taken unless contra-indicated for a reason or another.   Nobody can predict how long does a patient with congestive heart failure can live, unless his condition is deteriorating as regards repeated admissions to the hospital separated by very narrow intervals together with development of other organ failures such as the kidney or the liver then i think it is few months or may be even less.   The best thing to do is try to be on the best treatment available for the time being and try to improve the quality of life that you are living right now and if you or your husband have any postponned projects to do, just try to do them.   Now, i am not sure whether anybody has mentionned that to you or not (and i am not sure where you live). But, if you are a resident of the United States, then patients who have severe congestive heart failure who are judged by their physician to have 6 months or less to live are eligible for the hospice program and it will be covered by medicare as well. The hospice program is a very good program involving people who are dedicted to soothing other people's pains and standing besides them in the worst moments. So, you could also ask your husband's doctor about that as well.   I wish that there was more i and any body else could offer but science is rapidly progressing forwards and evey body hopes to discover more that could help people like your husband.   Once more, thank you vey much for chosing our website http://doctorslounge.com and hope to hear from you soon.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Thu Feb 06, 2003 8:09 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=244&sid=d415cdddd88c219557a15b32392c93ba#p244"
  },
  {
    "author": "chuck and betty  Guest Posts: 1 Joined: Fri Jan 31, 2003 10:38 am",
    "title": "Heart failure prognosis - asthma and lung infection",
    "content": "Hi Can someone give me some information on congestive heart failure? My Mom is 80 years old and has asthma.She has had a lung infection for the last 2 weeks. Now the doctors say she has the heart problem.She is now home from the hospital. She says she is feeling good.She is in Arizona and had planned on being there until the first of March. Do you think she should cut her trip short and come back home (northwest). Betty Ann\n\n",
    "posted_time": "Post  by chuck and betty » Fri Jan 31, 2003 10:40 am",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=189&sid=d415cdddd88c219557a15b32392c93ba#p189"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Heart failure prognosis",
    "content": "Dear Chuck and Betty,  Congestive heart failure in general has a bad prognosis if left untreated but if your mom is being treated then the prognosis improves.  If after hospitalization, your mother is feeling ok and she does not have any problems, and since she has access to medical care when needed, i would rather let her stay in a warmer place like arizona as compared to cold areas and any way, it is like 3 weeks away.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Wed Feb 05, 2003 10:31 pm",
    "category": "Cardiology",
    "sub_category": "Heart Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=233&sid=d415cdddd88c219557a15b32392c93ba#p233"
  }
]