[
  {
    "author": "khfarooq  Guest Posts: 1 Joined: Mon Aug 16, 2010 3:41 am Gender: Male",
    "title": "Hepatoma or Hemangioma?",
    "content": "To Whom It May Concern  My Father is suffering from Hepatitis C disease since 1995. He is doing really well and regularly undergo checkups which include various blood tests and Endoscopy. His recent test of AFP revealed levels of 298.4, due to which the doctor advised us to undergo a CT SCAN.  The CT SCAN detailed that a HEPATOMA of 2 x 2 cm in the segment VI of the liver was diagnosed.   Our Gastro doctor advised us to undergo a surgery called RFA. We got admitted to the hospital which later discharged us on the report of the Radiologist that the Tumor could not be seen on the Ultrasound machine due to which the surgery can't be performed.  We were later advised to travel to Singapore for the procedure.  Just recently before attempting surgery in Singapore, we visited a well known Cancer Hospital and were advised to undergo a few tests as well as a MRI Scan with Contrast.  The MRI Report has got me really confused as it showed that there were no signs of HEPATOMA but a HEMANGIOMA. Gastro Doctors at the Cancer hospital termed my father out of danger and sent us back home.  Later on consulting our Gastro Doctor in my hometown, the doctor was of the opinion that there is a Hepatoma as the AFP shows.  Kindly help as we are really confused.\n\n",
    "posted_time": "Post  by khfarooq » Mon Aug 16, 2010 4:24 am",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=100992&sid=6b4820429e927af9b3fd4f821b8d856e#p100992"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: Hepatoma or Hemangioma?",
    "content": "Hi, To begin with, let me try to explain the reason for some of the difficulties experienced in interpreting  -Fetoprotein (AFP) levels.  In adults, levels over 500 nanograms/milliliter of AFP are seen in the following situations:  - Hepatocellular carcinoma(HCC),  - Germ cell tumors of ovary and testis, and  - liver metastasis due to primary malignancies elsewhere.  Not every person with increased AFP test results can be presumed to have cancer or will develop liver cancer. AFP concentrations can be elevated, and fluctuate, in individuals with chronic hepatitis and cirrhosis. When the AFP concentrations of individuals with chronic liver disease change from ‘moderately’ elevated to ‘greatly’ elevated, their risk of developing liver cancer increases. AFP levels can increase temporarily in conditions causing liver injury and regeneration, and moderate elevations can be seen with a variety of conditions including some other cancers (gastric, pancreatic and biliary tract cancers).  The “high dose hook effect” is an artefact of tumor marker immunoassay kits, that results in reported value of a tumor marker to be falsely low, when the actual level is in fact, high. An undetected hook effect may cause delayed recognition of a tumor. A suspected hook effect can be confirmed by analyzing serial dilutions. If the hook effect is absent, then, reported quantities of tumor marker in a serial dilution should be proportional to the dilution.  Hereditary persistence of alpha-fetoprotein (HPAFP): an autosomal dominantly inherited condition, should be considered in both children and adults with unexplained and persistent elevation of AFP. This can be easily confirmed by analyzing AFP levels in the other members of the family.  Fibrolamellar variant of HCC: this is one variant which presents differently. It is more common in women and has a better prognosis. Less than 10% of patients with fibrolamellar carcinoma (FLC) have AFP levels > 200 ng/mL.  <10-20% of cases of FLC are associated with hepatitis B viral infection, and is rarely associated with hepatitis C viral infection.  The important of this condition (in the context of your father’s case) lies in the fact that it has some imaging features in common with hemangiomas and focal nodular hyperplasia and at times may be difficult to diagnose based on imaging.  A relatively new test, called AFP-L3% (one of the AFP variants), is sometimes used  to compare the amount of total AFP to the amount of AFP-L3. The AFP-L3% test is not yet widely used in the U.S, but has gained wider acceptance in other countries such as Japan. The main use of this test is to help determine the risk of developing HCC, especially in those individuals with chronic liver disease. When total AFP and AFP-L3% are significantly elevated, then risk for such a person of having, or developing hepatocellular carcinoma in the next year or two is higher.    Thus, in your father’s case, several possibilities must be entertained, such as - that he in fact has a hemangioma and has an elevated AFP level due to hepatitis C, - that he in fact has a hemangioma and has a raised AFP level due HPAFP,  - that  a firolamellar variant of HCC has been mistaken for a hemangioma (although it is more common in women and rarely associated with hepatitis C), or  - hypervascular metastasis from tumors such as neuroendocrine carcinoma, melanoma or renal cell carcinoma.  It is indeed an unfortunate situation to be in. What could be done next is hard to recommend.  One approach may be to have the AFP levels repeated after a few months. total AFP and AFP-L3% may be checked. MRI should also be repeated after a few months. RBC-tagged technetium-99m scintigraphy may be useful to confirm a hemangioma (sensitivity better for larger lesions).  Best wishes!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Tue Aug 17, 2010 6:44 am",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=101093&sid=6b4820429e927af9b3fd4f821b8d856e#p101093"
  },
  {
    "author": "inyati13  Guest Posts: 2 Joined: Sun Jun 13, 2010 12:04 pm Gender: Male",
    "title": "CT of ABD/Pelvis reveals spots on liver",
    "content": "I had a ABD/pelvis CT + contrast (IV and Barium smoothie).  It revealed spots on my liver.  Three small spots about 1-2 cm or less.  I was not told what these are.  Only that they should be watched.  Should I be concerned?\n\n",
    "posted_time": "Post  by inyati13 » Sun Jun 13, 2010 12:15 pm",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=93980&sid=6b4820429e927af9b3fd4f821b8d856e#p93980"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: CT of ABD/Pelvis reveals spots on liver",
    "content": "Hi, What you call as spots are perhaps what are known as 'focal' lesions in the liver.These are classified as  - (liquid)cystic or - solid. There are very many pathologies that can cause these 'focal' lesions.Some of these are benign and others malignant.Some of them, although benign are capable of causing serious or even life-threatning problems.  Examples of some of the focal liver lesions that usually tend to remain silent are - hemangiomas - focal nodular hyperplasia - simple cysts - focal fatty change.  Some of these start causing symptoms only when they grow to a large size. Best wishes!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Tue Jun 15, 2010 6:02 am",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=94160&sid=6b4820429e927af9b3fd4f821b8d856e#p94160"
  },
  {
    "author": "luehka  Guest Posts: 1 Joined: Thu Apr 30, 2009 2:58 pm Gender: Female",
    "title": "Focal fatty infiltration of liver new with lung granuloma",
    "content": "I am a 37 year old female. Had repeat CT recently last one 2 years prior r/t c-diff colitis. CT results this time showed new calcified granuloma on left lung base, New Focal fatty infiltration of the liver seen near the fissure for the ligamentum venosum, old unchanged tiny bilateral cortical hyperdensities  unchanged. No other significant findings. Dr states normal should I get second opinion. Thanks\n\n",
    "posted_time": "Post  by luehka » Thu Apr 30, 2009 3:11 pm",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=76415&sid=6b4820429e927af9b3fd4f821b8d856e#p76415"
  },
  {
    "author": "Camille Stubbs, RN  Nurse Posts: 7 Joined: Sat Sep 26, 2009 7:51 am Gender: Female",
    "title": "Re: Focal fatty infiltration of liver new with lung granuloma",
    "content": "Hello Luehka,  If getting a second opinion would be peace of mind for you; do it.    Secondly, the granuloma and fatty liver is recent for you.  Usually, granulomas are benign, though it should be definitely monitored as well as your history with bilateral cortical hyperdensities (I assumed the cortical issue is renal).    Thirdly, in my opinion, the fatty liver issue should be further investigated. There are many conditions that can cause a fatty liver.    Good luck.\n\n",
    "posted_time": "Post  by Camille Stubbs, RN » Sun Oct 11, 2009 7:00 am",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=83600&sid=6b4820429e927af9b3fd4f821b8d856e#p83600"
  },
  {
    "author": "wehope  Guest Posts: 1 Joined: Thu Apr 16, 2009 3:45 pm Gender: Male",
    "title": "Help: Treatment for Liver Cancer and Osteocarcinoma",
    "content": "My friend has recently been diagnosed with late stage liver cancer, which further spreads to cause osteocarcinoma. His family fell into deep sorrow. Words pale in the shadow of grief, we thus turn to this internet forum for help and suggestions. We would be really grateful if you could help provide some information regarding any of the following: new means of treatment, internationally leading experts/hospitals in this field (regardless of country), or any holistic or alternative prescriptions.  We trust that the diagnosis is not an end to this optimistic young man. Rather, it is a fair start for seeking a right remedy, and we remain hopeful for a collection of suggestions and advice, which comes from you and passes on to us.  Your assistance and warm-heartedness will be greatly appreciated!\n\n",
    "posted_time": "Post  by wehope » Thu Apr 16, 2009 3:49 pm",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=74492&sid=6b4820429e927af9b3fd4f821b8d856e#p74492"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "Re: Help: Treatment for Liver Cancer and Osteocarcinoma",
    "content": "Hello,  I am sorry to hear about your friend's condition. Just to clarify things for everyone else - osteocarcinoma is a relatively obsolete term which refers to bone metastasis from a carcinoma, in this case hepatocellular carcinoma (HCC).   To answer your question - late stage (stage IV) has a poor prognosis. Bone mets depending on their location can have serious implications due to encroachment on the spine or the possibility of a fracture.  Many things need to be taken into consideration when discussing prognosis of liver cancer, the functional status of the patient, the age, the state of the liver (liver function) as well as the type of pathology (eg, fibrolamellar carcinoma which appears in younger individuals and is of better prognosis).  Generally speaking metastatic HCC is treated with target therapy sorafenib. Other options may be appropriate depending on the details of his clinical assessment.  A lot can be done in terms of palliation such as radiation therapy for pain control of bone metastasis.   Best regards,\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Tue May 26, 2009 5:42 am",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=79579&sid=6b4820429e927af9b3fd4f821b8d856e#p79579"
  },
  {
    "author": "asla  Guest Posts: 1 Joined: Sat Nov 15, 2008 5:05 am Gender: Female",
    "title": "Hepatomegaly rt lobe mass lesion- 59yr male",
    "content": "Hi. This is regarding my brother-in-law, a 59 year old male.  He was diagnosed with hepatitis C and liver cirrhosis years ago. He has been in and out of hospitals ever since. Location Cairo, Egypt.  Last week he threw up a large amount of blood and had a high AFP reading over 1,000. All this happen while in the hospital; he is still in hospital at this time.  My question is, based on his latest medical test below, what type of treatment, if any would be recommended at this point.  I think that his doctor is suggesting Radiofrequency Ablation. I say \"think\" based on the doctor telling the family that they want \"to go in and iron cells…\". I am awaiting confirmation on the medical term of this \"ironing\" from his doctor.  Thank you for your time and for being available to us on this forum. I appreciate   your opinions and many thanks again.  MEDICAL REPORT  - Axial CT abdominal. CT scan was performed after bowel opacification and intra venous contrast injection. - The liver is moderate enlarged cirrhotic coarse pattern. The right lobe posterior segment is the seat of heterogeneous enhanced mass lesion measuring 11 x 12 x 9 cm. Extends to segment 6, 7 and to lesser extent 8 with visceral surface buldge. - Portal vein is homogeneously enhanced. - No intra hepcetic biliary rodicles dilation. - Spleen is moderate enlarged, homogeneous in attenuation with regular surface. - Multiple para esophageal collateral and varies. -Kidneys are average size, of homogeneous attenuation pattern and adequate excretory function. No focal mass lesion. - Pancreas, supra renal glands are average size, regular margins, with homogeneous attenuation pattern of the parenchyma. No focal mass lesion. - No para aortic or retro peritoneal lymphadenopathy or mass lesion. - No ascites or localized collection. - The scanned lung bases and pleural recess are clear.  CONCLUSION  - Hepatomegaly with right lobe (6-7 and 8) mass lesion likely neoplastic. - Splenomegaly and para esophageal collaterals and varices.\n\n",
    "posted_time": "Post  by asla » Sat Nov 15, 2008 7:50 am",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=64346&sid=6b4820429e927af9b3fd4f821b8d856e#p64346"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "Re: Hepatomegaly rt lobe mass lesion- 59yr male",
    "content": "Hello,  I do apologize for the late reply. I hope your brother in law is well.  The most important determinant for the treatment of hepatocellular carcinoma (HCC) is the liver function status. Since the most important risk factor for this disease is cirrhosis and hepatitis C (which is endemic in Egypt), HCC usually presents with poor liver function.   Many oncologists use one of several prognostic classifications that assess liver function to determine the best therapeutic approach.   Surgery as you know would be the optimal treatment. Liver transplant is another option with excellent outcome but requires strict criteria which do not apply to your father. The presence of varicies that you mention is quite significant as it indicates the presence of portal hypertension which is usually a contraindication for curative approaches.  Radiofrequency ablation is a great option for local disease in which neither surgery nor transplant is possible. Best results are acquired when the tumor size is less than 4cm. This is due to two reasons 1, the applicator has a circumference of approximately 5cm and of course smaller tumors fair better than larger ones. In this setting the outcomes are comparable to surgery. However, there is no strict limitation on size and multiple sessions can be used to cover the area occupied by the tumor although less benefit is expected.  HCC is a very difficult disease to treat because of the aforementioned reasons. Localized HCC always challenges the oncologist to take a more active attempt at its control.  Please keep us updated and my apologies again for the late response.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Tue Feb 03, 2009 7:11 am",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=70451&sid=6b4820429e927af9b3fd4f821b8d856e#p70451"
  },
  {
    "author": "KarenZee  Guest Posts: 6 Joined: Wed Feb 01, 2006 10:50 am Location: CT",
    "title": "Cholangiocarcinoma (bile duct cancer)",
    "content": "My 79yo mother was diagnosed with Bile Duct CA in the common BD just after Christmas. She was very sick with jaundice about 1 month prior.  What is the prognosis for this type of cancer? A stent was placed to drain the bile and she is feeling stronger. Radiation started 2 wwks ago, and a low dose of chemotherapy (5-FU) started last Fri for once a wk.  I realize that these treatments are palliative in nature and I want my momther to be as comfortable as possible. What I don't  know is how long she would be expected to live. Also, I am concerned that at some time these treatments will become worse than the disease itself.  If anyone has had experience with Colangiocarcinoma I would appreciate your insight. Thank you.\n\n",
    "posted_time": "Post  by KarenZee » Wed Feb 01, 2006 11:38 pm",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=29744&sid=6b4820429e927af9b3fd4f821b8d856e#p29744"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Hello,  Sorry for the delay in responding to your post.  Prognosis and survival depends on the tumor extent and the general condition of the patient which permit surgical resection and or chemoradiotherapy.  When the tumor can be resected completely, patients may achieve long-term survival with a 5-year survival rate up to 40%. The median survival duration of 17-27.5 months can be reached.  A median survival duration of 7-17 mo can be achieved  when resection is done with no further chemo radiation.  The poorest prognosis is when patients have unresectable disease and can not tolerate chemotherapy or radiation therapy (tolerate only palliative stent placement).   Hope this information is useful. Best regards.\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Mon Feb 05, 2007 3:40 pm",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=38441&sid=6b4820429e927af9b3fd4f821b8d856e#p38441"
  },
  {
    "author": "KarenZee  Guest Posts: 6 Joined: Wed Feb 01, 2006 10:50 am Location: CT",
    "title": "Cholangiocarcinoma",
    "content": "Dear Dr. Mahmoud:  Thank you for your reply. My mother has made it to 14 months post diagnosis and is still fighting. She has wonderful medical support from the cancer center where she receives treatment and the VNA hospice team who visit her at home.   She had radiation and 5 FU as I mentioned. She has had several rounds of Gemzar and continues to have low dose treatments every other week as long as she can tolorate it, which she does pretty well.  She had several set backs along the way... a fractured pelvis due to a fall and GI Bleeds, which postponed treatment.   Initially, my mother was extremely ill and it was felt that she couldn't tolarate resection surgery. After radiation and 5 FU she consulted with a surgeon who felt surgery was not a good option for her as they don't know the extent of the tumors and fear that they are probably elsewhere besides the bile duct. She has a pacemaker so an MRI was not done so better pictures were not available.   She has been such a strong person through all of this. In spite of all she has gone through, she remains in good spirits thinking more about everyone else than herself.  We are grateful to have her with us still and cherish every day with her.  Sincerely, Karen\n\n",
    "posted_time": "Post  by KarenZee » Mon Feb 05, 2007 5:55 pm",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=38446&sid=6b4820429e927af9b3fd4f821b8d856e#p38446"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Hello,  Thank you for keeping us updated. I am pleased to hear that she is receiving the best care for her condition and is doing well despite the difficult conditions she passed through her illness.   It is so brave of her to keep herself in a good spirit and to continue thinking about everyone. It is obvious that she is a very special person and I wish her and you best of luck.  Thank you again for updating us. Best wishes.\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Tue Feb 06, 2007 6:31 am",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=38458&sid=6b4820429e927af9b3fd4f821b8d856e#p38458"
  },
  {
    "author": "KarenZee  Guest Posts: 6 Joined: Wed Feb 01, 2006 10:50 am Location: CT",
    "title": "Many Thanks!",
    "content": "Dr. Mahmoud:  You are very kind. Thank you for your very thoughtful words.  Karen\n\n",
    "posted_time": "Post  by KarenZee » Wed Feb 07, 2007 10:49 am",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=38498&sid=6b4820429e927af9b3fd4f821b8d856e#p38498"
  },
  {
    "author": "jockdoc  Guest Posts: 1 Joined: Fri Nov 07, 2008 8:09 am Gender: Male",
    "title": "Re: Cholangiocarcinoma (bile duct cancer)",
    "content": "My mother in law has recently been diagnsed with a liver tumor. She has had RA for many years and her immune system is very week due to the RA drugs. The pyhsicians have recently placed a drain in and are preparing to put in a stint. THey have told her she is not physically strong enough to stand surgery, chemo, or radiation....they are going to try a radioactive bullet...what other options are out there?  THank you!\n\n",
    "posted_time": "Post  by jockdoc » Mon Dec 15, 2008 11:24 am",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=65381&sid=6b4820429e927af9b3fd4f821b8d856e#p65381"
  },
  {
    "author": "monica  Guest Posts: 10 Joined: Wed Feb 25, 2004 11:57 pm Location: wisconsin",
    "title": "Possible liver problem?",
    "content": "I was wondering if I should be concerned...I was just on a two week regimen of diflucan (300mg in the morning and 300mg at night) because I have a yeast infection that won't go away. I believe it may be because of candida overgrowth.  For months now, I've been tired to the point where I don't get anything done, just want to sleep when I get home from work....My skin is itchy(no rashes though)...My mouth seems drier than usual, my lips are so dry that they feel like leather, and nothing I put on them helps, and my urine is very yellow. This all started happening when I started the diflucan, but I also at the same time changed my diet to no sugar...which means no soda, or bread, or every day food most people consume...so I just thought that maybe the diet change was more responsible for the dry mouth and really dry lips. I'm trying to drink more, which has helped with the dry mouth, but my lips are basically peeling...oh....and my eyes get super dried out at the end of the day (sometimes they feel a little dry during the day) but I put in saline at night, helps for only a little bit then they feel dry again, so I wind up going to sleep because I can't keep my eyes open.  The yellow urine started happening after the diflucan...I was going to wait 7 days till it was out of my system, then see the doctor, but I wanted to see if I could get any input before then, because maybe it needs more immediate attention. If anything is wrong, I don't seem to feel sick...just tired and skin is itching...but not to the point where I can't stand it. I think my urine output should be more than what it is. I can drink almost a liter of water, and start to fell the need to urinate before it's gone, but not an urgency, I can hold it for my 8hrs of work and then go if I choose to. It just seems that I should have more urgency than that..or maybe I am dehydrated and that's all it is.  Any input on this is welcomed. Thanks, Monica\n\n",
    "posted_time": "Post  by monica » Sun Nov 28, 2004 11:40 pm",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6750&sid=6b4820429e927af9b3fd4f821b8d856e#p6750"
  },
  {
    "author": "monica  Guest Posts: 10 Joined: Wed Feb 25, 2004 11:57 pm Location: wisconsin",
    "title": "possible liver problems",
    "content": "I was wondering if anyone was going to reply to my post?  I'm still wondering about my questions that I asked\n\n",
    "posted_time": "Post  by monica » Wed Dec 01, 2004 7:44 pm",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6807&sid=6b4820429e927af9b3fd4f821b8d856e#p6807"
  },
  {
    "author": "margo  Guest Posts: 3 Joined: Wed Feb 16, 2005 8:40 pm Location: Wisconsin",
    "title": "Same Symptoms",
    "content": "I have much of the same symtoms.  Tired, dry mouth, yeast infections, and itchy skin.  My hands and feet itch like crazy and nothing I do gets them to stop.  It is worse at night.  I did have something show up in my liver on a CT scan, but so far Dr's haven't figured out what is wrong.  Have you had any luck since you posted this message?\n\n",
    "posted_time": "Post  by margo » Sun Feb 27, 2005 8:23 pm",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=10068&sid=6b4820429e927af9b3fd4f821b8d856e#p10068"
  },
  {
    "author": "delvoria  Guest Posts: 1 Joined: Mon Apr 11, 2005 11:15 am Location: USA",
    "title": "[no title]",
    "content": "the itchiness can probably be attributed to candida overgrowth, as well as possible parasitic infections (something overwhelmingly overlooked). Candidiasis can cause a myriad of problems, but one thing you have to realize is when you're fighting to kill it, you're going to go through a \"die off\", where the yeast dies - could last a week if your case is severe.  Your symptoms will temporarily get worse, but should get better soon.  If you have any stomach bloating, that should go away within a few days, unless you have latent food allergies that haven;t been identified, which is going to continue to cause havoc when trying to fight off candida.   I have been through very similar problems, monica, and I strongly suggest that you get checked out by a specialist before it gets worse.  I was 89lbs and extremely ill by the time they caught what was wrong with me (low thryoid, secondary adrenal insufficiency, intestinal permeability, candidiasis, 22 latent food allergies).  Had too many things going on at once, and most mainstream medical doctors don't consider half of my conditions valid medical conditions.  All stemmed from a problem early on - something attacked my immune system, and I wound up with infections, and on antibiotics all the time with no probiotics or antifungals.  Candida overgrowth and adrenal problems tend to go hand in hand, especially when one is left untreated.  I had many of the symptoms you're complaining of, but much worse.  Diflucan is NOT the answer, and many strains of yeast are resistant to it.  You should try nystatin.  nizoral is also good, but can cause serious liver damage - I would stay away from it.  I was on nystatin for 4 months with no problems, and then had to switch to capryllic acid bc I developed a sensitivity to nystatin (that happens when you have intestinal permeability).  Anyway, try flax seed oil - one with Omega 3's, 6's and 9's.  DO NOT use the capsules, they will not help that much.  You have to drink the stuff straight and it is nasty.  2 tspns a day - see if it doesn't help your itchy and dry skin, cracked lips, etc.  If you really hate it, try to eat things that are super high in the Omega's - fish, etc...  most importantly, see a specialist - an endocrinologist.  Get tested for low thyroid, low adrenals.  If they act like you're crazy, see another doctor.  If you're having trouble locating one, I know of several - email me.  I might be able to give you some good advice, as I had to learn this stuff all firsthand.   Good Luck to you. -  Jenn delvoria@darksphere.com\n\n",
    "posted_time": "Post  by delvoria » Mon Apr 11, 2005 11:43 am",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=12202&sid=6b4820429e927af9b3fd4f821b8d856e#p12202"
  },
  {
    "author": "Le Da Hae  Guest Posts: 2 Joined: Thu Apr 03, 2008 8:36 am Gender: Female",
    "title": "Re: Possible liver problem?",
    "content": "My bestfriend have liver problem.But,I don't know is it cancer or something else.Her cousin told me that she is in stage 4,the second worse level.She always fainted with bleeding mouth,cannot hold in cold,cannot eat seafood,cannot tired and so on.But,she is stubborn.She still want to join the taekwando practise that we involved in.I was being told that now she are waiting for a liver donor. I want to make an appointment with doctor,whether I am a suitable one. But, I am too young and still a kid.What should I do? I am very worried that she will 'leaves' me someday..\n\n",
    "posted_time": "Post  by Le Da Hae » Thu Apr 03, 2008 9:23 am",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=57535&sid=6b4820429e927af9b3fd4f821b8d856e#p57535"
  },
  {
    "author": "writerdljones  Guest Posts: 3 Joined: Tue Jun 12, 2007 9:01 am",
    "title": "I need to know the difference",
    "content": "About 3 years ago, my father died from liver cancer, he was in stage four, and was told that he would have no chance of survival. About one week ago, a good friend called and said HE has stage four liver cancer and is on some special medication for it. I am 18, female, and confused. Please help me by explaining this difference if it the same disease and same stage, how can there be a medication to possibly sae one and not the other.\n\n",
    "posted_time": "Post  by writerdljones » Tue Jun 12, 2007 10:11 am",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=43565&sid=6b4820429e927af9b3fd4f821b8d856e#p43565"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "I am not particularly knowledgeable in the area of liver cancer but in general once case of cancer is not the same as the next one, even though it may be the same type.  Cancer is quite individualized.   In addition, it may be that there have been new treatments that have come about in the last 3 years.  Cancer research is continually discovering new treatments.  I hope this helps a little.  Please feel free to post follow-ups if you have more questions.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Tue Jun 12, 2007 10:58 pm",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=43599&sid=6b4820429e927af9b3fd4f821b8d856e#p43599"
  },
  {
    "author": "kaitka  Guest Posts: 20 Joined: Sun Dec 17, 2006 12:58 am Location: Ohio  Contact:   Contact kaitka       AOL",
    "title": "Elevated ALT, GGT, cholesterol, LDL and triglycerides!",
    "content": "My husband just had bloodwork done for a life insurance policy.  We've always thought he was very healthy - he never gets sick or anything.  We got the lab results back in the mail today.  His ALT level is 58 (normal is 0 - 45), his GGT level is 75 (0 - 51 is normal).  His cholesterol is 247!!! His LDL Cholesterol is 159 (0 -129 is normal).  His Triglycerides are 189 (0-150 is normal).  I am in shock!   He is 27 years old, 5'9\", 180 pounds.  He's gained a bit in the past couple months, so his cholesterol doesn't SHOCK me.  But his liver enzymes are all off kilter!  And we have no reason for it at all.  He drinks maybe 3 times a year, hasn't SERIOUSLY drank in at least a year.  He used to be a very athletic guy, was in the Army.  Never had any problems.  They tested him for Hepatits C, which was negative, but not for A or B.  We have no health insurance on him (as he always claimed he was \"the healthy one\"), so I'm not sure what steps to take from here.  Are these levels VERY high or just moderately high?  I know his cholesterol is WAY too high (considered high-risk category), but the liver stuff confuses me.  I guess liver disease is pretty rare in America.  At least that's what the research I've done tells me.  What could be wrong?  He's around a lot of cleaning agents at work.  Could that be it?\n\n",
    "posted_time": "Post  by kaitka » Sat Mar 17, 2007 3:10 pm",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=39672&sid=6b4820429e927af9b3fd4f821b8d856e#p39672"
  },
  {
    "author": "kaitka  Guest Posts: 20 Joined: Sun Dec 17, 2006 12:58 am Location: Ohio  Contact:   Contact kaitka       AOL",
    "title": "by the way...",
    "content": "Oh, I forgot to mention... his AST level was 25, which is not abnormal.  And that's also related to the liver.  So I'm just totally confused!\n\n",
    "posted_time": "Post  by kaitka » Sat Mar 17, 2007 3:19 pm",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=39673&sid=6b4820429e927af9b3fd4f821b8d856e#p39673"
  },
  {
    "author": "kaitka  Guest Posts: 20 Joined: Sun Dec 17, 2006 12:58 am Location: Ohio  Contact:   Contact kaitka       AOL",
    "title": "[no title]",
    "content": "I also want to include that his Albumin level is 4.8, which is supposedly slightly high.  His ALP is normal.  His bilirubin is low.\n\n",
    "posted_time": "Post  by kaitka » Sat Mar 17, 2007 3:35 pm",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=39674&sid=6b4820429e927af9b3fd4f821b8d856e#p39674"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Your husband's cholesterol may be the culprit of his elevated liver enzymes.  Elevated cholesterol can cause a condition known as fatty liver that can lead to elevated liver enzymes.  His ALT and GGT are only slightly elevated.  As you say his AST is normal.  The albumin level of 4.8 is not concerning.  Low albumin levels are more concerning for liver failure.  The low bilirubin level means that his liver is working well.  I would recommend having his liver enzymes rechecked in a few months after some cholesterol modification steps.  Having no symptoms with an elevated cholesterol is almost always the case.  Thus it is known as a silent killer.  It can be elevated for many years leading to heart disease without any symptoms at all.  A healthy diet and exercise are key to cholesterol control.  If this is not sufficient there are medications that can help.  I hope this helps.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sat Mar 17, 2007 6:13 pm",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=39676&sid=6b4820429e927af9b3fd4f821b8d856e#p39676"
  },
  {
    "author": "kaitka  Guest Posts: 20 Joined: Sun Dec 17, 2006 12:58 am Location: Ohio  Contact:   Contact kaitka       AOL",
    "title": "[no title]",
    "content": "Yeah, I found some information on NAFLD online and it seemed eerily representative of the lab results.  We've talked about it and while he's not concerned, I've told him he's going to be having a diet makeover.  Gaining 30 pounds in 3 months isn't normal!  He's gained it all in his abdomen too, and I found something about Central Obesity, which relates to metabolism.  I found that interesting, as his  diet and activity haven't changed any and yet he's gained all this weight.  Does it all tie together?\n\n",
    "posted_time": "Post  by kaitka » Sat Mar 17, 2007 7:19 pm",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=39682&sid=6b4820429e927af9b3fd4f821b8d856e#p39682"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "As people get older metabolism generally slows down.  Even small changes in the amount of exercise or increased calorie intake can have significant effects.  While the liver enzymes are not incredibly worrisome at this point, they are certainly a warning signal that things are not right.  If healthy changes are not made, worse problems may develop.   Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sat Mar 17, 2007 9:32 pm",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=39684&sid=6b4820429e927af9b3fd4f821b8d856e#p39684"
  },
  {
    "author": "dixieagle  Guest Posts: 9 Joined: Fri Dec 08, 2006 5:19 pm",
    "title": "Scared; slightly elevated AFP",
    "content": "Hello,  I'm a 54 yr. old female, never smoked, slightly overweight.  I have taken zocor for about 4 years, and 6 months ago had slightly elevated LFTs for the first time. My gastroenterologist did more bloodwork - still mildly elevated, though down some, and ordered a liver ultrasound. The ultrasound showed a slightly enlarged, fatty liver; no mention made of tumors or anything else.  We are awaiting pre-certification for a CT scan.  The latest round of bloodwork showed my LFTs back to normal, but my AFP at 7, apparently 1 point higher than normal.  The doctor said that my hepatitis panel indicated HBsAg negative, HBsAb positive, and HBcAb negative.  I have never had hepatitis to my knowledge and have none of the risk factors at all, and don't even remember having had a vaccination.  Today I had bloodwork done for what my doctor called \"total\" hepatitis, plus another AFP test.  I don't have symptoms, but am frankly terrified by that slightly elevated AFP (though I have seen somewhere else that less than 10 is \"normal.)  I am scared silly at the thought of liver cancer.  Wouldn't it have shown up on the ultrasound?  Thank you.\n\n",
    "posted_time": "Post  by dixieagle » Mon Mar 05, 2007 4:48 pm",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=39283&sid=6b4820429e927af9b3fd4f821b8d856e#p39283"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "There are several causes of fatty liver.  Some medications, excess alcohol ingestion, some forms of malnutrition and obesity are common causes.  Your hepatitis B labs indicate immunity to virus.  This may be due to vaccination in the past, or possibly acute infection with the virus in the past that has since cleared.    There are many other viruses that can cause a hepatitis picture.  Fatty liver can also elevate LFT's.  Alpha fetoprotein is associated with liver cancer but an elevation only one above normal is much less likely to be due to cancer than a very large elevation.  I recommend that you continue to follow up with your GI doctor to find the cause of your fatty liver and optimize treatment for you.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Tue Mar 06, 2007 2:53 pm",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=39292&sid=6b4820429e927af9b3fd4f821b8d856e#p39292"
  },
  {
    "author": "dixieagle  Guest Posts: 9 Joined: Fri Dec 08, 2006 5:19 pm",
    "title": "Re: scared, slightly elevated AFP",
    "content": "Thanks so much, Dr. Lowe.  I have just received pre-certification for the CT scan and will have it tomorrow.  You've helped put my mind at ease.\n\n",
    "posted_time": "Post  by dixieagle » Tue Mar 06, 2007 4:27 pm",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=39305&sid=6b4820429e927af9b3fd4f821b8d856e#p39305"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Glad to be of help.  Best wishes for your tests tomorrow.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Tue Mar 06, 2007 4:53 pm",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=39307&sid=6b4820429e927af9b3fd4f821b8d856e#p39307"
  },
  {
    "author": "jljtmj  Guest Posts: 2 Joined: Wed Jan 24, 2007 11:42 am",
    "title": "Lump under rib cage in the back right side",
    "content": "I am a 30 year old woman. I have not had any diagnoses or surgeries. I do have family history of different kinds of cancers. The only medication I am taking right now is birth control.  I noticed about 3 months ago a lump on my back right side, about 2-3 inches right of my spine just underneath my rib cage. Up until recently it wasn't bothering me, but lately it's just been a dull ache.  I went to my primary doctor last week, who just looked at it real quickly and said it was a Lymphoma? a fatty lump. Which was wonderful to hear, but the fact that they were so quick to say what it was and that the doctor didn't poke around or really look at it makes me still feel very uneasy about it. Can anyone tell me if this sounds like something more serious? I asked if it could be associated with the liver and the doctor said no, that any issues with the liver would be in the front. However, I have found many sites that speak of issues with the liver associated with the back side and right shoulder blade. Any help?\n\n",
    "posted_time": "Post  by jljtmj » Wed Jan 24, 2007 11:55 am",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=37941&sid=6b4820429e927af9b3fd4f821b8d856e#p37941"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "From your description I would say that a diagnosis of a lipoma is quite possible.  A lipoma is essentially a collection of fat cells into a ball-basically a fat cell tumor.  They are benign and do not need to be removed but often will be removed if they are causing pain or are getting larger.  Lipomas generally are sort of rubbery feeling.  Liver issues can present with pain in the right upper abdomen area or back.  Generally with liver problems there are other indicators of liver dysfunction such as yellowing skin (jaundice), nausea/vomiting, etc.    The absolute way to tell would be to simply do an excision biopsy where they would remove the lump completely then look at it under the microscope to see what it is.  If you are worried this would be a very appropriate course of action.  There are also some blood tests that can help look at the liver.  Hope this helps.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Wed Jan 24, 2007 7:22 pm",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=37964&sid=6b4820429e927af9b3fd4f821b8d856e#p37964"
  },
  {
    "author": "jljtmj  Guest Posts: 2 Joined: Wed Jan 24, 2007 11:42 am",
    "title": "Thank you",
    "content": "Thank you very much for the quick response. I will continue to monitor the size and my health. As I mentioned, it was just the very quick look and diagnosis.. it made me worry.  Thanks again\n\n",
    "posted_time": "Post  by jljtmj » Thu Jan 25, 2007 5:50 am",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=37993&sid=6b4820429e927af9b3fd4f821b8d856e#p37993"
  },
  {
    "author": "Mrs2U  Guest Posts: 15 Joined: Fri Jan 21, 2005 3:07 pm Location: USA",
    "title": "Liver Cancer/Cirrhosis",
    "content": "My mother, age 66, recently finished chemo for acute leukemia in May '06.  She has cirhhosis, and that condition complicated her treatment greatly.  Recently she has not felt well, lost weight, etc, so we scheduled her to see a gastro for a visit.  Her last CT liver scan was done in 2005.  Apparently, there have been some changes to her liver.  The doctor said there are new areas of attenuation, although the report indicated they are nonspecific.  The gastro. said that liver cancer is a real possibility, and she is scheduled for an MRI.  She has not drank in several years, but I'm wondering if perhaps the chemo drugs could have caused the differences in her CT scan compared with 2005.  What is the prognosis of liver cancer?    Thank you for any information.\n\n",
    "posted_time": "Post  by Mrs2U » Fri Dec 22, 2006 11:34 am",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=36648&sid=6b4820429e927af9b3fd4f821b8d856e#p36648"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Hello,   It would be more helpful if you could inform us about the details written in her report for the CT scan.  It is very difficult to differentiate between liver cirrhosis lesion from malignant ones by conventional US or CT scan. Major difficulties occur when the liver parenchyma is not homogeneous (cirrhosis ) and the lesions are smaller than 1 cm.  New techniques like the Triple-phase, high-resolution CT and contrast-enhanced MRI are now the primary imaging modalities in the diagnosis and to stage liver carcinoma HCC.    The prognosis of patients with HCC depends on a group of factors including the extent of the disease in the liver, liver condition and the general condition of the patients including an existing comorbid condition.  Improved survival is seen when curative resection is possible, small tumor size, well-differentiated tumors, and normal performance status.  The 5-year survival rate in patients undergo curative resection,  can reach 20%.  Keep us updated. Best regards.\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Sat Dec 23, 2006 8:27 am",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=36666&sid=6b4820429e927af9b3fd4f821b8d856e#p36666"
  },
  {
    "author": "luckybux  Guest Posts: 1 Joined: Mon Dec 18, 2006 12:48 pm",
    "title": "Mylar's carcinogenic properties?",
    "content": "Hello, I am looking to find out if Mylar (made by DuPont) has been shown to contain any carcinogenic properties.  Mylar is made with ethylene glucose and dimethyl terepthalate.  A loved one that has lived a super-clean lifestyle has been diagnosed with liver cancer ans I was curious to see if there is any research data on the carcinogenic properties of these chemicals.  He has handled Mylar in the form of comic book protectants extensively for decades.  Thank you for any pertinent info.\n\n",
    "posted_time": "Post  by luckybux » Mon Dec 18, 2006 1:18 pm",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=36389&sid=6b4820429e927af9b3fd4f821b8d856e#p36389"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Hello,  Not to my knowledge. Please check this page on our website for a list of carcinogens related to hepatoma: Click here!.  I have also checked the research literature for any connection but failed to find any.  Best regards,\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Mon Dec 18, 2006 3:05 pm",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=36393&sid=6b4820429e927af9b3fd4f821b8d856e#p36393"
  },
  {
    "author": "ararat  Guest Posts: 1 Joined: Wed Nov 30, 2005 1:41 pm Location: Canada",
    "title": "Enlarged Liver and Diabetic and loosing weight  Please help?",
    "content": "My father has enalrged liver diagnosed through Ultrasound but because there is too much gas in his systme they could not see other things clearly. His Alkaline Phosphate is around 600 and Creatine is 132 and Urea was about 10. He suffers from upper back pain in between the shoulder blades and for the past month he has lost 27LBS and his apetite is next to nothing but he drinks juice and once in a while eats fruits. Minimal solid food. Doctors don't know and his situation is getting worse. Any Idea?\n\n",
    "posted_time": "Post  by ararat » Wed Nov 30, 2005 1:51 pm",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=25952&sid=6b4820429e927af9b3fd4f821b8d856e#p25952"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Dear ararat,  Alkaline phosphatase is an enzyme in the blood, intestines, liver, and bone cells.  The normal value is 20 to 140 IU/L (international units per liter  Higher-than-normal ALP levels is seen in many medical conditions like  liver disorders. These disorders include: hepatitis,  obstructive jaundice,  gallstones,  cirrhosis,  liver cancer.  Your father has hepatomegaly and pain similar to that of hepatobiliary disease. I advise you to follow with his doctor and to do more investigations like:  - CBC, liver enzymes, hepatitis markers, billirubin level,  - Images like abdominal CT.  Best regards,\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Sat Jul 15, 2006 8:46 pm",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=33446&sid=6b4820429e927af9b3fd4f821b8d856e#p33446"
  },
  {
    "author": "chochies  Guest Posts: 8 Joined: Thu Oct 20, 2005 12:16 pm Location: San Diego Ca  Contact:   Contact chochies       Yahoo Messenger",
    "title": "3CM LIVER CANCER",
    "content": "My husband went to UCSM Medical Center to see if he could get on the liver  transplant list. He is 49 years old has end stage liver desease, diabeties,  hepatitis c, and nows  liver cancer. We found out that he had end stage liver disease in July of 2004 when he started throwing up blood.Three month ago they did a CT scan and they told us he had a 2cm tumor now three months later they did an MRI and on Monday of this week they told us that the tumor is now 3 cm and the doctor has sceduled a procedure called TACE to be done on June 16th . His medications are Methadone 8mg, lactulose 15mg Zoloft 100mg, Potassium, Propranolol 10mg, Ciprofloxacin 250mg, Nexium 40mg, and Centrum. I wanted to know how safe TACE was and if he should stop taking Methadone before going into surgery. When the doctor told us that it was cancer my mind went blank and I could not think of anything.\n\n",
    "posted_time": "Post  by chochies » Mon Jun 05, 2006 1:53 am",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=32860&sid=6b4820429e927af9b3fd4f821b8d856e#p32860"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi chochies, Transcatheter arterial chemoembolization of the liver (TACE) is essentially a nonsurgical intervention that may be performed when a surgical intervention (resection) isn't an appropriate form of treatment. This is a radiological procedure, typically done by gaining access to the hepatic artery by way of the femoral artery in the groin. The intention of this treatment is administration of chemotherapy and an embolizing agent directly into the tumor. Tumor necrosis (death of the tumor) is the hoped result. This type of therapy may be completed once or several times. Some of the side effects and toxicities associated with traditional forms of intravenous chemotherapy can be avoided by TACE. There are of course complications and risks associated with any procedure but you have to weigh the risks verses the outcome without having a procedure done at all. In my opinion, I would not recommend discontinuation of the medication methadone, but you of course should inquire with his treating physician about clarification prior to the procedure. Best wishes to you both. Sincerely, Theresa Jones, RN\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Tue Jun 06, 2006 6:17 am",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=32879&sid=6b4820429e927af9b3fd4f821b8d856e#p32879"
  },
  {
    "author": "chochies  Guest Posts: 8 Joined: Thu Oct 20, 2005 12:16 pm Location: San Diego Ca  Contact:   Contact chochies       Yahoo Messenger",
    "title": "[no title]",
    "content": "Thank you for taking the time fo reply.\n\n",
    "posted_time": "Post  by chochies » Sat Jun 10, 2006 12:17 am",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=32947&sid=6b4820429e927af9b3fd4f821b8d856e#p32947"
  },
  {
    "author": "JayJee04  Guest Posts: 5 Joined: Mon May 09, 2005 3:26 pm Location: Illinois",
    "title": "abdominal discomfort",
    "content": "Hi.   i am 23 years old.  I have had a slight abdominal discomfort on my right side recently.   it is not really painful,  just kind of a slight preassure dicomfort.  I was really bloated and gassy yesterday and had cramps and constipation during the day, with diereah later in the evening, but that has gotten much better in the last day.    does this sound like something serious?  what could be the causes?  when should i go see a doctor??\n\n",
    "posted_time": "Post  by JayJee04 » Thu Jan 26, 2006 10:51 am",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=29237&sid=6b4820429e927af9b3fd4f821b8d856e#p29237"
  },
  {
    "author": "R. Zein, Pharm D  Pharmacist Posts: 157 Joined: Tue Jul 12, 2005 9:16 pm Location: USA",
    "title": "[no title]",
    "content": "Dear JayJee04  you did not mention how long you have had these symptoms.  bloating and constipation themselves could be painful, and cause what you have described as  pressure on the abdomen.  however if you continue to have these symptoms for more than 2 weeks, i advise you to see a doctor, you could have a case of irritable bowel syndrome, which is not dangerous, and can be resolved by medications.  meanwhile if you have constipation, try to increase the amount of  fiber and fluid in your diet.  i hope you always feel great.  thank you very much\n\n",
    "posted_time": "Post  by R. Zein, Pharm D » Thu Jan 26, 2006 11:26 am",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=29241&sid=6b4820429e927af9b3fd4f821b8d856e#p29241"
  },
  {
    "author": "JayJee04  Guest Posts: 5 Joined: Mon May 09, 2005 3:26 pm Location: Illinois",
    "title": "symptoms",
    "content": "I have had the symptoms for about 2 or 3 days or so.  just a preasurry feeling int eh right abdoman under the rib cage.. thats why i thought it was maybee a liver probelm.. The accompanyng gas and constipation/dierea has been the real souce of irritation, although the preassure has made me concerned it was something serious.  I recently starated a job after getting out of college and have been workin long hours and drinkin lots of coffie and caffine for the last 3-4 months.  is that something that could maybee trigger irritable bowel syndrome to start?\n\n",
    "posted_time": "Post  by JayJee04 » Thu Jan 26, 2006 11:37 am",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=29244&sid=6b4820429e927af9b3fd4f821b8d856e#p29244"
  },
  {
    "author": "R. Zein, Pharm D  Pharmacist Posts: 157 Joined: Tue Jul 12, 2005 9:16 pm Location: USA",
    "title": "[no title]",
    "content": "caffiene can contribute to constipation, and it can cause some abdominal discomfort if consumed excessively.  you have mentioned 3 days, so it could be nothing, and it may not be irritable bowel syndrome at all..  it could be a change due to changes in your working habits since you now have started a new job, and your body will  adjust to it.  just monitor your symptoms and if they continue, see your doctor.  thank you, and i hope you feel better\n\n",
    "posted_time": "Post  by R. Zein, Pharm D » Thu Jan 26, 2006 11:45 am",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=29245&sid=6b4820429e927af9b3fd4f821b8d856e#p29245"
  },
  {
    "author": "bubbarichard  Guest Posts: 1 Joined: Sun Jan 01, 2006 6:58 pm Location: Texas",
    "title": "Light colored Feces from Niacin?",
    "content": "I took Niacin (from brewers yeast) for a long time without problem to help me with my cholestrol.  It worked great, bought a home test kit and tested my cholestrol weekly at first.  It was always about 10 points higher then my doctors.  In a rush one day I grab the only non time released or non no flush niacin at the drug store.  It was my one day every two weeks that I took a large dose.  I had no adverse effects up until this point.  Then I read the bottle again, it was another form of niacin (niacmid?) for nerves and other stuff.  When I researched it, I was warned never to take a dose above 250 mg.  I took 1 gram.  Since then about two of my 7 to 9 bowel movements a week or very light  In color.   When I researched this it seems to be associated with Liver damage.  I'm taking no niacin and eat large amounts of oatmeal a day to control my cholestrol.  I mean large amounts of oatmeal (4 to 5 bowls).  I will not be back in my home state for another 3 months.  How worried should I be?\n\n",
    "posted_time": "Post  by bubbarichard » Sun Jan 01, 2006 7:10 pm",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=27532&sid=6b4820429e927af9b3fd4f821b8d856e#p27532"
  },
  {
    "author": "Rhonda P, CEP  Paramedic Posts: 252 Joined: Wed Mar 16, 2005 8:37 am Gender: Female Location: USA",
    "title": "[no title]",
    "content": "Dear Bubbarichard,  Niacinamide and Niacin are both water soluble vitamin B meaning they are flushed out of the body with water. Both can be hepatoxic if taken in excess and time released Niacin is not recommended due to its high toxicity on the liver. Taking Niacinamide one time over the recommended amount probably didn’t hurt your liver but if you had hepatic problems already it wouldn’t have helped it.  A few other things that may be causing your stools to be light colored may be gallbladder disorders, pancreas disorders, excessive consumption of light colored food, and intestinal giardia which also causes diarrhea. A liver panel blood test would put your mind to rest, it could probably be done at any clinic in the country with a faxed order from your physician.\n\n",
    "posted_time": "Post  by Rhonda P, CEP » Sun Jan 01, 2006 8:40 pm",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=27538&sid=6b4820429e927af9b3fd4f821b8d856e#p27538"
  },
  {
    "author": "tequiladeb  Guest Posts: 1 Joined: Thu Sep 29, 2005 6:54 am Location: essex",
    "title": "Liver/stomach cancer",
    "content": "Hi, can anyone please advice me? My father was diagnosed with Gastric cancer in March this year, he had two courses of chemo, he was then told that the chemo was doing more harm than good and so they were not going to continue with it, when he was scanned prior to the chemo they found nodules in his liver which they are assuming to be secondary cancer but they cant be 100% sure. They did not scan him again after the chemo. They eventually did a stomach bypass operation (palilative surgery) due to the fact that he was being sick all the time then sent him home. the doctor that spoke to me while he was in hospital said (blatanlty!) that there is nothing more they can do for him as its in the liver, (even though it isnt certain that it is) they have basically given up on him, they told us in March that he obly had a few weeks left, its now 7 months later and he seems no worse than he was in March, is there anything that can be done for him, they don't even know if the chemo has made any difference, i'm at my wits end and just want to help him. Also, he keeps getting calls from companies claiming that they can cure his cancer through organic products which would cost him in exces of £9000, dad would try anything if he though it would work, has anyone ever used these companies, do they work?? Thank you  Debbie xx\n\n",
    "posted_time": "Post  by tequiladeb » Fri Sep 30, 2005 9:44 am",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=21968&sid=6b4820429e927af9b3fd4f821b8d856e#p21968"
  },
  {
    "author": "Angela Grunewald, RN  Nurse Posts: 57 Joined: Sun Sep 11, 2005 12:22 am Location: USA  Contact:   Contact Angela Grunewald, RN       Yahoo Messenger",
    "title": "[no title]",
    "content": "first,let me express my empathy for your situation. There are many things that come into play when \"diagnosing\" cancer. The fact that they were unable to give you the diagnosis with 100% certainty must be very frustrating. This is something I can tell you.....In my experience I have not run across someone who had spots or nodules on the liver where it was NOT cancer. When you were all told it was cancer, the M.Ds were not basing this soley on the \"spots\". There are many things...lab values, signs and sypmtoms and so on. I can assure you that the M.D would not have told you it was cancer if he had ANY doubt about it. This is the thing about Chemo. Chemo is designed to \"kill\" cancer cells. In this process  it also \"kills\" the good cells. someone on chemo will become sick easier and will feel as if all their energy has been \"zapped\". Sometimes the best decision someone can make...is to stop chemo and treatments. Liver cancer is fast spreading and you will typically see it spread throughout the body. With the information you have given me regarding his diagnosis date of march I would be curious to find out what his current condition is. Activity? color? is his stomach distended? trouble swallowing? As far as the \"herbal\" treatments are concerned. I have not taken care of a patient where it has \"cured\" the cancer or prevented tumor growth. however, I have not researched this enough to speak about it.......good luck to you and your family!\n\n",
    "posted_time": "Post  by Angela Grunewald, RN » Fri Sep 30, 2005 10:08 am",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=21971&sid=6b4820429e927af9b3fd4f821b8d856e#p21971"
  },
  {
    "author": "Daddys-BabyGirl  Guest Posts: 1 Joined: Thu Sep 08, 2005 6:42 pm Location: Woonsocket RI  Contact:   Contact Daddys-BabyGirl       AOL",
    "title": "Help!! i need advice on liver cancer quick!",
    "content": "If someone can help i would really love it!!! heres my story! I am 15 years old and my Father has a Very High stage of Liver Cancer!! He has been having Liver and Spleen problems for YEARS now. The doctors say he has a year left to live. Im scared for the fact that he DOES NOT want to take the surgery that they have said COULD in fact help him alot. My Dad is only 36 years old!! and he wont be around to see me get married and grow up to have a family! I have no idea on what to do. He says hes tired of it all.. And Do i have any say in his choice? I have been trying to talk him into it, but he just doesnt want the surgery. Somebody please help me. My Father is Dieing, and hes leaving me and my sister behind with our mother. He is my Step dad, and they ARE divorced, But He is the only dad i have ever known. I don't want to lose my Daddy!!!\n\n",
    "posted_time": "Post  by Daddys-BabyGirl » Thu Sep 08, 2005 6:50 pm",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=20175&sid=6b4820429e927af9b3fd4f821b8d856e#p20175"
  },
  {
    "author": "Dr. Wafaa Abdel-Hadi  Medical Doctor Posts: 228 Joined: Mon Mar 07, 2005 2:15 pm",
    "title": "[no title]",
    "content": "I am so sorry to hear about your father's condition.Can you please give us some clinical data. If you have read  Dr. Gordon's reply to Khalefa...may be that will be helpful to you.  Best wishes,\n\n",
    "posted_time": "Post  by Dr. Wafaa Abdel-Hadi » Fri Sep 09, 2005 2:02 am",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=20194&sid=6b4820429e927af9b3fd4f821b8d856e#p20194"
  },
  {
    "author": "castry  Guest Posts: 1 Joined: Mon Sep 26, 2005 1:58 am Location: malaysia  Contact:   Contact castry       Yahoo Messenger",
    "title": "my mum et the liver cancer.so i need some hlep~~~",
    "content": "last saturday, my mum stomach feel very pain. then my dad sent her to emerency department. after that , the doctoc told us that my mum get the liver cancer. and the doctors said my mum blood vessel to liver was blocked. if do operation will be more dangerous. if do operation , she may be will die. beside that, there also dun hav medicine can help my mum. so, what should we do now? anyone can give me useful sugestion?\n\n",
    "posted_time": "Post  by castry » Mon Sep 26, 2005 2:52 am",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=21626&sid=6b4820429e927af9b3fd4f821b8d856e#p21626"
  },
  {
    "author": "fitnessdego  Guest Posts: 2 Joined: Mon May 23, 2005 12:19 pm",
    "title": "Elevated Liver Enzymes",
    "content": "My husband has had elevated liver enzymes show up in his bloodwork for the last 5-6 years now. It is inconsistent though - the doctors usually request additional bloodwork, and those results show the levels have returned to normal. This last visit though, they found the elevated levels again, requested the additional bloodwork (still elevated), and then scheduled an ultrasound of his liver, but found nothing abnormal from the ultrasound.   He is a healthy 6'4\", 220 lb. 29 year old male, who never drank in his teens, and only has a beer or two every couple of weeks. He has never smoked or done drugs. He has been taking a natural liver balance supplement over the past few years - and he takes it pretty regularly.  I am concerned though, because his parents were both alcoholics (though they are no longer), and his mother drank and did drugs throughout her entire 9 month-pregnancy with him. This fact troubles me greatly.  Could that be attributing to this \"yo-yo\" liver enzyme count? Should I be pushing the doctors to do futher testing?\n\n",
    "posted_time": "Post  by fitnessdego » Mon May 23, 2005 1:07 pm",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=14155&sid=6b4820429e927af9b3fd4f821b8d856e#p14155"
  },
  {
    "author": "Shannon Morgan, CMA  Medical Assistant Posts: 530 Joined: Fri May 06, 2005 6:28 pm Location: Dallas, Texas. USA.",
    "title": "[no title]",
    "content": "How elevated and what enzymes exactly are affected?  Any other abnormal bloodwork?  Has he had a hepatitis panel? Has he ever had hepatitis A or B?  Any health conditions other than this?  His parents' alcoholism doesn't affect his liver.  Does he take vitamins, \"herbal\" supplements, Tylenol or any other over the counter medicines?\n\n",
    "posted_time": "Post  by Shannon Morgan, CMA » Thu Jun 02, 2005 1:56 pm",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=14541&sid=6b4820429e927af9b3fd4f821b8d856e#p14541"
  },
  {
    "author": "stewygenie  Guest Posts: 1 Joined: Mon Jan 10, 2005 7:57 am Location: manila",
    "title": "Is Fructose good for Liver Cancer Patient?",
    "content": "Hi,     I would like to ask you if Fructose is good for Liver Cancer Patient? Because I have raed some articles that sugar can increase the growth of cancer cells and fructose is a form of sugar.  I just need some advice if this will be very good for a patient especailly my father thanks.  My father also has diabetes.  Thanks very much Need an answer as soon as possible because he is starting to drink a milk called \"Glucerna\" fructose milk.  Thanks!\n\n",
    "posted_time": "Post  by stewygenie » Mon Jan 10, 2005 8:05 am",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=7966&sid=6b4820429e927af9b3fd4f821b8d856e#p7966"
  },
  {
    "author": "Dr. Jeffrey Gordon  Medical Doctor Posts: 127 Joined: Sun Jan 05, 2003 5:22 pm",
    "title": "Liver cancer",
    "content": "Thanks for posting your question here at The Lounge.  I have not read any articles of a convincing nature or seen a scientific evidence published that has shown that sugar feeds cancer cells and makes the cancer cells grow.  I have not heard that fructose is bad or good for cancer patients.  If someone else has information of which I am not aware, then I would be interested in seeing it.  Anyway, I think that a healthy, well-balanced diet is good for everyone, including cancer patients.  Nutritional supplements are often recommended for cancer patients to help maintain their nutritional status, which can be depleted by the cancer.  In a patient with diabetes, one needs to watch out for sugar.  Perhaps talking with a Nutritionist or a Dietician would be helpful for your Father and you.  Jeffrey A. Gordon, M.D.\n\n",
    "posted_time": "Post  by Dr. Jeffrey Gordon » Tue Mar 01, 2005 2:39 pm",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=10165&sid=6b4820429e927af9b3fd4f821b8d856e#p10165"
  },
  {
    "author": "ratrenkamp  Guest Posts: 2 Joined: Sat Jan 08, 2005 8:55 am Location: new miami, ohio",
    "title": "Extremely high enzyme levels!",
    "content": "Hello, I do not have a regular doc and am goin to a methadone clinic that does a full workup on you when u start there, my results came today and are terrible.  My AST was 949  ALT 1170! and ALKPHOS was 226! Whats up here? I may go to er today for more tests!\n\n",
    "posted_time": "Post  by ratrenkamp » Sat Jan 08, 2005 10:09 am",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=7899&sid=6b4820429e927af9b3fd4f821b8d856e#p7899"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Extremely high liver enzyme levels",
    "content": "Dear ratrenkamp,  Considering your history of iv drug abuse, this could be hepatitis infection.  You have to be evaluated for hepatitis infection as soon as possible.  High liver enzymes don't necessarily mean that this is a case of liver cancer.  i think the insurance matter is not going to be relevant. Talk to your social worker and i think that there are going to be some clinics that will be able to do the work-up for free.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.  Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Sat Jan 08, 2005 10:55 am",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=7904&sid=6b4820429e927af9b3fd4f821b8d856e#p7904"
  },
  {
    "author": "CindyS45  Guest Posts: 1 Joined: Fri Sep 24, 2004 7:50 pm Location: charleston",
    "title": "Lobulated mass in the right lobe of liver",
    "content": "Hello, It has grown in size 3.2x1.6cm and now messures 3.1x2.4cm and i also have a cyst on anterior tip of spleen what do I do now I have been referred to surgeon\n\n",
    "posted_time": "Post  by CindyS45 » Fri Sep 24, 2004 7:55 pm",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5559&sid=6b4820429e927af9b3fd4f821b8d856e#p5559"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Lobulated mass in the right lobe of liver",
    "content": "Dear Cindy,  The most probable explanation for the increase in size in the hemangioma is bleeding within the hemangioma. If this is not a hemangioma and it is a cyst then, it is bleeding also that causes an increase in its size.  Did you have any new onset pain in your abdomen? Did they check a blood count and found that your blood count is low?  If this is a hemangioma, i think the best way of action is to see whether or not you can embolize the feeding vessel and this can be done by performing an angiogram and then embolizing the vessel.  If it is a cyst, then you should be evaluated for removal of the cyst if possible.  Regarding the cyst in your spleen, was it not seen on any of the previous imaging studies that you have or this is the first time that you ever looked at the spleen? Were your kidneys looked at too as a part of the imaging study that you had?  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Fri Sep 24, 2004 8:43 pm",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5560&sid=6b4820429e927af9b3fd4f821b8d856e#p5560"
  },
  {
    "author": "grinaldi  Guest Posts: 3 Joined: Sat Apr 10, 2004 11:16 am Location: NY",
    "title": "Creatinine related to liver problem?",
    "content": "I posted this under nephrology, but it's related to liver so am hoping for a response here as well.   My husband, age 52, on tricor for ><8 months, alcoholic (drinks daily), has the following results (doctor indicates he will want more tests). Need an interpretation of whether these could be an indicator of not only renal malfunction but could they also indicate a cirrhotic liver:   urea nitrogen =29  creatinine = 1.7  bun creatinine ratio=17.1  cholesterol total=237  HDL = 37L  Chol/HDL ratio=6.4  LDL calculated=137  triglycerides=317   ast, alt, bilirubin in range   What could this mean? My husband has gained 30 - 40 lbs in the past year, has sleep apnea, looks bloated, color off and has dark circles around his eyes. What wld a doctor be testing for next?   Thanks for any help.\n\n",
    "posted_time": "Post  by grinaldi » Sat Apr 10, 2004 1:17 pm",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3055&sid=6b4820429e927af9b3fd4f821b8d856e#p3055"
  },
  {
    "author": "Dr. Jeffrey Gordon  Medical Doctor Posts: 127 Joined: Sun Jan 05, 2003 5:22 pm",
    "title": "Liver",
    "content": "Grinaldi,  Thanks for your post.  Your question is not a psecific cancer question so I amy not be much help to you.  If the liver numbers are listed as being within normal limits, then the liver could be O.k. or be damaged severlely (i.e.- cirrhosis from alcohol use) and cannot increase the liver function tests.  The elevation in the kidney tests raises a concern about how the kidney is functioning or that the kidney is seeing decreased blood flow due to fluid going to third spaces (i.e.- outside of the blood itslef).  It seems that more testing is in order.\n\n",
    "posted_time": "Post  by Dr. Jeffrey Gordon » Sun Apr 18, 2004 8:24 pm",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3112&sid=6b4820429e927af9b3fd4f821b8d856e#p3112"
  },
  {
    "author": "grinaldi  Guest Posts: 3 Joined: Sat Apr 10, 2004 11:16 am Location: NY",
    "title": "Thank you,",
    "content": "I'm not entirely sure I understand your response on the liver tests. His doctor told him that he wanted him back for more tests.   What wld you anticipate that he wld be testing for?   Thanks again, I realize this is not your area.  G\n\n",
    "posted_time": "Post  by grinaldi » Wed Apr 21, 2004 12:28 pm",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3137&sid=6b4820429e927af9b3fd4f821b8d856e#p3137"
  },
  {
    "author": "Dr. Jeffrey Gordon  Medical Doctor Posts: 127 Joined: Sun Jan 05, 2003 5:22 pm",
    "title": "[no title]",
    "content": "I am not a liver expert., so I do not know specifically what the repeat tests are for.  They may be repeat tests to see if there are any changes with the liver and the kidneys.  Sometimes if a liver is so badly damaged, such as from cirrhosis, then the liver function tests may look normal because the liver cannot function properly and cause elevation in such tests.  Other times, normal liver tests do indeed show that a damaged liver is functioning O.K.  With regard to the kidney tests, sometimes the kidneys do not see enough blood flow and thus the kidneys can not function 100%, causing an elevation in the creatinine.  Other times the creatinien can be elevated due to an intrinsic problem with the kidneys.\n\n",
    "posted_time": "Post  by Dr. Jeffrey Gordon » Sat Apr 24, 2004 6:23 pm",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3175&sid=6b4820429e927af9b3fd4f821b8d856e#p3175"
  },
  {
    "author": "johnmassingham  Guest Posts: 1 Joined: Tue Jan 27, 2004 1:11 pm Location: UK",
    "title": "Massive cancer thought to be primary but not...",
    "content": "Hi, My mother, who is 53, has been diagnosed with a massive liver cancer (about 1/2 - 2/3 or her liver) and the CT and MRI scans suggested this was the primary cancer. The MRI scan also showed that she had cancer in the lymph nodes associated with the liver. Other than that she appears to be perfectly healthy!  Anyway, she has just had the results of a liver biopsy and has been told that the lier cancer isn't the primary but the secondary. The primary is still undiscovered but she has been on HRT for ~15 years so ovarian cancer is the most likely suspect. The reckoning is that the primary cancer is very aggressive for the secondary liver cancer to get so big in such a short space of time.  She is starting chemo, whereby she has three types (don't know which) of which two are administered once every three weeks and the third is administered continually over the three wekks through a hickman line, which I guess is essentially a drip feed into the blood supply near the heart.  Thats the background. Some questions: a) How is it possible to determine whether its primary or secondary cancer from the biopsy? b) How can you get a timeline from a biopsy. i.e. how do they know the cancer hasn't been around long? c) If (say) ovarian cancer is the main cancer why can that not be removed and the liver cancer treated with chemo? She has been told this is not possible. d) Will the chemo not also kill the primary cancer as well?  The list of questions goes on, but that will do for now! Thanks  John\n\n",
    "posted_time": "Post  by johnmassingham » Tue Jan 27, 2004 1:25 pm",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2296&sid=6b4820429e927af9b3fd4f821b8d856e#p2296"
  },
  {
    "author": "Dr. Jeffrey Gordon  Medical Doctor Posts: 127 Joined: Sun Jan 05, 2003 5:22 pm",
    "title": "[no title]",
    "content": "Thanks for your post to The Doctor's Lounge.  My apologies for no reply sooner, but I have been away.  Many cancers can travel via the blood to the liver.  A cancer mass in the liver is more loikely to be from some place elese and to have traveled to the liver than to have arisen from the liver.  Many times a Pathologist can see and do tests to confirm, as best as possibe, that the tumor in the liver is not a parimary liver cancer (i.e.- hepatocellular carcinoma).  There are also tests that can be done to sometimes determine from where the cancer originated.  However, this is not always conclusive.  There is a situation called \"cancer of unknown origin\".  This is a well known entity and more common than people think.  Sometimes the original site of the tumor doesn't grow large enough to be detected, whereas the metastatic site(s) do become large.  You cannot determine necessarily how long a cancer has been around.  There are cancers that grow very rapidly, but most cancers are not fast growing and have been present for some years.  Most of that tie the cancer is microscopic, so cannot be seen.  There is usually no benefit to remove a spot of cancer that has spread, since there is liklely to be other sponts of cancer around.  Sometimes surgery can be done on the liver, but if too much of the liver is involved by the cancer, than surgery cannot be done.  Very few cancers can be treated by a directed treatment to the liver.  This is a form of treatment that can be considered if a colon cancer has spread to the liver, but even then this type of treatment is not possible for most such patients.  Yoour Mother's doctors can tell you more about her specific liver and cancer situations.  One hopes that chemotherapy will go all throughout the body and try to stabilize or shrink back the cancer that can be seen and the cancer elsewhere that cannot be seen.  Unfortunately, in a situation where a cancer has spread beyond its original site of growth, the cancer is technically not able to be completely eradicated.  If you have a list of questions, then make certain that the doctors caring for your Mother talk with you about.  It is always important to try to have your questions answered.  My best regards.  Jeffrey A. Gordon, M.D.\n\n",
    "posted_time": "Post  by Dr. Jeffrey Gordon » Sat Feb 14, 2004 7:55 pm",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2506&sid=6b4820429e927af9b3fd4f821b8d856e#p2506"
  },
  {
    "author": "khalefa",
    "title": "Liver Cancer Urgent Advice Needed!",
    "content": "What is your medical advice for my father who is 65 Years old male patient.  Has been suffereing from moderate ascitis with acute onset since 18/12/200  Ultrasound on abdomen then spiral C.T. were done. They revealed focal lesion in the right lobe with other multiple satellites invading portal vein. There is portal vein thombosis most probably malignant Alpha feto protein level is 495,890  Profeeor of hepatologu has revealed that radiofrequency ablasion localized chemotherapy, and liver transplantation have no role.  Professor of Oncology has revealed that systemic chemotherapy has no role because creatinine is less than 60/ml/minute.  He now is on palliative treatment; lasix for ascitis (lasilactone), liver supplementation, antispasmodics, analgesics, vitamins, diet free from salt or fat. Dear doctor, do you think there is a cure or treatment available for him anywhere?\n\n",
    "posted_time": "Post  by khalefa » Wed Jan 29, 2003 8:35 pm",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=180&sid=6b4820429e927af9b3fd4f821b8d856e#p180"
  },
  {
    "author": "Dr. Jeffrey Gordon  Medical Doctor Posts: 127 Joined: Sun Jan 05, 2003 5:22 pm",
    "title": "Liver cancer",
    "content": "Khalefa,  I am sorry to hear about your father's problems.  Hepatocellular cancer is a most difficult cancer to treat.  When the cancer is localized, one can consider surgery or even liver transplantation.  Sometimes, the lesions of the cancer allow for either radiofrequency ablation or cryotherapy.  However, in many cases, the cancer cannot be removed by surgery, a liver transplantation cannot be done, and there are too many lesions (or diffuse infiltration throughout the liver) to allow for any other directed treatment.  Chemotherapy, either by vein or directly into to liver, is very limited in its benefit.  Many different chemotherapy drugs have been, and some reports of benefit have used multiple drugs in combination or combined with interferon-alpha.  However, these drug combinations are very toxic and do require good liver and kidney function.  As someone gets older, the chemotherapy is tolerated less well than if they were young.  The likelihood that chemotherapy drugs used as single agents will be of benefit is low, but can be tried.  However, some of the drugs used routinely do require good kidney function, otherwise the chemotherapy drugs accumulate in the body and cause significant problems.  Interferon-alpha by itself has limited benefit and carries a lot of toxicities.  Unfortunately, there are limited benefits from chemotherapy against hepatocellular cancer.  If several specialists have not been able to identify a good and safe treatment in your father's case, then I do not expect that chemotherapy will help him.  There is no treatment in this situation that can cure him of the cancer.  If the kidneys are a concern in giving chemotherapy, then one could consider using chemotherapy drugs that are cleared from the body by the liver.  But one must make certain that his liver is working properly.  Some drugs to consider are gemcitabine, vinorelbine, docetaxel, paclitaxel, and adriamycin.  However, these drugs do have side effects and are very limited in their usefulness in hepatocellular cancer.Khalefa,  I am sorry to hear about your father's problems.  Hepatocellular cancer is a most difficult cancer to treat.  When the cancer is localized, one can consider surgery or even liver transplantation.  Sometimes, the lesions of the cancer allow for either radiofrequency ablation or cryotherapy.  However, in many cases, the cancer cannot be removed by surgery, a liver transplantation cannot be done, and there are too many lesions (or diffuse infiltration throughout the liver) to allow for any other directed treatment.  Chemotherapy, either by vein or directly into to liver, is very limited in its benefit.  Many different chemotherapy drugs have been, and some reports of benefit have used multiple drugs in combination or combined with interferon-alpha.  However, these drug combinations are very toxic and do require good liver and kidney function.  As someone gets older, the chemotherapy is tolerated less well than if they were young.  The likelihood that chemotherapy drugs used as single agents will be of benefit is low, but can be tried.  However, some of the drugs used routinely do require good kidney function, otherwise the chemotherapy drugs accumulate in the body and cause significant problems.  Interferon-alpha by itself has limited benefit and carries a lot of toxicities.  Unfortunately, there are limited benefits from chemotherapy against hepatocellular cancer.  If several specialists have not been able to identify a good and safe treatment in your father's case, then I do not expect that chemotherapy will help him.  There is no treatment in this situation that can cure him of the cancer.  If the kidneys are a concern in giving chemotherapy, then one could consider using chemotherapy drugs that are cleared from the body by the liver.  But one must make certain that his liver is working properly.  Some drugs to consider are gemcitabine, vinorelbine, docetaxel, paclitaxel, and adriamycin.  However, these drugs do have side effects and are very limited in their usefulness in hepatocellular cancer.\n\n",
    "posted_time": "Post  by Dr. Jeffrey Gordon » Mon Feb 03, 2003 8:17 pm",
    "category": "Oncology",
    "sub_category": "Liver Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=218&sid=6b4820429e927af9b3fd4f821b8d856e#p218"
  }
]