[
  {
    "author": "Eng_Student  Guest Posts: 1 Joined: Wed Apr 01, 2009 10:01 pm Gender: Female",
    "title": "Benefits to Measuring Blood Pressure in the Carotid Artery?",
    "content": "Hello, I am an electrical engineering graduate student, and I have been solicited to design a noninvasive means of measuring blood pressure at the carotid artery.  I understand there are accuracy benefits, given the proximity to the heart, but as near as I can tell the sensors will have to be at the end of a pencil-like rod to get at the artery, and achieve just the right applanation to get an accurate pressure measurement without affecting the pressure very much.  But my question, is what are the medical benefits to measuring the blood pressure at the carotid artery as opposed to the radial or brachial artery?  Can it help in earlier detection of heart disease or strokes?  Are there some papers you can direct me to?  I've found a few biomedical papers, but none articulating a clear need for such a device.    Before I throw myself into this topic, or start applying for grants, I just want to make sure I would be working on a device that would be helpful to the medical community.  Thank you very much for all your assistance, ~V.\n\n",
    "posted_time": "Post  by Eng_Student » Wed Apr 01, 2009 10:25 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=72775&sid=cc2d08403f97bea715da83d5342b5404#p72775"
  },
  {
    "author": "Dr.M.jagesh kamath  Medical Doctor Posts: 1303 Joined: Mon Aug 03, 2009 7:24 am Gender: Male",
    "title": "Re: Benefits to Measuring Blood Pressure in the Carotid Artery?",
    "content": "Hello,While noninvasive measures to study the carotid artery function are in the form of Doppler as non invasive methodologies certain factors are to be borne in mind while selecting the carotids to study blood pressure.Ageing and the loss of elasticity acquired during hypertension,inability to hold the blood volume,the baro- receptor sensitivity at the carotid sinus all have to be borne in mind. \"Arterial alterations with aging and high blood pressure. A noninvasive study of carotid and femoral arteries\"  A Benetos, S Laurent, AP Hoeks, PH Boutouyrie and ME Safar  Department of Internal Medicine, Broussais Hospital, Paris, France.  Arteriosclerosis, Thrombosis, and Vascular Biology. 1993;13:90-97 Hope this reference would clarify some points in your proposed research.Wishing you all success. Best of luck in your carrier.\n\n",
    "posted_time": "Post  by Dr.M.jagesh kamath » Fri Aug 27, 2010 11:24 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=101938&sid=cc2d08403f97bea715da83d5342b5404#p101938"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: Benefits to Measuring Blood Pressure in the Carotid Artery?",
    "content": "Hi, With the exception of perhaps a cardiac arrest scenario, in routine blood pressure monitoring in clinical settings(including critical care), \"absolute\" blood pressure (systolic, diastolic or mean blood pressure) readings are not to be relied upon excessively. More important than the site of recording or the actual blood pressure value, is the \"change\" in the value in real time - what is known as \"TRENDING\" , is the most useful information to be gleaned from monitoring. This holds good for most parameters in monitoring. The critical questions while monitoring are, \"what is the \"trend\" like? Is it showing an increasing trend or is it decreasing, or remaining steady?\" Absolute readings are only of secondary value.  In the cardiac arrest scenario however, while external cardiac compressions are on-going, the critical question is the blood pressure in the coronary arteries (blood supply to the heart) and the carotids(the blood supply to the brain).Your proposed technique may find an application in this context to assess the efficacy of the cardiac compressions(external cardiac massage). Good luck!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Fri Aug 27, 2010 12:43 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=101942&sid=cc2d08403f97bea715da83d5342b5404#p101942"
  },
  {
    "author": "mikeytuna  Guest Posts: 2 Joined: Thu Jul 29, 2010 7:53 pm Gender: Male",
    "title": "what field deals with chemical exposure?",
    "content": "we are applying teflon at work and it involves heating it to 800 degrees f . there is much smoke and co-workers are feeling sick.. my question is what are the short and long term effects of exposure to C8 in teflon application?\n\n",
    "posted_time": "Post  by mikeytuna » Tue Aug 03, 2010 6:04 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=99584&sid=cc2d08403f97bea715da83d5342b5404#p99584"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: what field deals with chemical exposure?",
    "content": "Hi, I will confine my answer only to your question regarding the adverse effects of  breathing Teflon fumes in an industrial set up.To say that this is a highly charged and controversial topic is an understatement.  Invented at DuPont's Jackson Laboratory in 1938, Teflon® (registered trademark of DuPont's)- a resin, is a fluoropolymer polytetrafluoroethylene (PTFE). Ammonium salt of  the perfluorinated compound, perfluoroctanoic acid (PFOA) or C-8 is used as a surfactant in the emulsification process during manufacture of PTFE.   In its polymer form, PTFE is non-toxic and physiologically inert, but upon heating, PTFE resin generates polymer fumes. As temperatures rise, the pyrolysis of Teflon has been seen to occur. releasing pyrolytic gases, that are known to cause respiratory problems (temporary flue-like symptoms, known as \"polymer fume fever\" in industrial workers, with symptoms such as chest pain, dyspnea, and cough. Typically the fluoropolymer starts to degrade above 500°F. Fumes are not typically given off until the fluoropolymer starts to melt (660°F-according to Dupont).   A relatively rare but severe lung condition is acute pulmonary edema, due to inhalation of pyrolytic products of PTFE, although few cases have been reported in the literature. (Lewis C, Kerby G. An epidemic of polymer fume fever. J Am Med Assoc 1965; 191: 103–106)  It is well known that facial birth defects in the new born, an effect observed in experimental studies on the effects of PTFE on rats, occurred with the children of two out of seven female DuPont employees from the Washington Works facility from 1979–1981. DuPont did not accept any liability from the alleged ‘toxicity’ of PFOA based on their studies.  DuPont had conducted human experiments with Teflon-laced cigarettes in their employee volunteers. Nine out of ten who smoked 0.4 milligrams of Teflon developed “Polymer Fume Fever”. (Clayton JW. 1967. Fluorocarbon toxicity and biological action. In Fluorine Chemistry Reviews. 1(2),197-252).  Dupont’s studies indicate that breathing Teflon fumes at high concentrations for a full workday is equivalent to 0.4 milligrams of Teflon  per cubic meter of air over eight hours exposure.   DuPont employees are required to wear respiratory protection. As early as 1962 the company required their workers to wear respirators when working with Teflon heated at or above 400 °F in poorly ventilated areas.  (Zapp JA. 1962. Toxic and health effects of plastics and resins. Arch. Environ. Health, 4, 335. 1962).  There is also consistent evidence on associations with higher cholesterol and uric acid in people exposed to higher levels of PFOA. Whether or not these potential effects result in an increase in cardiovascular disease is unknown.   As far as your industrial setup is concerned, you need to only look into the prevailing work culture (work hours, availability of respiratory protection, level of awareness of risks involved among workers, presence or absence of surveillance mechanisms to identify toxicities early and to monitor of levels of toxic products in fumes, quality of ventilation in the work place, just to name a few). Good luck!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Sat Aug 07, 2010 8:55 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=99993&sid=cc2d08403f97bea715da83d5342b5404#p99993"
  },
  {
    "author": "mikeytuna  Guest Posts: 2 Joined: Thu Jul 29, 2010 7:53 pm Gender: Male",
    "title": "the health affects of teflon?",
    "content": "i'm not sure who to ask about this but , we have started doing teflon application at work and many of my coworkers are feeling sick . so my question is what are the long and short term affects of exposure to teflon ? thank you very much\n\n",
    "posted_time": "Post  by mikeytuna » Thu Jul 29, 2010 8:19 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=99138&sid=cc2d08403f97bea715da83d5342b5404#p99138"
  },
  {
    "author": "Faye Lang, RN, MSW  Nurse Posts: 468 Joined: Thu Oct 30, 2008 7:01 pm Gender: Female Location: California",
    "title": "Re: the health affects of teflon?",
    "content": "Hello, mikeytuna,  You have posed an interesting question.  When first introduced into cookware, there were many complaints that it made people sick.  There have been multiple studies and evaluations of Teflon, and there has been no evidence that it is injurious to health under normal circumstances.  Teflon is used in body piercings due to its flexibility and compatibility with the human body.  Teflon grafts are used to replace arteries in vascular diseases when a suitable vein isn't available.  In tests, Teflon is stable and non-toxic.  Fumes of many ordinary cooking oils have been measured as more toxic than the fumes from cooking with Teflon.  However, there is an exception:  when Teflon is heated above 500 degrees Fahrenheit, it begines to deterioriate.  At 662 degrees F, the fumes can be lethal to birds and may cause flu-like symptoms in humans.  Based on this information, if your work does not involve heating Teflon above 500 degrees F, there is no known health risk.  Good luck to you!\n\n",
    "posted_time": "Post  by Faye Lang, RN, MSW » Sun Aug 01, 2010 7:45 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=99397&sid=cc2d08403f97bea715da83d5342b5404#p99397"
  },
  {
    "author": "pumpkins  Guest Posts: 2 Joined: Sun Jan 11, 2009 3:01 am Gender: Female",
    "title": "Do Drs really care about their patients?",
    "content": "Or is it just another job?\n\n",
    "posted_time": "Post  by pumpkins » Fri Jan 30, 2009 12:52 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=70291&sid=cc2d08403f97bea715da83d5342b5404#p70291"
  },
  {
    "author": "Dan Abshear  Medical Assistant Posts: 12 Joined: Wed Dec 31, 2008 3:34 am Gender: Male Location: Missouri, United States",
    "title": "Re: Do Drs really care about their patients?",
    "content": "Your question is an excellent one, and continues to be debated to this day.  Doctors are learned professionals.  They are experts in whatever medicine they practice.  Some are more charming than others.  If a doctor has bad bedside manner, that does not mean that the doctor is inferior as far as his skills to maintain and restore your health as a patient.  Doctors also strive to delay the progression of any chronic illness you may have- usually by utilizing pharmacological therapy, and monitoring this therapy.  Doctors do in fact have ethical obligations and legal duties as they care for you as one of their patients. They have to apply standards of care, and any treatment they offer or apply to you as a patient must be reasonable and necessary.  Yet unfortunately, many visits with a doctor are brief and to the point.  So most patents do not form what may be viewed as a relationship with their health care provider.  Most visits between the doctor and patient are simply situational acquaintances, at best.  Finally, keep in mind that doctors are very objective, and rely on their objectivity to practice medicine with quality,  Dan Abshear\n\n",
    "posted_time": "Post  by Dan Abshear » Mon Feb 02, 2009 11:21 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=70409&sid=cc2d08403f97bea715da83d5342b5404#p70409"
  },
  {
    "author": "pumpkins  Guest Posts: 2 Joined: Sun Jan 11, 2009 3:01 am Gender: Female",
    "title": "Re: Do Drs really care about their patients?",
    "content": "Obviously not as nobody's bothered to reply. I was appalled when two elderly DRs told me when they fly they always use Mr just in case there's an emergency on the plane. Nice aren't they?\n\n",
    "posted_time": "Post  by pumpkins » Tue Feb 03, 2009 10:55 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=70497&sid=cc2d08403f97bea715da83d5342b5404#p70497"
  },
  {
    "author": "Debbie Miller, RN  Nurse Posts: 4746 Joined: Mon Apr 16, 2007 2:41 pm Gender: Female Location: USA",
    "title": "Re: Do Drs really care about their patients?",
    "content": "Hello, Just like any other profession, there are good doctors and not so good doctors.  I know for a fact there are many who care about their patients very much, who establish ongoing communication and eduction programs with them.  The doctors here are volunteers - they don't have to take time for this kind of help but they do.  This is evidence of some very caring medical professionals who want to reach out to people around the world.    It is important to have a trusting relationship with your doctor so sometimes a little shopping is in order to find that right fit.  A doctor who is perfect for one patient may not be a good choice for another one because of his/her goals for health care management.  Patients must take an active role in their care and decisions that are made by getting all the information they need to make informed decisions and to ask the right questions.  This will help them to feel comfortable.  Doctors can only help if the patient discloses full information and history, if the patient follows the recommendations, takes the medications that are prescribed properly and if the patient trusts him or her.  I don't know if this is what you were looking for but I hope it helps.  Best wishes\n\n",
    "posted_time": "Post  by Debbie Miller, RN » Wed Feb 04, 2009 1:52 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=70509&sid=cc2d08403f97bea715da83d5342b5404#p70509"
  },
  {
    "author": "J. Rodriguez CM  Paramedic Posts: 2 Joined: Mon Apr 05, 2010 1:30 pm Gender: Male",
    "title": "Re: Do Drs really care about their patients?",
    "content": "I do not use any titles on non business papers, Doctors must love there career and there patients! I understand why an MD, would not want people to know that there are a trained professional because if we decide to help we fall under the \"duty to act\" law and we are 100% responsible of that pt. granted there are other laws on our side but for the most part we can get suspended until the case is resolved so unfortunately in the US. It can sometimes be a risk to big to take.    J. Rodriguez CM.\n\n",
    "posted_time": "Post  by J. Rodriguez CM » Thu Apr 08, 2010 7:34 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=93209&sid=cc2d08403f97bea715da83d5342b5404#p93209"
  },
  {
    "author": "Gilbert Anderson  Guest Posts: 2 Joined: Tue Dec 29, 2009 3:30 am Gender: Male",
    "title": "stethoscope use..!!",
    "content": "HI guys.... We all know about the use of thermometer and measure the temperature of our own body...and it's just silly things now a days..and mostly it's now user friendly and familiar to all..but the same way my question here is, can we know the normal fluctuation of our body with stethoscope..? or can anyone explain the how use the stethoscope normally...?....one thing i have to clear here is i am not asking to trapped in any major disease with stethoscope...!!\n\n",
    "posted_time": "Post  by Gilbert Anderson » Fri Jan 01, 2010 4:27 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=90441&sid=cc2d08403f97bea715da83d5342b5404#p90441"
  },
  {
    "author": "Dr.M.jagesh kamath  Medical Doctor Posts: 1303 Joined: Mon Aug 03, 2009 7:24 am Gender: Male",
    "title": "Re: stethoscope use..!!",
    "content": "Hello,You must of heard that the most important part of stethoscope is between the ears.Unless there is training to interpret the sounds the brain would not differentiate.The thermometer is another thing and does only need a visual reading.Stethoscope is an art and an icon too.Whether tomorrow it would be a need or not can not be known but it would continue to remain around the medical professional's neck.Interpreting sounds and clinical diagnosis are firmly rooted in medicine.Best wishes.\n\n",
    "posted_time": "Post  by Dr.M.jagesh kamath » Fri Jan 08, 2010 4:43 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=90630&sid=cc2d08403f97bea715da83d5342b5404#p90630"
  },
  {
    "author": "Medic_wannabe  Guest Posts: 1 Joined: Sun Nov 14, 2004 1:59 pm Location: UK",
    "title": "What are the disadvantages of being a doctor?",
    "content": "Could all doctors reply to this please.  Could you please keep this topic in this forum aswell as I suppose it will get more replies...  What are the disadvantages of being a doctor?  Could you please answer... would be greatly appreciated.\n\n",
    "posted_time": "Post  by Medic_wannabe » Sun Nov 14, 2004 2:01 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6440&sid=cc2d08403f97bea715da83d5342b5404#p6440"
  },
  {
    "author": "Dr. Russell M  Medical Doctor Posts: 650 Joined: Mon Jun 09, 2003 12:34 pm Location: USA",
    "title": "[no title]",
    "content": "Hi!  I think the advantages and disadvantages of being a doctor would vary depending upon the interests of the individual.   bill\n\n",
    "posted_time": "Post  by Dr. Russell M » Sun Nov 21, 2004 10:54 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6583&sid=cc2d08403f97bea715da83d5342b5404#p6583"
  },
  {
    "author": "TheShoelessWonder  Guest Posts: 8 Joined: Mon Nov 22, 2004 2:17 am Location: Edmonds, WA  Contact:   Contact TheShoelessWonder       AOL",
    "title": "in agreement",
    "content": "I agree, it completely depends upon the individual.  it also depends on what type of doctor you are, where you work, and the conditions of the hospital where you work.  Some doctors are on call all the time and some have normal hours and some work with surplus staff and get more time off than most.  It completely depends.  There are so many different types of doctors that you really need to assess all their situations more individually.  Do you know what type of doc you want to be yet?  i havent decided, but i do know fairly what i'm getting into at least.  are there any specific fields you would recommend yourself? hehe just curious.  will check back later!  -TheShoelessWonder\n\n",
    "posted_time": "Post  by TheShoelessWonder » Mon Nov 22, 2004 8:25 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6627&sid=cc2d08403f97bea715da83d5342b5404#p6627"
  },
  {
    "author": "dr. janak patel  Medical Doctor Posts: 5 Joined: Sat Nov 01, 2008 5:46 am Gender: Male",
    "title": "Re: All doctors... please reply",
    "content": "The biggest disadvantage to being a doctor in the US where I practice is not having as much curing of disease and illness as one would expect. It seems medicine moves slowly for obvious safety reasons and when we donot move carefully, we pay the price or should I say our precious patients pay the price w side effects, missed diagnoses, later then desired diagnosis of disease, and then many times you may reflect and realize the huge strides we have made over the years in helping people cope w pain, suffering and complications of disease.  I also think there is a big disadvantage in that ONLY NOW at this time in history are we finally getting back to realizing that being a physician is much more  about the..... size of your heart.... then the size of your brain or wallet.  There have been similar periods in hx where being a physician was easier in that there were less distractions and greater morals, but we seem to be getting back to that type of time period now again as the superficial rewards of being a physician are fading away. Also, some of the worst times in medicine have been when patients are mistreated or assigned to a handy neat, quick diagnosis when there is much more going on clearly. Dealing w insurance companies that only want to save money by not approving tests, treatments, referrals as a knee jerk first response w/o first considering each patient as an indiviual first is very difficult if you truly care for the profession.  Dealing w hospitals that are only concerned about paying their bills and making profits . These are only some thoughts about the negatives.....  As for the positives... truly there are SO many, many precious rewards.... that  you can only feel and appreciate in your heart and inner being that all the above disadvantages stem from a healthy concern of truly caring for the ill that have placed themselves in our sacred trust to do our very best.\n\n",
    "posted_time": "Post  by dr. janak patel » Wed Nov 05, 2008 4:57 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=63197&sid=cc2d08403f97bea715da83d5342b5404#p63197"
  },
  {
    "author": "dr.heba  Guest Posts: 1 Joined: Thu Dec 10, 2009 5:52 am Gender: Female",
    "title": "Re: What are the disadvantages of being a doctor?",
    "content": "Thank u for your question for me the disadvantage is the heavy work that I have to do and the study that is important to become responsible about the life of the patient  But I like this even if it is make me tired it is enough to se a smile on the face of my patient i hope this from my my heart\n\n",
    "posted_time": "Post  by dr.heba » Thu Dec 10, 2009 6:53 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=88664&sid=cc2d08403f97bea715da83d5342b5404#p88664"
  },
  {
    "author": "texstorm  Guest Posts: 1 Joined: Fri Oct 30, 2009 2:45 am Gender: Male",
    "title": "Unsolved Dizziness Case, Care to take a crack at it?",
    "content": "Hello, I have suffered from dizziness for 4-5+ years. I had a really bad motocross (Bike) accident around the same time. I have had MRIs/Spec Scans/CT scans/Chriopractors/Neurological Scans/EKGs/ENT specialists etc. The only thing that was found, was damage to the front left lobe from the spec scan. But lately I have been researching and I was wondering could it be, intracranial pressure?  I was told it shows up in MRI's but I was also told that it doesnt show up with minor intracranial pressure and would like a second opinion for this aswell. I am looking for some solutions, any suggestions would be great and I am willing to do ANYTHING and trying everything!  Symptoms -Dizziness (feeling sureal, outside of my body, in a dream) I feel like this 24/7 it gets worst when moving, in a car, walking etc. I also get vertigo sometimes, and recently vertigo attacks have been around more often and more intense. -Certain spots on head, if i touch or put pressure on it causes intense pain aswell as increased dizziness temperarly. -Pupils seem to be uneven sometimes, not sure if its related doctors seem to think there fine so. -Arms feel numb \"Puppet like feel\" feeling like this all the time aswell -Constant Headaches -Feeling of pressure all over my head from the front all the way to the back of the skull, almost like someones squeezing my head. -Feeling tired all the time -I find it harder to swallow since all this, when I eat bread and such I feel like im choking.  There are a bunch of other symptoms but these are the main ones.  Hope to hear from you  Tyler\n\n",
    "posted_time": "Post  by texstorm » Fri Oct 30, 2009 2:46 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=85268&sid=cc2d08403f97bea715da83d5342b5404#p85268"
  },
  {
    "author": "Dr.M.jagesh kamath  Medical Doctor Posts: 1303 Joined: Mon Aug 03, 2009 7:24 am Gender: Male",
    "title": "Re: Unsolved Dizziness Case, Care to take a crack at it?",
    "content": "Hello,You seem to have developed a post traumatic disorder and in the absence of organic disease the clinical impression is of chronic fatigue syndrome which causes confusion,body pain,giddiness,headaches etc.Once branded as hypochondria CFS is now looked upon as a real physical problem relating to immunity.It may take a long time to disappear but stress control programmes would help you a lot to recover from this disorder which disturbs multiple areas.Do keep in touch with your doctor for further advice.Ok?\n\n",
    "posted_time": "Post  by Dr.M.jagesh kamath » Tue Nov 03, 2009 8:17 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=85809&sid=cc2d08403f97bea715da83d5342b5404#p85809"
  },
  {
    "author": "Lizard078  Guest Posts: 1 Joined: Mon Sep 21, 2009 11:45 pm Gender: Female",
    "title": "20 years old rapid hair loss",
    "content": "Hi I've always been self consicious about my hair. I have very thin hair and on top of that it seems it's falling out more quickly than ever. I'm always had an spot in the front left side of the hairline that had a little less hair than the rest of my hair line. When I was about 17 it seemed to be receeding but I didn't think much of it. Now it seems my whole head is losing hair little by little but that front left side is falling out more rapidly. About a year ago my doctor told me I had \"abnormal cells\" and \"signs\" of HPV I supposed. I don't know if that had anything to do with it but I did get my shots for it. I also know I do not get proper nutrition as well. I'm so confused and at the time I don't have health insuance. I want to cry every night about it because I'm so scared that I'm going to have hair resoration or I'm very sick. The stress about it may even be making my hair fall out even worse.  Do you have any explanation for this? Or have any idea what it may be? I'm so desperate for some answers because I feel like I'm TOO YOUNG for it to be happening because of age.  I know I have high cholesterol as well but I'm only about 10 pounds overweight. I'm aware it's very high for my weight and I'm not sure if this may be a reason for it as well.\n\n",
    "posted_time": "Post  by Lizard078 » Tue Sep 22, 2009 12:05 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=83139&sid=cc2d08403f97bea715da83d5342b5404#p83139"
  },
  {
    "author": "Dr.M.jagesh kamath  Medical Doctor Posts: 1303 Joined: Mon Aug 03, 2009 7:24 am Gender: Male",
    "title": "Re: 20 years old rapid hair loss",
    "content": "Hello,The causes of hairloss in your age group for women is of two types.Generalised and localised.The localised patterns are seen with an area of hairloss.Alopecia areata is an auto immune problem,and fungus infections again localised, but scaly.In your case it is generalised.The commonest cause is Telogen effluvium in which after an illness,or due to general weakness the growing hairs suddenly turn to telogen hairs.This is a normal cycle in all but the sudden change results in excess hairfall.The reason in a young female to develop this would be iron deficiency.Sure the telogen hair would turn back to anagen,ie new hair growth in time.But you may need iron and protein suppliments.Also best to get your thyroid study becaue hypothyroid states lead to hairfall.Best wishes.\n\n",
    "posted_time": "Post  by Dr.M.jagesh kamath » Sun Oct 11, 2009 8:38 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=83617&sid=cc2d08403f97bea715da83d5342b5404#p83617"
  },
  {
    "author": "Davey87  Guest Posts: 1 Joined: Thu Sep 17, 2009 7:14 pm Gender: Male",
    "title": "I got Caulk Residue on my skin",
    "content": "About four weeks ago in my garage, i was picking up a broken Caulk tube that was split in half. I put two latex gloves on each hand and picked up the chunks of Caulk that were on the garage floor, immediately throwing it in the trash. There was some Caulk stuck on the garage floor so i started scrubing it with a metal brush. As i was scrubing i noticed the handal had a sticky residue on it. at the same time my hands started to feel a little sticky even with two gloves on each hand. I quickly went to wash my hands about ten times scrubing the heck out of them. My hands still felt sticky, by this point i was really scared. Later that night i went to urinate and forgot my hands were sticky and accidently touched my penis all over especially the opening of my foreskin at the tip. I also touched my lips and the skin on my torso when i was changing my clothes that night. The next morning my stomach was really burning and felt like i had to go real bad, I went three times in a row. My lips also started feel sticky. Later that night my genital region started to feel a little sticky. About two days after that my hands still felt really sticky and the tip of my penis started to really burn. Since then i used acetone on my hands twice but still feel pretty much the same. My skin still feels a little sticky and my penis still hurts and burns a little, it is very uncomfortable. Im afraid the Caulk residue is stuck on the tip of my penis and underneath my foreskin. The Residue must have gone through the latex gloves. Will this ever go away. PLEASE HELP!\n\n",
    "posted_time": "Post  by Davey87 » Thu Sep 17, 2009 8:08 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=82724&sid=cc2d08403f97bea715da83d5342b5404#p82724"
  },
  {
    "author": "basketball25  Guest Posts: 1 Joined: Thu Nov 06, 2008 8:18 pm Gender: Male",
    "title": "Small and Big white lumps on scrotum. Itch really bad",
    "content": "Hello,  For three years now i have had some white lumps on my scrotom and now there getting worse and there are a lot of them and they itch like crazy. im 19 now, and i cant really find out what they are! Please help\n\n",
    "posted_time": "Post  by basketball25 » Thu Nov 06, 2008 8:35 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=63376&sid=cc2d08403f97bea715da83d5342b5404#p63376"
  },
  {
    "author": "Dr.M.jagesh kamath  Medical Doctor Posts: 1303 Joined: Mon Aug 03, 2009 7:24 am Gender: Male",
    "title": "Re: Small and Big white lumps on scrotum. Itch really bad",
    "content": "Hello,If you are in a hostel my first diagnosis would be an unresolved scabies.The parasite causes a delayed reaction which presents as nodules on the scotum or penis with severe itching.Hydrocortisone creme is recommeded by the physician to tide over the itch followed by antiscabies treatment.Good wishes.\n\n",
    "posted_time": "Post  by Dr.M.jagesh kamath » Sun Aug 30, 2009 2:42 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=81717&sid=cc2d08403f97bea715da83d5342b5404#p81717"
  },
  {
    "author": "kitt  Guest Posts: 1 Joined: Wed Sep 03, 2008 1:55 pm Gender: Female",
    "title": "UNKNOWN SMELLY BUMP ON SPINE",
    "content": "i've had a large bump on my back for a couple of years on the middle of my spine on my back. i don't know what it is or where it came from. it doesn't hurt, and recently my wife squeezed it and a massive amount of think stinky puss looking stuff came out of it. it got smaller then large again. she squeezed it again so its much smaller but still here. it stinks so bad and we,ve never seen anything like it before.WHAT COULD THIS BE?\n\n",
    "posted_time": "Post  by kitt » Wed Sep 03, 2008 2:27 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=59771&sid=cc2d08403f97bea715da83d5342b5404#p59771"
  },
  {
    "author": "Dr.M.jagesh kamath  Medical Doctor Posts: 1303 Joined: Mon Aug 03, 2009 7:24 am Gender: Male",
    "title": "Re: UNKNOWN SMELLY BUMP ON SPINE",
    "content": "Hello,The common condition affecting the spine near the natal cleft would be a plinoidal cyst,supposed to be caused by pressure and hair ingrown.Elsewhere a dermoid cyst or a sebaceous cyst is more likely.The later,contents would be smelly.Ideal to get it removed at surgery.Best wishes.\n\n",
    "posted_time": "Post  by Dr.M.jagesh kamath » Sun Aug 30, 2009 2:36 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=81716&sid=cc2d08403f97bea715da83d5342b5404#p81716"
  },
  {
    "author": "juggals  Guest Posts: 1 Joined: Tue Apr 07, 2009 4:20 pm Gender: Male",
    "title": "Conception after removal of L.ovary and R. Fallopian tube?",
    "content": "How can  a woman still conceive after having her left ovary and right ovarian tube removed? That is quite a gap through the pelvic cavity.\n\n",
    "posted_time": "Post  by juggals » Tue Apr 07, 2009 4:26 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=73477&sid=cc2d08403f97bea715da83d5342b5404#p73477"
  },
  {
    "author": "SoTired76  Guest Posts: 10 Joined: Sat Mar 01, 2008 3:00 am Gender: Female Location: United States",
    "title": "A Patient's Perspective In the Modern World",
    "content": "“By now I am resigned to the fact that if after trying so hard, and doing my best to be patient, and if dealing with all the of these things I have been dealing with are going to be the status quo, then I will probably toss all my medicine out and get a room with a view!“  Really, I guess this has become a testament to how probably many patients feel nowadays. But, why is everyone so sick nowadays anyhow? Was it always like this before the advent of modern medicine and the commercialized world? How does one decide to continue on and pursue care as opposed to giving up, crawling into a shell, or even worse. It makes me sad to see how there are so many people suffering out there, and not enough resources, and not enough time, and not enough answers. I myself am blessed to have some answers and some resources, but I think it is normal to want to just give up on trying to get help. Why should this be normal? From what I have observed from personal experience and what I have seen in others, I am not the only one who feels this way. I can always offer a bit of advice, but I cannot hardly get the help I need. I can always be there for someone, but when I need someone to be there for me they just aren't around. This is life for the chronically ill patient of the day it seems. I have seen this over and over and over again, and there is just not enough love and help to go around. If I could spread myself thin enough to take away all the pain in the world, or to help even a few of those out there who cannot get the care or answers they need, I would do it regardless of any impact upon my own health. Those who have cared and taken time are a blessing, and since many do not have the resources readily available to them, or because their own families or practitioners are overloaded, or unavailable, then the individual is given no choice but to look on their own for help. How does one find an advocate to facilitate health care when they are too tired and weak to do this anymore for themselves? I was blessed enough to have a friend who represented me years back when I just wanted to give up completely. However, she could not get the help she needed though and eventually only was given a few years to live. I guess suffering is a big motivator for some, and concern and empathy for others. Perhaps the world would be a better place if we didn't know so much, or if we all could have the simple innocence of children. I really think it would. With all the hype, stress, over immersion of stimuli and fast paced craziness that seems to permeate through our own walls, even in our own homes in this modern world...I cannot help but wish I lived in a peaceful setting without a care but to care for those around me. Family values have changed. The Nuclear family has declined in my opinion into some morphed and mutated dream of what a real family used to be.  Many kids are raising themselves. Parents cannot afford to stay at home, and so many children grow up as latchkey kids, or in some kind of day care setting. Were mental health illnesses really so prevalent even at the beginning of the last century? Sure, there were no computers or such a news oriented high tech world in existence, but I really believe that people are suffering more than ever because of a lack of fundamental basics such as values, structure in the home, work that involved the human being as a whole and not just taxed the brain. Stressors have definitely evolved into something beyond the typical olden day worry. Now we have to try to figure out who we are more than ever. Faith is in a great decline, and money and greed have replaced the need for compassion, fidelity, and overall common sense. So mental illness seems to be on the rise. But, what can we expect in a sick world without a remedy to cure what ails it. It is hard not to be disillusioned with the plight of the world today. So, here is my view and it is only one view. It may not matter at all. If I really had the energy, I would research this and add the ideas and world views of others...especially of patients who are suffering in the modern age, particularly in the Western world. Cultural differences seem to make a big difference on how we see things. It also seems to me that things are much simpler, even if chaotic in places where such innovation and the rush for success does not exist. The Amish are a good example of a culture where family values, spirituality, and simplicity still hold true. They form together as a community to help each other out, despite the lack of health insurance or governmental help which they do not normally look to for help. They access modern health care, but they help each other. Maybe we could learn a lot from cultures such as that. Maybe if there were more family farms, and less factories, families who lived together could eat, work, learn, live, love and play together too. Sure, I enjoy modern convenience...but isn't convenience sometimes just another way to not have to actually work hard and care about each other.\n\n",
    "posted_time": "Post  by SoTired76 » Fri Mar 14, 2008 12:18 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=55919&sid=cc2d08403f97bea715da83d5342b5404#p55919"
  },
  {
    "author": "Alexandra C, RN  Nurse Posts: 26 Joined: Fri Mar 14, 2008 3:46 pm Gender: Female Location: USA",
    "title": "Re: A Patient's Perspective In the Modern World",
    "content": "Dear SoTired76,  The tone of your post is so sad and frustrated, I just wanted to reach out to you to say that I am sorry for your suffering.  I do not know what kind of health problems you are experiencing but you indicate that you have a chronic illness and have difficulty obtaining the support you need.  I wanted to suggest to you that you seek out a support group in your area, or even online.  It sounds like you have a lot of knowledge and experience that might be helpful to others in similar situations, and likewise you may find others who can offer their understanding, knowledge and experience to you.    I agree that our health care system is at times seems overloaded and imperfect, as are many facets of our modern lives.  I also see that great progress has been made in medicine in recent years.  Globally the rate of life expectancy has increased, many diseases that once caused widespread death are now successfully treated, even eradicated, more people do have access to quality health care than ever before.  I think you're also correct that we as humans need to examine the impact that our lifestyles have on the health of our bodies, our communities, our planet as a whole, because there is a lot of room for improvement.  I also believe that change  must start within each of us.  I love the quote from Ghandi, \"Be the change you want to see in the world\".  You seem to have a lot of passion and great ideas about what change would do the world good.  I am certain you are not alone in that!  Good luck to you, I hope you will seek out and find ways to help yourself and others navigate towards good health.\n\n",
    "posted_time": "Post  by Alexandra C, RN » Mon Mar 17, 2008 11:51 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=56177&sid=cc2d08403f97bea715da83d5342b5404#p56177"
  },
  {
    "author": "SoTired76  Guest Posts: 10 Joined: Sat Mar 01, 2008 3:00 am Gender: Female Location: United States",
    "title": "Re: Alexandra-A Patient's Perspective In the Modern World",
    "content": "Thank you for your response. I really want to make a difference somehow. I wrote this sort of in an essay format, because after being on two websites that are for support and patient questions, and I have been been vigilant in trying to help in whatever (even if in a piecemeal sort of way), trying to help those I can. Here I am more limited understandably. I thought that the topic would be a good one for those who are on here and to see what it is like from the point of view of not just me, but several people whom I have learned much from over the past month. It is sad and frustrated, but also I tried to make light of things as I see it. I am very much affected by the suffering I see around me, and I feel very powerless to help in the way I really want to. So, I am doing what I can as best as I can. I am also trying (having some difficulty lol) trying to get a blog going but it takes me more time than normal. So, if I write things on this one board on here, even if it is not always the most cheery view, maybe even one person who is learning will think about being on the other side of the fence. I have a few friends who are nurses and my brother is going to college for nursing. My aunt is a PA, and my uncle is a nurse as well. I was going to be a psychologist, but my health put that on hiatus. At least I finished my undergraduate degree and if nothing else I have learned a lot about the world, different cultures, and emotional issues. So, the next thing I write will be more upbeat. I also really appreciate your feedback. It helps give me a more positive outlook in spite of everything. But truly, I do yearn for a beautiful place in the country and not have to deal with so much anymore. Peace and blessings to you and to all.\n\n",
    "posted_time": "Post  by SoTired76 » Mon Mar 17, 2008 4:48 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=56197&sid=cc2d08403f97bea715da83d5342b5404#p56197"
  },
  {
    "author": "Raistlin  Guest Posts: 1 Joined: Fri Feb 29, 2008 4:53 pm Gender: Male",
    "title": "Question regarding workflow for referrals",
    "content": "I am not a student, but I could not find a more appropriate category in which to post my question.  I apologize for that.  My employer is building an online physician referrals system and I have been tasked with mapping the workflow involved in referring patients from one physician to another.  I find myself on this forum because I can not seem to locate an adequate description of this process.  My request is that someone would take a moment and lay out the steps that are taken by a physician's staff from the time a decision is made to refer the patient through the time the referral is scheduled and confirmed by both offices.  Thank you in advance for any assistance.\n\n",
    "posted_time": "Post  by Raistlin » Fri Feb 29, 2008 5:06 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=54695&sid=cc2d08403f97bea715da83d5342b5404#p54695"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "Re: Question regarding workflow for referrals",
    "content": "Hello Raistlin,  I'm not familiar with all the business aspects of the process but I can tell you what I know from my perspective as a physician.  Most insurance companies require a referral from a primary care physician for the insured person to be able to see a specialist.  The reason for this is to have the primary care physician (PCP) screen patients to see who truly needs to see a specialist, since specialists are more expensive to the insurance company.  The thought is that if people are allowed to go to the specialist directly more people who don't need to see the specialist will anyway.    When I, as a primary care physician, decide to refer a patient to a specialist I submit a form with the necessary information.  This is then forwarded to the insurance company and the patient can then make an appointment with the specialist.  The form serves as notice to the insurance company that I have recommended the specialist.  I hope this helps a little.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Fri Mar 14, 2008 12:05 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=55918&sid=cc2d08403f97bea715da83d5342b5404#p55918"
  },
  {
    "author": "JP5  Guest Posts: 2 Joined: Thu Apr 12, 2007 7:43 pm Location: Florida",
    "title": "Communication Between Doctors and Patients",
    "content": "Hey there. I'm a college student and I am doing a research paper. I'm hoping to gather some information for that assignment and possibly come back for some more...   The research is about communication between doctors and patients but nurses are welcome to join in. Well here goes....  Feel free to make your responses as long as you want. Thank you for your time and effort. Have a good time. ^.^  1.How long have you been a Doctor/Nurse?  2.On a scale of 1 to 10 (1 being the least important), how do you rate the importance of communication between you and your patients? Why?  3.  Why do you think communication between doctors and patients has worsened over the years?   4.  How do you think communication affects the way health care is provided? (Would it help or hinder?)  5.  As a doctor/nurse, in what ways do you think would help improve communication?  If you guys can think of anything that might help than please let me know... I am always looking for information...  JP\n\n",
    "posted_time": "Post  by JP5 » Thu Apr 12, 2007 8:06 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=40687&sid=cc2d08403f97bea715da83d5342b5404#p40687"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "Re: Communication Between Doctors and Patients",
    "content": "Hey there. I'm a college student and I am doing a research paper. I'm hoping to gather some information for that assignment and possibly come back for some more...   The research is about communication between doctors and patients but nurses are welcome to join in. Well here goes....  Feel free to make your responses as long as you want. Thank you for your time and effort. Have a good time. ^.^  1. How long have you been a Doctor/Nurse?  4 years  2. On a scale of 1 to 10 (1 being the least important), how do you rate the importance of communication between you and your patients? Why?  At least a 9, it is crucial that the patient be aware of the condition and treatment plan.  A patient needs to be able to trust their doctor.  Understanding the medical plan is crucial to this.  Communication is the only way for this to occur.  3.  Why do you think communication between doctors and patients has worsened over the years?  This makes the assumption that it has.  For the most part I think you are correct.  There are some physicians that have maintained good communication but it definitely is a challenge.  Medicine has become much more business oriented.  As such, doctors are finding more and more demands on our time.  In many cases it simply is not possible to spend 30-45 minutes with each patient.  Some physicians find themselves in a position where they can only spend 10-15 minutes with each patient.  The trick is learning to communicate well during this limited time to allow the patient to feel their needs were met.  4.  How do you think communication affects the way health care is provided? (Would it help or hinder?)  This gets back to the issue of trust.  Communication enables a patient to understand what is going on and allows the patient to trust their doctor.  If this trust is not established care is often hindered.  Patients may be uncertain about taking their medications, for example, because they have not had their questions properly answered.  5.  As a doctor/nurse, in what ways do you think would help improve communication?  One of the most important issues is for physicians to make communication a priority.  Simply asking patient if they have anymore questions before leaving the room goes a long way.  I hope this helps some.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Fri Apr 13, 2007 1:51 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=40700&sid=cc2d08403f97bea715da83d5342b5404#p40700"
  },
  {
    "author": "JP5  Guest Posts: 2 Joined: Thu Apr 12, 2007 7:43 pm Location: Florida",
    "title": "[no title]",
    "content": "You're right. Number three does assume that there is a deterioration in communication. It's my own personal bias, though, based on my experiences. I worked in a doctors office and there are some doctors who love to spend an hour just talking to their patients and then there were the ones who did the In-and-out thing, and then there was everyone in between. And I saw how the patients reacted to each type.  But that's not what i'm getting at. You stated that for the most part I am correct in my assumption. So which part did you think otherwise or what did you think of as you read that?   JP\n\n",
    "posted_time": "Post  by JP5 » Fri Apr 13, 2007 7:37 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=40705&sid=cc2d08403f97bea715da83d5342b5404#p40705"
  },
  {
    "author": "jennifer1b  Guest Posts: 12 Joined: Fri Jun 01, 2007 9:35 am",
    "title": "Re: Communication Between Doctors and Patients",
    "content": "I am so glad you are concerned with communication, as it is the key to being a good doctor.  If you do not take the time to listen and to explain, you can and will probably miss important information.  There is so much care passed on to nurse practitioners and physicians assistants and not enough with the doctor.  I have had erroneous diagnosis from those that are not doctors.   It would seem alright to see the nurse for bloodwork or a flu shot etc. but especially as patients get older and more serious symptoms present themselves, it is important to have a doctor speak to them.  I hope you take the time to get to know your patients individually.  They all have their own personalities and histories.  You will find it helpful.  Most doctors have way too many patients to handle alone.  Is it necessary to have so many patients?  Why are waiting rooms packed and people waiting for hours along side contagious people?  Is this really the best way to treat people?  Obviously, I don't think so.  Take on a work load you can handle.  This way you won't miss vital information that can prevent a patient from a delayed diagnosis.  Good for you, doing research on this topic.\n\n",
    "posted_time": "Post  by jennifer1b » Sat Mar 08, 2008 6:45 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=55393&sid=cc2d08403f97bea715da83d5342b5404#p55393"
  },
  {
    "author": "zles  Guest Posts: 1 Joined: Thu Jan 03, 2008 1:08 am",
    "title": "sleeping very late waking up very late",
    "content": "Hi, im in my twenties and i sleep at around 5 AM -2 PM everyday. I get enough sleep and I'm not tired when I wake up, but I'm concerned about the long-term effects of this. Is sleeping late and waking up late any less healthy (long-term) than sleeping early and waking up early, if I got the same amount of sleep and my body seems to have adjusted? Thanks.\n\n",
    "posted_time": "Post  by zles » Thu Jan 03, 2008 3:03 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=52601&sid=cc2d08403f97bea715da83d5342b5404#p52601"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "Re: sleeping very late waking up very late",
    "content": "Hello Zles,  This is a very interesting question.  I don't think we can definitively say at this point if there are any longterm effects from shifting your sleep cycle.  There are many people that do this.  Probably as long as you are getting enough sleep you'll adapt just fine.  There could potentially be some long term health effects but to my knowledge, most people who have been studied regarding this have really not been adjusting well.  They stay up late but then don't sleep that well while they are asleep during the day.  I suspect there will be more information about this in the coming years as more studies are done.  Sorry I can't give you a solid answer on this.    Best wshes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Thu Feb 14, 2008 2:22 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=53845&sid=cc2d08403f97bea715da83d5342b5404#p53845"
  },
  {
    "author": "murphy1982  Guest Posts: 12 Joined: Mon Aug 06, 2007 7:58 pm",
    "title": "I have been working graveyard in the er and my question",
    "content": "I have been working graveyard shift in the ed for about 5 months now and my question is this since I have started this 12 hour shift it seems on my time off I cant get enough sleep I am always tired I do not feel like doing anything during the day other then laying around I feel extremely guilty do in partly because I have a 3 year old daughter who's schedule has somewhat adapted to mine meaning I will go to bed late 1 2 am then sleep in untill 9 930 am well she sleeps in with me and that night doesnt end up going to bed untill 1030-11 pm I feel horrible about this and im constantly questining whether im a good father ect. Is it normal for your child to adapt to your schedule and what are some ways that your more normal on your off days any advice in this matter would be very helpfull\n\n",
    "posted_time": "Post  by murphy1982 » Tue Dec 18, 2007 12:05 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=51761&sid=cc2d08403f97bea715da83d5342b5404#p51761"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "Re: I have been working graveyard in the er and my question",
    "content": "Hi Murphy1982,  The body will shift its usual schedule if working for extended periods of time.  So, basically your body is flipping its days and nights some.  This is why you are more tired during the day and able to stay up while working at night.  Children will also adjust their internal clocks if they are moved to a different schedule.  So, most likely, in an effort to spend more time with you your daughter started staying up later and subsequently started sleeping in later.  This can be difficult to overcome.  Some things you can try are to keep the room very dark when sleeping and bright when awake.  It will probably take you a day or two to readjust so trying to bunch your days off so that you can avoid having to flip back and forth.  This will give you the most opportunity to adjust to your schedule.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Tue Dec 18, 2007 10:12 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=51773&sid=cc2d08403f97bea715da83d5342b5404#p51773"
  },
  {
    "author": "chasewbaw  Guest Posts: 1 Joined: Sun Dec 16, 2007 7:57 am",
    "title": "X ray",
    "content": "im a guy nd I had an exray on my leg when i was 11 and they forgot to give me a lead patch to cover my youknowwhat  would tht have done anything bad to my youknowwhat?\n\n",
    "posted_time": "Post  by chasewbaw » Sun Dec 16, 2007 8:06 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=51686&sid=cc2d08403f97bea715da83d5342b5404#p51686"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "Re: X ray",
    "content": "Hi Chasewbaw,  The actual amount of radiation from an x-ray is quite low.  It has been estimated that the amount of background radiation that one absorbs everyday is equivalent to 50 or 100 chest x-rays.   It is very unlikely that any problems would develop from your leg x-ray, especially since the focus of the x-ray beam would not be in the groin area.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Mon Dec 17, 2007 6:04 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=51742&sid=cc2d08403f97bea715da83d5342b5404#p51742"
  },
  {
    "author": "jack88  Guest Posts: 1 Joined: Sun Nov 11, 2007 7:53 pm",
    "title": "Masturbation and Disease",
    "content": "I would like to know if frequent male masturbation can lead to pain in the abdominal area and if that signifies that there could be a disease?\n\n",
    "posted_time": "Post  by jack88 » Sun Nov 11, 2007 8:02 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50112&sid=cc2d08403f97bea715da83d5342b5404#p50112"
  },
  {
    "author": "Debbie Miller, RN  Nurse Posts: 4746 Joined: Mon Apr 16, 2007 2:41 pm Gender: Female Location: USA",
    "title": "[no title]",
    "content": "I do not know of any disease associated with this and it should not cause pain.  If you have having unrelieved abdominal pain, you should get it checked out with a doctor.  Best wishes.\n\n",
    "posted_time": "Post  by Debbie Miller, RN » Sun Nov 11, 2007 9:28 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50130&sid=cc2d08403f97bea715da83d5342b5404#p50130"
  },
  {
    "author": "ambiremo  Guest Posts: 3 Joined: Mon Sep 03, 2007 2:32 am",
    "title": "Most sensitive area in womens body",
    "content": "Which are the most sensitive areas in a women's body? please explain and clear my doubt.  Thanks, Riyas. Age - 25 (Male)\n\n",
    "posted_time": "Post  by ambiremo » Fri Oct 26, 2007 11:17 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=49563&sid=cc2d08403f97bea715da83d5342b5404#p49563"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Ambiremo,  The answer to this question depends a bit on what you mean by sensitive.  When looking at a map of the nerve receptors in a given area of the body (termed a homunculus) the areas with the most receptors are the face (particularly the mouth) and the hands.  This is true for both men and women.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Fri Oct 26, 2007 11:49 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=49565&sid=cc2d08403f97bea715da83d5342b5404#p49565"
  },
  {
    "author": "ambiremo  Guest Posts: 3 Joined: Mon Sep 03, 2007 2:32 am",
    "title": "[no title]",
    "content": "Thanks for your reply sir. It seems that i didnt ask you meaning fully. For example touching on a finger does not create as much as feeling when compared to touching on neck. On that aspect i am asking. Touch by a men at which areas make a women feels (sexy) more?\n\n",
    "posted_time": "Post  by ambiremo » Sat Oct 27, 2007 1:33 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=49570&sid=cc2d08403f97bea715da83d5342b5404#p49570"
  },
  {
    "author": "ambiremo  Guest Posts: 3 Joined: Mon Sep 03, 2007 2:32 am",
    "title": "[no title]",
    "content": "Sir, Please reply me\n\n",
    "posted_time": "Post  by ambiremo » Wed Oct 31, 2007 11:44 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=49778&sid=cc2d08403f97bea715da83d5342b5404#p49778"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "The answer to your question is that this varies from person to person.  What you are referring to really is more of a perception of pleasure that is quite individual.  What one person feels as pleasurable another may find painful.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Thu Nov 01, 2007 12:18 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=49780&sid=cc2d08403f97bea715da83d5342b5404#p49780"
  },
  {
    "author": "Cutiepie  Guest Posts: 9 Joined: Sun Jun 03, 2007 5:52 pm",
    "title": "Conception & Ovulation",
    "content": "F, 26. Does every woman ovulate 14 days before her next period? How can one go about tracking your cycle and when you're likely to ovulate?  Also, if a female has a 29 day cycle on average and her last period was March 24, 2007 and ended March 28, 2007 and she had intercourse (March 29 with condom but it was ruptured partner 1), (April 1 and 3 unprotected partner2) and she learnt April 24 she was 4 weeks pregnant and conception occurred April 7 or 8, 2007, who is likely yo be the father?\n\n",
    "posted_time": "Post  by Cutiepie » Wed Jul 11, 2007 6:33 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=44607&sid=cc2d08403f97bea715da83d5342b5404#p44607"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Ovulation is generally considered to be 14 days before the first day of the next cycle though this is not necessarily always true for all women.  There are several ways for women to track ovulation including analyzing cervical mucous changes and basal body temperature changes.  As to your second question, ovulation for a 29 day cycle would generally be considered to occur on day 15 (April 7th).  Sperm can survive in the vaginal tract for about a week.  As such, it is very slightly more likely for fertilization to occur from intercourse on April 1 and April 3 but this in no way excludes the 29th.  The 29th would be generally considered about the limits of when fertilization could occur.  Really, though, there is no way to know for sure unless DNA testing is done after the baby is born or if an amniocentesis is done during the pregnancy to look at the baby's DNA.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Wed Jul 11, 2007 8:41 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=44609&sid=cc2d08403f97bea715da83d5342b5404#p44609"
  },
  {
    "author": "hoshi  Guest Posts: 1 Joined: Fri May 11, 2007 12:03 pm",
    "title": "Effect of Brain Entrainment music for Brain",
    "content": "Hi I have interest in the area of Briain Entrainment and have purchased brain entrainment music like Mozart Effect for my kids. I am wondering if there is any medical studies on the effectiveness for   1. Slowing down the rate of cancer cell spreading  2. faster recovery for Brain related patients .  etc\n\n",
    "posted_time": "Post  by hoshi » Fri May 11, 2007 12:21 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=42297&sid=cc2d08403f97bea715da83d5342b5404#p42297"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "I can't speak specifically to the mozart music for children but studies have shown that the brain can heal better and stays sharper if it is being utilized and challenged by things such as puzzles and thinking about music.  I am not aware of any data regarding music therapy and cancer; however, this doesn't mean it doesn't exist.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Mon Jun 11, 2007 8:57 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=43547&sid=cc2d08403f97bea715da83d5342b5404#p43547"
  },
  {
    "author": "twitch418  Guest Posts: 1 Joined: Thu Feb 16, 2006 4:15 pm",
    "title": "i have a hole in/on my ear, fluids come out...",
    "content": "i am 29, female i don't have a doctor, i have no insurance.  my question is, i have a 'hole' on/in my ear, it is NOT in my eardrum, it is on the surface.  when i eat hot food, sometimes it 'leaks fluid'.  also, there is fluid that comes out randomly.  the fluid is mainly clear.  sometimes it is a little thicker, mucousy and cloudy.  rarely, and evenmore odd, is i can squeeze the area around it and a firmer 'body fluid' comes out, like the filling of a acne pimple.  i can stick an earring in it slightly, to the point where it will stay in there if i take my hand away.  i have looked for what this is, and i can't find it anywhere.  it doesn't heart, it does swell sometimes.  any ideas?  anyone?\n\n",
    "posted_time": "Post  by twitch418 » Thu Feb 16, 2006 4:27 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=30833&sid=cc2d08403f97bea715da83d5342b5404#p30833"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi twitch418, In most states there are programs and clinics that provide health access to people whom are not insured or are underinsured based on income, need, etc. I am unclear on the location of the ear you are referring to (earlobe, location-outer structure of the ear) etc. If the contents are foul smelling, have a cheesey appearance etc. this may be related to an Epidermoid Cyst. I encourage you to have the area in which you speak of evaluated by a physician. Sincerely, Theresa Jones, RN\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Thu Jun 29, 2006 6:37 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=33186&sid=cc2d08403f97bea715da83d5342b5404#p33186"
  },
  {
    "author": "Perrin  Guest Posts: 2 Joined: Thu Apr 07, 2005 9:29 pm Location: San Antonio  Contact:   Contact Perrin       AOL",
    "title": "In a doctors/nurse's point of view what is considerd healthy",
    "content": "What should you do if you want to become healthy. A step to step guide would be cool if someone would do that for me\n\n",
    "posted_time": "Post  by Perrin » Thu Apr 07, 2005 9:57 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=12023&sid=cc2d08403f97bea715da83d5342b5404#p12023"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi Perrin, Essentially the guide to health is common sense. Refrain from over use of alcohol. Don't use any sort of drugs or addicting substances. Eat a well balanced diet and exercise. Sincerely, Rntdj\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Fri Apr 08, 2005 4:56 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=12030&sid=cc2d08403f97bea715da83d5342b5404#p12030"
  },
  {
    "author": "nursie3205  Guest Posts: 24 Joined: Mon Sep 05, 2005 11:23 am Location: Kentucky",
    "title": "being healthy",
    "content": "Perrin, always wash your hands. Wash in between fingers, under nails and on all surfaces for at least ten seconds per wash.  Alcohol sanitizers such as Germ-x  are also very effective.  Wash before and after eating, after using the bathroom, (every time) and whenever you come into contact with something \"dirty\".  Keep your environment neat and clean.  Handwashing is the number one way to prevent the spread of infections.  This will help you stay healthy!!\n\n",
    "posted_time": "Post  by nursie3205 » Mon Sep 05, 2005 12:35 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=19986&sid=cc2d08403f97bea715da83d5342b5404#p19986"
  },
  {
    "author": "whoopoo  Guest Posts: 1 Joined: Wed Feb 08, 2006 2:28 pm",
    "title": "[no title]",
    "content": "Everyone has own step. No one is same. But importantly, keep you laugh everyday, and, more importantly, keep others laugh.\n\n",
    "posted_time": "Post  by whoopoo » Wed Feb 08, 2006 2:33 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=30226&sid=cc2d08403f97bea715da83d5342b5404#p30226"
  },
  {
    "author": "Dania630  Guest Posts: 1 Joined: Sat Jun 21, 2003 10:59 pm",
    "title": "Thinking of attending Medical School in Egypt",
    "content": "Hello, I was browsing through this website and saw that many of the contributors are doctors from Egypt, so I hope someone will be able to help me out with this.  I just finished my second year of medical school at Trinity College in Dublin, Ireland (second year consisting of anatomy, biochemistry, physiology, etc) and am thinking of transfering to The Cairo University Medical School ( Kasr al Ainy). Firstly, I can hardly obtain any information on their site, so I don't even know if they except transfers, but if anyone knows of someone I could contact there-I would greatly appreciate it. Secondly, I am a U.S. citizen and am thinking of returning to the US for residency, so does anyone know if such a transfer to Egypt would be detrimental to my future? Lastly, I would really just like any advice on this matter, so if I could talk with anyone privately through email, that would also be helpful. My real motivation in the move is that I am of arab origin, and so being in an arab country would be much preferable to me. thank you for your time, Dania\n\n",
    "posted_time": "Post  by Dania630 » Sat Jun 21, 2003 11:06 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1013&sid=cc2d08403f97bea715da83d5342b5404#p1013"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Dear Dania, 1- Yes you can transfere to finish your medical school in cairo university, however they have to check for the courses you have finished. You must pass all the exams for the first 2 years courses before starting 3rd year. So, if any courses left not studied, you have to do study them and to pass their exams in cairo university. But i really do not know how they organize this. 2- such a transfer to Egypt would not be detrimental to your future future, However to do postgraduate studies in USA you have to to pass USMLE exams which can be done also in egypt at anytime starting from  your first year of transfere. 3- Who to contact , i think by emails is more or less unsuscessfull, the best way to do this is to go to the embassy (egypt embassy , or any egypt cultural centers, accadimy  in your city) ask them . They can contact the university so easily and they know very well how to do this. Also, any new informations we can get will be posted, keep in contact. Best of luck.\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Sun Jun 22, 2003 4:41 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1016&sid=cc2d08403f97bea715da83d5342b5404#p1016"
  },
  {
    "author": "Dr. Wafaa Abdel-Hadi  Medical Doctor Posts: 228 Joined: Mon Mar 07, 2005 2:15 pm",
    "title": "[no title]",
    "content": "Dear Dania,  I just read your post and I am very happy about your feelings towards your arabic origin:-) ....so from which arabic country due you belong to?:-)   Anyway, I know this is a very late reply,but anyway, so that you wouldn't be asking yourself the \"What if I ?\" question....My advice to you is...to continue your studies in  Dublin....get your graduation certificate...which you  probably have by now,??then.. if you want...we'd be more than happy to have you in \"Kasr el aini\"faculty of Medicine...to do your training...which will be very useful for you in all departments...we have an extra high flow of patients ...and the rare diseases ...you'll be seeing frequently    Tell me  how did it go for the past few years since you've written this post and if u still wanna do something in Egypt...I'll be more than happy to help you.  Best wishes,\n\n",
    "posted_time": "Post  by Dr. Wafaa Abdel-Hadi » Sat Apr 09, 2005 2:10 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=12110&sid=cc2d08403f97bea715da83d5342b5404#p12110"
  },
  {
    "author": "~Dr.RG  Guest Posts: 1 Joined: Fri Nov 04, 2005 5:48 pm Location: Illinois/Cairo",
    "title": "[no title]",
    "content": "Hey,    Wow u have no idea how happy SMahmoud's reply just made me! I'm an Egyptian whom happens to be an American citizen in her first yr of undergrad *I take Pre-Medical subjects though* in the USA. I've practically lived in the USA for my entire life but I need to go back to Egypt because my family is there now...and for almost the same reasons as Dania: I'm Egyptian!      So you said that international students can transfer to Kasr El Aini,  but do you have more details on that issue now? I know they need to check the subjects I've taken(and I've specifically taken all the subjects they take here during the 1st yr), but do you know exactly who I can contact...maybe something more direct than the embassy since I'm in Egypt right now and can practically go anywhere? I hope someone who will give me real info tho, I've spent the past month going from office to office with no luck . I need to transfer next yr. (which will be my 2nd. yr) and they all say just come back then. But I need to know now. So if anyone knows how I can get an approval for transferring and who to contact please let me know! Thanks! ~Rana\n\n",
    "posted_time": "Post  by ~Dr.RG » Fri Nov 04, 2005 6:04 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=24558&sid=cc2d08403f97bea715da83d5342b5404#p24558"
  },
  {
    "author": "demandby  Guest Posts: 2 Joined: Tue Feb 07, 2006 7:29 pm",
    "title": "Alternative tips to height increase hence a slimmer U",
    "content": "Reflexology have been a proven technique towards better health and even height growth. Today, we have a choice. don't worry about consuming any stuff. Simply wear a massaging shoe pad  that have reflexology nodes which is called Yoko Height Increase or Kimi Height Increase. We are the global wholesaler for these bestselling products. Do visit http://www.demandby.com for more info or you can email me at demandby@gmail.com   Buy direct, buy wholesale.\n\n",
    "posted_time": "Post  by demandby » Tue Feb 07, 2006 7:47 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=30166&sid=cc2d08403f97bea715da83d5342b5404#p30166"
  },
  {
    "author": "DocFinder  Guest Posts: 2 Joined: Tue Mar 29, 2005 4:02 am Location: US",
    "title": "Need Feedback",
    "content": "I wanted to introduce a new website that I came up with up as a solution to a problem that has been bothering me for a long time: There's no website that provides people's reviews and ratings on doctors (which is funny since you can find reviews on bottle openers..).  Find a Doctor   I have just launched a beta and will be happy to hear your thoughts on the idea and the site in general.  Thanks!\n\n",
    "posted_time": "Post  by DocFinder » Tue Mar 29, 2005 4:04 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=11543&sid=cc2d08403f97bea715da83d5342b5404#p11543"
  },
  {
    "author": "dlugose  Guest Posts: 38 Joined: Tue Feb 22, 2005 6:08 pm Gender: Male Location: Boulder, CO, USA",
    "title": "[no title]",
    "content": "I see your site has become http://www.mdjunction.com/, and it looks like it is off to a good start.  Some other sites rate doctors, but sometimes these are in the insurance company sites.  Note that it is of course not fair to judge a doctor just by a very small number of comments.  In some states such as Massachusetts at the website of the agency that registers doctors, or at the state medical association, you can find out whether there have been disciplinary measures against a doctor, lawsuits, and what specialty boards that doctor is listed as being certified by.  Occasionally a doctor will claim to be a specialist when he / she is not registered by a specialty board.[/url]\n\n",
    "posted_time": "Post  by dlugose » Thu Oct 13, 2005 7:21 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=23291&sid=cc2d08403f97bea715da83d5342b5404#p23291"
  },
  {
    "author": "DocFinder  Guest Posts: 2 Joined: Tue Mar 29, 2005 4:02 am Location: US",
    "title": "[no title]",
    "content": "Thank you for your feedback Dan, I appreciate it. I'm aware that some states provide disciplinary and certification information on doctors and I do plan on adding that to MDJunction in the future - I think these are important when one chooses a doctor.  Please feel free to send me more feedback through this forum or directly through MDJunction.  Thanks! Ben\n\n",
    "posted_time": "Post  by DocFinder » Sun Oct 16, 2005 2:54 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=23437&sid=cc2d08403f97bea715da83d5342b5404#p23437"
  },
  {
    "author": "pam45  Guest Posts: 1 Joined: Thu Nov 17, 2005 2:45 pm Location: united states",
    "title": "financial concerns",
    "content": "I wasnt able to post unless I replied, so Im not sure if this is the best place.  But I came across these articles at http://www.medicaldebtresources.com, that address how many people are in debt.  Im a little concerned because I am in school now and I want to become a doctor.  Its only my first year so I have a ways to go, but if Im going to end up in debt I don't think I was that risk.  What do you all think?\n\n",
    "posted_time": "Post  by pam45 » Thu Nov 17, 2005 3:30 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=25320&sid=cc2d08403f97bea715da83d5342b5404#p25320"
  },
  {
    "author": "Ling  Guest Posts: 4 Joined: Thu Nov 20, 2003 6:33 am Location: Manila, Philippines",
    "title": "common diseases in asia , europe and america",
    "content": "Hi, I'm a student from the Philippines. We have this assignment to get a list of  some common diseases from an asian country other than mine, an european one and from america . If there are doctors out there who can help me out, please let me know and email me. My email address is tsubiph@yahoo.com. Thank You\n\n",
    "posted_time": "Post  by Ling » Thu Nov 20, 2003 6:41 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1705&sid=cc2d08403f97bea715da83d5342b5404#p1705"
  },
  {
    "author": "Dr. Russell M  Medical Doctor Posts: 650 Joined: Mon Jun 09, 2003 12:34 pm Location: USA",
    "title": "[no title]",
    "content": "Hi!  Some of the common diseases in the Indan subcontinent would be the common cold, upper respiratory tract infections like sinusitis and pharyngitis, lower respiratory tract infections like pneumonia, urinary tract infections, gastroenteritis like enteric fever (typhoid) and cholera, tuberculosis, malaria, dengue fever, Weil's disease, hepatitis, conjunctivitis, etc.  In America, I do not find much of tuberculosis, malaria, dengue, or weils. The flu is quite common. The west-nile fever is particularly common in the south central Americas.  I hope this helps.  - Bill\n\n",
    "posted_time": "Post  by Dr. Russell M » Thu Nov 20, 2003 8:35 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1706&sid=cc2d08403f97bea715da83d5342b5404#p1706"
  },
  {
    "author": "Ling  Guest Posts: 4 Joined: Thu Nov 20, 2003 6:33 am Location: Manila, Philippines",
    "title": "[no title]",
    "content": "bill,                   Thank you for your reply. It really helped me. Can I ask if you know some doctors from the places I mentioned? It would really help me more because we need responses from some of them also.\n\n",
    "posted_time": "Post  by Ling » Fri Nov 21, 2003 8:47 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1712&sid=cc2d08403f97bea715da83d5342b5404#p1712"
  },
  {
    "author": "sisohel  Guest Posts: 26 Joined: Tue Mar 18, 2003 10:46 am Location: Dhaka Bangladesh  Contact:   Contact sisohel       Website   Yahoo Messenger",
    "title": "[no title]",
    "content": "Hi Ling,  Thank you for using this site and I am glad it helped you.I am a doctor form Bangladesh and would be happy to help you in any regards.Please feel free to mail me at sisohel@dhaka.net for any of your queries.   Best luck,\n\n",
    "posted_time": "Post  by sisohel » Mon Nov 24, 2003 2:14 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1720&sid=cc2d08403f97bea715da83d5342b5404#p1720"
  },
  {
    "author": "Ling  Guest Posts: 4 Joined: Thu Nov 20, 2003 6:33 am Location: Manila, Philippines",
    "title": "[no title]",
    "content": "Hello sisohel,          First of all thank you for replying. There aren't  many who are replying. Anyway, I sent you an email earlier. I hope you read it. It is really important that you send your reply right away. Could I also ask you if you have any american and european physician friends because I also need the same data from their countries? If you do, could you please help me contact them through email.  Thanks so much\n\n",
    "posted_time": "Post  by Ling » Tue Nov 25, 2003 8:02 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1724&sid=cc2d08403f97bea715da83d5342b5404#p1724"
  },
  {
    "author": "sisohel  Guest Posts: 26 Joined: Tue Mar 18, 2003 10:46 am Location: Dhaka Bangladesh  Contact:   Contact sisohel       Website   Yahoo Messenger",
    "title": "[no title]",
    "content": "Dear Ling,                  Thanks for your mail. yes I do have some American and European friends and I can give you thier mail or collect the data you need from them.        Common Diseases in our country (Bangladesh) include: Malaria,Diarrhoea,Tuberculosis,Thyphoid,Peptic Ulcer,Arsenic poisoning,Asthma,Diabetics.  Signs symptomps of these diseases and how to prevent them is a long answer and I would sugest you consult any standard textbook of Medicine (like Davidson's or Kumar Klark's) from your library.    If you face any problem let me know.  I would also like to know where and in which grade you are studying. Regards,\n\n",
    "posted_time": "Post  by sisohel » Tue Nov 25, 2003 1:38 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1727&sid=cc2d08403f97bea715da83d5342b5404#p1727"
  },
  {
    "author": "Ling  Guest Posts: 4 Joined: Thu Nov 20, 2003 6:33 am Location: Manila, Philippines",
    "title": "[no title]",
    "content": "sisohel,            First of all, thank you so much for the help. I hope some of your european and american friends could help me. By the way, I'm studying in Manresa School and I'm a third year high school student.          The thing is we have to get at least some information of at least one of the diseases you mentioned through this  chat room. Our teacher said we have to print the exact page on our computer where you replied.          Is there any chance of talking to your american and european friends on the net very soon? I would be so thankful.\n\n",
    "posted_time": "Post  by Ling » Wed Nov 26, 2003 8:56 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1741&sid=cc2d08403f97bea715da83d5342b5404#p1741"
  },
  {
    "author": "morris1  Guest Posts: 1 Joined: Sat Nov 12, 2005 11:32 pm Location: Delhi",
    "title": "[no title]",
    "content": "Hello bill I am very much agree with you .Actually in developing countries like India , Pakistan actually due lack of development and lack of information about disease and its medication they have to face too much problem .Very much medication available here but mostly its side effects are major issue .Mandol's side effects ]are seems to be very much favorable.  see this also for more...  http://www.urlsdisabled/s3622-s-MANDOL.aspx\n\n",
    "posted_time": "Post  by morris1 » Sun Nov 13, 2005 12:13 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=25045&sid=cc2d08403f97bea715da83d5342b5404#p25045"
  },
  {
    "author": "lil_red_hot_mommie  Guest Posts: 1 Joined: Fri Jul 29, 2005 10:31 am Location: winnsboro ,sc",
    "title": "having a baby",
    "content": "IF I WAS I8 MONTHS  IN AND I HAD A MISSCARRIAGE WOULDN'T THE BABY HAVE TO BE TAKEN FROM MY STOMACH    ALSO AT 2 MONTHS\n\n",
    "posted_time": "Post  by lil_red_hot_mommie » Fri Jul 29, 2005 10:35 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=17712&sid=cc2d08403f97bea715da83d5342b5404#p17712"
  },
  {
    "author": "dlugose  Guest Posts: 38 Joined: Tue Feb 22, 2005 6:08 pm Gender: Male Location: Boulder, CO, USA",
    "title": "[no title]",
    "content": "When you have a miscarriage, the baby is already gone.  Perhaps you meant, if the fetus dies, does it need to be taken out.  Almost always if the fetus has died, the uterus can tell that things are not normal, and it stops producing hormones to protect it, and soon bleeding starts and forces the fetus to be pushed out.  Exactly how it happens depends on how old the fetus is.\n\n",
    "posted_time": "Post  by dlugose » Thu Oct 13, 2005 7:09 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=23290&sid=cc2d08403f97bea715da83d5342b5404#p23290"
  },
  {
    "author": "jillber  Guest Posts: 2 Joined: Mon Mar 03, 2003 11:51 am",
    "title": "Hey",
    "content": "Does anyone answer these questions very often??  It doesn't look like too many get answers.  Just wondering\n\n",
    "posted_time": "Post  by jillber » Tue Mar 04, 2003 7:13 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=436&sid=cc2d08403f97bea715da83d5342b5404#p436"
  },
  {
    "author": "DeLWolcott  Guest Posts: 293 Joined: Fri Jun 24, 2005 5:47 pm Location: Texas",
    "title": "[no title]",
    "content": "2+ year post.  Kind of answers your question for the time period you originally asked this question.  I can tell you that responses are have improved over the years.\n\n",
    "posted_time": "Post  by DeLWolcott » Mon Oct 03, 2005 12:00 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=22188&sid=cc2d08403f97bea715da83d5342b5404#p22188"
  },
  {
    "author": "jrunci1  Guest Posts: 2 Joined: Wed May 26, 2004 2:05 pm Location: Louisiana",
    "title": "I need help with E/M Coding",
    "content": "I am researching E/M coding, and I haven't found anything so far that tells me exactly how to decide which level of E/M go with which procedures and diagnoses.  Can you please walk me through a patient encounter and tell me exactly what goes on with the paperwork. I would like to know exactly what the doctor writes down, and how the E/M level is decided according to the written information.  Thank you.\n\n",
    "posted_time": "Post  by jrunci1 » Wed May 26, 2004 2:08 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3406&sid=cc2d08403f97bea715da83d5342b5404#p3406"
  },
  {
    "author": "Dr. Russell M  Medical Doctor Posts: 650 Joined: Mon Jun 09, 2003 12:34 pm Location: USA",
    "title": "[no title]",
    "content": "Hi!  Perhaps this should help for a start:  Click here!  bill\n\n",
    "posted_time": "Post  by Dr. Russell M » Thu Jun 03, 2004 12:38 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3565&sid=cc2d08403f97bea715da83d5342b5404#p3565"
  },
  {
    "author": "jrunci1  Guest Posts: 2 Joined: Wed May 26, 2004 2:05 pm Location: Louisiana",
    "title": "[no title]",
    "content": "Thanks, Bill!  That is really helpful!\n\n",
    "posted_time": "Post  by jrunci1 » Fri Jun 04, 2004 3:05 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3583&sid=cc2d08403f97bea715da83d5342b5404#p3583"
  },
  {
    "author": "Dr. Russell M  Medical Doctor Posts: 650 Joined: Mon Jun 09, 2003 12:34 pm Location: USA",
    "title": "[no title]",
    "content": "Any time!\n\n",
    "posted_time": "Post  by Dr. Russell M » Sat Jun 05, 2004 11:25 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3590&sid=cc2d08403f97bea715da83d5342b5404#p3590"
  },
  {
    "author": "beanhealer  Guest Posts: 1 Joined: Mon Aug 22, 2005 5:58 pm Location: Florida  Contact:   Contact beanhealer       Website",
    "title": "E/M coding",
    "content": "check out my website at emuniversity.com for physician-to-physician e/m coding advice\n\n",
    "posted_time": "Post  by beanhealer » Mon Aug 22, 2005 5:59 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=19264&sid=cc2d08403f97bea715da83d5342b5404#p19264"
  },
  {
    "author": "heartshapedbetrayal  Guest Posts: 1 Joined: Thu Jul 21, 2005 12:24 pm Location: Texas  Contact:   Contact heartshapedbetrayal       Website   AOL",
    "title": "please help...what is this????",
    "content": "i'm a 16 year old girl. the last time i had sex was on the 12th of this month. i had a urine  test on the 19th to see if i was pregnant because my period was late. my test came up negative. it has now 6 days late. i had back pains yesterday that i thought were because i was going to start but i haven't yet. and this morning i had a pain on the lower left side of my stomach. i've also had some white discharge. are those pregnancy sytoms, am i just worried or could it be something else? please help me i'm worried.\n\n",
    "posted_time": "Post  by heartshapedbetrayal » Thu Jul 21, 2005 12:34 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=17196&sid=cc2d08403f97bea715da83d5342b5404#p17196"
  },
  {
    "author": "StillNotThere  Guest Posts: 2 Joined: Fri Jul 08, 2005 7:30 pm Location: Bay City",
    "title": "[no title]",
    "content": "Has your white discharge been like a milky color? Has it been clumpy, or a fluid? I am not a doctor, however I know many teenage girls that get this white discharge you are talking about.   When you had sex, did you use a condom? Birth control? What methods do you use to protect yourself if you used none of these?  Do not panic yourself into thinking you are pregnant when you may be not. But also don't ignore the problem and hope it goes away.  Sorry my help is very limited. There are many people who can help you better than I can.  -Joshua\n\n",
    "posted_time": "Post  by StillNotThere » Sun Jul 24, 2005 12:29 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=17334&sid=cc2d08403f97bea715da83d5342b5404#p17334"
  },
  {
    "author": "emmy  Guest Posts: 2 Joined: Thu Jul 07, 2005 6:15 am Location: NSW-Australia",
    "title": "night sweats",
    "content": "hi  I am a 22 yr old female, who has been suffering from night sweats for over 12 months. I wake during the night numerous times absolutely drenched and freezing cold. I also wake frequently on average twice a night to go to the toilet. I am getting little sleep and am tired most of the day. What do you think can be causing it?\n\n",
    "posted_time": "Post  by emmy » Thu Jul 07, 2005 6:30 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=16446&sid=cc2d08403f97bea715da83d5342b5404#p16446"
  },
  {
    "author": "Najah  Medical Doctor Posts: 26 Joined: Mon May 30, 2005 11:49 pm Location: Iraq",
    "title": "[no title]",
    "content": "This type of sweating should be carfully investigated.you did not mention whether there is an associated fever,weight loss or not.consult you doctor to do full investigations to help find the cause.\n\n",
    "posted_time": "Post  by Najah » Fri Jul 08, 2005 3:19 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=16501&sid=cc2d08403f97bea715da83d5342b5404#p16501"
  },
  {
    "author": "x0x011  Guest Posts: 7 Joined: Sun Jun 05, 2005 10:01 pm Location: Mississauga",
    "title": "Tattoos and Professionalism",
    "content": "Currently i'm a studying to become a sonographer, and eventually an MRI tech. I had questions about how professionals in the medical field look at tattoos on workers. I was thinking about getting a small tattoo on my wrist but i was wondering how this would affect my career, as any tattoo would in a professional field. I was also wondering what kind of affects an MRI has on tattoos, on both the tech and the patient?\n\n",
    "posted_time": "Post  by x0x011 » Sun Jun 05, 2005 10:06 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=14686&sid=cc2d08403f97bea715da83d5342b5404#p14686"
  },
  {
    "author": "Shannon Morgan, CMA  Medical Assistant Posts: 530 Joined: Fri May 06, 2005 6:28 pm Location: Dallas, Texas. USA.",
    "title": "[no title]",
    "content": "If you do get a tatoo, make sure it is not visible to other  people.  Do not get one around the hands - you will not be taken as seriously, and may find it hard to find employment at better offices.  The ink has no bearing on MRI.  Latest studies done even on totally tatooed bodies did confirm the safety of the inks used now.\n\n",
    "posted_time": "Post  by Shannon Morgan, CMA » Tue Jun 07, 2005 4:15 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=14768&sid=cc2d08403f97bea715da83d5342b5404#p14768"
  },
  {
    "author": "castanza  Guest Posts: 19 Joined: Mon Apr 25, 2005 9:24 pm Location: Portland",
    "title": "I don't get it",
    "content": "What is it about some topics that get several hundered views and dozens of replies, versus others that get 1 or 2 views?  Is there a trick to writing catchy titles?  Are these just the easiest ones for everyone to identify with?  Just curious about that.\n\n",
    "posted_time": "Post  by castanza » Tue May 03, 2005 10:50 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=13315&sid=cc2d08403f97bea715da83d5342b5404#p13315"
  },
  {
    "author": "Dr. Wafaa Abdel-Hadi  Medical Doctor Posts: 228 Joined: Mon Mar 07, 2005 2:15 pm",
    "title": "[no title]",
    "content": "Dear Castanza,   It's really a matter of availability of physicians ,paramedics and other valuable members online and the type of topic...certain kind of topics need special care and a better opinion from a specialist...so we leave it till somebody steps in from our colleagues...and if it's not yet answered...we just give the best answers we've got and  try to put the patient on the right track.  Best regards,\n\n",
    "posted_time": "Post  by Dr. Wafaa Abdel-Hadi » Tue May 03, 2005 3:41 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=13323&sid=cc2d08403f97bea715da83d5342b5404#p13323"
  },
  {
    "author": "beefmerciful  Guest Posts: 3 Joined: Sat Apr 30, 2005 1:03 am Location: leclaire  Contact:   Contact beefmerciful       Website",
    "title": "selective service will draft medical workers",
    "content": "\"An article in The New York Times titled “U.S. Has Contingency Plans for a Draft of Medical Workers” appears, revealing that Widemeyer Communications was hired during the summer to help the SSS prepare an enormous draft of doctors, nurses, and 61 medical specialties. What is not mentioned is that the Medical Draft will be expanded to include medical equipment repairpersons and even medical form processors. SSS spokesman Flavahan says that 36,000 doctors and nurses, more than 1% of the total 3.4 million men and women in the U.S. under the age of 44, are planned to be inducted in the first batch once the Skills Draft is activated, showing the current great need or possibly a future need from new invasions and conquests.\"\n\n",
    "posted_time": "Post  by beefmerciful » Sat Apr 30, 2005 1:32 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=13139&sid=cc2d08403f97bea715da83d5342b5404#p13139"
  },
  {
    "author": "Rhonda P, CEP  Paramedic Posts: 252 Joined: Wed Mar 16, 2005 8:37 am Gender: Female Location: USA",
    "title": "draft",
    "content": "Hello Beefmerciful,   Thank you for your interest and desire to share your findings. This could be a possibility or maybe not, I encourage anyone interested in the details to do research themselves to verify the details. There are controversies on both sides and you will find pros and cons leaning to right and the left.\n\n",
    "posted_time": "Post  by Rhonda P, CEP » Sat Apr 30, 2005 10:27 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=13150&sid=cc2d08403f97bea715da83d5342b5404#p13150"
  },
  {
    "author": "DrZhivago  Guest Posts: 1 Joined: Fri Apr 22, 2005 1:31 am Location: Lynnwood WA",
    "title": "Physician misquoted costs",
    "content": "I've been seeing the same doctor for several years now and have been happy for the most part.  A couple weeks ago he recommended that I get a CT scan for precationary measures.  I do not have insurance and he knows this.  I asked him how much it would cost and he said between $500 and $800.  He told me he knows it's expensive for me, but recommended I do it.  Long story short, I just received the bill for the CT scan/s and it is almost $5,000 for apparently two cat scans (didn't I realize I needed two), a contrast media, and a seperate bill from a company called Radia.  What should I do about this?  I depend on my doctor, not only for medical reasons, but to I depend on him to be looking out for my best interests in all areas and to explain all my options medically and financially.  Any advice is appreciated.\n\n",
    "posted_time": "Post  by DrZhivago » Fri Apr 22, 2005 1:53 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=12718&sid=cc2d08403f97bea715da83d5342b5404#p12718"
  },
  {
    "author": "Dr. Anthony Solomon  Medical Doctor Posts: 510 Joined: Mon Nov 15, 2004 6:04 pm",
    "title": "MISQUOTED COSTS",
    "content": "This is ridiculous!  There must be a procedure for complaints to the parties involved. If you have not complained to your doctor, do so immediately and ask him to assist you in filing a complaint to the parties who billed you.  You have every right to be upset about the misrepresentation of costs and prohibitive bill. I am assuming of course that you did not receive any other investigations or treatment that you are unaware of.    I hope you are successful with your complaint.   Dr Anthony Solomon MB BS DTM&H DIP.VEN FRSM\n\n",
    "posted_time": "Post  by Dr. Anthony Solomon » Fri Apr 22, 2005 5:32 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=12725&sid=cc2d08403f97bea715da83d5342b5404#p12725"
  },
  {
    "author": "Dr_sweetdreams",
    "title": "PDA Users beware of SKYSCAPE PRODUCTS",
    "content": "Skyscape offers a variety of cheap medical software...but their tech support is lousy. You can not use the product you paid for already without an unlock code. It is very inconvenient because their product is not compatible with Palm PDAs. Cheap is not always good!\n\n",
    "posted_time": "Post  by Dr_sweetdreams » Sat Jun 07, 2003 8:22 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=902&sid=cc2d08403f97bea715da83d5342b5404#p902"
  },
  {
    "author": "Dr. Wafaa Abdel-Hadi  Medical Doctor Posts: 228 Joined: Mon Mar 07, 2005 2:15 pm",
    "title": "[no title]",
    "content": "Thank you dr_sweetdreams for your warning...I'll keep that in mind and will forward it to all my colleagues,  Best wishes:-)\n\n",
    "posted_time": "Post  by Dr. Wafaa Abdel-Hadi » Sat Apr 09, 2005 2:01 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=12109&sid=cc2d08403f97bea715da83d5342b5404#p12109"
  },
  {
    "author": "tejota  Guest Posts: 2 Joined: Sun Oct 24, 2004 9:58 pm Location: Colonia, NJ",
    "title": "In vitro fertilization",
    "content": "I'm doing a project and I need to know the number of women who undergo in vitro fertilization.  Thanks\n\n",
    "posted_time": "Post  by tejota » Mon Oct 25, 2004 1:01 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6057&sid=cc2d08403f97bea715da83d5342b5404#p6057"
  },
  {
    "author": "Dr. Wafaa Abdel-Hadi  Medical Doctor Posts: 228 Joined: Mon Mar 07, 2005 2:15 pm",
    "title": "[no title]",
    "content": "Dear Tejota,  you cannot just know the number of women who undergo IVF!! it varies from one country to another. you should either go to a specialized IVF site...or just search for these kindda date on http://www.pubmed.com  Best Wishes:-)\n\n",
    "posted_time": "Post  by Dr. Wafaa Abdel-Hadi » Sat Apr 09, 2005 1:54 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=12108&sid=cc2d08403f97bea715da83d5342b5404#p12108"
  },
  {
    "author": "Dr Robert James  Guest Posts: 2 Joined: Sun Jan 04, 2004 8:46 am Location: Internet  Contact:   Contact Dr Robert James       Website",
    "title": "How Do I Do It",
    "content": "Hello friends This is my first post.  I know this is not the place for this post, i cound find no other place.  I would like to change my details in profile, my sig etc but its not getting updated.  Its a good forum. Well maintained.\n\n",
    "posted_time": "Post  by Dr Robert James » Sun Jan 04, 2004 9:45 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2076&sid=cc2d08403f97bea715da83d5342b5404#p2076"
  },
  {
    "author": "Rhonda P, CEP  Paramedic Posts: 252 Joined: Wed Mar 16, 2005 8:37 am Gender: Female Location: USA",
    "title": "[no title]",
    "content": "Did you get this taken care of?\n\n",
    "posted_time": "Post  by Rhonda P, CEP » Fri Apr 08, 2005 7:35 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=12040&sid=cc2d08403f97bea715da83d5342b5404#p12040"
  },
  {
    "author": "AshleyF  Guest Posts: 2 Joined: Mon Mar 22, 2004 5:51 pm Location: Louisiana",
    "title": "Dark-Brown Urine",
    "content": "What are some diseases prevalent to the northeast US that could cause dark-brown urine?\n\n",
    "posted_time": "Post  by AshleyF » Mon Apr 19, 2004 3:06 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3118&sid=cc2d08403f97bea715da83d5342b5404#p3118"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Dark brown urine",
    "content": "Dear Ashley,  At any time a urinary problem is suspected, it is better to do a urine analysis.  The causes of dark-brown urine include but are not limited to:   - Concentrated urine because of dehydration and not drinking enough water and fluids. - Urinary tract infections. - Renal failure. - Liver failure. - Blood in the urine.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Mon Apr 19, 2004 9:02 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3122&sid=cc2d08403f97bea715da83d5342b5404#p3122"
  },
  {
    "author": "elias  Guest Posts: 15 Joined: Tue Jan 18, 2005 3:40 am Location: Torrance, CA  Contact:   Contact elias       AOL",
    "title": "[no title]",
    "content": "brown urine? crazy\n\n",
    "posted_time": "Post  by elias » Wed Jan 26, 2005 2:23 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8586&sid=cc2d08403f97bea715da83d5342b5404#p8586"
  },
  {
    "author": "Perrin  Guest Posts: 2 Joined: Thu Apr 07, 2005 9:29 pm Location: San Antonio  Contact:   Contact Perrin       AOL",
    "title": "[no title]",
    "content": "yeah just today i started to get the same thing as Ashley i don't know if i should go to the doctor or anything because i really never drink sodas, all i really drink is sweet tea and water and a short time after that i started to work out and i got this werid pain inside of my stomach on the lower left side which is weird because that has never happend to me before, i told my mom about the brownish pee but i dident mention the pain, she told me it could have been for a number of reasons why thats happening to me and not to worry about it and she told me to drink more water i really don't know what i should do so please get back to me on this\n\n",
    "posted_time": "Post  by Perrin » Thu Apr 07, 2005 9:44 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=12022&sid=cc2d08403f97bea715da83d5342b5404#p12022"
  },
  {
    "author": "Jenniec  Guest Posts: 30 Joined: Fri Feb 06, 2004 1:51 am Location: ID  Contact:   Contact Jenniec       Yahoo Messenger",
    "title": "ET",
    "content": "If someone tried to ET a person while they were awake and well. Would Lidocaine work for numbing the vocal cords, how much would you have to use? How long would it last? How would you get it there? After attempts were made would the tissue in the throat be just sore? And if you intubated the Esophagus and blood came out with it where did the blood come from? We were playing around in class and we had some problems... Thank you  Jennifer\n\n",
    "posted_time": "Post  by Jenniec » Tue Feb 24, 2004 12:59 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2586&sid=cc2d08403f97bea715da83d5342b5404#p2586"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "[no title]",
    "content": "Dear Jennifer,  Lidocaine will work to numb the vocal cords and abolish the gag response which is the most feared thing during intubation for fear of aspiration if the patient vomits during intubation.  Lidocaine can administred to the throat by spraying, using a gel like formulation that one can swalow and keep in the back of the mouth for a while and by a liquid formulation that could swished and gargled.  The effect of lidocaine is short lived, if you give a patient lidocaine intravenous, its half life is between one and a half and 2 hours.  About esophageal intubation and the blood coming out, it could be from any where because most probably this is trauma secondary to intubation attempt. Could be from teeth, tongue, throat or from the esophagus itself.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Tue Feb 24, 2004 2:15 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2587&sid=cc2d08403f97bea715da83d5342b5404#p2587"
  },
  {
    "author": "Jenniec  Guest Posts: 30 Joined: Fri Feb 06, 2004 1:51 am Location: ID  Contact:   Contact Jenniec       Yahoo Messenger",
    "title": "[no title]",
    "content": "Great!!! We were trying to intubate each other in class, but we ran into problems right when the tube was going through the Vocal Cords. So I think we will use a spray next time. However, I wanted to ask. Is it safe to ET people that are awake and oriented? Does it matter how long you take in intubating them, I know it does when you someone that is unconscious…And what would be the safest way to do it? Thanks Jennifer\n\n",
    "posted_time": "Post  by Jenniec » Tue Feb 24, 2004 6:17 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2588&sid=cc2d08403f97bea715da83d5342b5404#p2588"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Endotracheal tube",
    "content": "Dear Jennifer,  Are you med students? Are you doing this under medical supervision? Why are you trying to intubate each other?   If you want to learn how to intubate people to provide cpr in cases of emergency, there are courses held for cpr where you can learn how to intubate.  What you are doing is not the standard of practice and you might end up in real problems while doing this. Please, stop doing what you are doing unless you are under direct supervision of a medical doctor and yet i can not see a doctor trying to train people how to intubate using each other for training purposes.   Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Tue Feb 24, 2004 8:26 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2591&sid=cc2d08403f97bea715da83d5342b5404#p2591"
  },
  {
    "author": "Jenniec  Guest Posts: 30 Joined: Fri Feb 06, 2004 1:51 am Location: ID  Contact:   Contact Jenniec       Yahoo Messenger",
    "title": "[no title]",
    "content": "Well, I am going to go to Med school next year. Right now I am in a Paramedic Program, we are just having a …learning experience, mostly for fun during our free time. No we weren’t doing this with the supervision of a Medical Doctor. We have intubated before,  and we know how to. But we have done it in an OR were everything is prefect…the patient is sedated and is limp, and the table is prefect reach. We were trying for something a little less controlled, like on the ground, mostly awake but not in an emergency situation. A few of us do not have or have very good control of the gag reflex and are able to sustain it to the point where a Laryngoscopy is possible with the Laryngoscope blade, but when going to advance the tube  (I’ll use myself as an example) I start to get a little nervous and loose control of the reflex, then gag. So we got the great idea of using Lidocaine as a local anesthetic. We just didn’t know how to administer locally to the vocal cords.   I have the feeling that the program is a little more lax on training regulations then the Med schools.  I was given a choice between having a ET tube done or a NG tube. I am just scared I would throw up with an NG tube and was promised that the ET tube would only be in for a few seconds.  Anyway, would it still be unethical to go on? We were planning on trying it tomorrow after classes, but using a spray. Thanks for your time Jennifer\n\n",
    "posted_time": "Post  by Jenniec » Tue Feb 24, 2004 11:31 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2597&sid=cc2d08403f97bea715da83d5342b5404#p2597"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Endotracheal tube",
    "content": "Dear Jennifer,   i would encourage you all not to do that. As a paramedic most probably you will have the opportunity to intubate people in non-perfect conditions a lot and i don't think that what you are doing now is the perfect way to practice non-perfect conditions intubations because still it is a somewhat controlled situation.  Intubations have there own risks and lidocaine as well has its own severe and serious side effects. So, something might happen and then you will get into real problems.  Training programs have regulations and rules and these were put by people who have thought aobut the best way to train students and i think that if they thought that using each other for practice would make people trained better, most probably they would have gone with it and i think you have to go by the rules even though if you think they are not good enough because if you break the rules and the life of a person is endangered or lost it is going to be because the rules were broken.  i would urge you not to participate in such activities.   Thank you very much for using our website http://doctorslounge.com   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Wed Feb 25, 2004 12:22 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2598&sid=cc2d08403f97bea715da83d5342b5404#p2598"
  },
  {
    "author": "Jenniec  Guest Posts: 30 Joined: Fri Feb 06, 2004 1:51 am Location: ID  Contact:   Contact Jenniec       Yahoo Messenger",
    "title": "[no title]",
    "content": "Tomorrow I am supposed to be the student that gets E.T.ed. I tried it already on Monday…that is why I asked the questions about the blood and stuff on the topic page. We had complications. They hoped that after a few days my throat would be better so we could try again. If you really feel strongly that I shouldn’t I trust that, and will not do it again. However I fail to see how it could be too dangerous for us. Is it the drug that you are worried about or is it the complication of Intubating the wrong tube ( that happened Monday)  Anyway  Thanks for your time  Jennifer\n\n",
    "posted_time": "Post  by Jenniec » Wed Feb 25, 2004 12:44 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2599&sid=cc2d08403f97bea715da83d5342b5404#p2599"
  },
  {
    "author": "Jenniec  Guest Posts: 30 Joined: Fri Feb 06, 2004 1:51 am Location: ID  Contact:   Contact Jenniec       Yahoo Messenger",
    "title": "[no title]",
    "content": "Well...if it makes a difference, Medical Control doesn't know about the Nitro testing thing.\n\n",
    "posted_time": "Post  by Jenniec » Wed Feb 25, 2004 12:48 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2600&sid=cc2d08403f97bea715da83d5342b5404#p2600"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Endotracheal tube",
    "content": "Dear Jennifer,   i don't think that training this way is going to make you any better and i think that whoever is doing this is subjecting him/herself to unnecessary potential complications.   i can only give my opinion but i can not force you to implement it.   Thank you very much for using our website http://doctorslounge.com   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Wed Feb 25, 2004 12:49 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2601&sid=cc2d08403f97bea715da83d5342b5404#p2601"
  },
  {
    "author": "Jenniec  Guest Posts: 30 Joined: Fri Feb 06, 2004 1:51 am Location: ID  Contact:   Contact Jenniec       Yahoo Messenger",
    "title": "[no title]",
    "content": "I was thinking about it, I don't think I will do that tomorrow...anyway The things we are doning like that are done without the approval of Medical Control. Do you think it would just be wise to not participate in things that are not approved though them? Thanks Jennifer\n\n",
    "posted_time": "Post  by Jenniec » Wed Feb 25, 2004 12:55 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2602&sid=cc2d08403f97bea715da83d5342b5404#p2602"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Endotracheal tube",
    "content": "Dear Jennifer,   Yes, i think so because they put people's safety before anything else.  Thank you very much for using our website http://doctorslounge.com   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Wed Feb 25, 2004 12:57 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2603&sid=cc2d08403f97bea715da83d5342b5404#p2603"
  },
  {
    "author": "Jenniec  Guest Posts: 30 Joined: Fri Feb 06, 2004 1:51 am Location: ID  Contact:   Contact Jenniec       Yahoo Messenger",
    "title": "[no title]",
    "content": "Sorry this was a question I had too...NG tubes, What is the difference on putting those down people other then the fact that they are smaller? Why do the teachers what to have the students do that? My class ( wont have to because I tryed the ET thing already) is going to do it to each other.  Thanks  Jennifer\n\n",
    "posted_time": "Post  by Jenniec » Wed Feb 25, 2004 1:02 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2604&sid=cc2d08403f97bea715da83d5342b5404#p2604"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: ng tubes",
    "content": "Dear Jennifer,  ng (nasogastric) tubes go down the esophagus to the stomach through the nose (nothing to do with breathing or using a laryngoscope), could lead to minor nasal trauma though, while et (endotracheal) tube goes down the windpipe and it could cause some damage to the vocal cords in addition to other side effects.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Wed Feb 25, 2004 1:07 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2605&sid=cc2d08403f97bea715da83d5342b5404#p2605"
  },
  {
    "author": "Jenniec  Guest Posts: 30 Joined: Fri Feb 06, 2004 1:51 am Location: ID  Contact:   Contact Jenniec       Yahoo Messenger",
    "title": "[no title]",
    "content": "Why are the teachers making the students do that?\n\n",
    "posted_time": "Post  by Jenniec » Wed Feb 25, 2004 1:11 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2606&sid=cc2d08403f97bea715da83d5342b5404#p2606"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "[no title]",
    "content": "Dear Jennifer,   i think that this question has to be asked to the teachers.  Thank you very much for using our website http://doctorslounge.com   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Wed Feb 25, 2004 1:13 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2607&sid=cc2d08403f97bea715da83d5342b5404#p2607"
  },
  {
    "author": "emskyle  Guest Posts: 10 Joined: Thu Mar 10, 2005 10:44 am Location: Canada",
    "title": "[no title]",
    "content": "I understand that this post / topic is old but I feel compelled to post a reply anyway in case anyone else out there is even contemplating this.  I am an Advanced Life Support Paramedic in Canada, and this question almost knocked me off my seat.  I’m usually hesitant to criticize a peers practice but this ...     What concerned me about what was being asked by this particular student was the extreme lack of knowledge about intubation and airway management.  The student asked numerous questions but not one bordered on being an intelligent one.  I want to reassure anyone who reads these postings, that the level of absolute ignorance illustrated is not reflective of the profession.  I only hope that these questions were posted VERY early in this paramedic student’s education and that her class mate’s attempts at performing this advanced procedure was a sign of an eagerness to learn.\n\n",
    "posted_time": "Post  by emskyle » Thu Mar 24, 2005 8:20 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=11296&sid=cc2d08403f97bea715da83d5342b5404#p11296"
  },
  {
    "author": "Rhonda P, CEP  Paramedic Posts: 252 Joined: Wed Mar 16, 2005 8:37 am Gender: Female Location: USA",
    "title": "ET",
    "content": "Idaho is a National Registry State as is Arizona. It isn't in the curriculum to intubate each other and it isn't in the State regulations for Paramedics to carry lidocaine for this purpose. My question is, where are they getting the lidocaine and under what Doctors orders are they using it?  I would be willing to bet the Instructor doesn't know this is being done and if they do, they need to be severely reprimanded by the Medical Director because his/her license is on the line if someone gets hurt.\n\n",
    "posted_time": "Post  by Rhonda P, CEP » Thu Mar 24, 2005 10:32 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=11326&sid=cc2d08403f97bea715da83d5342b5404#p11326"
  },
  {
    "author": "Jenniec  Guest Posts: 30 Joined: Fri Feb 06, 2004 1:51 am Location: ID  Contact:   Contact Jenniec       Yahoo Messenger",
    "title": "[no title]",
    "content": "Good Day to you all…I am sorry, I haven’t been on this site for a while and forgot about this posting until I received an e-mail this last week. As Emskyle comments are concerned, when we were playing around with this we were still in the “VERY” begging of learning about the airway system.  The professors did know that we were doing with the lidocain and airway instruments, in fact they even encouraged it.   A little background on my questions…I was in the beginning of Paramedic School, and the youngest of my class (I was very gullible).  The teacher had said that if we would attempt to stand an ET we wouldn’t have to try the NG tube.  Honestly I was disgusted by the thought of having anything go down my nose so I and a few others opted for intubation.  I was concerned about this because of all the soft tissue in the throat and the damage that could be done so I asked questions on here. NOTE: The Medical Director never did know that we did this and I am sure he would a more then a little mad if he knew the many things we did in that class. There were many things that happened in the class I took that were wrong and later I took some of those problems to higher authorities.  Since then, the Paramedic Director no longer works here, and they are getting new teachers. Another NOTE: We got the Lidocaine, Nitroglycerin and Adenosine from one of the teachers who was a nurse.   I am glad I did ask that question because it is through questions that we learn what is wrong and right. While I was learning I am glad that someone that knows more then I was there to answer my questions and be concerned about that I was doing. (Thank you to the people that responded) I don’t know if I ever posted anything about Nitro but we used to drop out BP to see the effects (very stupid!!) The teachers and Program Director were removed do to my reporting after I posted questions and received answers that it was wrong I did finish school…healthy and alive, did a paramedic internship at Grady and have moved on. There are new people in charge of the Paramedic Program I went through and a new Medical Director. Thank you for your concerns and comments. Like the Web Medic said the things that we did in that class are not reflections on the National Registry for Paramedics in the U.S.. Thank you again Jennifer\n\n",
    "posted_time": "Post  by Jenniec » Sun Mar 27, 2005 11:44 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=11464&sid=cc2d08403f97bea715da83d5342b5404#p11464"
  },
  {
    "author": "NurseNancy  Guest Posts: 1 Joined: Sat Mar 26, 2005 1:52 am Location: Australia",
    "title": "Biochemical changes in the body",
    "content": "a grossly obese man goes on a starvation diet consuming only 2 slices of bread and vegemite daily and water. He does this for 10 days ... what would the biochemical changes be that would occur in his body during this time and what would  the negative consequences be.\n\n",
    "posted_time": "Post  by NurseNancy » Sat Mar 26, 2005 1:58 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=11371&sid=cc2d08403f97bea715da83d5342b5404#p11371"
  },
  {
    "author": "Dr. D. Sawh  Medical Doctor Posts: 18 Joined: Sun Mar 20, 2005 7:05 am Location: GUYANA  Contact:   Contact Dr. D. Sawh       Yahoo Messenger   AOL",
    "title": "Biochemical changes in the body",
    "content": "DEAR NurseNancy, Thanks for your question. However, you didn't indicate in your profile whether u r a student nurse or any other medical professional or whether the ques. is an assignment,etc. As a result I don't know how to respond because I haven't a clue as to what exactly u are looking for. Kindly let me know if my answer below was of any help to you. I would now proceed with my answer to your question:  Biochemically, starvation implies prolonged fasting. When the obese man enters the starved state, after 3-5 days of fasting, biophysiological changes occur in his body. --- His muscles decreases its use of ketone bodies and oxidises fatty acids as its primary energy source. --- Due to decreased muscle usage, blood ketone body levels rise.--- His brain then takes up and oxidises the ketone bodies in order to derive energy. Consequently, the brain decreases its use of glucose, although glucose is still a major fuel for the brain. --- HEPATIC GLUCONEOGENESIS DECREASES. --- MUSCLE PROTEIN IS SPARED. --- Due to decreased conversion of amino-acids to glucose, LESS UREA IS PRODUCED FROM AMINO-ACIDS IN STARVATION THAN AFTER AN OVERNIGHT FAST. --- The body uses its FAT STORES AS ITS PRIMARY SOURCE OF ENERGY DURING THE 10 DAYS. --- Overall, LIPIDS ARE QUANTITATIVELY THE MOST IMPORTANT FUEL IN HIS BODY. --- The LENGTH OF TIME THAT A PERSON COULD SURVIVE ON 2 SLICES OF BREAD (source of carbohydrate), VEGEMITE & WATER DEPENDS MAINLY ON THE AMOUNT OF FAT STORED IN ADIPOSE TISSUE.--- Even after 3-4 weeks of starvation, blood glucose levels are still in the range of 65 mg/dL. IN SUMMARY, starvation causes muscle to decrease its use of ketone bodies. As a result, ketone body levels rise in the blood, and the brain uses them for energy. Consequently, the brain needs less glucose and gluconeogenesis slows, thereby, sparing muscle protein. These changes in the fuel utilisation patterns of the obese individual enabled him to survive for 10 days without SOLID FOOD. REMEMBER: TO LIVE LONGER, LESSEN THY MEALS.        (Benjamin Franklin)I SINCERELY HOPE THAT THIS IS WHAT U WERE LOOKING FOR. KINDLY LET ME KNOW A.S.A.P. YOURS TRULY,                                                                                                    D.SAWH M.D., F.R.C.P.--- [quote][/quote]\n\n",
    "posted_time": "Post  by Dr. D. Sawh » Sat Mar 26, 2005 11:44 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=11414&sid=cc2d08403f97bea715da83d5342b5404#p11414"
  },
  {
    "author": "Nadia_C",
    "title": "Doctor Survey",
    "content": "Hello, I am currently doing a project for school about doctor's fields of specialty and I was wondering whether some soctors could  answer some questions. Thank you in advance.  _______________________________________________________________________ 1. What is your field of specialty? 2. Which medical school did you attend? 3. What do you believe to be the most rewarding aspect of your job? 4. Was medical  school the hardest part in the process of becoming a doctor? 5. Contrarily, what do you consider to be the worst aspect of your job? 6. How did you become interested in becoming a doctor? Also, what drew you yo choose your field of specialty? 7. What is unique about your specialty field when compared to other specialties, in other words what sets your specialty apart from the rest? 8. What would you change about your field of specialty if you could. 9. What is your advice for students who want to become doctors?\n\n",
    "posted_time": "Post  by Nadia_C » Sun Mar 23, 2003 1:22 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=556&sid=cc2d08403f97bea715da83d5342b5404#p556"
  },
  {
    "author": "Dr. D. Sawh  Medical Doctor Posts: 18 Joined: Sun Mar 20, 2005 7:05 am Location: GUYANA  Contact:   Contact Dr. D. Sawh       Yahoo Messenger   AOL",
    "title": "DOCTOR SURVEY",
    "content": "Hello, Nadia_C, [/b]The answers are as follows: 1) My speciality is INTERNAL MEDICINE. 2) I attended University of Guyana, thence to Glasgow University(SCOTLAND), Postgraduate studies at the University of Cambridge(UK.) 3) Well, generally, I would have to say patient satisfaction with response to therapy. 4) Most definitely. 5) Filling out INSURANCE CLAIMS & BENEFITS ( A lot of paper work) 6) I guess you can say that it runs in the family - from father & brothers + cousins     Because it encompasses everything, including obstetrics-gynaecology, paediatrics, neurology, nephrology, urology, urogynaecology, endocrinology, clinical haematology, oncology, medical genetics, pharmacology, etc. 7) You get to see a broad spectrum of patients each with a different complaint rather than a paediatrician who sees only infants, toddlers & children,etc.  NOTHING EXCEPT FOR SOME OBSOLETE DRUG SCHEDULES. 9)ADVICE: STUDY HARD, PLAY HARD & DO A LOT OF READING FOR ABOUT 10-12 HOURS PER DAY. I DON'T MEAN TO SCARE YOU BUT THAT'S REALITY BURNING THE MIDNIGHT OIL.    REMEMBER: ALL WORK AND NO PLAY MAKES JACK A DULL BOY. ALSO, HARD WORK, DEDICATION, SACRIFICE, SETTING YOUR GOALS IN LIFE VERY HIGH, NO CIGARRETTE SMOKING & ALCOHOL CONSUMPTION.                                                                                                     BEST REGARDS,                                                                                                         D.SAWH M.D., F.R.C.P.\n\n",
    "posted_time": "Post  by Dr. D. Sawh » Sat Mar 26, 2005 10:21 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=11413&sid=cc2d08403f97bea715da83d5342b5404#p11413"
  },
  {
    "author": "dr_shadow  Guest Posts: 2 Joined: Wed Mar 02, 2005 1:21 am Location: egypt",
    "title": "best stethoscopes with suitable price",
    "content": "hi i'm a medical student and i'm going to buy a new stethoscope for the physiology lab  i don't know much about the prices and types so i need a  good type of stethoscope for me would u prefer littman or which one do u recommend (please don't include the electronic stethoscope ... ican't afford its price  )\n\n",
    "posted_time": "Post  by dr_shadow » Wed Mar 02, 2005 1:29 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=10219&sid=cc2d08403f97bea715da83d5342b5404#p10219"
  },
  {
    "author": "Dean M. Mitchell  Guest Posts: 10 Joined: Wed Mar 09, 2005 6:54 am Location: Kent, England (UK)",
    "title": "[no title]",
    "content": "Dear dr_shadow,  this is a medical forum and we are here to answer urgent medical questions, I suggest that you turn somewhere else to not take up our precious time.\n\n",
    "posted_time": "Post  by Dean M. Mitchell » Sun Mar 13, 2005 1:49 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=10765&sid=cc2d08403f97bea715da83d5342b5404#p10765"
  },
  {
    "author": "Kathy C, RN  Nurse Posts: 84 Joined: Tue Jan 25, 2005 5:57 am Location: Titusville Florida",
    "title": "[no title]",
    "content": "Dear Dr Shadow, I have used Littman for years and have found it is worth your while to spend the extra money to get the top of the line. I currently use Littman Cardiology and I  hear so much better. Hope this helps and good luck with your studies.\n\n",
    "posted_time": "Post  by Kathy C, RN » Mon Mar 14, 2005 3:32 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=10812&sid=cc2d08403f97bea715da83d5342b5404#p10812"
  },
  {
    "author": "dr_shadow  Guest Posts: 2 Joined: Wed Mar 02, 2005 1:21 am Location: egypt",
    "title": "[no title]",
    "content": "dear angelseakr i'm so gratefull for ur advice and i'll searsh for littman cardiology scope Thanks again best regards\n\n",
    "posted_time": "Post  by dr_shadow » Thu Mar 17, 2005 2:46 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=10947&sid=cc2d08403f97bea715da83d5342b5404#p10947"
  },
  {
    "author": "Rhonda P, CEP  Paramedic Posts: 252 Joined: Wed Mar 16, 2005 8:37 am Gender: Female Location: USA",
    "title": "stethoscope",
    "content": "I really like the Littman on the ambulance. It's hard to hear anything with the sirens going, the patient moaning or crying, people talking and the road noise rumbling through the floor but the Littman would come through for me. Nice lung sounds, good heart tones, good B/P's, I could hear wonderfully well when the place was quiet. Littman is my choice too. Only one problem I found with them, they grow legs real fast. You will need to figure out a way to mark it so it won't be taken. Keep your eyes open, you'll see interesting ways people have thought up to mark their \"ears\".\n\n",
    "posted_time": "Post  by Rhonda P, CEP » Fri Mar 18, 2005 1:41 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=10989&sid=cc2d08403f97bea715da83d5342b5404#p10989"
  },
  {
    "author": "elias  Guest Posts: 15 Joined: Tue Jan 18, 2005 3:40 am Location: Torrance, CA  Contact:   Contact elias       AOL",
    "title": "a good question",
    "content": "say a homeless person gets treated at a hospital through urgent care. This person has no \"identity\". How will the hospital go about billing this person? I was watching ER and a homeless person got treated. Got me thinking~\n\n",
    "posted_time": "Post  by elias » Sun Feb 13, 2005 10:29 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=9371&sid=cc2d08403f97bea715da83d5342b5404#p9371"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi elias, In a large number of hospitals there are programs or charities that if a person is under a certain income guidelines etc. they are treated and the bill for that treatment is \"written off\" or disolved. It would be my impression that someone in the situation whom is homeless would certainly receive treatment without cost. Sincerely, Rntdj\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Tue Feb 15, 2005 8:36 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=9439&sid=cc2d08403f97bea715da83d5342b5404#p9439"
  },
  {
    "author": "elias  Guest Posts: 15 Joined: Tue Jan 18, 2005 3:40 am Location: Torrance, CA  Contact:   Contact elias       AOL",
    "title": "[no title]",
    "content": "that does make sense\n\n",
    "posted_time": "Post  by elias » Tue Feb 15, 2005 7:53 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=9474&sid=cc2d08403f97bea715da83d5342b5404#p9474"
  },
  {
    "author": "healthee  Guest Posts: 1 Joined: Wed Dec 15, 2004 3:27 pm Location: US",
    "title": "need doctors' advice pls",
    "content": "Hi friends,  iam new to the board,i think  the board is for sharing but not for doctors' advice. i wish to ask few health questions to the doctor,can anybody guide me where i have to put my health issue pls? thanks to u in advance.reply me please\n\n",
    "posted_time": "Post  by healthee » Wed Dec 15, 2004 3:36 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=7094&sid=cc2d08403f97bea715da83d5342b5404#p7094"
  },
  {
    "author": "Carolyn Merritt, LPN  Nurse Posts: 141 Joined: Sun Sep 19, 2004 12:36 am Location: Northern California USA",
    "title": "[no title]",
    "content": "Hello: You can post them just like you did this message you sent.  Either a doctor on one of the health techs or nurses will answer your questions for you. Regards, Carolyn\n\n",
    "posted_time": "Post  by Carolyn Merritt, LPN » Sat Dec 18, 2004 1:00 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=7152&sid=cc2d08403f97bea715da83d5342b5404#p7152"
  },
  {
    "author": "supertech20845  Guest Posts: 1 Joined: Wed Dec 15, 2004 7:47 pm Location: Ohio",
    "title": "Challege For Med Students or Docs",
    "content": "I am a Medical Technologist.  I have been taking fluoxitine for 1 and 1/2 years.  In the last six months I have recently been extreemly tired regadless of how much sleep I get.  I have run cortisols, thyroids, CBCs, mono, and everything else I can think of.  I don't know what is wrong.  All my test are normal and I exercise regularly, but I am so tired I hardly get a shower everyday.  My family doctor has no clue what is wrong.  Any ideas?\n\n",
    "posted_time": "Post  by supertech20845 » Wed Dec 15, 2004 7:57 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=7096&sid=cc2d08403f97bea715da83d5342b5404#p7096"
  },
  {
    "author": "Carolyn Merritt, LPN  Nurse Posts: 141 Joined: Sun Sep 19, 2004 12:36 am Location: Northern California USA",
    "title": "[no title]",
    "content": "Hello: Can you tell me if there has been any changes in your life over the past six months.  For instance, have you taken on additonal work, or increased your level of responsibility? Have your eating habits changed? Have you experiences additonal stresses that you didnt have before?  Stress and tension takes a huge toll on the body and can cause extreme fatigue.  Often the things that cause stress come on gradually so that we do not realize how much stress we are under.  How do you sleep at night?  Do you experience any pain in the joints or muscles? People tend to always look for a physical disease that causes fatigue and forget that often it is the mental stresses of life that wears the body down.  Let me know about these things and perhaps we can narrow it down to one or two possibilities. Regards, Carolyn\n\n",
    "posted_time": "Post  by Carolyn Merritt, LPN » Sat Dec 18, 2004 12:58 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=7151&sid=cc2d08403f97bea715da83d5342b5404#p7151"
  },
  {
    "author": "Oleh  Guest Posts: 1 Joined: Sun Nov 07, 2004 5:34 am Location: Malaysia",
    "title": "Online English-Chinese Medical Dictionary",
    "content": "Am spending my twilight years in China and found this site extremely helpful:  ESAURUS Online English-Chinese Medical Dictionary http://www.esaurus.org/\n\n",
    "posted_time": "Post  by Oleh » Sun Nov 07, 2004 5:36 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6326&sid=cc2d08403f97bea715da83d5342b5404#p6326"
  },
  {
    "author": "Dr. A. Saif  Medical Doctor Posts: 101 Joined: Mon Oct 25, 2004 1:56 pm Location: UK  Contact:   Contact Dr. A. Saif       Yahoo Messenger",
    "title": "[no title]",
    "content": "Hi Oleh,  Extremely useful...I will bookmark it, thanks  Saif\n\n",
    "posted_time": "Post  by Dr. A. Saif » Mon Nov 08, 2004 2:01 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6352&sid=cc2d08403f97bea715da83d5342b5404#p6352"
  },
  {
    "author": "trees  Guest Posts: 1 Joined: Wed Sep 29, 2004 2:24 pm Location: na",
    "title": "just a question",
    "content": "im 17.5 and im five foot five my mom is 5\"9 dad is 6\"0 bot h my brothers 15 and 19 are 6\"0 or taller i was very athletic as a kid  and was wonderin if this is as tall as i will get? any thing that i can eat specific to encourage growth?\n\n",
    "posted_time": "Post  by trees » Wed Sep 29, 2004 2:40 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5685&sid=cc2d08403f97bea715da83d5342b5404#p5685"
  },
  {
    "author": "Carolyn Merritt, LPN  Nurse Posts: 141 Joined: Sun Sep 19, 2004 12:36 am Location: Northern California USA",
    "title": "[no title]",
    "content": "Hello: Females usually stop growing at age 16 and males at age 18.  However, there is a wide variance in when one stops growing and it all depends on genetics.   Some males have been known to continue growing into their late 20's and in rare instances up to the age of 30. HGH or human growth hormone is responsible for our rate of growth.  Studies are being done with HGH to help children with exceptionally short stature to grow taller.  I do not know of any studies being done with those in their late teens however.  Taking a poll will only give you peoples guesses and one guess is as good as another.  It is genetics that plays the important role here.  Ask your parents about their age when they stopped growing and if your grandparents are alive I suggest asking them also.  That would be a better estimate of when you will stop growing than a poll can give you. Regards, Carolyn\n\n",
    "posted_time": "Post  by Carolyn Merritt, LPN » Sun Oct 03, 2004 10:30 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5762&sid=cc2d08403f97bea715da83d5342b5404#p5762"
  },
  {
    "author": "castinglola  Guest Posts: 1 Joined: Sun Sep 26, 2004 3:49 pm",
    "title": "MALE DOCTOR, 34-45, NYC FOR NATIONAL SAMSUNG CAMPAIGN",
    "content": "I am CASTING ONE CAUCASIAN MALE, AFFLUENT-LOOKING REAL DOCTOR 34 - 44 YEARS GEORGE CLOONEY/LANDS ENDISH type.  NO EXCEPTIONS.  NO FEMALES. GENERAL PRACTICE, INTERNAL MEDICINE, OB/GYN, ETC.  USAGE Unlimited North America Print (INCLUDING JAMA AND THE NEW ENGLAND JOURNAL OF MEDICINE) and Worldwide Internet for one year Options: to be paid at time of need -Unlimited North America Collateral for one year -Unlimited North America Outdoor/OOH for one year  PAYMENT: $2500 FLAT AND A NEW SAMSUNG PHONE WITH SPECIAL FEATURES SPECIFIC TO THE MEDICAL COMMUNITY.  SHOOT DATE:  FRIDAY OCTOBER 8th  OTHER NEEDS: MUST BE A NYC DOC. > 1   Available on Friday, Oct 8 to shoot > 2   Will agree to  endorse and use the Samsung product > 3   Will agree to let his real name be used in the advertisement. > 4   Will agree to let us shoot in his office if needed.  The idea is to shoot him in a location that he actually spends time in ..his office, the park or restaurants he eats lunch in, the way he gets to work..Etc..he should know we will want to immediately location scout his \"places\" once we cast him.  SEND THE DOCTOR'S NAME, AGE, HEIGHT. WEIGHT, PRACTICE, BIO, LOCATION OF PRACTICE AND A  PHOTO TO BRENDA DELLA CASA AT CASTINGLOLA@YAHOO.COM NO LATER THAN TUESDAY, SEPTEMBER 28, 2004 AT NOON.    THIS IS A HUGE OPPORTUNITY.\n\n",
    "posted_time": "Post  by castinglola » Sun Sep 26, 2004 3:51 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5617&sid=cc2d08403f97bea715da83d5342b5404#p5617"
  },
  {
    "author": "Carolyn Merritt, LPN  Nurse Posts: 141 Joined: Sun Sep 19, 2004 12:36 am Location: Northern California USA",
    "title": "[no title]",
    "content": "Do you have any need for a nurse with flaming red hair?\n\n",
    "posted_time": "Post  by Carolyn Merritt, LPN » Mon Sep 27, 2004 6:00 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5640&sid=cc2d08403f97bea715da83d5342b5404#p5640"
  },
  {
    "author": "LinaMarie520  Guest Posts: 1 Joined: Thu Aug 26, 2004 1:26 pm Location: Portland",
    "title": "Need some job questions answered by any medical professional",
    "content": "I am a medical student at WBC.  I was hoping there was any medical profesional out there who would be willing to give me a few moments of their time.  I need 10 questions answered about your job.  This project is for my Career class and is due on September 9.  Any help would be greatly appreciated.  Thank you, LinaMarie\n\n",
    "posted_time": "Post  by LinaMarie520 » Thu Aug 26, 2004 1:37 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=4880&sid=cc2d08403f97bea715da83d5342b5404#p4880"
  },
  {
    "author": "Carolyn Merritt, LPN  Nurse Posts: 141 Joined: Sun Sep 19, 2004 12:36 am Location: Northern California USA",
    "title": "[no title]",
    "content": "I sure am sorry we didnt make it in time for your class project.    Give us another chance? Regards, Carolyn\n\n",
    "posted_time": "Post  by Carolyn Merritt, LPN » Sat Sep 25, 2004 5:34 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5588&sid=cc2d08403f97bea715da83d5342b5404#p5588"
  },
  {
    "author": "cassgiff  Guest Posts: 1 Joined: Wed Sep 01, 2004 3:39 pm Location: Boston",
    "title": "HHHEELLLP!",
    "content": "What is the name of the disease/syndrome, that prohibits physical maturation?  Have seen many times on television, but don't know the official name.  If you know please e-mail me at cassgiff@aol.com.  I'm not very computer-literate, and may never find this site again.  Thanks,  Cass\n\n",
    "posted_time": "Post  by cassgiff » Wed Sep 01, 2004 3:52 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5026&sid=cc2d08403f97bea715da83d5342b5404#p5026"
  },
  {
    "author": "Carolyn Merritt, LPN  Nurse Posts: 141 Joined: Sun Sep 19, 2004 12:36 am Location: Northern California USA",
    "title": "[no title]",
    "content": "In response to your question of what is the name of the disease that causes growth retardation.  There are several.  Here are the names of some of them: Human Growth Hormone Deficiency Cushing's Syndrome Hypothyroidism Nutritional Short Stature Intrauterine Growth Retardation Russell Silver Syndrome Achondroplasia  My guess is that what you are looking for is Cushing's Syndrome. Hope this helps. Regards Cmmerritt  P.S.  I emailed this personally to you per your request.\n\n",
    "posted_time": "Post  by Carolyn Merritt, LPN » Sat Sep 25, 2004 5:30 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5587&sid=cc2d08403f97bea715da83d5342b5404#p5587"
  },
  {
    "author": "luna  Guest Posts: 1 Joined: Wed Mar 03, 2004 6:51 am Location: France",
    "title": "master or phd",
    "content": "I have a bachelor of science in general engineering major in networking, & I am interested in continuing my studies in sth related to medecine, any suggestions?\n\n",
    "posted_time": "Post  by luna » Wed Mar 03, 2004 6:55 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2690&sid=cc2d08403f97bea715da83d5342b5404#p2690"
  },
  {
    "author": "Carolyn Merritt, LPN  Nurse Posts: 141 Joined: Sun Sep 19, 2004 12:36 am Location: Northern California USA",
    "title": "[no title]",
    "content": "Hello Luna: You didn't say whether you planned on going into medicine or whether you just wanted to learn about it.  From my own experience I would say that just taking a few courses would not be of much benefit to you in your career if you don't plan on going into medicine or a field of Allied Health.  If you are considering Medicine as a profession I think it would be beneficial to spend time volunteering at a  hospital or other facility where you could see first hand what goes on to determine if this is really something you want to spend your time studying. Any career in the medical field relies heavily on the study of Anatomy and Physiology. After that an in-depth study of Pharmacology would be the next course I would take. These courses are a far cry from networking.  Are you thinking of changing your major? CmMerritt\n\n",
    "posted_time": "Post  by Carolyn Merritt, LPN » Sun Sep 19, 2004 7:37 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5423&sid=cc2d08403f97bea715da83d5342b5404#p5423"
  },
  {
    "author": "Juztice  Guest Posts: 1 Joined: Fri Jul 02, 2004 5:49 pm Location: colorado",
    "title": "Reporting a doctor for abuse?",
    "content": "A friend of mine is wondering how she would go about reporting her doctor for being abusive.  I didn't get any details, would someone know how to go about reporting this?  Thanks ~J\n\n",
    "posted_time": "Post  by Juztice » Fri Jul 02, 2004 5:51 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3930&sid=cc2d08403f97bea715da83d5342b5404#p3930"
  },
  {
    "author": "Dr. Russell M  Medical Doctor Posts: 650 Joined: Mon Jun 09, 2003 12:34 pm Location: USA",
    "title": "[no title]",
    "content": "Hi!  Why can't your friend report to the police or consult a lawyer or better still report to the hospital/clinic the doctor is attached to?  bill\n\n",
    "posted_time": "Post  by Dr. Russell M » Sun Jul 11, 2004 1:13 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=4026&sid=cc2d08403f97bea715da83d5342b5404#p4026"
  },
  {
    "author": "medic3  Guest Posts: 3 Joined: Sat Mar 27, 2004 2:47 am Location: canada",
    "title": "facial pain",
    "content": "hi all i am new to this site and am looking for the specific medical term for facial pain.  my pain specialist told me once and i have since forgotten but need to find out what the term is for some research i am doing.  i am a paramedic but this is not a term frequently used in prehospital care.   i have searched many internet sites to no avail !!!  if anyone knows the term i am looking for, please email me at ema3@canada.com     thank you all in advacne for your help, it is muchly appreciated    medic3 (tanya)\n\n",
    "posted_time": "Post  by medic3 » Sat Mar 27, 2004 2:54 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2930&sid=cc2d08403f97bea715da83d5342b5404#p2930"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Facial pain",
    "content": "Dear Tanya,  Was it trigeminal neuralgia?  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Sat Mar 27, 2004 11:47 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2937&sid=cc2d08403f97bea715da83d5342b5404#p2937"
  },
  {
    "author": "medic3  Guest Posts: 3 Joined: Sat Mar 27, 2004 2:47 am Location: canada",
    "title": "facial pain",
    "content": "dr. mokhtar  thank you for your reply, unfortunately it is not the term.  however, after thinking about it more, i feel i was somewhat vague with just 'facial pain', perhaps if i share more details someone will know the term i am looking for  the facial pain i am speaking off occurs when i have a migraine, my face is extremely sesitive, so much so that if anything  touches my face, it causes immense pain.  even the lightest touch with something soft can be excruiating.  sometimes it feels as though my face is on fire when it is touched.  the pain specialist i saw said for some people it can be like this even when they don't have a migraine, for others (like me) it occurs in conjunction with a migraine.  the word i am looking for is the medical terminology for this condition  thank you in advacne for any help  tanya  ps  dr. mokhtar, i have been a paramedic for almost 9 years and i would never attempt to 'practice' intubation, the advice you gave in february was right on.  (i can only imagine how that girl will do in medical school or on the road as a paramedic !!)\n\n",
    "posted_time": "Post  by medic3 » Sat Mar 27, 2004 1:01 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2939&sid=cc2d08403f97bea715da83d5342b5404#p2939"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Facial pain",
    "content": "Dear Tanya,  Is it \"cephalalgia\" or did it sound french like \"tic doulereux\"?  And regarding the intubation practice, there are models (dummies) to practice on but there is nothing like the real thing. Of course, it should never be practiced on alive healthy awake people without an indication for intubation.  One of the ways of practicing which is known is to practice on dead bodies and there are certain hospitals who have policies regarding this and they have to take the consent of the family of the deceased which allows the medical personel to practice such procedures. One of the ways to practice intubation is to go to the operating room but this is more of a controlled environment.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Sat Mar 27, 2004 6:53 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2945&sid=cc2d08403f97bea715da83d5342b5404#p2945"
  },
  {
    "author": "medic3  Guest Posts: 3 Joined: Sat Mar 27, 2004 2:47 am Location: canada",
    "title": "[no title]",
    "content": "hi  i finally found the word i was looking for, i was at the pain specialist yesterday and i wrote it down so as not to forget.  the word for the facial pain is 'allodynia'  it is defined as 'a non painful stimuli that evokes pain' (not exactly word for word, sorry)  another term he gave me was  'hyperalgesia' (i think that is it, can't read his writing, it is not very clear!!!)  it is increased skin sensitivity to touch  if anyone has any further info or comments, feel free to email or post  thanks for your help  tanya\n\n",
    "posted_time": "Post  by medic3 » Thu Apr 08, 2004 11:14 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3047&sid=cc2d08403f97bea715da83d5342b5404#p3047"
  },
  {
    "author": "Krnoto55  Guest Posts: 4 Joined: Fri Mar 12, 2004 6:38 pm Location: Maryland, USA",
    "title": "Visiting your Doctor",
    "content": "I just joined this website.  I've been reading through the posts and I'm horrified at what some of you are posting.  If I had some of your symptoms I'd be visiting my personal Doctor for an evaluation.    Many replies are site Doctors advising posters to visit your Doctor.  Have you?  I'm curious if you found an answer to your inquiry, yet there are no futher follow-up postings.    From what I've read, this site is not a substitute for visiting your Doctor in the flesh.  All I can say is go visit your Doctor if you have any out of the ordinary symptoms.  Don't depend on the Doctors on this board.  They can only advise you based on the detail wording of your posting.  That is it.    I wish you all relief of your medical problems, so please if you think your condition warrants questioning a physician, please go see one.  thank you,  Ken\n\n",
    "posted_time": "Post  by Krnoto55 » Sat Mar 13, 2004 1:52 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2757&sid=cc2d08403f97bea715da83d5342b5404#p2757"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Visiting your doctor",
    "content": "Dear Ken,  Thank you very much for using our website.  You are right.  There is no substitute for visiting one's own personal physician.   Some of the posts here on the website are patients who already saw their physicians and want a second opinion, some of them need support, i feel sometimes that some of the patients just want to get the load off their chests.   Sometimes, you will notice that some of the posters will mention that they don't have insurance or some of them like the patients in the United Kingdom don't have access to their doctors for a regular non-emergency visit except after a few months because of how the health system is constructed over their so instead of waiting and do nothing why not get an opinion from here or there.   There are few patients who give feed back on the website but i wonder about the other patients that don't give any feed back.  My explanation is that people nowadays like to talk to computers more than humans, no wonder, we are now living in the digital world era.  Once more, thank you very much for using our website http://doctorslounge.com and waiting for more of your posts.  Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Mon Mar 15, 2004 4:12 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2793&sid=cc2d08403f97bea715da83d5342b5404#p2793"
  },
  {
    "author": "soirse  Guest Posts: 11 Joined: Fri Feb 27, 2004 7:14 am Location: ireland  Contact:   Contact soirse       Website",
    "title": "Ken's remarks",
    "content": "Ken,  There are people that don't go to see their doctors for many reasons and a resource like this is invaluable. If you have taken the time to read enough of the messages posted you will see there are cases that this board has prevented someone from becomaing seriously ill or worse.  Aside from anything else, every doctor on this board in every message I have read always insists on users going to thier GP should the symptoms suggest something serious. did you know in the UK and Ireland combined there is in excess of 350 million UK pounds wasted on pointess visits to the doctor?  And also, if you aren't a GP which i suspect you aren't qualified to comment.  I appreciate your remarks but do not agree that this board dissuades people from visiting their doctor. In fact, I firmly believe it to be quite the contrary.  Kind regards,  Egan\n\n",
    "posted_time": "Post  by soirse » Mon Mar 15, 2004 5:39 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2796&sid=cc2d08403f97bea715da83d5342b5404#p2796"
  },
  {
    "author": "douggage  Guest Posts: 3 Joined: Thu Feb 12, 2004 3:31 pm Location: Atlanta",
    "title": "International Medical Schools",
    "content": "Looking for any kind of information on intrnational medical schools...can you help?  Thanks in advance, Douglas\n\n",
    "posted_time": "Post  by douggage » Thu Feb 12, 2004 3:48 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2486&sid=cc2d08403f97bea715da83d5342b5404#p2486"
  },
  {
    "author": "Dr. Russell M  Medical Doctor Posts: 650 Joined: Mon Jun 09, 2003 12:34 pm Location: USA",
    "title": "[no title]",
    "content": "Hi!  What is this international medical school?\n\n",
    "posted_time": "Post  by Dr. Russell M » Sat Feb 14, 2004 7:12 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2502&sid=cc2d08403f97bea715da83d5342b5404#p2502"
  },
  {
    "author": "douggage  Guest Posts: 3 Joined: Thu Feb 12, 2004 3:31 pm Location: Atlanta",
    "title": "Need more information",
    "content": "I am looking to attend any international medical school and need information about finding one.  Specifically international medical schools that have US connections.  Any information would be greatly appreciated and very helpful to me with pursuing my medical degree.   Thanks Bill  Doug\n\n",
    "posted_time": "Post  by douggage » Sat Feb 14, 2004 2:17 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2503&sid=cc2d08403f97bea715da83d5342b5404#p2503"
  },
  {
    "author": "Dr. Russell M  Medical Doctor Posts: 650 Joined: Mon Jun 09, 2003 12:34 pm Location: USA",
    "title": "[no title]",
    "content": "Hi!  Did you check this site?  Click here!\n\n",
    "posted_time": "Post  by Dr. Russell M » Sun Feb 15, 2004 7:14 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2525&sid=cc2d08403f97bea715da83d5342b5404#p2525"
  },
  {
    "author": "douggage  Guest Posts: 3 Joined: Thu Feb 12, 2004 3:31 pm Location: Atlanta",
    "title": "International Medical Schools",
    "content": "Hi Bill,  This is a broken link you sent me.  Can you re-send it or let me know where you went to search.  Thanks, Doug\n\n",
    "posted_time": "Post  by douggage » Mon Feb 16, 2004 11:09 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2538&sid=cc2d08403f97bea715da83d5342b5404#p2538"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "I've corrected the link.. works fine now. That was my faulty editing .. again.. my apologies to the both of you!\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Mon Feb 16, 2004 12:38 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2541&sid=cc2d08403f97bea715da83d5342b5404#p2541"
  },
  {
    "author": "John Hart  Guest Posts: 2 Joined: Sat Jan 31, 2004 4:54 pm Location: Greenville",
    "title": "self-limited diseases",
    "content": "I would like to poll the medical and osteopathic physicians on board here, and ask what the term \"self-limited disease\" means to them.  Does it mean any of the following?  A. a disease that generally will go away on its own and therefore generally does not require treatment.  B. a disease that generally will go away on its own but treatment may speed up the recovery.   C. a disease that is unaffected by treatment and may or may not go away on its own.   Thank you for your time!  John Hart, D.C. jhartdc@yahoo.com\n\n",
    "posted_time": "Post  by John Hart » Sat Jan 31, 2004 5:08 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2355&sid=cc2d08403f97bea715da83d5342b5404#p2355"
  },
  {
    "author": "Dr. Russell M  Medical Doctor Posts: 650 Joined: Mon Jun 09, 2003 12:34 pm Location: USA",
    "title": "[no title]",
    "content": "Hi!  I would go for B. But I could be wrong. Do you know the right answer?\n\n",
    "posted_time": "Post  by Dr. Russell M » Wed Feb 04, 2004 2:43 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2385&sid=cc2d08403f97bea715da83d5342b5404#p2385"
  },
  {
    "author": "John Hart  Guest Posts: 2 Joined: Sat Jan 31, 2004 4:54 pm Location: Greenville",
    "title": "self limited diseases",
    "content": "Bill,  I don't know the correct answer.  I also thought it was answer \"B\" but I've heard it defined differently from different sources.\n\n",
    "posted_time": "Post  by John Hart » Wed Feb 04, 2004 9:29 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2392&sid=cc2d08403f97bea715da83d5342b5404#p2392"
  },
  {
    "author": "Shamina",
    "title": "Obstructive jaundice",
    "content": "what are the differential diagnosis of obstructive jeaundice?\n\n",
    "posted_time": "Post  by Shamina » Mon Apr 14, 2003 5:02 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=639&sid=cc2d08403f97bea715da83d5342b5404#p639"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Dear Shamina; You can find detalis for obstuctive jaundice in these two sites  First site Second site  hope you find the informtion you need thanks\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Sun May 18, 2003 12:28 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=750&sid=cc2d08403f97bea715da83d5342b5404#p750"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Dear shamina, you can find also very useful informations in this site about jaundice  Click here!  Good luck\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Sun May 18, 2003 12:36 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=751&sid=cc2d08403f97bea715da83d5342b5404#p751"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "Jaundice",
    "content": "Actually how about: The Doctor's Lounge Jaundice information\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Sun May 18, 2003 6:14 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=753&sid=cc2d08403f97bea715da83d5342b5404#p753"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "yes, sure why not\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Mon May 19, 2003 2:23 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=757&sid=cc2d08403f97bea715da83d5342b5404#p757"
  },
  {
    "author": "mooseshu04",
    "title": "henoch-schoenlein",
    "content": "Im doing a report for a physio class and was wondering if anyone could tell me how immunoglobulin A is responsible for the onset of Henoch-Schoenlein purpura. Thanks!\n\n",
    "posted_time": "Post  by mooseshu04 » Fri May 02, 2003 11:29 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=681&sid=cc2d08403f97bea715da83d5342b5404#p681"
  },
  {
    "author": "Dr. A. Rajput  Medical Doctor Posts: 74 Joined: Fri Apr 11, 2003 10:16 pm Gender: Male Location: India  Contact:   Contact Dr. A. Rajput       Yahoo Messenger",
    "title": "HENOCH-SCHOENLEIN PURPURA",
    "content": "Allergen(drugs,food,insect bite,intection,vaccination etc)##> stimulation##>elevated IgA levels -> IgA-mediated vasculitis in small vessels of involved organs -> necrotizing vasculitis##>HENOCH-SCHOENLEIN PURPURA    Mechanism of vasulitis:- *deposition of IgA-containing immune complexes with subsequent activation of complement leads to a vasculitis  *biopsy of an acute skin lesion reveals an aseptic vasculitis with fibrinoid necrosis of vessel walls and perivascular cuffing of vessels\n\n",
    "posted_time": "Post  by Dr. A. Rajput » Fri May 02, 2003 8:15 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=682&sid=cc2d08403f97bea715da83d5342b5404#p682"
  },
  {
    "author": "music  Guest Posts: 1 Joined: Sat Mar 22, 2003 11:58 am",
    "title": "effects of music",
    "content": "I was wondering if i could ask you a few questions about music and medicen\n\n",
    "posted_time": "Post  by music » Sat Mar 22, 2003 12:06 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=553&sid=cc2d08403f97bea715da83d5342b5404#p553"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "dear guest; you can ask whatever you want in medicine and we hope we will be able to find you an answer. thanks for using http://www.doctorslounge.com\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Tue Mar 25, 2003 3:41 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=565&sid=cc2d08403f97bea715da83d5342b5404#p565"
  },
  {
    "author": "NadiaC  Guest Posts: 1 Joined: Sun Mar 23, 2003 12:27 am",
    "title": "Doctor Questions",
    "content": "Hello, I am currently doing a project for school about doctor's fields of specialty and I was wondering whether some soctors could answer some questions. Thank you in advance.  ___________ 1. What is your field of specialty?  2. Which medical school did you attend?  3. What do you believe to be the most rewarding aspect of your job?  4. Was medical school the hardest part in the process of becoming a doctor?  5. Contrarily, what do you consider to be the worst aspect of your job?  6. How did you become interested in becoming a doctor? Also, what drew you yo choose your field of specialty?  7. What is unique about your specialty field when compared to other specialties, in other words what sets your specialty apart from the rest?  8. What would you change about your field of specialty if you could.  9. What is your advice for students who want to become doctors?\n\n",
    "posted_time": "Post  by NadiaC » Sun Mar 23, 2003 1:33 am",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=559&sid=cc2d08403f97bea715da83d5342b5404#p559"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "yes Nadia why not we hope we can help you. for question number 1-oncology is my speciality 2- faculty of medicine; cairo university 3- the most rewarding aspect in our career is to be able to give the patient the right proper care he needes . this is for sure will be translated by the trust pateints and their families give to us so you will see the smile, satisfaction and hope in thier eyes once they know you are arround. 4-no the medical school was nt the hardest at all , the hardest comes with time which is how to manitain your skills and to upgrade your informations and knowledge. 5- the worest aspect is that sometimes we need to be awake 24 hours or more if possible to catch what is coming up. so it is not easy to take rest and there is no stop. 6-i became intersested to be a doctor coz i ve had my grandma with a chronic disease that neccesitate follow up with doctors for so long.then come my parents who wished me to be a doctor. and for this speciality i felt stick, sympathy to this type of pateints. 7-every speciality has it s own stigma for mine it is a combination of general medicine and onclogy also we share some other branches in medicine like biology,farmaclogy etc. thanks for using website http://www.doctorslounge.com\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Tue Mar 25, 2003 3:34 pm",
    "category": "Medical Students",
    "sub_category": "Miscellaneous Student Topics",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=564&sid=cc2d08403f97bea715da83d5342b5404#p564"
  }
]