[
  {
    "author": "iahching  Guest Posts: 3 Joined: Sat Oct 13, 2007 11:35 pm",
    "title": "Protein Level Results in Blood test",
    "content": "I am 50years old and about 3months ago, I was referred to Oncologist because I had elevated protein level. At the time Oncologist said IGA protein and advised 1200. I had Bone Marrow Biopsy which only showed abnormal plasma cells but no cancer. CT Scan, Xrays all came out normal. I repeated the Serum Protein Electrophesis and Oncologist said it went up to 1500 and he will monitor for MM but nothing he can do for me right now, but he says, he is concern. What does all this mean for me. I am confused. I am nauseated all the time, dizziness, constipated and within the last 2 weeks developed foamy urine. Please help.\n\n",
    "posted_time": "Post  by iahching » Sun Oct 14, 2007 12:02 am",
    "category": "Oncology",
    "sub_category": "Multiple Myeloma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=48935&sid=fad5416b47776deb5afacb4360396009#p48935"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Iahching,  I suspect your doctor is just as frustrated as you are.  Occasionally, we have patients where we know something is going on but we can't \"prove\" it.  In your case, the elevated IgA protein levels and the abnormal plasma cells signal that there is something going on.  It sounds like the problem is that at this point a firm diagnosis cannot be made.  Because of this, a proper treatment cannot be chosen so the best thing to do is continue to follow up very closely with your doctor and wait for signs to appear that can make a definite diagnosis.   Close follow up is crucial so that the diagnosis can be made as early as possible.    Your foamy urine is likely due to increased protein levels in the urine.  Best wishes and I hope you are able to figure this out soon.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Wed Oct 17, 2007 5:44 pm",
    "category": "Oncology",
    "sub_category": "Multiple Myeloma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=49075&sid=fad5416b47776deb5afacb4360396009#p49075"
  },
  {
    "author": "iahching  Guest Posts: 3 Joined: Sat Oct 13, 2007 11:35 pm",
    "title": "Multiple Myeloma",
    "content": "What is the level of iga protein to start or consider chemo treatment so I can be prepared?  Please advise and thank you\n\n",
    "posted_time": "Post  by iahching » Sun Oct 21, 2007 9:38 pm",
    "category": "Oncology",
    "sub_category": "Multiple Myeloma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=49284&sid=fad5416b47776deb5afacb4360396009#p49284"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "This is a very individualized answer.  I think it is unlikely that any particular level of IgA would be an indication to start chemotherapy.  Instead, I suspect that your doctor will want to monitor the IgA level in addition to other possible symptoms of multiple myeloma to help make a decision.  If more symptoms begin to appear it is likely your doctor will want to begin treatment.  These situations can be very difficult.  Hang in there.  I wish you the best.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sun Oct 21, 2007 10:32 pm",
    "category": "Oncology",
    "sub_category": "Multiple Myeloma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=49294&sid=fad5416b47776deb5afacb4360396009#p49294"
  },
  {
    "author": "iahching  Guest Posts: 3 Joined: Sat Oct 13, 2007 11:35 pm",
    "title": "Re: Protein Level Results in Blood test",
    "content": "I had blood transfusion about a year ago due to severe anemic for about 6 months. About a month after I started the transfusion I developed a rash on my right foot inside my ankle and it spread around the front part of my foot. Then my left foot started. The tip of my pointer finger right hand developed a dry skin rash and it spread to the base of my finger and then to my thumb on the same hand. My left leg inside from my ankle to below my knee started and then my right arm only on the outside from the middle of my hand, over the elbow and up my arm. Then it started on my left upper back on my left shoulder. And most recently after a Biopsy done on my right arm, it started on my right forearm and up my neck in the back on the left side from my left shoulder and also on my right leg from inside my ankle to just below my knee. I had taken multiple types and doses of Antibiotics, Creams, Steroidal Creams, Fungus, Steroids orally and nothing worked. Over the year, it progressed to the different areas as I mentioned and over the year I was referred by my Oncologist back to my regular doctor to find out if there is anything else going on with me. After referrals and referrals over the whole year between  Dermatologist, to an Allergist and to another Dermatologist, and a Biopsy, it was diagnosed today that it was a Blood Allergy and possibly relating to MM and now I am referred right back to my Oncologist. I was advised by the Dermatologist today there is no medicine to cure it except Steroids only to try and make me comfortable , a month supply and Aquaphor to soothe my body. I am very frustrated and confused that it took a year between the different specialists and then to tell me it is an internal blood matter and there is nothing to cure it. The skin reaction on these various parts of my body all look different and doctor said it is because its a blood disease. Some areas have a rash form, my legs have more of red bumps all over, my fingers and thumbs have very dry cracked and pulling my skin. Do you have any comments about all this to make me understand why and what is happening to me. The Dermatologist and the Allergist both confirmed that I have no allergy, nor Skin infection or disease or Skin Cancer but has to do with my blood. Please help with some explanation and information. Help please. Thank you very much.\n\n",
    "posted_time": "Post  by iahching » Sat Feb 02, 2008 1:37 am",
    "category": "Oncology",
    "sub_category": "Multiple Myeloma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=53500&sid=fad5416b47776deb5afacb4360396009#p53500"
  },
  {
    "author": "JKF  Guest Posts: 51 Joined: Thu Jan 19, 2006 11:08 am Location: Missouri",
    "title": "Re: Protein Level Results in Blood test",
    "content": "I have elevated levels of protein in my blood, not terribly high but enough to be tested every six months. Anyway now I have a lump that is by my neck on my collarbone. It is growing and I am scheduled for a cat scan.Do you think the blood protein and the lump could be related. Thank you JKF\n\n",
    "posted_time": "Post  by JKF » Wed Sep 09, 2009 1:56 pm",
    "category": "Oncology",
    "sub_category": "Multiple Myeloma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=82251&sid=fad5416b47776deb5afacb4360396009#p82251"
  },
  {
    "author": "payton49  Guest Posts: 1 Joined: Tue Feb 10, 2009 3:04 am Gender: Female",
    "title": "Myeloma in the brain......",
    "content": "My freind has just been told that the Myeloma has gone to her brain. The doctor is going to give her chemo via a lumber puncture. Can anyone give me any information on Myeloma in the brain and what we can expect. Thank you\n\n",
    "posted_time": "Post  by payton49 » Tue Feb 10, 2009 3:07 am",
    "category": "Oncology",
    "sub_category": "Multiple Myeloma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=70731&sid=fad5416b47776deb5afacb4360396009#p70731"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "Re: Myeloma in the brain......",
    "content": "Hello,  I hope your friend is doing well. Central Nervous System (CNS) involvement with multiple myeloma is extremely rare. It is diagnosed by finding malignant plasma cells in the spinal fluid by lumbar puncture. This is usually ordered after a patient with myeloma presents with CNS symptoms that are suspicious.   Usually these patients have advanced disease and various chromosomal abnormalities such as del 13q and p53 mutations. These abnormalities confer poor prognosis.  Unfortunately, there are two few cases to draw general conclusions about what may happen to your friend but most of these cases have been treated with CNS directed therapy (eg, intrathecal chemotherapy) as well as bone marrow transplants.  Sadly, most of the cases reported in the literature do not do well altogether. However, like I said there are too few of those and any generalization would be stated with caution.  Good luck!\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Fri Mar 20, 2009 1:47 pm",
    "category": "Oncology",
    "sub_category": "Multiple Myeloma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=71470&sid=fad5416b47776deb5afacb4360396009#p71470"
  },
  {
    "author": "dgaito  Guest Posts: 1 Joined: Mon Aug 13, 2007 7:55 am",
    "title": "Multiple Myeloma life expectancy",
    "content": "What it the average life expectancy for an otherwise healthy 62 year-old male with Stage 1 Multiple Myeloma.  He was diagnosed in June 2007 and has just started a treatment of a steroid once a week combined with a daily dosage of a derivative of thalidomide (forgot the name of the drug - starts with an R).  I believe that 30% of his bone marrow is affected, according to the bone marrow biopsy.\n\n",
    "posted_time": "Post  by dgaito » Mon Aug 13, 2007 8:06 am",
    "category": "Oncology",
    "sub_category": "Multiple Myeloma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=46232&sid=fad5416b47776deb5afacb4360396009#p46232"
  },
  {
    "author": "Debbie Miller, RN  Nurse Posts: 4746 Joined: Mon Apr 16, 2007 2:41 pm Gender: Female Location: USA",
    "title": "[no title]",
    "content": "It would be best to discuss this with the oncologist.  Every patient is different so while some have a fast progression; others live longer and an average is the best you could come up with.  This would also take into account all patients, healthy and otherwise.  The type of treatment the patient receives would also affect the life expectancy.  So, helpful statistics here would be hard to come up with.  According to the American Association of Family Practice Physicians, \"Multiple myeloma has a general median survival of three years.\"  Many factors would determine actual prognosis for the individual.   Best wishes\n\n",
    "posted_time": "Post  by Debbie Miller, RN » Wed Aug 15, 2007 3:27 pm",
    "category": "Oncology",
    "sub_category": "Multiple Myeloma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=46351&sid=fad5416b47776deb5afacb4360396009#p46351"
  },
  {
    "author": "Amy Thorne  Guest Posts: 1 Joined: Fri Dec 29, 2006 1:01 am",
    "title": "Left Supraclavicular Lymph Node",
    "content": "I am a 36 year old women, who had squamouscell carcinoma removed 18 months ago from my the right side of my tongue.  I have just discovered what I believe to be a swollen supraclavicular node on my left side.   I am concerned, based on what I have been reading on the internet.  My doctor however, isn't as concerned.  He thinks since it is on the opposite side, it is not a big deal.  What should I do?  Prod him to investigate more, or accept that I am being a hypochondriac and move on?  I have little to no pain, when touching the node, but have experienced some pain, prior to discovering the swelling on my left side in my upper chest area.  Thanks for your help.\n\n",
    "posted_time": "Post  by Amy Thorne » Fri Dec 29, 2006 1:13 am",
    "category": "Oncology",
    "sub_category": "Multiple Myeloma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=36913&sid=fad5416b47776deb5afacb4360396009#p36913"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Hello,  Abnormal Lymph node enlargement tends to commonly result from infection / immune response, cancer and less commonly due to infiltration of macrophages filled with metabolite deposits (eg, storage disorders).   Sometimes, following infection Lymph nodes occasionally remain permanently enlarged, though they should be non-tender, small (less the 1 cm), have a rubbery consistency and none of the characteristics described for malignancy or for infection.  An increase in nodal size on serial examinations is significant. Hence nodes that continue to grow in size are important and those that regress in size tend to be more reassuring.   Bilateral and contralateral metastases from lateral tongue cancers are uncommon bu occur. I advise you to follow up with your doctor.  Keep us updated. Best regards.\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Fri Dec 29, 2006 2:44 am",
    "category": "Oncology",
    "sub_category": "Multiple Myeloma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=36914&sid=fad5416b47776deb5afacb4360396009#p36914"
  },
  {
    "author": "esmith  Guest Posts: 1 Joined: Wed Jun 15, 2005 8:14 pm Location: MN",
    "title": "Identification of bone lesions",
    "content": "My mother has recently been diagnosed with multiple myeloma, and recently suffered a broken hip.  The orthopedist has suggested a bone scan of her body to try to  identify the locations of other bone lesions.  The oncologist has indicated that a bone scan will not be helpful.   Is there an effective tool - MRI, bone scan, X-ray, etc - for the identification of the location of bone lesions in a patient with multiple myeloma?  Thank you.\n\n",
    "posted_time": "Post  by esmith » Wed Jun 15, 2005 8:24 pm",
    "category": "Oncology",
    "sub_category": "Multiple Myeloma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=15200&sid=fad5416b47776deb5afacb4360396009#p15200"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Dear esmith,  The following tests are performed on the bone to check for bone lesions in cases of MM:    X-rays as well as other imaging procedures are used to diagnose bone defects and determine the site, the number and size of bone lesions.    -   Bone -skeletal- survey, (a series of x-rays of the skull, spine, arms, ribs, pelvis, and legs) is routinely done to all patients.   -    Other procedures include:        Magnetic Resonance Imaging (MRI),which gives detailed images of bone and soft tissue and of choice in studying lesions of the spinal cord.        Computerized axial tomography (CAT),  i also used to diagnosis bone and soft tissue lesions.  I hope that this information is helpful.   Best regards,\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Sun Jul 16, 2006 12:58 pm",
    "category": "Oncology",
    "sub_category": "Multiple Myeloma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=33464&sid=fad5416b47776deb5afacb4360396009#p33464"
  },
  {
    "author": "jenlyn95  Guest Posts: 1 Joined: Thu Sep 29, 2005 3:24 pm Location: Georgia",
    "title": "Confusions on new diagnosis",
    "content": "My grandfather (70yo) has just been diagnosed with MM.  Initially last week docs said they thought it was in the early stages but today when the bone marrow tests came back they said it was advanced.  I understand some about the disease but I would like to know how much time we have left with him.  They are starting him on Thalidomide.  He has Bence Jones.  His kidneys are only functioning at about 20%.  The docs have said that they will begin with the Thalidomide and then go to chemo if they see no results.  He has commented that he isn't sure if he is a candidate for any type of bone marrow transplant.  I have tried to pin point them down to a time line and I do understand that it is very difficult to do.  We would like to have some idea of what is ahead of us and what to expect.  I have small children and don't want to tell them anything until I have to but he is so weak right now I know they are going to start asking questions and although they don't need to know everything we all need to be prepared for what is ahead.  Are we looking at six months or six years.  We are just feeling very much in the dark right now.  Thank you for any help.\n\n",
    "posted_time": "Post  by jenlyn95 » Thu Sep 29, 2005 3:42 pm",
    "category": "Oncology",
    "sub_category": "Multiple Myeloma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=21913&sid=fad5416b47776deb5afacb4360396009#p21913"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Dear jenlyn95,  The 5-year survival rate for MM patients treated with conventional therapy is  20%-25% for those older than 65 years. About 30%-50% of  newly diagnosed multiple myeloma patients are expected to be unresponsive to chemotherapy.  The criteria for partial response are: ■ > 50% reduction in serum myeloma protein ■ > 90% reduction in Bence Jones protein. Criteria for complete response include: ■ disappearance of serum myeloma protein and Bence Jones protein by immunofixation ■ no monoclonal plasma cells in bone marrow.  Thalidomide (Thalomid) can be uses alone and in combination with dexamethasone as upfront therapy in newly diagnosed patients. Thalidomide Alone, produces 50% reduction in paraprote in 36% of patients; and in up to 72% when given in combination.  Thalidomide shows superior results compared to dexamethasone alone but comparable to VAD (vincristine, Adriamycin [doxorubicin], and dexamethasone).   Care should be taken with any symptoms suggestive of thrombotic complications since high rateof thrombosis was found in patients receiving this drug.  Other regimens used for treatment of newly diagnosed MM patients are: -VAD (vincristine, Adriamycin [doxorubicin], and dexamethasone). -MP The combination of melphalan and prednisone has been used over the past 30 years but they cause damage to bone marrow cells and affect the bone marrow reserve. -Pulse dexamethasone alone is commonly used in patients who are going to receive Radiation therapy.  In those who are resistant e can be offered one of the following therapies:   - Combination Chemotherapy.  High doses of alkylating agents, alone or in combination are proved to be effective in these patients.  Examples of these regimens are:  IV melphalan (70-100 mg/m2)  The combination of high-dose cyclophosphamide (Cytoxan,  Neosar) and etoposide.   - Novel agents have shown good activity in the disease control and studies on these drugs are still going on, these agents include:  IMiD Revimid thalidomide analog with immunomodulatory effects.  Proteasome inhibition Bortezomib  Arsenic trioxide (Trisenox)  I advise you to follow with her doctor and to trust his judgment since he seems to be very careful in providing her the best  treatment options.  Best regrads,\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Sun Jul 16, 2006 12:28 pm",
    "category": "Oncology",
    "sub_category": "Multiple Myeloma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=33463&sid=fad5416b47776deb5afacb4360396009#p33463"
  },
  {
    "author": "CEDWARDS  Guest Posts: 1 Joined: Wed Feb 08, 2006 11:12 am",
    "title": "Enlarged Testicles Multiple Myeloma",
    "content": "Hello, My father has Multiple Myeloma.  He was diagnosed about a year and a  half ago.  We were recently told that he is in the later stages now.  His kidneys are only functioning at 9% and he seems to get disoriented quite a bit.  Within the past few weeks his testicles have become very enlarged.  He is planning on mentioning it to his doctor.  I have two questions: 1) Why are the testicles becoming so enlarged 2) Does Multiple Myeloma turn into other cancers? Thank You.\n\n",
    "posted_time": "Post  by CEDWARDS » Wed Feb 08, 2006 11:17 am",
    "category": "Oncology",
    "sub_category": "Multiple Myeloma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=30216&sid=fad5416b47776deb5afacb4360396009#p30216"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Dear CEDWARDS,  Scrotal swelling are commonly due to extratesticular and intratesticular lesions.  Extratesticular lesions include: – Hydrocoele – Hernia – Epididymal cyst and spermatocoele – Varicocoele  Intratesticular lesions – Primary testicular tumour – Metastases, lymphoma and leukaemia – Testicular cysts and epidermoid cysts  Multiple myeloma is one of these cancers which can give metstatic lesions in the testis although not common.  US,  can distinguish between different causes of testicular and extratesticular origin, testicular tumors appear hypoechoic compared to normal testicular tissue. Focal or diffuse areas of homogeneous hypoechogenicity with sharply-demarcated intratesticular borders are the characteristic feature in some metastatic tumors like MM .  I advise you to follow up with his doctor for proper management.  Only by complete history, physical examination and investigations, the correct diagnosis can be reached.  Best regards,\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Sun Jul 16, 2006 11:56 am",
    "category": "Oncology",
    "sub_category": "Multiple Myeloma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=33462&sid=fad5416b47776deb5afacb4360396009#p33462"
  },
  {
    "author": "ohioles  Guest Posts: 1 Joined: Fri Nov 04, 2005 6:33 pm Location: Georgia",
    "title": "Options if chemo fails?",
    "content": "My 69 yr. old mother was diagnosed with MM 2 months ago. She was considered Stage II at diagnosis with a Beta 2 Micro level of 3.6 and albumin 3.9.  She has kappa light chain disease and has had arthritis for many years. She's had 2 cycles of doxil, vincristine and dexamethasone.  After the first cycle the doctor told us that she may only have to do 3 cycles since her numbers looked so good.  We were elated since she has been accepted for a autologous stem cell transplant in Atlanta (providing she is physically ready).  Two days ago, the doctor told her that he didn't like her protein numbers (kappa had gone from 9.54 before treatment, to 5.0 after first chemo, to 6.0 after second treatment.  Her total proteins are now 8.5, up from 8.0. She doesn't seem to have any kidney problems, but does have degenerated L3 & L4 disks with back pain when she's off the dex.  The dex also causes extreme difficulty with sleeping.  She's taken 8 different sleep meds but has finally settled on Remeron 30mg with about 1 1/2-2mg of xanax per night and this gives her from 4-6 hours of sleep.  I left my teaching job to help dad care for mom and we are now feeling very anxious about everything.  Can you tell me what our options might be if this chemo treatment fails?  Are there other combinations she could try?  Do we then go to some of the newer drugs like Velcade or Revlimid or what??   I thought Emory said they would consider doing a transplant even if a person wasn't in remission...is this possible??  Originally the doctors gave us the impression that mom probably had 3-7 years to live with the new advances happening in this area but now we just feel confused and frankly, frightened.   Any information you would be willing to share would be greatly appreciated!!  Thanks\n\n",
    "posted_time": "Post  by ohioles » Fri Nov 04, 2005 6:54 pm",
    "category": "Oncology",
    "sub_category": "Multiple Myeloma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=24562&sid=fad5416b47776deb5afacb4360396009#p24562"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Dear ohioles,  The 5-year survival rate for MM patients treated with conventional therapy is  20%-25% for those older than 65 years. About 30%-50% of  newly diagnosed multiple myeloma patients are expected to be unresponsive to chemotherapy.  The criteria for partial response are: ■ > 50% reduction in serum myeloma protein ■ > 90% reduction in Bence Jones protein. Criteria for complete response include: ■ disappearance of serum myeloma protein and Bence Jones protein by immunofixation ■ no monoclonal plasma cells in bone marrow.  In those who are resistant to VAD- combination chemotherapy Like in her case can be offered one of the following therapies:  - Combination chemotherapy. High doses of alkylating agents, alone or in combination are proved to be effective in these patients. Examples of these regimens are: IV melphalan (70-100 mg/m2)  The combination of high-dose cyclophosphamide (Cytoxan, Neosar) and etoposide.  - Thalidomide is of role in treatment of  refractory/relapsed multiple myeloma,  and shows 50% reduction in paraprotein in almost 30% of patients. Remissions obtained are durable.  - Novel agents have shown good activity in the disease control and studies on these drugs are still going on, these agents include: IMiD Revimid  thalidomide analog with immunomodulatory effects. Proteasome inhibition Bortezomib Arsenic trioxide (Trisenox)  I advise you to follow up with her doctor for proper management.  Best regrads,\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Sun Jul 16, 2006 11:29 am",
    "category": "Oncology",
    "sub_category": "Multiple Myeloma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=33461&sid=fad5416b47776deb5afacb4360396009#p33461"
  },
  {
    "author": "Cammie  Guest Posts: 2 Joined: Sun Jan 29, 2006 1:03 pm Location: mississippi",
    "title": "Confused about diagnosis? MM or MGUS.",
    "content": "Dear Doctor, I am a 35 year old female. In 2005 I began seeing a rheumatologist for pain I was having in my back and ribs. She ran a few test wich included an ESR, CMP, and a immunoelectrophoresis. Everything came back normal except the immuno. electr. It showed a monoclonal gamopathy with a 2gram IGG peak. I in turn I was sent to a hematologist. He proceeded to do a bone marrow. The bone marrow showed 10% plasma cells in the marrow and 10-20% in the periphearal blood stream. With plasmacytes. The markers I can't remember off hand but they  leaned  toward MM. Expect for I didn't have chromosome 13.(I am writing this from memory). Now I get confused here. My first two check-ups after the reults my Dr. talked in terms of MGUS. Now this last visit he talked in terms of myeloma. He says nothing has changed.( I do not know my Beta-2 reults. As of Sept. 2005 no bence jones.) I still have four weeks befor I return. I know the ramifications of this disease I am MLT. I just want to know where I stand. Is this truely a smoldering myeloma or a MGUS. I need to know how to prepare. I have to small children. I plan on asking my Dr. more questions when I go back. Four weeks is a long time to wonder.  I also have no punch lesions. H&H normal. CA runs low. Albumin runs around 3.3, Total Protien around 7.6.   Thank you.\n\n",
    "posted_time": "Post  by Cammie » Tue Jan 31, 2006 7:15 pm",
    "category": "Oncology",
    "sub_category": "Multiple Myeloma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=29637&sid=fad5416b47776deb5afacb4360396009#p29637"
  },
  {
    "author": "Cammie  Guest Posts: 2 Joined: Sun Jan 29, 2006 1:03 pm Location: mississippi",
    "title": "I got my answers.",
    "content": "To whom it May Concern:  I went back on 2-28-06 for my 3 month eval. I talked with my Dr. at that time about my queston. I do have what is considred smoldering myeloma. My eletropherisis pattern is pretty much remaining stable. I only posted this to help others with the same questions I had.   cammie\n\n",
    "posted_time": "Post  by Cammie » Thu Mar 09, 2006 5:40 pm",
    "category": "Oncology",
    "sub_category": "Multiple Myeloma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=31847&sid=fad5416b47776deb5afacb4360396009#p31847"
  },
  {
    "author": "htowngal  Guest Posts: 2 Joined: Mon Oct 03, 2005 12:32 pm Location: houston",
    "title": "Dr asked mom to seek oncologist",
    "content": "My mother's rheumatologist told her she needed to speak with an oncologists as soon as possible because of outcomes of two blood tests. Both tests showed a M-spike (one test was done in July and the other in September) The test in July showed a small spike (?) while the test in September showed an increase in the spike.  She was not informed of the spike in July b/c the doctor felt that it was just age related (she is 63). Her sed rate was 30 in September. The pathologist suggested two other tests be completed : serum immunofixation or urine electrophoresis.  Do only oncologists perform these tests?   Side note: Her doctors have also found a growth in her liver and a growth on the outside of her liver and 6 or more nodules on her thyroid.  She is always tired, bruises easily, sick to her stomach and dizzy (to the point of falling over).  She also has occult blood in her urine   (is that normal?)  I guess I am looking for someone to tell me if I need to be concerned  and stay on her about the oncologist or if this is just a process of aging.     Any information is appreciated.\n\n",
    "posted_time": "Post  by htowngal » Mon Oct 03, 2005 1:06 pm",
    "category": "Oncology",
    "sub_category": "Multiple Myeloma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=22198&sid=fad5416b47776deb5afacb4360396009#p22198"
  },
  {
    "author": "htowngal  Guest Posts: 2 Joined: Mon Oct 03, 2005 12:32 pm Location: houston",
    "title": "Oh, one more thing",
    "content": "I posted this message here because they (her rheumatologist)  told her it was probably multiple myeloma\n\n",
    "posted_time": "Post  by htowngal » Mon Oct 03, 2005 1:09 pm",
    "category": "Oncology",
    "sub_category": "Multiple Myeloma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=22199&sid=fad5416b47776deb5afacb4360396009#p22199"
  },
  {
    "author": "Lexy Dacosta  Guest Posts: 1 Joined: Thu Sep 29, 2005 8:32 am Location: Ontario Canada",
    "title": "Signs of death from multiple myeloma",
    "content": "My mother is 73 years old and was diagnosed approximately 5 years ago with mulitple myeloma.  At that time, she refused most treatments including chemo and stem cell replacement.  Now, the doctors believe she is too frail and sickly to endure those treatments.  For the past year, her treatments have included radiation, pamidronate, and steroids and fentanal patch and morphine.  The doctors now believe her time is imminent and in fact as we speak she is in hospital.  Unfortunately our wonderful, caring doctors cannot pinpoint a time of death, and we understand this is not very easy or always accurate.  As her family though, what we are wondering is if there are certain signs that could clue us in to a more accurate timeframe.  We would like to have some time as a family to plan and prepare ourselves better and to just know. Currently her signs and symptoms are:  bad headaches, rattly sound in chest, hard time to breath, immense pain throughout, very swollen and discolored feet and legs, confusion, disorientation, immense weakness and fraility.  When given hydration, blood and pamidronate these signs get better for a few days to week and then return. Although I understand how difficult this question is looking for a more accurate timeframe for how long she may have left, I wonder if there is statistics or information that says generally patients with certain symptoms and/or signs have generally passed on within days, weeks, months of the start of these signs or symptoms. Please help this family.\n\n",
    "posted_time": "Post  by Lexy Dacosta » Thu Sep 29, 2005 8:51 am",
    "category": "Oncology",
    "sub_category": "Multiple Myeloma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=21886&sid=fad5416b47776deb5afacb4360396009#p21886"
  },
  {
    "author": "alex.hardcastle  Guest Posts: 3 Joined: Fri Feb 04, 2005 8:45 pm Location: Houston, Texas  Contact:   Contact alex.hardcastle       Website",
    "title": "Death and Dying",
    "content": "The process of death and dying is woefully ignored all too often at the clinical level. And if there is a way to answer your question with the certainty you seem to be looking for, it eludes me. Perhaps one of the other volunteers can offer their insight.  Bernie Siegel, MD, once told a large group of doctors in a conference setting that he would put up one-year of his salary against the one-year salary of any \"taker\" if the challenger could take a set of pathology reports from a cancer patient, and, predict within a 30-day window, either side of the actual date of demise, when the patient would die.  Despite there being about 200 well trained, experienced oncologists, hematologists and internal medicine specialists in the room, there was not a single taker. At that particular point in time, Dr. Siegel's salary ran to a seven-figure sum.  I have had a number of family membenrs tell me that they watched a loved one struggle against death, which is distinctly different that a patient struggling for life, until that person was told by family members that it was alright for them to pass on - after assuring them that it was, in essence, alright for them to die. Equally important though is the need to be mindful that an ill loved one must be supported in their decision to fight for their life.  If your mom has a living will, or any end-of-life type directives, and if she is truly incapable of making a decision about her wishes at this terribly straining moment, then family members are acting appropriately when they discuss the patient's wishes in this regard with the physician. Prolonging life functions for the mere sake of supporting bodily function is not always what the patient truly wants or even needs.  Having said that, let me hasten to add that hope is a cardinal emotion in all of us. Nothing should ever be done to quell the hope any patient at any time. If your mom is indeed trying to recover, perhaps even with the modest goal of just getting well enough to leave the hospital and pass away at home, I'd support her wholeheartedly in that, were she my mother.  In summary. patients described as being in a lot worse shape than you describe your mom have been known to recover, dramatically, and walk out of hospitals. Younger persons with fewer problems have been known to die without much warning.  I'd suggest listening carefully to your mother, get a good handle on her wishes, than support her as best you can.\n\n",
    "posted_time": "Post  by alex.hardcastle » Fri Sep 30, 2005 9:58 am",
    "category": "Oncology",
    "sub_category": "Multiple Myeloma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=21970&sid=fad5416b47776deb5afacb4360396009#p21970"
  },
  {
    "author": "lindah  Guest Posts: 1 Joined: Fri Oct 01, 2004 11:27 pm Location: Big Stone Gap, VA",
    "title": "Protein levels in Multiple Myeloma",
    "content": "I would like to have a better understanding of the elevated protein level associated with MM.  I know that it's more complicated than a simple blood test and involves light chains etc.  I was diagnosed a year ago and my protein level was 460.  Over a few months it escalated to 9,000.  I received radiation to the one tumor on my pelvis and it immediately dropped dramatically to 1,300.  It has, for the past 3 months, stayed below 200, even being as low as 86.  I thought I was in remission but was told no.  Amazingly, I don't  have any renal damage and even though I do recive Procrit shots off and on, my level has never been lower than 11.5 and I seem to be doing fine.  My biggest complaint is my weight gain.  I have gained nearly 50 pounds.  So, my questions are, what constitutes remission and is the weight gain abnormal?  Thanks so much.  Linda\n\n",
    "posted_time": "Post  by lindah » Fri Oct 01, 2004 11:41 pm",
    "category": "Oncology",
    "sub_category": "Multiple Myeloma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5725&sid=fad5416b47776deb5afacb4360396009#p5725"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Hello Lindah,  As you probably know multiple myeloma is a malignant disease of the plasma cells. The main function of these cells is to produce plasma proteins (immunoglobulins). Certain gene rearrangements lead to exessive production of plasma proteins via the malignant plasma cells leading to exess protein in blood and to many of the complications and manifestations of the disease.  As you respond to therapy (e.g. the radiotherapy you received) more malignant plasma cells die and this decreases the production of plasma proteins.  There are two types of complete remissions (CRs): a clinical CR and a molecular CR.   Criteria for clinical CR include disappearance of bony lesions in skeletal x-rays, normal plasma proteins, normal blood counts, normal electrophoresis and normal plasma cell rates on bone marrow examination.  Weight gain may be a result of therapy or due to renal affection (not in your case). Please get a lipid profile done to adjust your blood lipids and try to maintain a healthy diet if required.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Sat Oct 02, 2004 7:31 am",
    "category": "Oncology",
    "sub_category": "Multiple Myeloma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5733&sid=fad5416b47776deb5afacb4360396009#p5733"
  },
  {
    "author": "mbaldwin  Guest Posts: 1 Joined: Wed Apr 21, 2004 11:34 am Location: Biggar, Saskatchewan, Canada",
    "title": "Relapsed Multiple Myleoma",
    "content": "3 years ago my mother was diagnosed with Multiple Myleoma.  She underwent six months of chemotherapy, her cancer went into remission and her stem cells were harvested.  Unfortuantely, the chemo was hard on her lungs and she had to be on oxygen for 3 months following the harvest of stem cells.  The doctors decided not to go through with the stem cell transplant at that time.  The cancer was in remission for 2.5 years and has recently relapsed.  She am currently taking Dextramethosone (sp?) and has been told that the 'transplant team' will assess her capability of undergoing the stem cell transplant.  If the transplant is not possible (due to her lung capacity), we are told she has 6 months to a year left.  Is there any other clinical test drugs  which she can try or other treatments available? (such as thalidamide - which I've heard has been successful)  She is only 56 years old and is otherwise healthy, she's not quite ready to give up yet--and we don't really want to see her go yet.  Any responses are appreciated.  Thank you.\n\n",
    "posted_time": "Post  by mbaldwin » Wed Apr 21, 2004 11:40 am",
    "category": "Oncology",
    "sub_category": "Multiple Myeloma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3136&sid=fad5416b47776deb5afacb4360396009#p3136"
  },
  {
    "author": "Dr. Jeffrey Gordon  Medical Doctor Posts: 127 Joined: Sun Jan 05, 2003 5:22 pm",
    "title": "Myeloma",
    "content": "Thanks for your question here at The Doctor's Lounge.  Any information that I give you does not replace the expert advice from the doctors caring for your Mother.  IF a bone marrow transplantation cann be done, then there are several potential options available: low-dose thalidomide (with or without dexamethasone) has some activity; bortezomib is a new drug used to treat myeloma after other treatments have not worked; other chemotherapy drugs (I do not know what chemotherapy drugs were given to her before); clinical research trials studying new drugs.  My best to your Mother.\n\n",
    "posted_time": "Post  by Dr. Jeffrey Gordon » Sat Apr 24, 2004 6:41 pm",
    "category": "Oncology",
    "sub_category": "Multiple Myeloma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3178&sid=fad5416b47776deb5afacb4360396009#p3178"
  },
  {
    "author": "AngelB-",
    "title": "Multiple myloma",
    "content": "i have had 4+ pitting edema , shortness of breath, and fatigue.  R heart cath showed high output failure.  During hospitalization, found thymine low, elevated alk phos, c-reactive protein high, lambda light chain in 24 hour urine slightly elevated, normal ct scan of chest, abdomen.  microcyitc anemia, low thymine , hyperglobulinemia.  tested negative for lupus, cryoglobulinemia, 5-HIAA, hepatitis.  i have a stenosed kidney but bun and creat are normal.  didi have high creatin cleareance in 24 hr urine.  I have stumped three docs.  one has mentioned multiple myloma and amalydosis  but wants to wait until april to do a bone marrow and kidey biopsy and a fat plate biopsy?   I don't understand why wait?  should i get a second opinion?   he said we would wait to see if light chain still showed high? any comments?    I am a 32 year old white mother!! i need help. :roll:\n\n",
    "posted_time": "Post  by AngelB- » Thu Feb 20, 2003 10:43 pm",
    "category": "Oncology",
    "sub_category": "Multiple Myeloma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=391&sid=fad5416b47776deb5afacb4360396009#p391"
  },
  {
    "author": "Dr. Jeffrey Gordon  Medical Doctor Posts: 127 Joined: Sun Jan 05, 2003 5:22 pm",
    "title": "Light chain",
    "content": "Angel,  Heavy and light chains can appear in the blood due to primary disorders (multiple myeloma is an example) but these can also be elevated due to a reactive state caused by other unrelated illnesses or problems affecting the body.  The C-reactive protein can be elevated in a reactive state as well.  Light chains are cleared by the kidneys and thus can appear in the urine and not so much in the blood.  You do not mention if any specialized testing was done on the blood or the urine to determine if the light chains seen are monoclonal (such is the case in multiple myeloma, for example) or \"reactive\".  How elevated were the light chains in the urine?  Amyloidosis produces similar proteins, although it is a different disease than multiple myeloma.  Sometimes the two disorders overlap.  If the light chain is slightly elevated in the urine and no monoclonality to it is seen, then I would repeat it.  If the blood does not reveal any monoclonal proteins, then still one needs to check the urine since if a blood disorder were to be present, then it may just produce light chains and not heavy chains.  The higher a heavy or light chain is detected and found to be monoclonal, the more likely that a multiple myeloma or related process is at play.  However, it is important to note that light chains can be elevated and not be monoclonal - again, this can be seen in a reactive state and does not imply a blood disorder.  If one wants to continue an evaluation for multiple myeloma or amyloidosis, then a bone marrow biopsy may be helpful.  For amyloidosis, a biopsy of a fat pad (such as near the belly button or near the rectum) can be done as well.  A Congo red stain will be positive in amyloidosis.  There are different forms of amyloidosis.  Can you post the results of your blood and urine tests?  That would be helpful.\n\n",
    "posted_time": "Post  by Dr. Jeffrey Gordon » Sun Feb 23, 2003 8:27 pm",
    "category": "Oncology",
    "sub_category": "Multiple Myeloma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=407&sid=fad5416b47776deb5afacb4360396009#p407"
  },
  {
    "author": "angel",
    "title": "REPLY",
    "content": "W ill try to give all the info i can. History:  Lyme disease found after 4 yrs (treated).  Had a weird rash called Erathema Nodosum in 88 and 94. Biopsy showed nothing. Gained 57 lb in two months in 2000, persisted with no ab normal  blood except alk phos 195 H,  sed rate 23  H,  IgG reticulin ab titer 1:10 (H),  C4 serum 40 H  range9-36   C3 198 H  ranges90-180  Dr (internist) said didnt know cause of Edema. quit eating so much.  I just got married and was not eating any more than i had been.    Everything else was ok, this persisted until September of 2002 with no change in anything except increased S.O.B, edema and feel run down. Dr thought about constrictive pericardits.  R heart cath was done only, echo looked good, i am allergic to dye so none was used. DIAGNOSIS: R high output failure unknown etiology.most current LABS  Iron Saturation 13 L,  Hematocrit 35.2 L,  MCH 26.9 L,  Albumin 3.3 L,  alk phos 165 H, Anion Gap 3 L, all Hepatitis Panel  Negative,  FSH and LH Normal , Antinuclear antibodies Speckled Pat.  Borderline at  1:80),  C3 serum - 186H,  Immunoglobulin A 415 H,  5-HIAA neg. (URINE]:  24 hour Creat Clearance 164H,  Protein Electrophoresis: albumin 3.5 L, Kappa/Lambda light chains by Rate Nephelometry:  Kappa 246 normal,  Lambda  167 H, (visual inspection reveals, presence of abnormal, trace concentration PEAK migrating in the Gamma region. Randome total protein 16.0 H    Have seen cardiologist he is great, but he says I worrie him but have him stumped,  See Kidney dr he is good too, He says i have BeriBeri but I eat well. says he just don't know,  Latest is a Hematologist, and he says im hard to figure out  and has ruled out everything he has mentioned except for he said Amaylodosis and the MM.  No lupas,no cryoglobulinemia, no thalasemia.  and  wants to wait 4 months and re check some stuff.  I don't know if maybe I should go elswhere like Mayo, or wait.  I feel really tired, have no stamina, s.o.b., during even house work, my neck and spine hurt and I have bad headaches.  and of course the pitting edema in LE and face hands ectt... ANY advise?      By the way I thingk U are wonderful for taking the time to do this!!!  im really scared at the thought of MM and its hard to wait...        Thanks Angel\n\n",
    "posted_time": "Post  by angel » Tue Feb 25, 2003 7:22 pm",
    "category": "Oncology",
    "sub_category": "Multiple Myeloma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=410&sid=fad5416b47776deb5afacb4360396009#p410"
  },
  {
    "author": "angle",
    "title": "[no title]",
    "content": "one more Lab  i think this is what u mean ,  on 10/24/2002 a random urine showed  M-spike not observed under neath it says monoclonal protein us not apparent. So why could the Hematologist not rule out the MM?  we ask him and he said not yet he needed to see more.\n\n",
    "posted_time": "Post  by angle » Tue Feb 25, 2003 7:31 pm",
    "category": "Oncology",
    "sub_category": "Multiple Myeloma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=411&sid=fad5416b47776deb5afacb4360396009#p411"
  },
  {
    "author": "angle",
    "title": "[no title]",
    "content": "one more Lab  i think this is what u mean ,  on 10/24/2002 a random urine showed  M-spike not observed under neath it says monoclonal protein us not apparent. So why could the Hematologist not rule out the MM?  we ask him and he said not yet he needed to see more.\n\n",
    "posted_time": "Post  by angle » Tue Feb 25, 2003 7:31 pm",
    "category": "Oncology",
    "sub_category": "Multiple Myeloma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=412&sid=fad5416b47776deb5afacb4360396009#p412"
  },
  {
    "author": "Dr. Jeffrey Gordon  Medical Doctor Posts: 127 Joined: Sun Jan 05, 2003 5:22 pm",
    "title": "Myeloma",
    "content": "Angie,  My apologies for the delay in your receiving a follow-up response to your last post.  Have any further tests been done to try to figure out the cause(s) of your symptoms and problems?  Sounds to me that further testing is in order.   An uncommon presentation of multiple myeloma is the so-called \"non-secretory\" type of myeloma, wherein no proteins are produced by the abonormal plasma cells.  If one is to be thorough in evaluating your situation, from a Hematology-Oncology point of view, then I would definitely  perform a bone marrow biopsy.  In addition, although amyloioisis can be diagnosed based upon a bone marrow biopsy, this is not 100% the case, so a fat pad biopsy (such as the gums, rectal area or near the umbilicus (belly button) is also done.\n\n",
    "posted_time": "Post  by Dr. Jeffrey Gordon » Fri May 09, 2003 9:12 pm",
    "category": "Oncology",
    "sub_category": "Multiple Myeloma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=715&sid=fad5416b47776deb5afacb4360396009#p715"
  },
  {
    "author": "angelB  Guest Posts: 4 Joined: Wed Feb 18, 2004 10:21 pm",
    "title": "Multiple Myloma",
    "content": "Hello, its been a while i was not on line.  I want to thank you for your help and advice I apreciate it very much.  I am still having health problems that no one can figure out.  I still have pitting edema in LE and all over , tackycardia, elevated alk phos, hyperchromic microcytic anemia, joint and tendon flair ups of unknown orgion, SOB, fatigue, slightly elevated c-reactive protein  and a speckeled pattern in some test.   I have had a bone scan (Neg), blood cultures (Neg), echo shows a little enlargemt of my L Ventricle now.  I was in the hospital right after christmas couldnt breath and they took 18 lb of fluid off of me in 3 days..   Im at  the end of my rope and my wallet is empty!    I don't know what to do.  I would go some where else but I really don't know where to go.  My Lambda light chain and M spike are all ok so now my hematologist does not think ist MM any more.  Im only 34 with a 13 yr old and I just want my life back.  I have a history of lyme disease but none of the Dr's. I go to thinks it is a factor to all this.   Any Sugestions?  Im all ears..and would  travel to Egypt and back if I thought I would get an answer.   oh one more thing, if My heart stays in this R high output failure, will it continue to enlarge? and what does that mean for my health if it does.                        Difficult patient, Angel B\n\n",
    "posted_time": "Post  by angelB » Wed Feb 18, 2004 10:41 pm",
    "category": "Oncology",
    "sub_category": "Multiple Myeloma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2563&sid=fad5416b47776deb5afacb4360396009#p2563"
  },
  {
    "author": "Dr. Jeffrey Gordon  Medical Doctor Posts: 127 Joined: Sun Jan 05, 2003 5:22 pm",
    "title": "[no title]",
    "content": "AngelB,  Sorry to hear about your continued medical problems.  I don't know what is causing your heart problems.  I am assuming that a Cardiologist has evaluated you.  I don't know where you are receiving your care.  IYou may want to seek more detailed evaluations from heart specialists, such as those who specialize in heart failure.  Someitmes more specialized testing can help reveal the problem.  If there is a heart problem, then one can run through a battery of imaging tests and also consider a heart biopsy.  have test for amyloidosis been done?  Was a bone marrow biopsy done?  Were biopsies for amyloidosis done?  One may also consider the help of an Infectious Disease expert.  My best to you.\n\n",
    "posted_time": "Post  by Dr. Jeffrey Gordon » Sun Mar 21, 2004 8:56 am",
    "category": "Oncology",
    "sub_category": "Multiple Myeloma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2872&sid=fad5416b47776deb5afacb4360396009#p2872"
  },
  {
    "author": "angelB  Guest Posts: 4 Joined: Wed Feb 18, 2004 10:21 pm",
    "title": "[no title]",
    "content": "THANK YOU!!!  I really do appreciate your help.  I will use your advice and questions for my Doc's, and If I need to go elsewhere.  Thanks again I know I have a complex History.  If I do find out, I will let ya know what they find.  God Bless you for what you are doing, with this site.  Angel B.\n\n",
    "posted_time": "Post  by angelB » Sun Mar 21, 2004 10:05 pm",
    "category": "Oncology",
    "sub_category": "Multiple Myeloma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2883&sid=fad5416b47776deb5afacb4360396009#p2883"
  },
  {
    "author": "ravi0273  Guest Posts: 4 Joined: Mon Oct 06, 2003 4:58 am Location: hyderabad,india",
    "title": "new drugs for myeloma",
    "content": "dear gordon,the other day i was going thru  jco where i came across  proteosome inhibitors for myeloma relapsed.the other one of course thalidomide.any response from ur side regarding this new drugs.\n\n",
    "posted_time": "Post  by ravi0273 » Sat Nov 08, 2003 11:01 pm",
    "category": "Oncology",
    "sub_category": "Multiple Myeloma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1603&sid=fad5416b47776deb5afacb4360396009#p1603"
  },
  {
    "author": "Dr. Jeffrey Gordon  Medical Doctor Posts: 127 Joined: Sun Jan 05, 2003 5:22 pm",
    "title": "Multiple myeloma",
    "content": "Thalidomide and the proteosome inhibitor (Velcade or bortezomib) are very interesting drugs.  Chemotherapy has remained standard therapies for myeloma, but not every patient responds and since a complete eradication of the disease without the use of a bone marrow or stem cell transplantation cannot be achieved, the myeloma at some time after treatment will grow again and become active.  Thalidomide each day is being used by itself or with high-doses of dexamethasone (40 mg) once a week.  I do use low doses of thalidomide (200 mg at bedtime each day) with dexamethasone in relapsed myeloma for patients who are not going for a transplantation.  Since most myeloma patients are elderly, transplantation is not an option.  Thalidomide can work well for extended periods of time.  It can cause constipation, sedation, and peripheral sensory neuropathy.  But at low doses at bedtime, these side effects are not severe and can be managed.  The high dose of the dexamethasone can cause GI side effects and there appears to be an increased incidence of venous thromboses when it is added to the thalidomide.  There is still some debate about this.  I do not routinely anticoagulate my patients with warfarin (some people recommend it), but I do watch closely for blood clots.  I do have my patients take a full strength aspirin.  Bortezomib  does have interesting activity in the thrid-line treatment setting of myeloma.  It is easy to give and is tolerated well.  There are many exciting studies looking at using thalidomide either with standard chemotherapy or dexamethasone as first-line treatment of myeloma.  Bortezomib is also being actively studied early in the course of the disease.  Overall, thalidomide and bortezomib have improved our ability to treat patients with multiple myeloma and it will be most exciting to see what develops with clinical research studies using these drugs.  Jeff Gordon, M.D.\n\n",
    "posted_time": "Post  by Dr. Jeffrey Gordon » Fri Nov 14, 2003 1:21 pm",
    "category": "Oncology",
    "sub_category": "Multiple Myeloma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1653&sid=fad5416b47776deb5afacb4360396009#p1653"
  },
  {
    "author": "ussellray  Guest Posts: 1 Joined: Thu Oct 23, 2003 10:49 am Location: Omaha",
    "title": "Multiple Myloma/Chromosome 13",
    "content": "My mother has been diagnosed with multiple myloma and now they at throwing around the term Chromosome 13.  Can someone enlighten me as to the ramifications of this new twist.  Bob\n\n",
    "posted_time": "Post  by ussellray » Thu Oct 23, 2003 10:58 am",
    "category": "Oncology",
    "sub_category": "Multiple Myeloma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1472&sid=fad5416b47776deb5afacb4360396009#p1472"
  },
  {
    "author": "Dr. Jeffrey Gordon  Medical Doctor Posts: 127 Joined: Sun Jan 05, 2003 5:22 pm",
    "title": "Myeloma",
    "content": "Chromosome 13 changes can be seen in myeloma.  It is important to understand more than just chromosome 13 in myeloma.  Other factors such as the degree of the bone marrow involved by the disease, the height of the abnormal protein made by themyeloma, the statusof the kidneys, the presence of elevated calcium levels in the blood, and a patient's overall medical condition and age factor into what forms of treatment can be considered and used.  various chromosomal abnormailites in various hematological diseases can provide information about the disease and sometimes prognostic information.  It appears that the presence of a deletion of chromosome 13 carries a worse prognosis of themyeloma than if it is not present.\n\n",
    "posted_time": "Post  by Dr. Jeffrey Gordon » Fri Oct 24, 2003 9:05 pm",
    "category": "Oncology",
    "sub_category": "Multiple Myeloma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1482&sid=fad5416b47776deb5afacb4360396009#p1482"
  },
  {
    "author": "Lynn McHenry",
    "title": "Multiple  Myloma",
    "content": "Hello: My sister was diagnosed with a genetic blood disease 3 years Neucleotide A gene Mutation 20201  She had minor surgery and her body starting throwing blood clots they went in and inserted a green field filter and she got well finally.  She started losing weight and we packed up and went to Mayo clinic in Jacksonville Florida ..They ran a two weeks of tests found sugar diabetes found that she had a heart attack and found the blood disease .  In the past 4 years she has not had well days legs cramping and hurting . Now they believe that she has multiple myloma will know for sure on Tuesday .  I have the blood disease and so do my three sons and their children ..I want to know everything about the disease and what we can do to keep the good gene good .. Please help me . I have to be strong for my sister and want to educate my family ..Help me Please                                    Sincerely Lynn McHenry\n\n",
    "posted_time": "Post  by Lynn McHenry » Wed Aug 20, 2003 8:26 am",
    "category": "Oncology",
    "sub_category": "Multiple Myeloma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1231&sid=fad5416b47776deb5afacb4360396009#p1231"
  },
  {
    "author": "Dr. Jeffrey Gordon  Medical Doctor Posts: 127 Joined: Sun Jan 05, 2003 5:22 pm",
    "title": "Gene mutation",
    "content": "Lynn,  Sorry to hear about your sister.  The gene mutation 20210 that you refer in the setiing of blood clots is the prothrombin G20210A mutation.  This gene mutation is seen in some patients who develop abnormal blood clots.  It is one of the more common gene mutations seen overall in patients who develop unexplained or abnormal blood clots.  The gene mutation can occur as having a \"bad\" copy of both genes (normally there are two \"good\" copies of the gene), which is termed homozygous.  Heterozygous refers to having one \"bad\" and one \"good\" copy of the gene.  The homozygous state carries a higher risk of developing clots than does the heterzygous state.  Usually, the risk is lowinf a person developing a clot if just the 20201 gene mutation is present.  In fact, the majority of such people are termed \"silent carriers\" in that they do not develop clots.  Some people never know that they have the gene mutation .  It is not routinely tested for.  Usually a person with the 20210 gene mutation develops a clot if another event or process occurs that also carries a risk of developing a clot.  For example, a person with the 20210 gene mutation may not develop a clot, but if a surgery or tramua occurs or a cancer occurs, then there is more than one process now at play to generate a clot and the risk profile increases.  As far as I know, there is no association between the prothrombin gene G20210A mutation and multiple myeloma.  Unfortunatley, both are not uncommon and can occur in the same person.  Myeloma can have associated with it an increased risk of clots, but this is not due to the prothrombin gene.  Some forms of myleoma treatment (for example, thalidomide with or without dexamethasone) can be associated with blood clots independent of the 20210 gene mutation.  If someone has the 20210 gene mutation, then it does not go away.  There is nothing per se that can be done to keep the \"good\" copy of the gene doing well.  The best that can be done is to provide prophylactic blood thinning only if an event is to occur (such as immobility after surgery) that will increase the overall risk of clotting.  I would assume that if you and your children have been tested for this gene mutation, that you have undergone genetic counseling.   If not, then you should talk with a Hematologist (a blood specialist) or a Genetic Counseolr.  Jeffrey A. Gordon, M.D. Hematology-Oncology\n\n",
    "posted_time": "Post  by Dr. Jeffrey Gordon » Fri Aug 29, 2003 7:08 pm",
    "category": "Oncology",
    "sub_category": "Multiple Myeloma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1281&sid=fad5416b47776deb5afacb4360396009#p1281"
  },
  {
    "author": "sisohel  Guest Posts: 26 Joined: Tue Mar 18, 2003 10:46 am Location: Dhaka Bangladesh  Contact:   Contact sisohel       Website   Yahoo Messenger",
    "title": "Role of Bisphosphonate in Multiple Myeloma",
    "content": "The use of Bisphosphonate in Multiple Myeloma has added a new dimension in the treatment of Multiple Myeloma(MM) indeed. But due to the high cost of Bisphosphonates (I.E.-Zometa,Bondronath etc ) it often becomes impossible on the part of the patient to bear the cost.                          Some haemato-Oncologists consider it as an Ornamentation in MM. Now, I would like to know exactly how much helpful will the Bisphosphonate really be to a patient of MM ?\n\n",
    "posted_time": "Post  by sisohel » Tue Jul 22, 2003 1:35 pm",
    "category": "Oncology",
    "sub_category": "Multiple Myeloma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1149&sid=fad5416b47776deb5afacb4360396009#p1149"
  },
  {
    "author": "Dr. Jeffrey Gordon  Medical Doctor Posts: 127 Joined: Sun Jan 05, 2003 5:22 pm",
    "title": "Multiple myeloma",
    "content": "Dr. Sohel,  Welcome!  Yes, unfortunatley, bisphosphonate therapy is expensive if someone does not have medical insurance, especially since the standard bisphophonates used in the treatment of multiple myeloma (at least in the U.S.) are given once a month on an indefinite time course.  The two FDA-approved bisphophonates that are used in the U.S. in this case are pamidronate and zoledronic acid.  The former has been used for a long time and is now in a less expensive generic form.  The latter is more potent, but in clinical trials comparing zoledronic acid 4 mg versus pamidronate 90 mg, both were equivalent.  It is not certain if the bisphophonate actually treats the myeloma, although there are intirguing laboratory findings and some clinical observations.  Nevertheless, it does significantly decrease the risk of hypercalcemia, bone fractures, and the debilitating complications of bone problems from myeloma.  I offer pamidronate 90mg once a month to my myeloma patients.  I consider it an important adjunct to  myeloma treatment, but the major part of myeloma treatment is the chemotherapy and/or steroids used.  I hope that this answers your questions.  Thanks for posting a question here at The Doctor's Lounge.\n\n",
    "posted_time": "Post  by Dr. Jeffrey Gordon » Sat Jul 26, 2003 7:58 pm",
    "category": "Oncology",
    "sub_category": "Multiple Myeloma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1166&sid=fad5416b47776deb5afacb4360396009#p1166"
  },
  {
    "author": "sisohel  Guest Posts: 26 Joined: Tue Mar 18, 2003 10:46 am Location: Dhaka Bangladesh  Contact:   Contact sisohel       Website   Yahoo Messenger",
    "title": "Bisphosphonates in MM",
    "content": "Dear J Gordon MD,                                  I am really grateful for your valuable opinion. I understand that Chemotherapy and/or steroids still remain the hallmarks of treating MM but to what extent do the Bisphosphonates work is still not clear to me. As here in Bangladesh many patients have to sell thier home/lands/business to meet the treatment of MM and in such cases can we not consider giving them Calcium supliments and other symptomatic treatments for the bone case insted of Bisphosphonates. Would it really offer a different in treatment?      I really feel for such patients and hope could provide an altarnative therapy which would be within thier limits.     Thank you for your considarations and best regards,\n\n",
    "posted_time": "Post  by sisohel » Sun Jul 27, 2003 3:56 pm",
    "category": "Oncology",
    "sub_category": "Multiple Myeloma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1172&sid=fad5416b47776deb5afacb4360396009#p1172"
  },
  {
    "author": "Dr. Jeffrey Gordon  Medical Doctor Posts: 127 Joined: Sun Jan 05, 2003 5:22 pm",
    "title": "Multiple myeloma",
    "content": "Dr. Sohel,  Here in the U.S., we face as imilar problem with our patients who can not afford various treatments of the diseases.  In such cases, I have an honest talk with patients about their care and the cost of it.  There is a limit to how much free care we can provide.  If a patient wishes to hold on some part of treatment due to financial reasons, then that is their decision to make in an informed manne.   In the case of multiple myeloms, the important part of  treatment is 1.) chemotherapy, usually melphalan and prednisone or just dexamethasone therapy alone and 2.) control of any pain from the bones.  Bisphosphonates can help strengthen bones affected by myeloma, decrease the risk of developing bone fractures, and help with bone pain.  However, it does not replace chemotherapy or steroid therapy.  In the case of a patient who cannot afford treatment and wishes not to receive a bisphosphonate, then I proceed with just chemotherapy and/or steroid therapy, along with pain medications.  If the myeloma can be treated and kept under control for as long as possible, then the bone problems do improve, even without bisphosphonates.  Thank you for posting a question here at The Doctor's Lounge.  You are welcome to post a question any time and hopefully myself or someone else will be able to help you.  If you have any interesting cases that you would like to discuss, then let me know.  Jeffrey A. Gordon, M.D.[/quote]\n\n",
    "posted_time": "Post  by Dr. Jeffrey Gordon » Sun Aug 10, 2003 9:14 am",
    "category": "Oncology",
    "sub_category": "Multiple Myeloma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1198&sid=fad5416b47776deb5afacb4360396009#p1198"
  }
]