[
  {
    "author": "helpme101  Guest Posts: 1 Joined: Mon Aug 23, 2010 7:10 pm Gender: Female",
    "title": "Vasculitis condition- Who to see, OB/gyn? Nephro? Derma?",
    "content": "Hello,  I'd appreciate if a medical professional can advise me which doctor should I see to consult my condition. This might not be the best forum to post this but I'm hoping someone can advise me what to do.  I am 28 years old, just arrived in US last Feb 2009 and had a history of kidney infection and UTI back home, although not much of skin problems.  Currently, i am experiencing a recurring vasculitis in my lower body. I first had this last winter of 2009. The derma diagnosed it as vasculitis, or inflammation of blood vessels, without even explaining to me what caused it. This recent appearance of my vasculitis (for 3 weeks now) appeared immediately after I had few infected insect bites (I think bed bug or mites) in my legs. My infected bites already healed but i notice the rashes are not fading away, instead it is worsening and starting to get itchy.   I am worried that the burning itch will wake me up again in the middle of the night like the last time I had it. But I am most worried of the cause of this vasculitis. I am worried that it might be something internal, or a system disorder (God forbids!). That is why I want to see the right specialist/doctor. I am looking at 3 possible causes: Viral infection due to my infected insect bites, kidney problem/renal problem, or a form of infection from my recent miscarriage.  In June 2010, I had a miscarriage in my 8th week, but did not have to undergo any procedure since I was said to have had a spontaneous miscarriage. About two weeks after, I felt a burning sensation while urinating, which I believed was UTI. I opened these conditions to my Obgyn during my last visit. OB advised a urinalysis. OB said shes gonna call me if they find something alarming from any of my blood test results and urine tests. I was not called since then so I believe I was fine, this was sometime July 2010.   Until now, two months after my miscarriage, I have not had my period back yet, and I started feeling a lump and mild pain in the left side of my tummy, that part which hurt most when I had my miscarriage contractions.   Please advise whether I should see an OB/Gyn, or a Nephrologist, or a Dermatologist.   Would appreciate any suggestions.  God bless you!\n\n",
    "posted_time": "Post  by helpme101 » Mon Aug 23, 2010 8:01 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrotic Syndrome",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=101677&sid=8638cb4413d30f998ac9978e9ed8e411#p101677"
  },
  {
    "author": "Dr.M.jagesh kamath  Medical Doctor Posts: 1303 Joined: Mon Aug 03, 2009 7:24 am Gender: Male",
    "title": "Re: Vasculitis condition- Who to see, OB/gyn? Nephro? Derma?",
    "content": "Hello,The information you have given other than diagnosis of vasculitis is too little to give you a proper answer,yet I assume you have a cutaneous vasculitis,from the present episode details.Vasculitis can range from a single organ involvement to multiple organ failures.Cutaneous vasculitis could involve small or bigger vessels.This is an inflammation of blood vessels caused either by viruses,drugs,inflammatory disease(Mainly connective tissue disorders),malignancy(2%),and cause unknown(50%).Special mention is to be made about hepatitis B and C with some forms of vasculitis associated with cryoglobulins.While pulmonary,renal and other system vasculitis may be difficult to identify dermatologists can easily identify the skin lesions due to visual appearance.While ordinary urticaria rash do not leave behind pigmentation these do. Aso the red rashes are palpable(Palpable purpura).High ESR,hypo complementemia,Posive ANA,hematuria are some of laboratory features. Most important will be to rule out systemic involvement.If there is nothing it can be tackled with out much problem.A doctor with internal medicine specialization would be ideal to consult. Best wishes.\n\n",
    "posted_time": "Post  by Dr.M.jagesh kamath » Thu Sep 02, 2010 5:13 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrotic Syndrome",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=102049&sid=8638cb4413d30f998ac9978e9ed8e411#p102049"
  },
  {
    "author": "alexman93  Guest Posts: 1 Joined: Sat Nov 07, 2009 9:43 am Gender: Male",
    "title": "bubbly/frothy urine",
    "content": "I am a 15 year old male. I was diagnosed with minimal change disease when I was 6 and still currently have the condition. I have bubbles in my urine, ranging from a medium large amount to an extremely large frothy mass sometimes, but there has always been bubbles in my urine for about the last 9 months (maybe a little more I'm not sure). What's interesting though is that I'm currently in remission. I test my urine with the dipstick and it comes up negative for protein. I am currently taking 1000mg of mycophenate myfotil twice a day and have been on cellcept for the past 2 and a half years. (mycophenate myfotil is the same thing as cellcept I suppose, because recently those are the pills I have been getting in the prescription. I am extremely active, being a three sport athlete. I train heavily, including weight trainging, calisthenics, and an assortment of sprints and cardio. I'm not sure if maybe that could affect anything. I don't drink or smokeat all. I'm not sure why my urine is so frothy sometimes, although it seems to increase in frothiness the morning sfter I have been in cold conditions while inadequately dressed, which worries me that it could be connected to my condiition. Sometimes in the morning I wake up feeling slightly swollen around the eyes, but I could just be overworrying. Could you help me out?\n\n",
    "posted_time": "Post  by alexman93 » Sat Nov 07, 2009 10:14 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrotic Syndrome",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=86172&sid=8638cb4413d30f998ac9978e9ed8e411#p86172"
  },
  {
    "author": "Dr.M.jagesh kamath  Medical Doctor Posts: 1303 Joined: Mon Aug 03, 2009 7:24 am Gender: Male",
    "title": "Re: bubbly/frothy urine",
    "content": "Hello,It is quite possible that there may be some reaction to the urinary stream and the toilet sides in forming a froth if you have put some disinfectants.The most important thing is to get a 24hr urinary protein estimation since dip tests are not very accurate in predicting a micro proteinuria.If it is normal you can be rest assured of your remission status.\n\n",
    "posted_time": "Post  by Dr.M.jagesh kamath » Sat Nov 14, 2009 2:15 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrotic Syndrome",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=86915&sid=8638cb4413d30f998ac9978e9ed8e411#p86915"
  },
  {
    "author": "sky1386  Guest Posts: 3 Joined: Sat Aug 01, 2009 8:54 am Gender: Female",
    "title": "pyelonephritis with burning..... ? help!",
    "content": "Hi,  I was diagnosed last week with pyelonephritis by my doctor. He prescribed me a weeks worth of leviquin for the infection. I have taken all of it. I went back to my doctor because my right kidney was still hurting and I am experiencing vaginal burning without urination. He prescribed me Celebrex for inflammation and I am still hurting. He also did a urine culture again and this time it showed no growth of bacteria or anything. Please Help.... !\n\n",
    "posted_time": "Post  by sky1386 » Sat Aug 01, 2009 9:06 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrotic Syndrome",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=81103&sid=8638cb4413d30f998ac9978e9ed8e411#p81103"
  },
  {
    "author": "Dr.M.jagesh kamath  Medical Doctor Posts: 1303 Joined: Mon Aug 03, 2009 7:24 am Gender: Male",
    "title": "Re: pyelonephritis with burning..... ? help!",
    "content": "Hello,Since the urethritis has been treated the vaginal burning may be related to a vaginitis possibly yeast related after antibiotic therapy.Do cosult your gynec.\n\n",
    "posted_time": "Post  by Dr.M.jagesh kamath » Sun Sep 06, 2009 9:51 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrotic Syndrome",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=81917&sid=8638cb4413d30f998ac9978e9ed8e411#p81917"
  },
  {
    "author": "tori1989  Guest Posts: 1 Joined: Wed Apr 01, 2009 2:07 pm Gender: Female",
    "title": "irregular menstruation with nephrotic syndrome",
    "content": "Hello I am 19 years old when i was 15 i was diagnosed with nephrotic syndrome. A little over a year ago i stopped going to my doctor and stopped taking the medication in fear that it was making me sicker. It seemed like all my symptopms went away including thank god the adema. I just moved and i don't have a doctor and have to work on getting my insurence back. I have not had a period since jan i have taken two home pregnency test the first was a few days before my period in jan so it came so i was not longer scared besides the fact that it was negative. And i also took an ept test a few weeks back i took it all wrong by drinking a huge amount of water so i don't know if that affected but i don't think im pregnent because even though my period was irregular that month it still came. So what i really want to know is \"Can I be going into renal failure without any symptoms beside mentration issues\". Because besides that and a few headaches and once in a while some nausea I am ok.\n\n",
    "posted_time": "Post  by tori1989 » Wed Apr 01, 2009 2:23 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrotic Syndrome",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=72726&sid=8638cb4413d30f998ac9978e9ed8e411#p72726"
  },
  {
    "author": "W451M  Guest Posts: 1 Joined: Sun Sep 07, 2008 7:10 pm Gender: Male",
    "title": "presumed lgA nephropathy or thin membrabe disease",
    "content": "Hi for the past 10 years a have had blood in urine its not visible blood but just my urine has a dark yellow to brown in colour. i have had most of the tests which inc ultra scan with contast,cat scan with contrast,cystoscopy of the bladder, full blood count which also inc tests for kidney function etc. i have seen a urologist and a renel pysician, all these tests showed normal my kidney function was also normal GFR in excess of 90 mls/min,serum creatinine was 81 mMol/L when i last seen the consultant which is 2 years ago he said i had 3+++ of blood in urine and 2++ of protein when checked on a 24 hour urine  he also said this is presumed either lgA nephropathy or thin membrane disease he also said normal blood pressure,renel function and absence of significant proteinuria which is good sign of progress. so my qs is how is it possible for a doc to diagnose me with just a 24hour urine sample. i also seen a urologist who done a syctoscopy of bladder this year and said my bladder was inflamed they took biopsy of bladder which came back normal and i had another kidney test which they said it was normal function over 90. i don't wanna have renel failure :( so i need ur kind advice to my qs about the disease and the doc just persuming the diagnostic.  av had the cat scan with contrast to most parts of the bodys organs which showed no mass what so ever everything was normal.. thankyou\n\n",
    "posted_time": "Post  by W451M » Sun Sep 07, 2008 7:36 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrotic Syndrome",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=60060&sid=8638cb4413d30f998ac9978e9ed8e411#p60060"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: presumed lgA nephropathy or thin membrabe disease",
    "content": "Hello -  Well the good news is there is nothing bad that jumps out from all the tests. This is promising. As to what might be causing it, yes, possibly thin membrane disease or some equally obscure problem. However, while I am not especially knowlegeable in the field of nephrology, I have to ask you this: are you, by any chance, a serious runner? The reason I ask is this is often seen in people who run, and is then attributed to literal \"bouncing\" or \"pounding\" of the kidneys. If you're not a runner then that becomes a moot issue, but it should be ruled in/out first. If the answer is no, then  you probably will need to be followed for thin membrane disease, but complications from this are fairly rare.   I hope this is helpful.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Mon Sep 29, 2008 10:11 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrotic Syndrome",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=61583&sid=8638cb4413d30f998ac9978e9ed8e411#p61583"
  },
  {
    "author": "Scooter5052  Guest Posts: 2 Joined: Sun Aug 19, 2007 6:45 am",
    "title": "Another case of bubbly/foamy urine",
    "content": "Hi.  I am 22 and generally healthy.  Since fall of 2007, though, I have had bubbly/foamy urine on a pretty regular basis.  Also, sometimes I only urinate a little bit of liquid, though that seems consistent with my intake of fluid.  When this first began happening, I went and saw my doctor.  He did a dipstick test, said it had tested positive for protein (and didn't get into specifics), but said something about that not always being right.  The only other thing he did was schedule a kidney ultrasound for me.  The ultrasound was normal.  A few months into 2008, I saw another doctor, who actually had my urine sent out for urinanalysis.  He said that no protein was traced at all and that the related blood work he had sent for (including kidney function) was all fine.  He told me not to worry unless I have other concerning symptoms.  The bubble/foam problem still persists today and I am wondering if there are ever any cases where this just happens and doesn't mean anything.  The fact that the ultrasound and more recent tests came back clean seems encouraging to me, but since the bubbles/foam have not gone away, I'm wondering if I should be looking into this further.  Thank you for your help.  I appreciate everything that the doctors and nurses on this site do to help people.\n\n",
    "posted_time": "Post  by Scooter5052 » Sun Jun 22, 2008 11:16 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrotic Syndrome",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=58566&sid=8638cb4413d30f998ac9978e9ed8e411#p58566"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "Re: Another case of bubbly/foamy urine",
    "content": "Hi Scooter5052,  Foamy urine is often a sign that there is protein in the urine.  If this is persisting I would recommend that you see your doctor again for a repeat urinalysis to look for protein.  Protein spilling can be intermittent.  If, by chance, the formal urinalysis simply missed the protein spilling, a repeat may help determine if protein is present.    If there is still concern,  seeing a nephrologist may be helpful.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sun Jul 20, 2008 12:27 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrotic Syndrome",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=58895&sid=8638cb4413d30f998ac9978e9ed8e411#p58895"
  },
  {
    "author": "munda_kamaal  Guest Posts: 3 Joined: Wed Jul 04, 2007 7:48 pm",
    "title": "question about Adrenal crisis",
    "content": "Hi there,  I am currently on prednisone for my nephrotic syndrome. I have read a little about adrenal crisis and adrenal insufficiency which may occur due to abrupt withdrawal of prednisone. It states:  'adrenal crisis is a medical emergency caused by a lack of cortisol, can be caused by abrupt withdrawal of prednisone. Patients may experience lightheadedness or dizziness, weakness, sweating, abdominal pain, nausea and vomiting, or even loss of consciousness or may even lead to death.'   My question is Can adrenal crisis or adrenal insufficiency occur while someone is still on prednisone (if it does then in what prednisone dose range it can occur) ? or adrenal crisis or adrenal insufficiency can only occur when someone is completely off prednisone?  thankyou very much  kind regards\n\n",
    "posted_time": "Post  by munda_kamaal » Thu Oct 25, 2007 1:40 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrotic Syndrome",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=49497&sid=8638cb4413d30f998ac9978e9ed8e411#p49497"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Munda_kamaal,  This is an excellent question.  When one is taking prednisone it suppresses the normal release of steroids from the adrenal glands.  Basically the glands see the exogenous prednisone and determine that more is not needed.  It takes the adrenals a little bit of time to recover from this so anyone that is on long term prednisone should be slowly weaned off it.  At higher doses, adrenal crisis really doesn't occur because the steroid is there.  It can occur when the prednisone dose is abruptly stopped or when it is very low and not sufficient enough to cover stress.  If the wean has been slow this is pretty unlikely to occur.  If you are beginning to wean down your prednisone for your nephrotic syndrome I would recommend you ask your doctor to review this with you to be sure you are on a nice, slow taper to prevent adrenal problems.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Thu Oct 25, 2007 5:51 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrotic Syndrome",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=49529&sid=8638cb4413d30f998ac9978e9ed8e411#p49529"
  },
  {
    "author": "munda_kamaal  Guest Posts: 3 Joined: Wed Jul 04, 2007 7:48 pm",
    "title": "[no title]",
    "content": "thankyou very much for your reply Dr. Chan.\n\n",
    "posted_time": "Post  by munda_kamaal » Fri Oct 26, 2007 6:58 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrotic Syndrome",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=49560&sid=8638cb4413d30f998ac9978e9ed8e411#p49560"
  },
  {
    "author": "munda_kamaal  Guest Posts: 3 Joined: Wed Jul 04, 2007 7:48 pm",
    "title": "want to try some supplements?",
    "content": "Hello everyone,  I am 23 years old and suffering from nephrotic syndrome. Following are the list of medications I am currently on.. 1. Prednisone 50mg 2. Metaprolol 95mg 3. Frusimide 120mg 4. Inhibace 5mg  My doctor told me that he will be starting me on neoral capsules (cyclosporine) and will be decreasing prednisone slowly, as prednisone is not working on me anymore and making the condition worse.  My question is that - I wanted to try the following supplements,  is it safe for me to try the following supplements? - acetyl-L-carnitine 500mg once a day - L-ornithine 100mg once a day  Kind regards\n\n",
    "posted_time": "Post  by munda_kamaal » Wed Jul 04, 2007 7:56 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrotic Syndrome",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=43941&sid=8638cb4413d30f998ac9978e9ed8e411#p43941"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "From what I was able to find there is not good data regarding interactions of the supplements that you are considering.  To further complicate the matter, there is not good data that I could find on these supplements in nephrotic syndrome.  I would strongly advise you to be incredibly cautious if you choose to use them.  You may want to talk with your nephrologist, though.  They may have more information than I was able to find.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Thu Jul 12, 2007 10:23 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrotic Syndrome",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=44660&sid=8638cb4413d30f998ac9978e9ed8e411#p44660"
  },
  {
    "author": "douayang  Guest Posts: 2 Joined: Mon May 14, 2007 5:15 pm",
    "title": "left leg is smaller and shorter than right right leg",
    "content": "Age 29 Male  For many years I've always wondered what happened to my left leg or was I born like this.  My left leg is a little shorter and smaller than my right.  I walk with a little limp.  The left leg is not as strong either and there really is no muscle on it like the other one.  Besides walking, I'd say I use this leg like 15% of the time.  Anything else relies on the right leg.  My parents told me that when I was a baby (back in Thailand) I started walking already and then one day I just couldn't walk anymore and didn't start walking again when I was like two (in the U.S.).  Just wanted to find out what happened and if I can get my leg to be strong like the right leg.  Any help would be nice.  thanks\n\n",
    "posted_time": "Post  by douayang » Mon May 14, 2007 6:54 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrotic Syndrome",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=42482&sid=8638cb4413d30f998ac9978e9ed8e411#p42482"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "The difference in lengths can generally be easily corrected for by a shoe insert.  A good shoe store or an orthopedic specialist can often measure and create an appropriately sized insert for you.  With your decrease in muscle mass, physical therapy may help.  I wonder if there was a little nerve damage to that leg at some point causing your decreased muscle strength and mass.  You may want to see your doctor about getting some physical therapy appointments.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Mon May 21, 2007 3:38 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrotic Syndrome",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=42846&sid=8638cb4413d30f998ac9978e9ed8e411#p42846"
  },
  {
    "author": "douayang  Guest Posts: 2 Joined: Mon May 14, 2007 5:15 pm",
    "title": "[no title]",
    "content": "thank you Dr. Lowe for the advices.  Do you think this was something that I was born with?  My parents told me they were usually never home because they had to go out and work and just left me with my 8-9 year old sister.  I'm just wondering if something happened to me during the first and a half years.  Like if I was dropped or something like that and landed on my leg.  And lastly would I just go to a regular family doctor or would I have to go to a specialist?    Thank you.  I appreciate your help\n\n",
    "posted_time": "Post  by douayang » Thu May 24, 2007 11:51 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrotic Syndrome",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=42930&sid=8638cb4413d30f998ac9978e9ed8e411#p42930"
  },
  {
    "author": "wguru  Guest Posts: 4 Joined: Sat Apr 21, 2007 12:30 pm",
    "title": "Home testing for Proteinuria",
    "content": "Can one perform a home test for proteinuria?   I live in California and am in reasonably good health except for an infected tooth.  My pre-employment physical went well except for several oddities.  My blood pressure was on the border of being high and my urine tested postive for proteinuria.  In that I had eaten a lot of beef  product the night before, I'm hoping that the combination of diet and tooth infection are the sole causes for proteinuria.\n\n",
    "posted_time": "Post  by wguru » Sat Apr 21, 2007 12:42 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrotic Syndrome",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=41131&sid=8638cb4413d30f998ac9978e9ed8e411#p41131"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Testing the urine for protein during an illness can most definitely cause it to become positive.    With the elevated blood pressure and protein in your urine I would suggest that you see your doctor for another test once your illness has subsided.  Home urine protein testing can be done by using protein dip sticks (I think they can be bought over-the-counter) but given your BP issues also it is a good idea to follow up with your doctor.  There are several \"incidental\" reasons for your findings such as most people have a slightly higher blood pressure when a little anxious for some reason (often referred to as white-coat syndrome).  It is quite likely that you are well but best to be sure.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sat Apr 21, 2007 2:00 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrotic Syndrome",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=41132&sid=8638cb4413d30f998ac9978e9ed8e411#p41132"
  },
  {
    "author": "wguru  Guest Posts: 4 Joined: Sat Apr 21, 2007 12:30 pm",
    "title": "Home testing for Proteinuria",
    "content": "Thank you for the details (protein dip sticks) and I appreciate your added info.  I have been drilling the internet for this issue and am aware of the wide array of potential causes for proteinuria and I'm surmizing my cause to be diet, but mostly  a result of a tooth infection I have ignored for nearly a year as it seemeded to have been clearing up until recently when I began noticing what seems to be my kidneys have become a bit sore or achy at times, that and my blood pressure has been elevating, and even some chest discomfort, all I attribute to chronic infection (which today I obtained a script for 500 mg amoxicillian), plus I'm scheduling a general anesthia extraction asap.  I feel much better with the Doxazosin and Amoxcillian, but one of my two biggest concerns are that I clear up my urine so that that my likely (to be prescribed) 24 hour sedimentation test and/or the albumen blood workup DO NOT result in any 'unfit for work' prognosis.  I am immediately seeking medical treatment (tooth extraction) and exam/testing, plus in the interim I plan on trying an ACE inhibitor as well as water pills, but as I am also taking 4 mg Doxazosin (soon increasing that to 8 mg), I am unaware if the inhibitors are avaialble over the counter (and what if any effects one might cause with the Doxazosin and Amoxicillian).  I would greatly appreciate any added comment towards my obtaining a 'fit for work' prognosis.\n\n",
    "posted_time": "Post  by wguru » Sat Apr 21, 2007 4:45 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrotic Syndrome",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=41145&sid=8638cb4413d30f998ac9978e9ed8e411#p41145"
  },
  {
    "author": "wguru  Guest Posts: 4 Joined: Sat Apr 21, 2007 12:30 pm",
    "title": "[no title]",
    "content": "Additionally, my dentist suggested a script of tetracycline but in that he said I shouldn't take that and Amoxcillian at the same time, I chose the Amoxacillian.  I'm grasping at straws trying to expedite a speedy 'fit for work' prognosis (in that the job offer is the best one I've ever had and sorely in need).  I even tried getting the tooth out today (Saturday), but their office was closed.  I seem to have until some time this coming week to get a 'clearance' regarding the initial proteinuria finding.\n\n",
    "posted_time": "Post  by wguru » Sat Apr 21, 2007 5:00 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrotic Syndrome",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=41148&sid=8638cb4413d30f998ac9978e9ed8e411#p41148"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Staying well hydrated will help as well.  If your proteinuria is not improving you shoud consider seeing a nephrologist for further work up.  Best wishes and good luck with your job offer.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sat Apr 21, 2007 8:51 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrotic Syndrome",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=41172&sid=8638cb4413d30f998ac9978e9ed8e411#p41172"
  },
  {
    "author": "wguru  Guest Posts: 4 Joined: Sat Apr 21, 2007 12:30 pm",
    "title": "[no title]",
    "content": "Thank you again for your kindly afforded replies.  Yes, as many, I do tend to not drink enough liquids and especially so on the day of my physical.  I was planning on seeing a Doctor asap and really appreciate the speciality reference (Nephrologist) because I had been attributing the kidney discomfort to back strain, but it has become evident I am experiencing some kidney issues.  Being fairly physically fit, late 50's and male, I have been undergoing frequent physicals, averaging them from 6 to 12 months.  And I've been watching my prostrate closely, but must admit I need to start watching my intakes.  Again, thanks ever so much for the replies.\n\n",
    "posted_time": "Post  by wguru » Sat Apr 21, 2007 10:19 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrotic Syndrome",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=41179&sid=8638cb4413d30f998ac9978e9ed8e411#p41179"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Glad to help.  I hope you find our site helpful and informative.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sat Apr 21, 2007 11:49 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrotic Syndrome",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=41190&sid=8638cb4413d30f998ac9978e9ed8e411#p41190"
  },
  {
    "author": "starshine  Guest Posts: 8 Joined: Sun Dec 10, 2006 8:39 pm",
    "title": "bubbles in urine",
    "content": "Hi, I have recently found bubbles in my urine. I never have this before. Is it normal? I am a 37 years old female.  How can one tell if the bubbles appear in the urine are normal? My parents have diabete and I did notie that their urine are also formy and frothy but mine isn't like that.  Also I do have some kind of pain (on and off) around my rhs, somewhere below the rib both front and back. Honestly, I couldn't really pintpoint exactly where the pain come from.  I had a med check-up 3 years ago and I got a clean bill of health.  Should I worry about it?  Thank you  starshine\n\n",
    "posted_time": "Post  by starshine » Sun Dec 10, 2006 9:11 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrotic Syndrome",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=35885&sid=8638cb4413d30f998ac9978e9ed8e411#p35885"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "Pneumaturia",
    "content": "Hello,  Bubbles in urine can be caused by the presence of excess protein in urine or it may also be something as simple as a forceful flow of urine that could make a foamy type of appearance due to excess trapping of air in urine as it contacts water. You will not be able to tell just by appearance.  This can however be established using a dipstick test for urinary protein or a simple urine analysis. For a more precise measurement, you may need to collect urine for 24 hours (microalbumin study - positive between 30 - 300 mg albumin per day).   Diabetes maybe associated with excess protein in urine.  On the other hand, passing actual air bubbles in the urine, is very rare - a condition known as pneumaturia. It is most often caused by a fistula between the bladder and the colon, usually as a result of a diverticular abscess, Crohn's disease or cancer of the colon, bladder or female genitalia.   I would recommend a visit to the doctor's office to evaluate your pain and maybe do a few tests.  Best regards,\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Sun Dec 10, 2006 11:05 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrotic Syndrome",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=35893&sid=8638cb4413d30f998ac9978e9ed8e411#p35893"
  },
  {
    "author": "check Lao",
    "title": "Creatine level meaning",
    "content": "ear  friends, my wife at 60 has a creatine level of 0.2 while at age of 67 my creatine level is 1.1 what does that meats? we are in general have good health..\n\n",
    "posted_time": "Post  by check Lao » Tue Feb 04, 2003 9:46 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrotic Syndrome",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=220&sid=8638cb4413d30f998ac9978e9ed8e411#p220"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Creatine level meaning",
    "content": "Dear Sir,  Thank you very much for using our website.  i hope that you and your wife continue to feel good and be in good health.  Creatinine is a substance that is produced by the muscles. Creatinine levels are related to the muscle mass of the person. If the person has a small muscle mass then his creatinine will be low (and this is absolutely normal for him/her). Also, if the person has a big muscle mass, his creatinine could even be higher than normal (and this would be absolutely normal for this person).  So, it looks that you have more muscle mass than your wife.  Once more, thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Wed Feb 05, 2003 9:30 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrotic Syndrome",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=228&sid=8638cb4413d30f998ac9978e9ed8e411#p228"
  },
  {
    "author": "yen2ken  Guest Posts: 1 Joined: Tue Feb 21, 2006 4:17 am Location: SW Virginia",
    "title": "Creatine Level",
    "content": "What does Creatine level have to do with healthy kidney function?  I am a 63 yr male with some kidney stone history, AND continuing 'flank' pain that does not show on XRAY as kidney problem.  HAVE an uncle, 85, whose kidney near failed from stone impaction, whose swelling legs are like mine but worse, etc etc.  I am wanting to know whether periodic testing of creatine level will be able to indicate when possibly heriditary condition is getting serious.  (Grandfather had kidney removed, uncle has only one kidney, all six grandsons of my grandfather have had stones and gout.. etc)\n\n",
    "posted_time": "Post  by yen2ken » Tue Feb 21, 2006 4:57 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrotic Syndrome",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=31071&sid=8638cb4413d30f998ac9978e9ed8e411#p31071"
  },
  {
    "author": "bleu  Guest Posts: 3 Joined: Thu Dec 23, 2004 1:24 pm Location: new york",
    "title": "left leg is smaller than the other",
    "content": "i was diagnosed with nephrotic syndrome since a small child-im now 25-my doctor told me that i would either out grow this disease or have it forever-in 1997 i had a kidney biopsy done and the results revealed that i had massive scars on my kidneys, since the biopsy, i havent had any problems with my kidneys. well i havent really followed up with a doctor for my kidneys.   what i am concerned about is muscle atrophy-my left leg is extremely smaller than the right one and i don't know if it has anything to do with this disease. im not sure how long my leg has been like this because ive just recently noticed it-i might have had this for quite a while because when i was younger, people use to say i walked with a limp but ive never noticed it. i noticed it after gaining a few pounds that my pants was not fitting right, while one pants leg is tight, the other one is extremely loose and noticeable------i havent been to the doctor because i don't have any medical insurance but im currently working on that situation.  any advice or knowledge----please help\n\n",
    "posted_time": "Post  by bleu » Thu Dec 23, 2004 1:59 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrotic Syndrome",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=7304&sid=8638cb4413d30f998ac9978e9ed8e411#p7304"
  },
  {
    "author": "aerolexis  Guest Posts: 1 Joined: Wed Oct 26, 2005 4:22 am Location: Philippines",
    "title": "[no title]",
    "content": "My left leg is also smaller AND shorter than my right one as well! My mum noticed this when i was still a kid, around 5 years of age. She noticed that I seems to be limping while walking, and she saw that one my leg is shorter than the other. This has stayed with me untill now.  The difference is really obvious when I wear shorts, and people still thinks Im limping while I walk, but I don't notice it.  So yes, help is appreciated.\n\n",
    "posted_time": "Post  by aerolexis » Wed Oct 26, 2005 4:27 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrotic Syndrome",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=24059&sid=8638cb4413d30f998ac9978e9ed8e411#p24059"
  },
  {
    "author": "p1o2i3u4  Guest Posts: 1 Joined: Sat Feb 26, 2005 10:49 pm Location: Washinton D.C.",
    "title": "Foamy Urine",
    "content": "I have had foamy urine for few months now.  It happens every time I go.   When I read about it on-line, the impressions that I got are a) it implies a major kidney problem and b) it is often associated with other symptoms, like edema.   My questions are: 1.  Are my impressions correct? 2.  Can the foam in urine be caused by some benign process or is it always the case that kidney disease is involved.  The reason I ask is because some people mentioned that they have foamy urine but their urine protein tests come back negative. 3.  I've had some foam in my urine for as long as I can remember, so how much foam is too much?  Thank you very much.\n\n",
    "posted_time": "Post  by p1o2i3u4 » Sat Feb 26, 2005 10:58 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrotic Syndrome",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=10013&sid=8638cb4413d30f998ac9978e9ed8e411#p10013"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi p1o2i3u4, A foamy appearance of urine may indicate numerous conditions, kidney disease, kidney failure from diabetes, urinary tract infections etc. I wouldn't consider a urinary tract infection since it has been long standing. Is your urine a normal yellow color? Any swelling? A urinalysis and a microalbumin study (24 hour urine collection) are a couple of easy methods to determine kidney function. If these tests came back normal then I wouldn't give it much concern at this time. It may be something as simple as a forceful flow of urine that could make a foamy type of appearance. Sincerely, Rntdj\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Wed Mar 02, 2005 3:30 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrotic Syndrome",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=10224&sid=8638cb4413d30f998ac9978e9ed8e411#p10224"
  },
  {
    "author": "Victoire2002  Guest Posts: 4 Joined: Sat May 15, 2004 10:35 am Location: Texas",
    "title": "Hydronephrosis",
    "content": "I have been diagnosed with Hydronephrosis, and would like to know if this is a serious condition, and what can cause this.  I am 35 yrs old, female, and have not had any serious health issues.  Thanks Vicki\n\n",
    "posted_time": "Post  by Victoire2002 » Sun Jan 23, 2005 3:29 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrotic Syndrome",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8455&sid=8638cb4413d30f998ac9978e9ed8e411#p8455"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Hi Vicki, Hydronephrosis is defined as a dilation of the renal pelvis and calyces. This happens in response to the interruption of the flow of urine. That is, once something obstructs the flow of urine the backpressure causes the expansion of the ureter (hydroureter) and the kidneys (hydronephrosis).  Causes of this condition are many, basically anything that obstructs the outflow of urine either from inside such as kidney stones (common) and blood clots, tumors etc... or from outside such as lymph node enlargement or tumors or even pregnancy compressing the ureter from outside.  A search for a possible cause is mandatory. This would require other imaging modalities such as pyelography and or magnetic resonance imaging.  Prognosis and outcome depends on the cause and the delay in receiving proper therapy which may include surgical relief of obstruction. You must be referred to a urologist asap. Any delay can lead to irreversible loss of renal function.   Best regards,\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Mon Jan 24, 2005 1:37 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrotic Syndrome",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8475&sid=8638cb4413d30f998ac9978e9ed8e411#p8475"
  },
  {
    "author": "Dan Theman  Guest Posts: 7 Joined: Fri Aug 13, 2004 2:09 pm Location: US",
    "title": "Asymptomatic Proteinuria and Altace Treatment Protocol",
    "content": "I have had proteinuria which went from 1.3g in November 2003 to 5g in October 2004.  My Nephrologist has been treating me with 10mg Altace and is adopting a wait and see if it goes down, which if it doesn't, he will want to do a biopsy.  I have no symptoms other than the protiein which technically puts me in the nehprotic syndrome stage and my kidney functions are stable.  What is a reasonable amount of time to wait and see to determine if the Altace treatment  is not working?  Also, should I fast for future blood work? I have heard creatinine levels could be unreliable if you eat before the test.\n\n",
    "posted_time": "Post  by Dan Theman » Fri Jan 14, 2005 11:50 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrotic Syndrome",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8091&sid=8638cb4413d30f998ac9978e9ed8e411#p8091"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Hello Dan, There is no wait and see policy once you are in the nephrotic range. A biopsy should be done right away. I have reviewed the literature and found a rather rare association of nephrotic syndrome with CLL. Luckily if it is a membranous glomerulonephritis then therapy for both conditions (CLL and nephrotic syndrome) could be similar. How well is your leukemia controlled and are you currently taking any therapy for it?\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Sun Jan 16, 2005 4:48 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrotic Syndrome",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8162&sid=8638cb4413d30f998ac9978e9ed8e411#p8162"
  },
  {
    "author": "Dan Theman  Guest Posts: 7 Joined: Fri Aug 13, 2004 2:09 pm Location: US",
    "title": "Nehprotic Syndrome",
    "content": "Thanks for the response.  I was diagnosed with CLL in 1995 and have not been treated as yet.  My WBC counts are normal although my platelets are low (110).  Again, do you recommend fasting prior to blood work for kidney functions?  Thanks again.\n\n",
    "posted_time": "Post  by Dan Theman » Tue Jan 18, 2005 8:31 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrotic Syndrome",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8266&sid=8638cb4413d30f998ac9978e9ed8e411#p8266"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Avoid eating a diet high in meat or other protein before having a blood urea nitrogen (BUN) test. Serum creatinine on the other hand, is not affected by diet or activity.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Tue Jan 18, 2005 8:59 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrotic Syndrome",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8268&sid=8638cb4413d30f998ac9978e9ed8e411#p8268"
  },
  {
    "author": "noni  Guest Posts: 1 Joined: Wed Oct 13, 2004 2:17 am Location: singapore",
    "title": "nephrotic syndrome",
    "content": "i have nephrotic syndrome. i have been to the doctor but it doesn't heal... my legs are swollen like hell and my fingers too. it feel tite. i have difficulties walking about even for a short distance. my weight have also increase and decrease ever since i have this sickness. i really feel very weak, tired and sometimes i lost appetite to eat. everytime i want to eat, i feel like vomitting. and i also cant stand for long hrs if not, my legs will become more swollen. i wear big clothings. i look like a mother now dat i've gain around 20 kg. i really am looking forward to sumone who can provide me with enuf information bout whether thereis anything else i can do to make myself look the way i am back n to heal me back normally... i really appreciate ur help... tanks a lot!\n\n",
    "posted_time": "Post  by noni » Wed Oct 13, 2004 2:36 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrotic Syndrome",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5851&sid=8638cb4413d30f998ac9978e9ed8e411#p5851"
  },
  {
    "author": "janetriley  Guest Posts: 4 Joined: Mon Oct 18, 2004 8:31 am Location: vernon,mi",
    "title": "[no title]",
    "content": "Hello! I too have had nepheritis since I was young,Never had symptoms of your extent,I only have protein in my urine,I feel for you,I have seen it it my people when I used to follow up with a uroligst Best wishes to you and god bless. Janet\n\n",
    "posted_time": "Post  by janetriley » Mon Oct 18, 2004 5:08 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrotic Syndrome",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5939&sid=8638cb4413d30f998ac9978e9ed8e411#p5939"
  },
  {
    "author": "sran  Guest Posts: 4 Joined: Sat Oct 25, 2003 4:47 pm",
    "title": "symptoms of Nephrotic Syndrome",
    "content": "Dear friends,  What are the symptoms of Nephrotic Syndrom? What are the current routin treatments for Nephrotic Syndrom?  Thanks for any comments.\n\n",
    "posted_time": "Post  by sran » Sun Oct 26, 2003 3:46 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrotic Syndrome",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1493&sid=8638cb4413d30f998ac9978e9ed8e411#p1493"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "Nephrotic syndrome",
    "content": "Sran,  Please check this page for a summary of clinical findings and a brief treatment overview of nephrotic syndrome. Nephrotic Syndrome  Regards,\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Mon Oct 27, 2003 4:34 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrotic Syndrome",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1503&sid=8638cb4413d30f998ac9978e9ed8e411#p1503"
  },
  {
    "author": "sran  Guest Posts: 4 Joined: Sat Oct 25, 2003 4:47 pm",
    "title": "Re: Nephrotic syndrome",
    "content": "Dear Dr. Fouad,  Thank you for your information. I read the webpage you sent to me. It says glucorticoids are frequently used in the treatment. I want to know what is the reason of using glucorticoids in the treatment, i.e. what is the function of glucorticoids? Are there any negative effects on the patients? Any other methods in the treatment?  Regards,  Tamer Fouad, M.D. wrote:Sran,  Please check this page for a summary of clinical findings and a brief treatment overview of nephrotic syndrome. Nephrotic Syndrome  Regards,\n\n",
    "posted_time": "Post  by sran » Mon Oct 27, 2003 3:08 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrotic Syndrome",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1507&sid=8638cb4413d30f998ac9978e9ed8e411#p1507"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "Glucocorticoids in nephrotic syndrome",
    "content": "Sran, Treatment of nephrotic syndrome depends primarily on the cause, however, it frequently involves the use the glucorticoids given over long periods of time. Especially in cases of minimal change disease. Here the role of steroids is to suppress the autoimmune basis for this disease. The use of cytotoxic agents maybe required in some cases (e.g. cyclophosphamide). Dietary salt control, treatment of hypertension and hypercholestrolemia is also recommended. ACE inhibitors, in addition to controlling blood pressure have also been found to decrease the protein loss. Diuretics may help control the edema and the hypertension.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Mon Oct 27, 2003 5:21 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrotic Syndrome",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1508&sid=8638cb4413d30f998ac9978e9ed8e411#p1508"
  },
  {
    "author": "sran  Guest Posts: 4 Joined: Sat Oct 25, 2003 4:47 pm",
    "title": "Re: Glucocorticoids in nephrotic syndrome",
    "content": "Dr. Fouad,  My nephew is 13 months old. The doctor said he got nephrotic syndrome and his symptoms are similar to the definition of nephrotic syndrome. The doctor suggests to use glucorticoids. My concern is that if there are any negative effects of glucorticoids on him since he is so young.  Thanks, Sran  Tamer Fouad, M.D. wrote:Sran, Treatment of nephrotic syndrome depends primarily on the cause, however, it frequently involves the use the glucorticoids given over long periods of time. Especially in cases of minimal change disease. Here the role of steroids is to suppress the autoimmune basis for this disease. The use of cytotoxic agents maybe required in some cases (e.g. cyclophosphamide). Dietary salt control, treatment of hypertension and hypercholestrolemia is also recommended. ACE inhibitors, in addition to controlling blood pressure have also been found to decrease the protein loss. Diuretics may help control the edema and the hypertension.\n\n",
    "posted_time": "Post  by sran » Mon Oct 27, 2003 6:50 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrotic Syndrome",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1510&sid=8638cb4413d30f998ac9978e9ed8e411#p1510"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "cortisone",
    "content": "Do his tests fit the diagnosis of nephrotic syndrome? What is the level of protein in urine? If the diagnosis is sure (as outlined in the page i referred you to) then glucorticoids is the drug of choice in treating nephrotic syndrome in children as long as we strongly suspect the cause to be minimal change disease of the kidneys. The results of this type of therapy are excellent and a large number of patients are cured forever on it. The benefit from taking the drug in this case outways the risks of its negative effects.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Mon Oct 27, 2003 7:01 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrotic Syndrome",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1511&sid=8638cb4413d30f998ac9978e9ed8e411#p1511"
  },
  {
    "author": "sran  Guest Posts: 4 Joined: Sat Oct 25, 2003 4:47 pm",
    "title": "Re: cortisone",
    "content": "Dr. Fouad,  His 24 hour urinary protein test shows 1.21g. He is 13 months old and his weight is about 25 lbs. He also showed hyperlipidaemia and oedema (although not serious). Is that serious?  Thanks, sran Tamer Fouad, M.D. wrote:Do his tests fit the diagnosis of nephrotic syndrome? What is the level of protein in urine? If the diagnosis is sure (as outlined in the page i referred you to) then glucorticoids is the drug of choice in treating nephrotic syndrome in children as long as we strongly suspect the cause to be minimal change disease of the kidneys. The results of this type of therapy are excellent and a large number of patients are cured forever on it. The benefit from taking the drug in this case outways the risks of its negative effects.\n\n",
    "posted_time": "Post  by sran » Tue Oct 28, 2003 11:35 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrotic Syndrome",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1515&sid=8638cb4413d30f998ac9978e9ed8e411#p1515"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "Nephrotic syndrome",
    "content": "Nephrotic syndrome has a very good outcome with treatment. Go ahead with your doctor's recommendations. There are very few choices in my opinion. The steroids will only be taken for some time and will be tappered as you stop them.  Good luck\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Tue Oct 28, 2003 2:49 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrotic Syndrome",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1516&sid=8638cb4413d30f998ac9978e9ed8e411#p1516"
  }
]