[
  {
    "author": "bandit4102  Guest Posts: 1 Joined: Mon Aug 23, 2010 2:25 am Gender: Female",
    "title": "Dialysis patient short of breath and high BP",
    "content": "75yo male diabetic, dialysis patient with vascular access, renal function is 14%. Has been short of breath since last treatment Friday morning. Blood Pressure is stedily rising and currently at 208/90. blood sugar levels are nid 200s.  I am the daughter in law and I am concerned about my father in law. I have been caring for him since the beginning of August. He has been in and out of the hospital 3 times so far this month. He decided on Friday Aug. 13th 2010, just a couple weeks ago to start dialysis. They put his temporary access in his chest/neck area. Has had four dialysis treatments since then. Since his last treatment last friday he has been short of breath, and his blood pressure has been bouncing back and forth between very low to very high. Currently his BP is 208/90 and has been rising over the last hour or so.  What should I do?\n\n",
    "posted_time": "Post  by bandit4102 » Mon Aug 23, 2010 2:46 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=101586&sid=718853a88eb875ade3053b8ee252d7ec#p101586"
  },
  {
    "author": "KKBCabales, RN  Nurse Posts: 10 Joined: Sun Dec 14, 2008 8:44 pm Gender: Female Location: philippines  Contact:   Contact KKBCabales, RN       Yahoo Messenger",
    "title": "Re: Dialysis patient short of breath and high BP",
    "content": "Hi Good day! It is better if you will get an opinion to a cardiology doctor since your father's signs and symptoms typically involves the heart. A rise in blood pressure is common to dialysis patients but usually during the treatment, hypotension also occurs or drop in blood pressure. A shortness of breath may indicate either the dialysis or removal of water to his body is insufficient. one of the reason why we are doing dialysis is to remove water from the body that accumulates in the lungs which makes the patient difficult to breath. Thus in my opinion, your father in law might need to have increase removal of fluid.. But that is according to the doctor's order,mainly by a Nephrologist and with coordination of Cardiologist. A blessed day!\n\n",
    "posted_time": "Post  by KKBCabales, RN » Wed Sep 21, 2011 2:04 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=102662&sid=718853a88eb875ade3053b8ee252d7ec#p102662"
  },
  {
    "author": "dxUGA  Guest Posts: 1 Joined: Mon Aug 16, 2010 7:48 pm Gender: Male",
    "title": "Bilateral Flank Pain & Microscopic Hematuria",
    "content": "Hoping for Answers.  33 y/o male.  Generally healthy and fit.  I've been dealing with intermittent bilateral flank pain for a few months now.  Pain is not severe nor is it constant - crampy/uncomfortable at times would be a good description.  Also, pain can be bilateral, unilateral on either side, or not there at all at times.  No fever nor chills present.  Visited GP in mid July 2010. Urinalysis showed trace hematuria (which has never been visible to me) and trace white blood cells.  Culture was negative for infection.  Prescribed a course of Cipro 750 mg twice daily for 10 days as a precaution.  Also sent for Renal CT scan searching for stones which came back negative.  Symptoms seem to be improved following antibiotics but are still present.  GP referred me to a Urologist to search for cause of trace hematuria.  I visited the Urologist this morning and urinalysis still showed trace hematuria but trace white blood cells are gone. The Urologists has scheduled a cystoscopy for next week.  Most recent CBC bloodwork taken in April 2010:  UREA NITROGEN (BUN) - 13 mg/dL - (7-25 normal range) CREATININE - 0.86 mg/dL - (0.79-1.33 normal range) eGFR - >60 mL/min/1.73m2 - (> OR = 60 mL/min/1.73m2 normal range)  Sodium - 141 mmol/L - (135-146 mmol/L normal range) Potassium - 5.6 mmol/L High - (3.5-5.3 mmol/L normal range)  Chloride - 105 mmol/L (98-110 mmol/L normal range) Carbon Dioxide - 24 mmol/L (21-33 mmol/L normal range) Calcium - 10.3 mg/dL High - (8.6-10.2 mg/dL normal range) Protein, Total - 7.9 g/dL - (6.2-8.3 g/dL normal range)  All other results from CBC not listed above were within normal range.  GP wrote off the slightly elevated Potassium and Calcium as a bad sample.  My questions are: 1-Do the described symptoms indicate a urinary tract/bladder problem or are they more likely kidney-related? 2-What are some possible causes of these symptoms?  Also, maybe unrelated but have noticed that my wedding band and watch seem looser than before, I've had geographic tongue for the duration of symptoms, and this past week I've noticed that my fingers seem to be slightly pruny (like I've been in the swimming pool too long only I haven't) and the skin on my fingertips on my right hand (where my fingerprints are) peeled last week for no apparent reason.  I'm concerned (a little scared) that there might be something serious going on so any advice would be much appreciated.  Thanks.\n\n",
    "posted_time": "Post  by dxUGA » Mon Aug 16, 2010 8:43 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=101060&sid=718853a88eb875ade3053b8ee252d7ec#p101060"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: Bilateral Flank Pain & Microscopic Hematuria",
    "content": "Hi, Hematuria may be  - symptomatic or - asymptomatic. Several studies have indicated that the prevalence of asymptomatic microscopic hematuria varies from 0.19 percent to 16.1 percent and in the elderly age group, it may be about 21%.  Normal urine usually is devoid of blood cells. Once Red blood cells(RBCs) are identified, one needs to determine if the hematuria is \"significant\".If the centrifuged sediment in two or three properly collected urinary samples contains an average of >3 RBCs/High power field (HPF),it is called as microscopic hematuria.  The next step is to decide if further testing is required. Risk factors that indicate possible significant underlying disease in patients with microscopic hematuria are, - Age >40 years, - Smoking history, - History of irritative voiding symptoms, - Analgesic abuse, - Occupational exposure to chemicals or dyes (benzenes or aromatic amines), - History of gross hematuria, - History of urologic disorder or disease, - History of urinary tract infection, and - History of pelvic irradiation.  In individuals with these features, further testing for underlying causes is warranted.   Further testing begins with measures to try and determine the area of the urinary tract from where the RBCs may be leaking out.The best method perhaps is the phase contrast microscopy. On phase contrast microscopy, morphologic appearance of the RBCs may help in differentiating glomerular and nonglomerular source of microscopic hematuria.  \"Dysmorphic\" erythrocytes showing an irregular outer cell membrane and red blood cell casts suggest hematuria of glomerular origin. Acanthocytes, which are ring-shapd erythrocytes with one or more membrane protrusions of variable size and shape, are thought to represent an early form of dysmorphic erythrocytes and therefore also indicate a glomerular origin.  Erythrocytes of uniform character are classified as isomorphic and suggest a lower urinary tract origin. Microscopic clots of clumped RBCs are also suggestive of lower urinary tract bleeding.  The presence of both dysmorphic and isomorphic erythrocytes in urine represents a mixed morphologic pattern and should be labeled as hematuria of nonspecific origin.  As you have been having recurrent bilateral loin pains, the hematuria is more likely to be from the upper urinary tract. Further investigations as advised by your urologist are likey to shed more light on the cause of your symptoms. Good luck!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Thu Sep 09, 2010 5:13 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=102157&sid=718853a88eb875ade3053b8ee252d7ec#p102157"
  },
  {
    "author": "spEakKs  Guest Posts: 3 Joined: Wed Apr 22, 2009 12:52 pm Gender: Female",
    "title": "Always thirsty..",
    "content": "I am 19, female and in college. I drink a fair share of sodas and juices but I also drinks lots of water. I am ALWAYS thirsty. I drink about 4-5 bttles of water 2 sodas and about 2 juices a day...everyday...I eat ice constantly and have been a little fatigued lately. My mothe is hypoglycemic (I think thats how you spell it) and her father died of diabetes. My fathers mother also is in kidney failure due to diabetes. Is it likely that I may be having kidney issues?\n\n",
    "posted_time": "Post  by spEakKs » Wed Apr 22, 2009 1:25 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=75428&sid=718853a88eb875ade3053b8ee252d7ec#p75428"
  },
  {
    "author": "Dr.M.jagesh kamath  Medical Doctor Posts: 1303 Joined: Mon Aug 03, 2009 7:24 am Gender: Male",
    "title": "Re: Always thirsty..",
    "content": "Hello,Pagophagia is consuming ice constantly is also considered as a part of pica.Some studies have found that this could be a manifestation of iron deficiency anaemia.This is more commonly found in pregnant women and children.Since you are complaining of fatigue you should get CBC and a urine analysis to rule out sugar since you have a family history. Best wishes.\n\n",
    "posted_time": "Post  by Dr.M.jagesh kamath » Mon Sep 06, 2010 12:26 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=102116&sid=718853a88eb875ade3053b8ee252d7ec#p102116"
  },
  {
    "author": "mijo  Guest Posts: 1 Joined: Wed Aug 25, 2010 1:13 am Gender: Female",
    "title": "Frequent Kidney stones, pain, doctors confused",
    "content": "For the past 3 years i have been having kidney stones and pain which starts in my back and travels round to my bladder.  The occurrences have been becoming more frequent and I have visited many Urologists (they say drink more water) - surely there is better advice than this.  I have done 24 hour urine collections (oxalate crystals and super saturation of calcium).  I have been to the ER when the pain has been too severe, CT scans always reveal stones in both kidneys (and never the same number - so something is happening to them).  Lately I have been having bone/muscle pain alternating with Kidney stones.  I have had pain in my hands, feet, knees and elbows.  Migraine like headaches (behind one eye only).  My energy level is low.  I fatigue easily and can sometimes not even get up to feed myself.  I am often not inclined to eat, even if I could make something.  I have occasional heart palpitations and night sweats.  Clammy skin.  Clinically the various tests have shown:  high normal PTH (52-65), normal serum and ionized calcium, low vitamin D, High Rheumatoid factor (56).  RA has been ruled out.    The doctors do not feel that the high PTH is an issue, though isn't it odd that the PTH is high but the calcium is normal - shouldn't a high PTH imply a low calcium?  The Vitamin  D level (12-19) has been of concern to the doctors.  I take the 50000IU (once per week) and almost immediately my bone pain increases and my energy levels go down.  This lasts for several days, when the kidney pain takes over.  By the time it has all calmed down it is time to take another Vitamin D pill.  The endocrinologist, or the PCP, does not understand (or acknowledge) that this is happening.  I am at my wits end and do not know what to do next, or who to turn to.  My life is reduced to sitting and waiting in pain.  I have given up my job and most of my personal hobbies,  my husband and I are now just trying to figure out what to do next.  Any advice?\n\n",
    "posted_time": "Post  by mijo » Sun Aug 29, 2010 3:32 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=101993&sid=718853a88eb875ade3053b8ee252d7ec#p101993"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: Frequent Kidney stones, pain, doctors confused",
    "content": "Hi, The debate over what the optimal blood levels of vitamin D are and what is the appropriate dosage for supplementation continues to exist.Moreover, the \"Tolerable Upper Intake Level (UL)\" is also unclear.  What is meant by supplementation is the dose needed over and above the amount available from dietary sources + what is available via the skin (both of which are variable and difficult to ascertain). The amount absorbed via the skin depends upon the geographic region where a person lives (especially the northern latitudes) and the seasons(less in winter season).  Dark skin blocks ultraviolet wavelengths of light. Obesity results in sequestration of vitamin D in the excess fat so it is not available for use (although in storage). Thus, circulating 25(OH)D levels often underestimate the total body stores. Aging also lowers vitamin D levels as the aging skin's ability to make vitamin D declines.  There has been considerable variability in results of laboratory estimation of the level of 25-hydroxy-vitamin D. Falsely low or high values are not uncommon depending on the particular technique or laboratory used. Just over an year ago, in July 2009, a standard reference material has become available, which should result in better uniformity in standardization between laboratories.  A vitamin D level below 10 nanograms per milliliter is generally considered to indicate \"Vitamin D deficiency\". This should not be confused with the more controversial \"optimal blood levels\" for a given population to maintain health.What the optimal levels are, is as yet inconclusive.  In the US, Food and Nutrition Board (FNB) of the Institute of Medicine in 2007, identified >15 ng/mL (> 37.5 nmol/l) as adequate for bone and overall health in healthy individuals (please note that 1 ng/mL = 2.5 nmol/l). Others recommend that one should aim for vitamin D blood test levels of 30 ng/mL or more. You have not indicated whether the Vitamin D level of (12-19) is in ng/mL or in nmol/l).If it is in ng/mL it is close to being vitamin D deficient (borderline) if one goes by the FNB guidelines.  The Vitamin D Council (a non-profit organization promoting Vitamin D and informing people about the dangers of being Vitamin D deficient) recommends optimal blood levels of vitamin D of 50-80 ng/ml.if one goes by this, your values clearly indicate suboptimal levels.  The Institute of Medicine (a not-for-profit, non-governmental American organization) currently recommends vitamin D supplementation at the following levels: - 200 international units (IU) per day from birth to 50 years of age, - 400 IU per day for adults aged 51 to 70, and - 600 IU per day for adults 71 and older.  No extra benefit is obtained from taking more than 400 IU/day except for therapeutic indications. \"Increased intake of vitamin D (greater than or equal to 1,000 IU/d) -- particularly during the winter months and at higher latitudes -- and judicious sun exposure would improve vitamin D status and likely improve the overall health of the U.S. population\". Adit A. Ginde et al. \"Demographic Differences and Trends of Vitamin D Insufficiency in the US Population, 1988-2004\". Arch Intern Med. 2009;169(6):626-632.   The National Institutes of Health (NIH) has a \"Tolerable Upper Intake Level (UL)\" of 2,000 IU/day, while newer studies indicate a UL as high as 10,000 IU/day.  Taking very high daily doses of  vitamin D - for example, 50 or more times the recommended daily allowance (RDA) over several months, can cause toxicity and high calcium levels in the blood. Some researchers recommend that daily low doses are safer than infrequent high doses.  Your calcium levels apparently are normal, but the PTH is at the upper limit of normal range(still within normal limits). A high PTH with  normal calcium levels could occur with mild magnesium deficiency. This should be excluded. Your vitamin D dosage should be based several considerations including, - where you live, - your skin color, - life style, - likely dietary intake,and - vitamin D levels. Individuals on relatively higher dosages should be monitored for possible toxicity (calcium and 25-OH-vitamin D levels checked weekly at the start of supplementation, then on a monthly basis). As you are on a higher dosage schedule, you need to be carefully monitored,especially so because of the history of recurrent renal stones.  Best wishes!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Fri Sep 03, 2010 1:39 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=102063&sid=718853a88eb875ade3053b8ee252d7ec#p102063"
  },
  {
    "author": "sandinid10  Guest Posts: 1 Joined: Sat Aug 14, 2010 9:25 pm Gender: Female",
    "title": "Severe Kidney Pain (started left side & continued to right)",
    "content": "I started to have lower back pain right underneath my ribs starting Friday night (it is now Saturday night). I plan on seeing my doctor Monday morning but the pain has spread to my other side which I think is my other kidney. I've had no pain or blood with urination maybe a little but of stinging which subsided around a week ago, my stool is soft and light brown which is a little abnormal for me (that has been going on for 2 weeks maybe). The pain is dull, hurts when I move or take a deep breath and is only severe at night. I just want to know if I'll be okay until Monday morning when my doctor's office is open? I've had UTI's before and I've never left them untreated to the point where I'd get a kidney infection. I have a feeling it may be a kidney infection but will I be okay until Monday? How long can you keep it untreated? I'm just nervous because the pain has moved from my left side and continued to the right. Thank you for taking time to read this.\n\n",
    "posted_time": "Post  by sandinid10 » Sat Aug 14, 2010 9:36 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=100893&sid=718853a88eb875ade3053b8ee252d7ec#p100893"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: Severe Kidney Pain (started left side & continued to right)",
    "content": "Hi, It is not very clear from your description the exact location of your pain. However, there is a possibility that it could be a fixed renal pain.I suggest that you should consult your doctor without delay and have your renal functions tested first. The next step would be an ultrasound examination to exclude hydronephrosis and to look for any calculi.  Hydronephrosis with any of the following may turn out to be an emergency. - Fever / chills, - Diabetes Mellitus, - immunosupression, - oliguria / Anuria, - solitary Kidney.  Thus, as long as there is no suspicion of a pyonephrosis, there is no acute emergency.You must get investigated without much delay. Best wishes!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Sat Aug 21, 2010 4:44 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=101448&sid=718853a88eb875ade3053b8ee252d7ec#p101448"
  },
  {
    "author": "victoryflower  Guest Posts: 2 Joined: Mon Jul 26, 2010 6:02 am Gender: Female",
    "title": "Proteinuria, no edema, nocturia and metallic taste in mouth",
    "content": "What's the initial dx of a patient  female 42 y.o with proteinurie 4+, no edema, wakes up 4-5times a day at night to urinate. hypertension stage 2, cardiomegali, urine production normal, 2 months of nausea and vomiting and metallic taste (+). please do help, thanks\n\n",
    "posted_time": "Post  by victoryflower » Mon Jul 26, 2010 6:28 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=98639&sid=718853a88eb875ade3053b8ee252d7ec#p98639"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "Re: Proteinuria, no edema, nocturia and metallic taste in mouth",
    "content": "Hello, You give no information about the patient's consciousness level or blood sugar / ketonuria as in DKA? Was an electrolyte panel requested? Is the patient hospitalized? It's also important to assess the possibilities and dangers of dehydration. What about her daily protenuria was it quantified?   Menstrual history?  Any scans (abdominal ultrasound) done? It really could be anything at this stage from metabolic condition, to an abdominal tumor encroaching on the viscera, to a renal condition, amyloidosis, to pregnancy and pre-eclampsia. It's a shot in the dark really - there's not enough information. Sorry I can't be of more help.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Mon Jul 26, 2010 8:29 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=98653&sid=718853a88eb875ade3053b8ee252d7ec#p98653"
  },
  {
    "author": "victoryflower  Guest Posts: 2 Joined: Mon Jul 26, 2010 6:02 am Gender: Female",
    "title": "Re: Proteinuria, no edema, nocturia and metallic taste in mouth",
    "content": "Hello,  Well, I was asked to dx a patient with very limited lab equipment. The patient I mention suffers from CKD, (high level of Ur/Cr, decrease of BUN < 15). Is it possible to dx a patient with CKD with very limited lab test (done manually and only once). Thank you.\n\n",
    "posted_time": "Post  by victoryflower » Tue Jul 27, 2010 6:47 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=98822&sid=718853a88eb875ade3053b8ee252d7ec#p98822"
  },
  {
    "author": "Lillyofparadise  Guest Posts: 1 Joined: Wed Jul 21, 2010 3:19 pm Gender: Female",
    "title": "Nutcracker phenomenon",
    "content": "I wonder what other possible complications could a person with the \"nutcracker phenomenon\" have?\n\n",
    "posted_time": "Post  by Lillyofparadise » Wed Jul 21, 2010 3:53 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=98089&sid=718853a88eb875ade3053b8ee252d7ec#p98089"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: Nutcracker phenomenon",
    "content": "Hi, \"Nutcracker phenomenon\" refers to compression of the left renal vein, in the angle between the aorta and the superior mesenteric artery, with drainge of the blood via the vein often accompanied by distention of the distal portion of the vein.  A distinction has been proposed to distinguish \"nutcracker phenomenon\", which is a radiologic finding in an asymptomatic individual, from \"nutcracker syndrome\" (NCS), which is characterized by the combination of radiologic findings of meso-aortic compression of the left renal vein and dilated collateral veins associated with clinical picture of chronic left flank pain, haematuria, orthostatic proteinuria, and pelvic venous congestion.   This syndrome can only be diagnosed after excluding all known causes of hematuria.  Some of the reported complications are,   - Postural Orthostatic Tachycardia Syndrome (pediatric chronic fatigue syndrome): a Common finding in some studies on pediatric NCS patients associated with orthostatic hypotension and chronic fatigue.   - left renal venous hypertension leading to pericaliceal varices causing unilateral severe hematuria, the originally reported symptom of NCS.   - development of varicosities of the gonadal veins.  - occasionally varicoceles among men and   - abnormal menstruation among women.   Hope this information is helpful. Best wishes!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Thu Jul 22, 2010 2:00 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=98230&sid=718853a88eb875ade3053b8ee252d7ec#p98230"
  },
  {
    "author": "kranemetal  Guest Posts: 1 Joined: Thu Jul 15, 2010 12:00 pm Gender: Male",
    "title": "Increased Serum Creatinine",
    "content": "Respected Doctors,  My Father's Serum Creatinine level is 2.6mg% as against a normal range of 0.5 to 1.4 mg% found out by Jaffe Kintec method. What is the cause behind this increase, any particular foodstuff or medicine ? Further, what should be our course of action ? Which specialist we must see in this case ?  About my Father : He is 48 years old, is a Teacher by profession, eats mostly vegetarian food, overall fit and indulges in brisk walks, occasionally he takes painkillers to get relief from pain in calves and feet, resulting from standing continuously in the classroom.  Eagerly waiting for a reply,  Thank You, Amit Purswani.\n\n",
    "posted_time": "Post  by kranemetal » Thu Jul 15, 2010 12:28 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=97273&sid=718853a88eb875ade3053b8ee252d7ec#p97273"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: Increased Serum Creatinine",
    "content": "Hi, You have not indicated the duration of this laboratory finding as well as if he has any problems with voiding of urine.  NSAIDs are certainly capable of causing renal damage. A urinary bladder outlet obstruction, often caused by benign prostatic hyperplasia (enlarged prostate) needs to be excluded. There can be other causes as well for bladder outlet obstruction(prostatic cancer, bladder neck stenosis etc).  Your father needs to be seen urgently by your regular family doctor who, after assessing his condition and having certain lab tests done(renal function tests,serum electrolytes etc), will be better placed to decide on the question of to whom to refer for for a specialist opinion.  Best wishes!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Tue Jul 20, 2010 2:25 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=97878&sid=718853a88eb875ade3053b8ee252d7ec#p97878"
  },
  {
    "author": "Adampc  Guest Posts: 1 Joined: Sat Jun 12, 2010 7:04 pm Gender: Male",
    "title": "1yr of mild discomfort in left flank",
    "content": "For about a year now, ever since I came back from the caribbean (where I spent 2 years studying), I've been having some very mild discomfort in my left lower back area (flank) that comes and goes every few days and which I only barely notice. But every few months I get a slight pain (which is more noticeable) that lasts for an instant and is maybe followed by one more instant of slight pain perhaps 2 seconds later, and that's it.  I was thinking it might be kidney stones because of the drinking water where I was living, which may have had a lot of calcium. I've never had any painful stones before so I was wondering if I should be worried about this or if drinking lots of water will be enough of a cure, and how long this might go on for. Thank you.\n\n",
    "posted_time": "Post  by Adampc » Sat Jun 12, 2010 7:43 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=93939&sid=718853a88eb875ade3053b8ee252d7ec#p93939"
  },
  {
    "author": "skigirl347  Guest Posts: 1 Joined: Tue Jun 08, 2010 4:38 pm Gender: Female",
    "title": "lower back pain and hard breathing, kidney related?",
    "content": "I am a 15 year old female, and for several years i have been having strange back pains.  Then are in my lower back, but deeper in than the spine and muscles.  The pains occur randomly and in the last few months have been occuring more often, and are more painful.  When the pain comes on, I also have some difficulty breathing, my chest feels heavy.  When it happens, i lie down flat and usually after about 5 minutes is starts to go away.  It is very painful and can be very inconvenient when i can't leave class at school.  I was wondering if it could be at all related to my kidneys, or if you have any other idea of what it could be.  Thank you.\n\n",
    "posted_time": "Post  by skigirl347 » Tue Jun 08, 2010 4:53 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=93544&sid=718853a88eb875ade3053b8ee252d7ec#p93544"
  },
  {
    "author": "brandygb  Guest Posts: 1 Joined: Tue Jun 08, 2010 1:49 pm Gender: Female",
    "title": "FSGS or another kidney issue?",
    "content": "I'm 30 years old, a smoker, and a bit overweight (5'4 and 155lbs) I am routinely followed for issues related to my heart (peripartum cardiomyopathy in 2000 recovered EF of 57%) and to watch my kidneys because of my heart.  My chief complaint is bubbly urine, and major twitches and cramps in my legs and feet - CONSTANTLY and light swelling in the feet, itching everywhere.  24 hour protein results from March 29 2010 Creatinine, Serum 0.71 Creatinine, Urine 54.1mg/dl  (normal range 16.0-327.0) Creatinine, urine, 24hr 1038.7mg/24 hour (normal range 800-1800) Creatinine Clearance 100mL/min (normal range 88-128) Protein Total  24 hour urine 2.1mg/dl (normal range 0.0 to 15.0) (verified by repeat analysis) Protein 24 hour calculated 40.3mg/24 hr (normal range 30-150)  Same day - Kidney ultrasound doctor said kidney's look great on ultrasound Urology report negative for cancer (didn't even know they ran that!) and cystoscopy is negative.  Previous urine tests: Feb 24, 2010 dipstick test Blood - trace-lysed Protein- Negative Leukocytes- trace  07/07/09 blood- small leukocytes- moderate Ua protein- negative   6-19-2009 Blood 3+ Protein 1+ Leukocytes - negative  6-15-2009 Blood - negative Protein- negative Leukocytes- trace  Blood tests: Serum Creatinine: 09/30/2000 - 0.7 11/21/00 - 0.9 7/11/01- 0.7 7/21/01- 0.7 6/19/09-0.8 7/7/09-0.9 12/28/09- 0.76 2/11/10- 0.81 02/17/10- 0.81 2/17/10-0.77 2/24/10 0.74 2/24/10- 0.74  Bun has always been between 6 and 9  At last check 02/27/10 my Serum Protein total was 7.5 (normal 6.2-8.3) and of that 4.6 was albumin and 2.9 was golobulin  Since all of this testing, the bubbles have gone away and then come back with a vengence, all of my leg muscles twitch and cramp constantly and I'm feeling some major back pain and nausea. I don't want any more blood tests if they are unnecessary - but what are the odds that something is really wrong - or changed quickly and I need to call my doctor? Do I need to change anything in my diet?\n\n",
    "posted_time": "Post  by brandygb » Tue Jun 08, 2010 1:51 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=93534&sid=718853a88eb875ade3053b8ee252d7ec#p93534"
  },
  {
    "author": "Kidney Problems  Guest Posts: 1 Joined: Fri Nov 06, 2009 11:08 am Gender: Female",
    "title": "Chronic Pyelo since childhood, unknown etiology",
    "content": "Hi- I am a 22 y/o female that has had chronic uti's and pyelo since childhood. I have had 7 kidney infections this year! I take 1 cipro for suprression after my husband and I have intercourse. I have had renal ultrasounds done and the findings are normal. I am pretty sure I have another kidney infection right now, but don't want to go into the doc. because I don't think he knows what else to do. I also have just started noticing that I am having a increase in body odor , and have tried every deodorant in the book. I am wondering if this has to do with my chronic kidney infections since they filter everything out?  Thank yous so much!\n\n",
    "posted_time": "Post  by Kidney Problems » Fri Nov 06, 2009 11:24 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=86093&sid=718853a88eb875ade3053b8ee252d7ec#p86093"
  },
  {
    "author": "Dr.M.jagesh kamath  Medical Doctor Posts: 1303 Joined: Mon Aug 03, 2009 7:24 am Gender: Male",
    "title": "Re: Chronic Pyelo since childhood, unknown etiology",
    "content": "Hello,I am sure you have had voiding cystograms to rule out a vesicouretral reflux(VUR).Anatomical abnormalities also could be a factor in recurrent infections and if so some authors recommend a endoscopic antireflux procedure in patients with anatomic defects even in the absence of VUR, with good results.Do consult a urologist for more details.I do not think the body odour is anything to do with the recurrent infections.Best wishes.\n\n",
    "posted_time": "Post  by Dr.M.jagesh kamath » Tue Nov 17, 2009 11:20 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=87173&sid=718853a88eb875ade3053b8ee252d7ec#p87173"
  },
  {
    "author": "Tami0366  Guest Posts: 1 Joined: Tue Oct 27, 2009 4:05 pm Gender: Female",
    "title": "Kidney Infection - Disagreeing Doctors",
    "content": "I started with burning when urinating and dark urine.  I went to my gyn doctor and he said bladder infection.  He prescribed an antibotic and I finished the meds.  The day after the burning came back.  Went back in for a urine test and he said urine was clear.  2 adys later I woke up at 3 in the morning with intense lower back pain.  I went to the ER and they did urine, blood test, and ct scan.  CT scan was negative.  UA Chem screen was as follows: Color - Yellow Appearance - SL Hazy Specific Gravity - 1020 Leukocytes - Urine = 2+ Nitrites = NEG pH = 6.0 Protein = 2+ Sugar = NORM Ketone = NEG Bile = NEG Urobilinogen = Normal Occult Blood = 3+  UA Microscopic RBC (hpf) = INNUMERABLE WBC (hpf) = INNUMERABLE WBC Clumps = MODERATE Bacteria = Many Squameous Epithelial = 1  CBC WBC = 17.8 RBC = 5.11 HGB = 15.2 HCT = 45.4 MCV = 88.8 MCH = 29.8 MCHC = 33.5 RDW = 15.2  Platelet Count Platelet Count = 274 Mean Platelet Volume 7.8  Differential Segs = 72 Bands = 2 Lymps = 24 Monos = 2  Comprensive Metabolic The only thing out of range is ALT (SGPT) = 9  My problem is that my gyn says that I do not have a kidney infection.  He has a copy of the results from the ER visit.  He says the flank pain is coming from a pulled muscle.  This concerns me because the pain is still there.  (not as intense as before)  I am also concerned about taking a strong antibotic (ER doc prescribed Cipro) if it is not necessary.  I know enough about blood testing to know that my white count should not be that high.  This knowlegde came from having my appendix rupture in 2007.  I walked around with the ruptured appendix for 14 days because it only hurt in my back.  I took 800mg of Ibuprofin and it releived the pain. I still have said appendix and every time I have have back pain I wonder if it is that appendix again.  I have had at least 6 scans since this happend and they all say the appendix is normal.  This seems a little strange to me.  One doctor went so far as to say that the appendix looks as if nothing happened to it.  Please advise ASAP.  I do not want to take antibiotics if I have nothing more than a pulled muscle.  Thank you\n\n",
    "posted_time": "Post  by Tami0366 » Tue Oct 27, 2009 4:42 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=84996&sid=718853a88eb875ade3053b8ee252d7ec#p84996"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: Kidney Infection - Disagreeing Doctors",
    "content": "Hi, Before attempting to making sense out of the reports,i would like to place a few facts before you.... - mere presence of numerous white blood cells in the urine does not automatically mean there is UTI.It only means that there is pyuria.  - presence of significant number of red blood cells in the urine assumes significance only if the urine specimen (in females) had not been collected during the menses or in the next few days following cessation to menstrual flow.  - UTI can be diagnosed ideally if a urine culture shows significant numbers of microorganisms(which are not contaminants).  - if a urine sample is allowed to stand for a prolonged period of time before testing, bacterial growth may occur and the finding of  'Bacteria = Many' may not be considered significant.  The total WBC count is certainly high, but band forms are not excessive.Is there any chance that you were pregnant at that time?(Total WBC counts usually increase during pregnancy).  I do not know if your urine had been cultured and if so, what the report was.If your urine had not been cultured,it is certainly indicated. Best wishes!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Thu Nov 05, 2009 12:24 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=85999&sid=718853a88eb875ade3053b8ee252d7ec#p85999"
  },
  {
    "author": "BrainKing  Guest Posts: 2 Joined: Wed May 27, 2009 6:33 pm Gender: Male",
    "title": "Blood, Crystals & \"Kidney cells\"",
    "content": "Hi. I am 23 year old male. I eat healthy, hardly any meat. I feel healthy. However from time to time i have pains near my right side (i will clutch my kidney area.) The pain isnt as bad as i have hard a kidney stone is though. The pain will happen at random, although more often after walks. A CT Scan showed 2 kidney stones on right side (2months ago). Urine tests done 1month ago and last week  showed blood, crystals and \"cells from the kidney.\" I have to see a nephrologists, but what should i know before that. What should i expect?  Thank you, BrainKing\n\n",
    "posted_time": "Post  by BrainKing » Wed May 27, 2009 6:38 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=79815&sid=718853a88eb875ade3053b8ee252d7ec#p79815"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: Blood, Crystals & \"Kidney cells\"",
    "content": "Hi, The pain in your right loin could have been caused by the renal stones.As far as the urinalysis report is concerned i would like to give you the following info...  Epithelial cells found during urine microscopy  are generally of little diagnostic importance. Cells lining the urinary tract may slough into the urine.   Renal tubular epithelial cells,normally slough into the urine in small numbers. About 0-1 cells/five high power fields is considered normal. An increase in this number is sometimes seen in nephrotic syndrome.  I do not think you should be excessively worried about the \"kidney cells\" in your urine. Good luck!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Fri Oct 16, 2009 7:59 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=84003&sid=718853a88eb875ade3053b8ee252d7ec#p84003"
  },
  {
    "author": "xilepeco  Guest Posts: 1 Joined: Mon Sep 07, 2009 12:21 am Gender: Male",
    "title": "Urine pH",
    "content": "Hi,   I would like to find out more about my urine pH throughout the day. My urine is usually alkaline in the day and acidic towards the evening. I've been peeing on dipstick to check the pH and usually get acidic first time in the morning. It gradually becomes alkaline to about pH 8 and will move towards acidic around 5 to 6 pm.  I am concern about this and would like to know if it is usual. I do know that diet influence the pH in urine but I'm not a vegetarian. I do eat about 3-5 servings of veg/fruits throughout the day and don't eat that much meat (about 2 servings or less).  Appreciate any information provided. BTW I am on medication, Pantoprazole sodium sesquihydraate and itopride hydrochloride for my gastritis.  Colin\n\n",
    "posted_time": "Post  by xilepeco » Mon Sep 07, 2009 12:44 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=81930&sid=718853a88eb875ade3053b8ee252d7ec#p81930"
  },
  {
    "author": "blsnipe  Guest Posts: 1 Joined: Thu Apr 23, 2009 9:14 pm Gender: Female",
    "title": "Bi-Lateral Kidney Stones and Persistant Pain",
    "content": "I have had numerous endocrinology problems, PCOS and hypothyroidism. During all my pregnancies I had numerous UTIs and Kidney Infections. However, after I had my third child I started having persistent pain on my right side. It worsens when I bend over or reposistion myself. I had a MRI done and it showed numerous bi-lateral kidney stones. However, the urologist thought that the stones were too small and not in the correct position to cause the pain. Now, two years later, I still have that pain and it is constant. No doctor can seem to figure it out. What could cause pain that seems to be from my right kidney, and hurts worse when I bend over?\n\n",
    "posted_time": "Post  by blsnipe » Thu Apr 23, 2009 9:35 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=75603&sid=718853a88eb875ade3053b8ee252d7ec#p75603"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Bi-Lateral Kidney Stones and Persistant Pain",
    "content": "Hello --  The fact the kidney stones are present still makes them the prime suspect, although their being small and the pain aggravated by bending at the waist does throw some doubt on  this. If the stones are definitely not the cause there are so many possibilities outside that one it would be difficult to enumerate let alone speculate on the possible cause. Given there are multiple bilat. stones with no help from the urologist suggests it may be time for a second opinion. Those stones can't be doing any good anyway and still may well be the cause of the pain, at least indirectly.   Wish I could give you a better answer, but outside the stones there are just too many, mostly benign, possible causes for this postural pain I  can only recommend a consult with another urologist. If that fails to yield any valid result, consult with a good internist would be next.   Hope this is helpful. Good luck to you.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Thu May 28, 2009 10:29 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=79982&sid=718853a88eb875ade3053b8ee252d7ec#p79982"
  },
  {
    "author": "senyax  Guest Posts: 1 Joined: Tue Sep 23, 2008 12:28 pm Gender: Female",
    "title": "creatinine levels in drug testing",
    "content": "I am an attorney with a client who is required to drug test randomly. She has tested over 40 times, roughly once every four or five days, and has had no \"positives\" for any amphetamines, alcohol, THC, cocaine, opiates, barbiturates, or benzodiazepines. She has been on methadone, and, at various times, taking various anti-depressants and medications for her mental illness. (She is said to be bi-polar.) Her drug tests show creatinine levels which fluctuate wildly ---  from 40.6 mg/dL to 210.6 mg/dL, and on one occasion she had a creatinine level of 19.7 mg/dL, which the lab characterized as a \"dilute specimen.\" All the stuff I've read on line about creatinine tests measure \"normal\" levels as, for example, 1.2 or 2.5mg/dL. So why are her levels measured differently? Is there any reason for a drug test to test creatinine other than to try to identify urine specimens that have been diluted? Wouldn't one specimen testing at 19.7 mg/dL, in the midst of all these wildly fluctuating levels, be unlikely to be an attempt by her to dilute her specimen? What would cause such a wild fluctuation in creatinine?\n\n",
    "posted_time": "Post  by senyax » Tue Sep 23, 2008 1:15 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=61281&sid=718853a88eb875ade3053b8ee252d7ec#p61281"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: creatinine levels in drug testing",
    "content": "Hello -  Most common causes of creatinine elevation are kidney disease, diets high in meats and certain medications, especially some antibiotics. However, the readings you relay are so grotesquely out of range (10-50 times the high end of abnormal) that they should have been either cited as a \"critical lab finding\" or thrown out and repeated because, if the patient is not deathly iil, then these results are apparently lab errors.   The \"dilute specimen\" finding makes no sense in the contex of the other, wildly out of range readings, and even this level would be difficult to achieve via dilution to skew the test results.   The only explanation I can think of is that this lab is using some obscure or outdated scale, or is incompetent. Anyone with findings such as those of your client would normally be place on dialysis if it weren't too late already.   Wish I could be more helpful, but this really doesn't make much sense. I can  only suggest the possible assignment of a different lab.   Hope this is helpful.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Tue Oct 14, 2008 10:19 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=62192&sid=718853a88eb875ade3053b8ee252d7ec#p62192"
  },
  {
    "author": "ToxPro  Guest Posts: 4 Joined: Tue May 26, 2009 7:11 pm Gender: Male Location: Arizona",
    "title": "Re: creatinine levels in drug testing",
    "content": "I wish I saw this post 8 monhts ago! :)  The original post indicated that normal urine creatinine levels are 1.2-2.5 mg/dL - this is simply not accurate - I suspect the referenced source was either mistaken or the units employed are incorrect, as they are off by a factor of 10.  Normal urine creatinine levels for random urine collections are typically observed between 40-250 mg/dL, with a mean around 100 mg/dL. Variability of random urine collections may be observed between 10-350 mg/dL, depending upon the individual and circumstances.  Being an expert in the field of Forensic Urine Drug Testing for over 20 years, I can attest that this variability in urine creatinine is not uncommon. I suspect the (previous reply) CNA's confusion may lie in trying to compare a random urine draw to a 24-hour urine collection.  One of the many reasons a 24-hour urine is collected in a clincial setting is to normalize urine hydration and to get a more accurate representation of the concentration of the compound being voided.   It is true that creatinine can vary due to kidney disease, diets high in meats, certain medications, as well as age, gender, and metabolism. However, rapid intake of copious amounts of fluids, particularly when the client has ingested a diuretic, can dramatically increase urine production in a state of polyuria that produces diluted samples (very low creatinine levels - less than 20 mg/dL).  Conversely, a simple case of dehydration can dramatically increase urine creatinine levels 2-3 fold.  The most common technique employed to \"beat\" a drug test is \"water-laoding\" - consuming copious amounts of fluid in a short period of time within 30 minutes of a urine collection to achieve a state of polyuria.  The state of polyuria typically lasts from 1-4 hours, and during that time the urine may be diluted by a factor of 5-10 or more.  The desired effect is to lower the overall concentration of trace amounts of drug(s) in the urine to a level that is below the detection limit utilized by the laboratory.  This is very effective method for temporarily \"masking\" THC (marijuana metabolite) in a casual marijuana smoker's urine.  Many commercial products exist on the market that make claims that they can \"detoxify\" the body to facilitate passing a drug test. These products, sold in liquid, capsule, pill, or tea bag form, typically work by the principle of dilution.  They contain herbal supplements that are natural diuretics, which are to be ingested with 80-128 oz of fluids (or more!) within 60 minutes of providing a urine sample.    SAMHSA has recognised this as a potential method of subverting federally mandated drug testing, and requires creatinine be measured on all urine samples submitted for drug testing.  Samples with creatinine levels below 20 mg/dL are not acceptable and reported as diluted, invalid, or substitued depending on the creatinine levels when compared to the urine density (specific gravity). It should also be noted that diluted samples may not be due to a conscious effort of subversion, and cannot be proved to be intentional.  To summarize, RANDOM urine sample creatinine variability is common.  With all due respect to the previous reply by the Nursing Assistant, the suggestion that the variability in observed urine creatinine levels is due to lab error is a \"red herring\".\n\n",
    "posted_time": "Post  by ToxPro » Tue May 26, 2009 8:12 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=79684&sid=718853a88eb875ade3053b8ee252d7ec#p79684"
  },
  {
    "author": "lz1978  Guest Posts: 2 Joined: Sun May 17, 2009 8:18 pm Gender: Female",
    "title": "After Double Kidney Transplant",
    "content": "Hi - My friends mother has polycystic kidney disease. 4 weeks ago she had a doublekidney transplant by one of the best doctors in NYC. The transplant was a success as far as the doctor says. No rejection or infection. BUT she is in the most pain imaginable. She is in so much pain that she is saying she wish she could just die. This is a woman who is one of the happiest people I know. I am trying to seek guidance from anyone who knows anything about the recovery for this double transplant surgery. The doctor is not giving much in how to relieve the pain except to give it time. But it has been 4 weeks and she spends every minute awake, moaning in pain, and not wanting to live. Please please if you can offer any sort of guidance. Even to know that this is how long it takes and that it will start to get better would be nice. THANK YOU.\n\n",
    "posted_time": "Post  by lz1978 » Sun May 17, 2009 8:22 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=78595&sid=718853a88eb875ade3053b8ee252d7ec#p78595"
  },
  {
    "author": "angphx  Guest Posts: 2 Joined: Thu May 14, 2009 5:19 pm Gender: Female",
    "title": "severe hypertension, flank pain-PKD?",
    "content": "I'm a 38 year old female who has suffered from severe hypertension for the past 9 years and in the past week, I have started experiencing dull aching pain in my left flank area on my back as well as in the front.  Also, a couple weeks ago, my Creatinine & BUN levels were high (I'm not sure exactly how high).  After researching a little online, I found that some of my symptoms might be caused by PKD.  I've had a really difficult time controlling my hypertension even with meds and experience severe headaches all the time (nothing shows on CT scan).  Any suggestions?\n\n",
    "posted_time": "Post  by angphx » Thu May 14, 2009 5:27 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=78208&sid=718853a88eb875ade3053b8ee252d7ec#p78208"
  },
  {
    "author": "Surfin' USA  Guest Posts: 3 Joined: Sun Mar 07, 2004 3:01 pm Location: Virginia, USA",
    "title": "miscellanious category",
    "content": "Just wondering,are the miscellaneious category questions ever answered? Questions in other categories seem to get answered quicker.Not that I'm in any great hurry, but I was wondering if those questions will get answered.(or,if I should repost someplace else) Thank you for your help.\n\n",
    "posted_time": "Post  by Surfin' USA » Sun Mar 14, 2004 5:56 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2773&sid=718853a88eb875ade3053b8ee252d7ec#p2773"
  },
  {
    "author": "dlugose  Guest Posts: 38 Joined: Tue Feb 22, 2005 6:08 pm Gender: Male Location: Boulder, CO, USA",
    "title": "[no title]",
    "content": "Answering any questions on this BB are more difficult in ways than in person.  We can't see the patient, which immediately would give an impression of how sick, worried, stressed, in pain, etc. a person is.  Also a need to be careful about giving an opinion with limited information exposes a person to malpractice or license suspension etc.  Some people ask questions more clearly or their symptoms are easier to describe.  By its nature the misc. categories are more prone to have problems that are not well described, or a little of this and a little of that, perhaps not yet a problem well developed enough to differentiate from other problems.  Most vague problems never get diagnosed, either they go away before the person sees a doctor, or there is not much known about the symptom by itself or it could be any of a number or problems by itself.  There is the most research on well defined symptoms and diseases in the stage where there is less doubt about what it might be turning into.  There is little research for example on variations in how the body feels in the absence of a disease.\n\n",
    "posted_time": "Post  by dlugose » Wed Oct 12, 2005 8:10 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=23157&sid=718853a88eb875ade3053b8ee252d7ec#p23157"
  },
  {
    "author": "lupusgirl  Guest Posts: 1 Joined: Thu Apr 23, 2009 1:07 am Gender: Female",
    "title": "Re: miscellanious category",
    "content": "I have lupus since 05 the last few days I have been having a eletrical feeling that goes through my head and both arms they are real quick and off and on through out the day no matter what I am doing. I won't beable to see my rhyem for another month. Should I be worried.    lupusgirl\n\n",
    "posted_time": "Post  by lupusgirl » Thu Apr 23, 2009 1:28 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=75500&sid=718853a88eb875ade3053b8ee252d7ec#p75500"
  },
  {
    "author": "megs0106  Guest Posts: 1 Joined: Tue Apr 07, 2009 1:21 pm Gender: Male",
    "title": "Kidney pain from holding urination",
    "content": "I am a 30 year old male. I have been having back pain for a few months.  It seems to happen when I hold my urine too long.  It is a dull ache that starts in my back.  After I urinate about 20 minutes later the pain goes away.  It also happens first thing in the morning.  I do have a history of kidney stones in my family.  The pain is not horrible, but really achy.  I am bad about drinking water also.  I am active and run several times a week.  Does this sound concerning?\n\n",
    "posted_time": "Post  by megs0106 » Tue Apr 07, 2009 3:59 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=73475&sid=718853a88eb875ade3053b8ee252d7ec#p73475"
  },
  {
    "author": "irock502  Guest Posts: 1 Joined: Tue Apr 21, 2009 7:44 pm Gender: Female",
    "title": "Re: Kidney pain from holding urination",
    "content": "I want to know can you get kidney stones from drinkin to much alcohol??\n\n",
    "posted_time": "Post  by irock502 » Tue Apr 21, 2009 7:51 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=75319&sid=718853a88eb875ade3053b8ee252d7ec#p75319"
  },
  {
    "author": "carolena  Guest Posts: 1 Joined: Sat Jan 10, 2009 8:34 pm Gender: Female",
    "title": "Frequent kidney stones",
    "content": "Hi,  I am 34 year old female, I have been getting kidney stones since I was 18. Over the past 2 years they have been coming with increased frequency, last year I passed 10 stones and got 3 UTI infections. The urologist I see said we are out of things to test to determine why I make them. I do know the stones are calcium oxalate, the oxalate level in my 24 hour urine was 30. I have been reading some about the parathyroid, mine was checked last year and it was 47.3, my urine calcium was 8.9, which I understand are in the normal ranges. Do these numbers ever fluctuate? would it be appropriate to retest them? Do you have any suggestions about what further tests I could have to help determine the cause. I am also concerned are there any long term complications I should be concerned about if I continue to  make stones throughout my lifetime?  My family has taken to calling me pebbles due to my frequent stones, any help would be appreciated.\n\n",
    "posted_time": "Post  by carolena » Sat Jan 10, 2009 9:23 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=67807&sid=718853a88eb875ade3053b8ee252d7ec#p67807"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Frequent kidney stones",
    "content": "Hello --  Some people do seem to make far more kidney stones than others (and many, of course, never make any). However, I believe there's usually an underlying cause, and many times it does involve the parathyroid. And while your calcium level was definitely in the normal range, this has absolutely no bearing on whether or not a person has hyperparathyroidism. Surprising, but true. Calcium metabolism often does not work in ways one might expect, and levels can be normal in urine or serum but not be going where they need to be. Calcium can also be removed by the kidneys to keep the levels normal, but wind up forming lots of kidney stones, which of course don't show up as calcium in urine or serum, but simply as stones.   While both calcium and PTH levels can fluctuate a good deal, it's generally believed that frequent kidney stones, even with normal calcium levels, and a PTH which is not in the upper range of normal (that would be you -- yours was just plain normal), are considered likely to have hyperparathydoidism (a difficult diagnosis based on the numbers alone, obviously), and only a parathyroid sestimibi scan for tumors or other abnormalities will really yield any useful information, but the very fact you've produced so many kidney stones is strongly suggestive that you do have HPT. I hope your doctor will exhaust all the avenues of testing, including a scan, so you can be treated for this if appropriate. It can make a huge difference in the way you feel and, especially, in the production (or stopping production) of the stones.   I hope this is helpful. Good luck to you with this, and please do follow up with us here as needed.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Sat Mar 14, 2009 8:27 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=71392&sid=718853a88eb875ade3053b8ee252d7ec#p71392"
  },
  {
    "author": "meatlover  Guest Posts: 1 Joined: Tue Mar 24, 2009 4:19 pm Gender: Male",
    "title": "Can Spinach Cause Kidney Stones?",
    "content": "Hi,  I hear conflicting information on the health benefits of spinach.  I've always heard that it is one of the most healthy vegetables for you.  However, I was searching online and found multiple sources stating that spinach can also cause kidney stones... is that true?  If so, why is eating spinach so highly recommended?  thanks!\n\n",
    "posted_time": "Post  by meatlover » Tue Mar 24, 2009 4:35 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=71712&sid=718853a88eb875ade3053b8ee252d7ec#p71712"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Frequent kidney stones",
    "content": "Meatlover: Spinach contains a certain amount of fiber, as well as high levels of vitamin K and more than average of A as well. I have no idea why eating significant amounts would lead to formation of kidney stones, but as with all things, too much of anything will usually have some sort of unwanted result. I don't see too much of a downside to excess spinach except for the  vitamin K, which helps one's blood to clot normally. So long as you're active, well-hydrated and have no clotting problems a nominal amount of spinach in the diet shouldn't be worse than any other dark green leafy vegetable.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Fri Mar 27, 2009 11:19 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=72064&sid=718853a88eb875ade3053b8ee252d7ec#p72064"
  },
  {
    "author": "kengw002  Guest Posts: 2 Joined: Wed Jan 14, 2009 9:41 pm Gender: Male",
    "title": "Can kidney disease be cured or only maintained?",
    "content": "My girlfriend has problems with her kidneys which she is currently seeing the specialists about. It is regarding her kidney producing to much protein or something of that effect and is currently taking steroids as part of her medicines. She is currently about a stage 2/3.  I have read in other information that once you develop a problem such as this that it cannot be fixed completely but can only be slowed down and maintained from here on end?   Is this true or can treatment fix this kind of problem altogether?\n\n",
    "posted_time": "Post  by kengw002 » Wed Jan 14, 2009 9:48 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=68370&sid=718853a88eb875ade3053b8ee252d7ec#p68370"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Can kidney disease be cured or only maintained?",
    "content": "Hello --  I've already responded to this question via another post of yours. Please refer to that one and kindly refrain from multiple postings of the same question in the future, as it confuses us as to what we've already handled. Thanks for your help with this.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Wed Mar 11, 2009 9:09 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=71330&sid=718853a88eb875ade3053b8ee252d7ec#p71330"
  },
  {
    "author": "vmax33  Guest Posts: 1 Joined: Fri Feb 29, 2008 4:32 pm Gender: Male",
    "title": "IGA nephropathy",
    "content": "I have Iga nephropathy. diagnosed about 4yrs. ago. I was told by my kidney specialist that when I become ill, visible blood in the urine is common with my disease. I have been ill twice before this occaision, that amounted to visible blood in my urine.  I had only urinated blood once or twice and then it was gone.  I have recently become ill and feel as if I am recovering.  I have had a flu shot in november.  I went to my family practitioner and he explained my symptoms to a \"T\".  Apparently he had the same illness days before me and it is running wild through my area, (Duluth, MN.).  He believes it is viral. symptoms were frequent liquid bowel movements. body aches, chills and slight fever. This infection generally runs it's coarse in 48 to 72 hrs. according to my Doctor and he was right I feel alot better after 70 hrs. but still have diarhea.  My main concern is that in the past I generally urinated blood once or twice on the downslope of an illness.   I feel as if I'm on the downslope of this one but I have noticed blood in my urine for the last 36 hrs.  This is far longer than I have ever had blood in my urine.  But, I feel fine and in good spirits.  shall I go to the ER, or wait until Monday when my doctor is in and maybe it may clear up by then?  I am a 35yr. old Male 5' 9\", 200lbs. With no other health issues other than the IGA Nephropathy.  Any advice would be greatly appreciated and I thank you in advance for all of your effort.   Sincerely,  Shane johnson\n\n",
    "posted_time": "Post  by vmax33 » Sat Feb 07, 2009 2:53 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=70649&sid=718853a88eb875ade3053b8ee252d7ec#p70649"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: IGA nephropathy",
    "content": "Hello --  Hematuria with IGA nephropathy is especially common during viral infections and as long as there is no swelling of the extremities (which can be a sign of increased proteinuria) and no other symptoms -- and you continue to feel as though you're recovering from the viral infection, the presence of blood doesn't usually mean much and of course tends to look like more than it is anyway, since it is diluted. However, if you experience anything markedly outside your experience other than blood in the urine you should report it to your doctor, and if the hematuria continues for an inordinate period of time it should at least be reported. Otherwise, a person with IGA nephropathy usually won't find him or her self in a crisis situation without feeling it (and that is rather rare).  I hope this is helpful. Good luck to you. Please follow up with us as needed.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Mon Mar 02, 2009 8:23 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=71123&sid=718853a88eb875ade3053b8ee252d7ec#p71123"
  },
  {
    "author": "Arst  Guest Posts: 2 Joined: Mon Sep 15, 2008 8:38 pm Gender: Male",
    "title": "Gross hematuria, flank pain, and insomnia",
    "content": "Hi, I am a 22 year old male diagnosed with ADHD(2008), and have been seeing a nephrologist about my hematuria (2004). I have had a cystoscopy done, and many blood tests done. Family has a history of diabetes and cancer. I am on Ritalin for ADHD, and take pyridium for the burning in my urine. All of my blood tests came back negative for STD/Sickle cell. I exercise regularly, and eat very healthy.  Now my condition; it is sporadic, seemingly random bouts (2-4 times a month) of flank pain and red - black urine. It renders me unable to sleep, and function correctly. The nephrologist told me that a biopsy was the only way to find the cause of my disease, as he believes it is genetic. However, the outcome of that test would tell me nothing, being as there is no treatment for these diseases, so he advised against getting it done. Also, I get very sick randomly, and usually end up with an IV and a overnight at the hospital (Strep/infection). When I can, I sleep 12-14 hours a day.  My question is; Is there anything I can do to return to normal? My life has been shattered, I have been kicked out of the military for this. The last job I had, \"let me go\" because I missed a month, only being there 3 days, and had to get rushed to the hospital (103.4 fever).\n\n",
    "posted_time": "Post  by Arst » Mon Sep 15, 2008 9:16 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=60591&sid=718853a88eb875ade3053b8ee252d7ec#p60591"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "Re: Gross hematuria, flank pain, and insomnia",
    "content": "Hello,  This is really a difficult situation to diagnose and as your physician advised the best way to reach the diagnosis is by kidney biopsy.  However, I would like to give you a list of some of the possible causes that might help you be sure that all possible causes have been excluded by conventional investigations as you mentioned.  -Blood clots in urine usually indicate a cause below the kidney. -Frank hematuria due to kidney glomerular causes is not painful. -Urinary tract infection presents with dysuria, fever, pelvic pain and hematuria. -An early-morning periorbital edema, dark-colored concentrated urine are seen in kidney glomerular cause. -Hematuria and anemia with low platelt count is seen in hemolytic uremic syndrome. -Post infectious glomerulonephritis usually occur after sore throat or skin infection. -Systemic conditions like SLE and Henoch-Schönlein purpura are usually associated with joint pain, skin rash -Familial disease are suspected when a positive family history of renal disease is found like collagen vascular diseases, stones, or polycystic kidney disease. -Autoimmune diseases characterized by increase level of IGA are diagnosed by serology blood testing and kidney biopsy.  So, CBC and blood film (smear), complement tests, IgA level, ESR, LDH ASO, ANA, DsDNA, and urine analysis and culture are among the essential investigations. When results are not conclusive, kidney biopsy is essential for diagnosis and proper treatment.  Hope you find this information useful. I advise you to follow up with your Doctor and to discuss with him your concerns. Please keep us updated. Best regards.\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Fri Nov 07, 2008 3:36 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=63483&sid=718853a88eb875ade3053b8ee252d7ec#p63483"
  },
  {
    "author": "Arst  Guest Posts: 2 Joined: Mon Sep 15, 2008 8:38 pm Gender: Male",
    "title": "Re: Gross hematuria, flank pain, and insomnia",
    "content": "Thank you for the information, I am going for my biopsy in January and will post the results.\n\n",
    "posted_time": "Post  by Arst » Wed Dec 03, 2008 9:38 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=65090&sid=718853a88eb875ade3053b8ee252d7ec#p65090"
  },
  {
    "author": "Almost51  Guest Posts: 7 Joined: Wed Nov 12, 2008 10:39 am Gender: Female",
    "title": "Strange Kidney Pain-Both Sides!!!",
    "content": "A 47-yr old male friend of mine, with a previous history of a kidney stone, has been suffering for at least a year with pain on both sides where his kidneys are located. (He had the kidney stone about 6 years ago.) He finally was able to get a CT scan and it only showed some scarring from the previous stone but nothing else.  He has no pain with urination, nothing unusual in the urine, but the kidney pain is so bad sometimes he cannot go into work.  He takes Aleve for arthritis pain every 12 hrs. and he has tried eliminating this medication for several weeks (in case it could be a reaction to the drug.) with no change.  He has bouts of diarrhea, 3-4 times in one day, sometimes lasting for 2 weeks.  Is there any other test he should have or any suggestions on what could be the problem?  Any help you can give would be greatly appreciated!!!!!!\n\n",
    "posted_time": "Post  by Almost51 » Thu Nov 13, 2008 9:34 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=64134&sid=718853a88eb875ade3053b8ee252d7ec#p64134"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "Re: Strange Kidney Pain-Both Sides!!!",
    "content": "Hello, Stones are known as the most common case of renal pain. But Obstructions of the urinary system may also occur following its removal due to stone recurrence (common) or as a result of post interventional (endoscopic or surgical) fibrosis, or scaring around the ureter. If obstruction in the urine outflow from the kidney occurs a back pressure will result in renal damage and renal pain.   If you have an idea about the type of the procedure used to remove the previous stones would be more helpful. If you can provide us information about the CT results as written in the repost would be very helpful. The site and extent of the fibrosis is important.  Back pressure changes in the kidney are seen by US and CT scan as dilated pelvicalyceal system in the kidney. It indicates the presence of outflow obstruction and the possible need for intervention.  Urine analysis, kidney function tests are important to assess the degree of kidney damage if present. The nature of the stone and its possible cause is another important information. In the presence of narrowed passages small stones can cause the pain although they once pass below the level of obstruction, can spontaneously go out in urine.   Avoidance of NSAID medications (add to renal damage) is very important.  I would advise you to convince him to follow up with his doctor and consult a urologist. Please keep us updated. Best regards.\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Fri Nov 14, 2008 11:59 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=64251&sid=718853a88eb875ade3053b8ee252d7ec#p64251"
  },
  {
    "author": "sunnysunshine  Guest Posts: 1 Joined: Mon Nov 03, 2008 11:10 am Gender: Female",
    "title": "Rare Kidney Transplant Rejection for 14 yr old son",
    "content": "I hope someone here can help. On October 3rd, 2008 my 14 yr old son received a kidney transplant from me (mom) we were a match both times they tested. The transplant itself went great. He was given campath prior to surgery and now is on prograf and cellcept. Plus other meds. valcite, smztmp and magnesium. 10 days after transplant, his creatine rose and continued to do so. We did an ultrasound and the kidney looked perfect. creatine continued to rise. we did a bi-opsy and the first one came back looking good but they noted toxicity. 2 days later we were informed that he was in rejection. This is a rare rejection because he has developed anti-bodies to me. they tell us if it were not for the campath given the kidney would have been gone as soon as they hooked it up. His white cells are not attacking the kidney but it is as if I was never a match for him in the first place. we did 4 treatments of Plasmapheresis and 4 of IVIG therapy. during the treatments his creatine stayed steady between 1.6- 1.8 . two days later the creatine rose to 2.6 . We are looking for anyone who might have seen this before and has treated this kind of rejection. Our dr is very dedicated and he has been doing research on this as well.  Also very strange is the fact that when given prograf 2mg  morning and night prograf level was 6.3. when reduced to 1mg am and pm - prograf level rose to 12.0. It took three days on this dosage to reduce the prograf level. doesnt make sense with his kidney function for him to be holding prograf. any help would be appreciated as we try to figure this puzzle out.   sunny\n\n",
    "posted_time": "Post  by sunnysunshine » Mon Nov 03, 2008 11:27 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=63035&sid=718853a88eb875ade3053b8ee252d7ec#p63035"
  },
  {
    "author": "YaNiRa88  Guest Posts: 1 Joined: Mon Nov 10, 2008 2:53 pm Gender: Female",
    "title": "Re: Rare Kidney Transplant Rejection for 14 yr old son",
    "content": "I'm sorry to hear that, I'm a kidney recepient and have had my kidney for 11 years now, i've never heard anything like this before. When i received my kidney transplant wich was also donated to me by my mother they started me on Neoral 100 mg gell capsule and another thing is your son on Prednisone? I'm asking because all kidney recepients take prednisone and you did not mention your son taking it. Where are you located and what hospital did your son receive his transplant and is being cared in. I can give you my Renal transplant nurse number and maybe you could ask them for a second opinion, i would love to help you and your son i know how hard it is to be in this situation, i hope everything turns out good for you guys. best wishes  YaNiRa  yanira142003@yahoo.com\n\n",
    "posted_time": "Post  by YaNiRa88 » Mon Nov 10, 2008 4:24 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=63784&sid=718853a88eb875ade3053b8ee252d7ec#p63784"
  },
  {
    "author": "amy_c_78  Guest Posts: 1 Joined: Sat Sep 06, 2008 5:16 pm Gender: Female",
    "title": "Low eGFR but no action by Doctor",
    "content": "I am a 30 year old female.  Height 6'0\" and 180lbs, exercise 3-4 times a week, don't smoke, don't drink, normal blood pressure and blood sugar levels  but my eGFR according to lab results is 53 and from what I can tell that means stage 3 kidney disease.  Dr. said not to worry but keeps repeating the blood test (4 times in three months) without taking any other action.  I am horribly exhausted lately and finding it difficult to stick with exercise routine.  I have fairly severe flank pain.  In 2004, I was diagnosed with endometriosis.  The surgeon said he found scar tissue growing on my bladder and kidney's.  Could this be the causing decreased kidney function?  What should I do?  I am very scared!\n\n",
    "posted_time": "Post  by amy_c_78 » Sat Sep 06, 2008 5:30 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=59999&sid=718853a88eb875ade3053b8ee252d7ec#p59999"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "Re: Low eGFR but no action by Doctor",
    "content": "Hello, It true the result of your estimated glomerular infiltration rate indicate moderate kidney damage. If your other kidney functions are normal (creatinine and urea), physicians usually keep patients on follow up and make sure they avoid situations that may deteriorate their kidney function like frequent use of medications that affect the kideny or contrast dyes during radiologic exams. Physicians seek nephrologist consultation when eGFR is 30ml/min or below.  This surely a concerning situation that mandates proper investigations. However, keeping in mind that this is a calculated way to estimate the GFR and not the most accurate way to test for the GFR. The best way to do so is by measuring the 24 hours urine chemical concentrates (24 hour Creatinine Clearance).  You have mentioned that during the surgical treatment of the endometriotic pelvic lesions, the physician observed some sort of fibrosis around the bladder and possibly the lower part of the ureter. This may cause obstruction in the urine flow from the kidney into the bladder. Consequently back pressure will cause deterioration of kidney function and possibly formation of renal cysts.  If this is the case, you better consult a nephrologist who would evaluate the proper therapeutic intervention before the situation is worsened. An US abdomen is helpful. Other investigations are based on your physician’s evaluation of the situation.  I would advise you to follow up with your physician and to discuss with him your concerns.  Please keep us updated. Best regards.\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Sun Nov 09, 2008 7:34 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=63638&sid=718853a88eb875ade3053b8ee252d7ec#p63638"
  },
  {
    "author": "sanna1966  Guest Posts: 1 Joined: Sat Nov 08, 2008 9:08 am Gender: Female",
    "title": "renal cyst/adrenal TB",
    "content": "Can anyone help ease my mind.  40 yr old woman with abdominal pain (mid to right upper quadrant) & night sweats for 9 weeks so visit to doc resulted in admission hospital for abdominal ultrasound, x ray, blood tests & gastroscopy which all proved negative. Then did CT scan which i think showed cyst like area, couple of small stones and slight scarring on my kidney which together with night sweats led to thoughts might be adrenal TB and so have done blood test for that and daily urine samples to be submitted for total 6 days. Interestingly this all on my left kidney so they don't think connected with my ongoing pain (putting that down to probably an irritable bowel) and the kidney issue an accidental finding. They also plan an MRI scan. Question is why are doing MRI ....is it because suspect cancer/tumour or are there other reasons for doing it. Saying not an urget MRI and supposedly radiologist relayed back thought it was just a cyst. When asked Consultant whether any suggestion of tumour he said my age combined with appearance on scan and how it was reported thought it unlikely. After T test? for Adrenal TB how long before results likely to be available  In all of this my original and continuing symptoms are mid to right upper abdominal pain and night sweats.\n\n",
    "posted_time": "Post  by sanna1966 » Sat Nov 08, 2008 9:21 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=63562&sid=718853a88eb875ade3053b8ee252d7ec#p63562"
  },
  {
    "author": "KathyJL  Guest Posts: 1 Joined: Thu Sep 04, 2008 5:24 pm Gender: Female",
    "title": "Large bilateral renal cysts",
    "content": "I am a 55 yr old wht F with recent test results showing 3 renal cysts (9.3 cm in AP and 7.2 cm transversely, right kidney; 9.5 cm cyst lower pole of left kidney; 8.7mm cyst in mid-portion of left kidney. Had test following symptoms of abdominal pain (mild,chronic); significant feelings of bloating; unexplained wt gain; & chronic lower back pain. Labs show BUN of 30 & Creatinine of1.2; EGFR Non-AFR AM of 50: Bun/CREAT Ratio of 25.0; total protein 8.3; Globulin 4.0; ALT (SGPT) 29.  All other labs run were within normal range... Cysts were detected with CT exam with oral and IV contrast...  Could these cysts be causing extreme fatigue/weakness; bowel elimination problems as well as presenting symptoms previously listed?  Could this be Polycystic disease?  When is surgery appropriate for renal cysts?  I am very responsible with regular checkups with my urologist (due to history of bladder cancer) and with my GP who ordered the tests...Have not spoken to either of them since receiving the test results but am scheduled to see both of them next week.  I want to be sure I ask the right questions and am fully informed re. the significance of these results.  Can you please address these questions?  I have done extensive web research but have not found any protocol for suregery dependent on size or numeber of cysts...  Thanks, KJL\n\n",
    "posted_time": "Post  by KathyJL » Thu Sep 04, 2008 5:54 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=59872&sid=718853a88eb875ade3053b8ee252d7ec#p59872"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "Re: Large bilateral renal cysts",
    "content": "Hello,  Small simple kidney cysts are commonly seen after the age of 50, they rarely result in symptoms and are accidentally discovered. Large cysts on the other hand may cause complications and present with pain and deterioration of the kidney function thus may require surgical removal.  Having a history of urinary bladder cancer that was recurrent although early stage, the possibility that a mild obstruction in the urine flow out of the kidney was present. Overtime with back pressure on the kidney, renal cysts can be formed.  This could happen if fibrosis has occurred after resection of the mass in the bladder near the ureteric insertion into the bladder.  Another more serious problem to be excluded is the presence of low grade carcinomas in the urinary tract (since bladder cancer is a part of multifocal disease all through the urinary system from the renal pelvis down to the urethra). This may also cause some sort of renal back pressure and cysts formation.  Another possibility is renal stones that may also result in kidney back pressure.  Radiological examination and endoscopy is essential to exclude any lesion throughout the urinary tract. In addition removal of these cysts for diagnosis as well as for therapy may be needed.  This list of possibilities can be narrowed and more specific investigations and approach can be done only after thorough clinical history and clinical examination. So I advise you to follow up with your Doctor and to discuss with him all your concerns.  Please keep us updated. Best regards.\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Fri Nov 07, 2008 4:17 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=63487&sid=718853a88eb875ade3053b8ee252d7ec#p63487"
  },
  {
    "author": "jodie1  Guest Posts: 3 Joined: Sun May 20, 2007 10:14 am",
    "title": "why still thirsty with clear urine?",
    "content": "Hi, I am drinking lots of water and passing very clear urine, but I am still extremely thirsty.  could this be anything to do with kidney function?  It happens occasionally for a day or so and I always feel very sick at the same time. Thanks Jodie\n\n",
    "posted_time": "Post  by jodie1 » Sun Sep 21, 2008 6:26 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=61119&sid=718853a88eb875ade3053b8ee252d7ec#p61119"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: why still thirsty with clear urine?",
    "content": "Hello -  What you describe (the thirst, urination and nausea) could well suggest new onset of diabetes. I don't have enough information to go beyond this suggestion, but this is part of the picture often seen. It could be a good many other things as well, but a serum glucose test would at least seem to be in order.   Hope this is helpful. Please follow up with us as needed.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Thu Oct 23, 2008 10:32 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=62419&sid=718853a88eb875ade3053b8ee252d7ec#p62419"
  },
  {
    "author": "CWalsh  Guest Posts: 1 Joined: Tue Sep 16, 2008 6:57 pm Gender: Female",
    "title": "Bilateral renal atrophy",
    "content": "Hi,  I'm 33 y/o, 37 weeks gestation, 2nd pregnancy, twins born in 1999. My current pregnancy has proceeded fairly uneventfully with the  exception of 5-6 UTI's, pain that has/was assumed to be from large kidney stores, and an almost constant vaginal discharge. The UTI's have been treated with Macrobid and Ceftin. My obstetrician said that since I was not itching or hurting that it would be better not to treat the vaginal discharge.  At about 32 weeks gestation I began to have quite a bit of back pain. Not long after, the pain was bad enough to warrant trips to Labor & Delivery. A urological consult was obtained, pain meds given, and I was discharged home, the assumption being this was pain from kidney stones. Nothing was done during those 3-4 trips to confirm that. I had been previously diagnosed with the stones. Additionally, I had a UTI at the time my pregnancy was confirmed.  Last week I was admitted to the antenatal unit due to extreme pain in my back. About 3 days prior, my OB ordered a urine culture after reviewing my UA which showed a lot of blood and WBC.  He changed me from Macrobid, which the urologist had prescribed, to Ceftin.  The result of the culture showed 10,000-49,000 candida albicans.  I have had a culture in the past, prior to this pregnancy, that  showed showed >100,000 candida albicans in clusters or something  like that.  During last week's hospitalization, a renal ultrasound was obtained. It showed bilateral renal atrophy with the cortex having an average measurement of <1 cm.  A C-T scan performed in my urologists office 1.5 years ago was negative except for a stone in each kidney.  My questions are: can untreated yeast damage the kidneys? I was born at 27 weeks gestation and weighed 1000 grams. Could prematurity account for this finding?  My BUN and creatinine were normal x 2. I have never had any protein in my urine; I am not diabetic. I have been treated for infertility with induction of ovulation with gonadotropins, hCG, and clomiphene. Was treated with progesterone vaginal suppositories until 13 weeks with both pregnancies. I have never used drugs and  have at no time in my life used alcohol. I'm an active mom and have  been working full time.  I am as large as I was when I had my twins, but my ultrasound  exams have been perfect. I had fluid...ascites?..in my abdomen due to acute hyperstimulation of the ovaries prior to conceiving in 1998. I was hospitalized twice and had so much fluid in my  abdomen I looked like I was pregnant and full term. I did  conceive, but it turned out to be a chemical pregnancy. Three months later I underwent my second round of gonado- tropins and conceived my twins.    I've included all this information in the hopes of getting a lead on what may have caused my kidneys to waste. I have not yet had a full investigation due to my pregnancy and my husband and I are so worried.  Is it possible I have bladder reflux that never gave me trouble in childhood? I ask this because my 14 month old niece had a horrific UTI at 4 months and was diagnosed with kidney reflux which seems to run in families.  Are my kidneys going to fail? Will I die? Have I been running  around with shrunken kidneys for years without knowing it, and is it possible the CT from 1.5 years ago (a KUB was also performed which confirmed the CT findings) simply did not image as well as an ultrasound?  Thank you for taking the time to read this. My cesarean is scheduled for 9/29/08. I am having a girl. Should I be concerned in any way for her?  Respectfully,  CWalsh\n\n",
    "posted_time": "Post  by CWalsh » Tue Sep 16, 2008 8:05 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=60693&sid=718853a88eb875ade3053b8ee252d7ec#p60693"
  },
  {
    "author": "manmountain  Guest Posts: 2 Joined: Wed Aug 27, 2008 3:42 pm Gender: Male",
    "title": "Severe back pain-what is this?",
    "content": "Last Thursday (08/21/08) I got a pain in my back out of nowhere that rapidly got worse.  It is on the right side on the bottom rib, near the Serratus Posterior Inferior Muscle.  Later on I had bouts of severe spasms that caused unimaginable pain.  On a scale of 1-10 it was an 11+.  I thought I had a Kidney Stone.  I went in to Urgent care last Saturday and they found microscopic hematuria (blood in Urine).  They told me it was probably a small stone that would pass on it's own and gave me Ketorolac, a dangerous non-steroidal anti-inflammatory drug, and Cyclobenzaprine, a muscle relaxer.  The extreme pain has been diminished by the drugs but the pain is still there and when the drugs begin to wear off it gets worse again.  Today (08/27/08) I saw another doctor and they did another urine test and an X-ray.  This time there was no blood in the Urine and they did not see any stones on the X-ray.  The pain is still there though and I don't know what it is.  The Doctor said there is a small chance that the Urine all came from the other Kidney, and Uric Acid Stones don't show up on X-ray.  He suggested a CT scan, but I am holding off for now.  It seems unlikely that there would be no blood in the urine if it was a kidney stone.  Some other symptoms that I've had are wrap around pain in the ribs, some slight and brief pain in the abdomen and testes, and difficulty urinating (no pain though).  I do not feel sick at all either. I should also mention that I thought I injured the Serratus Posterior Inferior muscle 17 years ago, and it seems to get pulled every once in awhile.  The pain from that injury has left me out of action for weeks at a time in the past, but the pain I just experienced was on a whole new level.  It was so much worse than the original injury, and I did nothing to traumatize the muscle.  I am starting to wonder if some of those pains in the past that I thought were muscle pulls could have something to do with my kidney?  So anyway, my question is, what could this be?  Uric Acid Stones with no blood in the urine, Kidney disease, Kidney Infection with no fever, Myofascial Pain Syndrome, the worst muscle pull in history, or something I haven't thought of yet?   Any ideas?   Thanks-Justin\n\n",
    "posted_time": "Post  by manmountain » Wed Aug 27, 2008 5:11 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=59391&sid=718853a88eb875ade3053b8ee252d7ec#p59391"
  },
  {
    "author": "manmountain  Guest Posts: 2 Joined: Wed Aug 27, 2008 3:42 pm Gender: Male",
    "title": "Re: Severe back pain-what is this?",
    "content": "Thanks for nothing...\n\n",
    "posted_time": "Post  by manmountain » Wed Sep 10, 2008 5:03 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=60252&sid=718853a88eb875ade3053b8ee252d7ec#p60252"
  },
  {
    "author": "pnranjith  Guest Posts: 4 Joined: Thu Feb 28, 2008 1:18 pm Gender: Male",
    "title": "Improve Renal Function",
    "content": "My dad is taking medicines for diabetic and hypertension from past 20yrs. Due to skin itching he has taken blood test before 1 week.It was 325mg/dl  blood sugar and 6.3 mg/dl of creatinine. After strict  diet control  and increase of insulin to 15 from 10 Unit, blood sugar is 75mg/dl  and creatinine is 5.8mg/dl. I know that creatinine increase is an evidence of renal failure. Please advice to improve his kidney function.  His medication is : Tide 10(Torsemide Tablet 10mg)  1-1-0.since 5 months. Amlovas-s(Amlodipine Besilate 2.5mg) 1-0-0.since 5 months. Deriphylline Retard 150(Sustained release tablets of Etofylline and Theophylline) 0-0-1.since 5month Razo D(Acid reflex tablet) 1-0-0 since 5 month Doxacard-2(Doxazosin Mesylate 2mg) 1-0-1  started since 4 years. Dyamide 20(Torsemide Tablet 20mg) 1/2-0-1/2 since 1 week. Alfacalcidol & Calcium cap. 1-0-0 since 1 week folic acid,iron with copper and manganese cap. 1-0-1. since 1 wk. Huminsulin 15 0 15  Age : 58 yrs Weight : 68Kg Morning : South Indian breakfast with tea. Lunch : Rice  Dinner : Wheat  Daily tea consumption: around 7 glass without sugar  BP:160/100 Random blood glucose : 75 mg% Serum Creatinine : 5.8mg% POTTASSIUM : 4.0 m.eq/l HAEMOGLOBIN : 11.0gm%  creatinine was 4.8 before 6 months and 6.3 before 1 week.  please let me know why it is was 6.3 before 1 week and now 5.8.   Is there any way to reduce the creatinine and increase renal function?.Is there any benifit in taking lot of plain water. Expecting a detailed reply. Thank you.\n\n",
    "posted_time": "Post  by pnranjith » Thu Feb 28, 2008 1:47 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=54585&sid=718853a88eb875ade3053b8ee252d7ec#p54585"
  },
  {
    "author": "R. Zein, Pharm D  Pharmacist Posts: 157 Joined: Tue Jul 12, 2005 9:16 pm Location: USA",
    "title": "Re: Imrove Renal Function",
    "content": "Dear pnranjith  the medical problem your presented in this case, that is exacerbations of renal function is a very common complication in patients with hypertension and diabetes. In deed it is estimated that the majority of patients with both diabetes and hypertension will eventually present with acute renal failure and if diabetes/blood pressure are left uncontrolled, acute renal failure can progress to end stage renal disease.  - assessing your dad's case, i noticed that he is on insulin therapy for the management of his diabetes, suggessting that he is a type 1 diabetic patient. based on the blood glucose level of 75, which is within the normal recommended range, the dose of the insulin seems to be appropriate. usually frequent monitoring of blood glucose before and after meals help us in deciding on an insulin schedule and the type of insulin (short acting, intermediate, and long acting, depending on each patient's case).  - the second key point is blood pressure. you noted that your father's blood pressure is 160/100. this is a high reading, and with the different medications your dad is recieving , amlodipine and diuretics, it is possible that your dad needs to be on additional medication, or the whole therapy needs to be assessed.  the target goal for blood pressure is patients with diabetes is 135/80 and your dad bp is 160/100 suggessting that your dad is not at his target goal.  this is important because as i mentioned in my introduction, it is important to control both blood pressure and blood sugar to prevent further kidney damage.  ACE inhibitors are very effective class of drugs to treat hypertension and it is usually first line therapy for patients with diabetes. this class has been shown to provide a nephroprotective effect, that is a renal protective effect. I wonder if your dad has tried these agents before, such as lisinopril, ramipril, accupril, etc. or even ARBs (angiotensin receptor blockers like irbesartan, candasartan, etc).   one more thing i want to point out to you, since you requested detailed answers :) diuretics are great agents and first lines for the management of hypertension, but they can increase blood sugar via an unknown mechanism. Now this is not a reason to perclude their use in hypertension and diabetes, but it is something that one need to be aware off.  overall, hydration is always very important, but i highly recommend tight glucose and blood pressure control for your dad to prevent further exacerbations of his renal function. worsenning of renal function is a consequence of diabetes and hypertension; we can not eliminate it , but we can for sure help preventing it from getting worse.   thank you very much and remain blessed\n\n",
    "posted_time": "Post  by R. Zein, Pharm D » Fri Mar 21, 2008 2:26 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=56550&sid=718853a88eb875ade3053b8ee252d7ec#p56550"
  },
  {
    "author": "pnranjith  Guest Posts: 4 Joined: Thu Feb 28, 2008 1:18 pm Gender: Male",
    "title": "Re: Imrove Renal Function",
    "content": "Thank you Doctor for your informative reply We went to hospital last week to get treatment for itching. Doctor suggested some change in his medication  Now it is like Amlovas 5(S-Amlodipine - 5)      1-0-0 Ocid 20(Omeprazole - 20)      1-0-0 Doxacard 2(Doxazosin mesylate - 2mg)  1-0-1 Folic Acid 5     1-0-0 Gemcal 0.25 (Calcitriol  0.25)   1-0-0    Doctor said Gemcal is for itching.But still it is there. He also advice dad to take Hepatitis-B vaccine  I would graceful if you clear these doubts. Why he's got itching?.  Is there any limitation for drinking water for renal patients?   Thank you very much Doctor.\n\n",
    "posted_time": "Post  by pnranjith » Fri Mar 21, 2008 10:24 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=56566&sid=718853a88eb875ade3053b8ee252d7ec#p56566"
  },
  {
    "author": "R. Zein, Pharm D  Pharmacist Posts: 157 Joined: Tue Jul 12, 2005 9:16 pm Location: USA",
    "title": "Re: Imrove Renal Function",
    "content": "thank you very much for the update  so it seems to me that the doctor took out the diuretics, and your dad currently is only on amlodipine for treatment of hypertension. I wonder how is your father's blood pressure doing on amlodipine alone.  itching is very common and often present in patients with kidney /renal disease.  In addition, most of patients treated with dialysis complain of itching of the skin during or after dialysis sessions. it is believed that uremic toxins that arent removed from the blood by dialysis sessions could contribute to the itching of the skin.   The problem can also be related to high levels of parathyroid hormone (PTH), and it is a common in kidney failure. there is no cure for itching, but the fact that your dad is on calcitriol (a drug used for managment of hypocalcemia in patients with chronic renal failure), this drug also help reduce elevated leves of parathyroid hormones, and therefore will help reduce the itching.    if itching continues to be a problem, you can use antihistamines like benadryl (diphenhydramine) or capsaicin topical cream.   as for drinking, hydration is important. in deed increasing water intake and decreasing salt intake help in the management of both kidney failure and hypertension. fluid restrictions is important for patients with heart failure; that is why doctors use alot of duiretics in these patients. based on your case presentation, your father does not have heart failure, but the fact that the doctor took out diuretics from his medication regimen, you don't want him to ingest too much fluids (> 1.5-2 L). With the absence of diuretics, your dad wont be able to get rid easily of the fluid build up in his system until he has a dialysis session.  thanks alot.\n\n",
    "posted_time": "Post  by R. Zein, Pharm D » Fri Mar 21, 2008 6:11 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=56600&sid=718853a88eb875ade3053b8ee252d7ec#p56600"
  },
  {
    "author": "pnranjith  Guest Posts: 4 Joined: Thu Feb 28, 2008 1:18 pm Gender: Male",
    "title": "Re: Imrove Renal Function",
    "content": "Thanks a lot Doctor for giving all the valuable suggestion.I would like to clarify that whether we need to consult the doctor again for any additional medication.I will update about any change in his treatment if any.  Thank you once again. Ranjith\n\n",
    "posted_time": "Post  by pnranjith » Thu Mar 27, 2008 2:27 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=57032&sid=718853a88eb875ade3053b8ee252d7ec#p57032"
  },
  {
    "author": "R. Zein, Pharm D  Pharmacist Posts: 157 Joined: Tue Jul 12, 2005 9:16 pm Location: USA",
    "title": "Re: Imrove Renal Function",
    "content": "my pleasure ranjith...and continue to keep me updated!\n\n",
    "posted_time": "Post  by R. Zein, Pharm D » Fri Mar 28, 2008 4:51 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=57115&sid=718853a88eb875ade3053b8ee252d7ec#p57115"
  },
  {
    "author": "pnranjith  Guest Posts: 4 Joined: Thu Feb 28, 2008 1:18 pm Gender: Male",
    "title": "Re: Improve Renal Function",
    "content": "Doctor, Let me brief about his past few blood test results.  21/02/20008  -  BP - 160/100 BLOOD GLUCOSE - 325mg Serum creatinine : 6.3mg K : 4.0 m.eq/l  03/03/20008  -  BP - 170/90 2HRS PP BLOOD GLUCOSE - 165mg Serum creatinine : 5.7mg HBs Ag : -ve  17/06/20008  -  BLOOD GLUCOSE - 179mg Serum creatinine : 7.3mg Hemoglobin : 8.2 gm %  12/07/2008 BLOOD GLUCOSE(FBS) - 94mg Random Glucose(1 hr after food) : 154mg  Yesterday I have taken him to another doctor due to swelling in legs and also for having Shanvac(Hepatis -B) vaccine which was prescribed by his regular doctor. He asked us to take two injections(Venofer and Espogen 4000IU) yesterday itself and we did that. Doctor also asked my dad to stop insulin and change to tablets for sugar control since insulin now a days caused him hypoglycemia(dad was taking 15 unit each morning nut now a days it is causing hypoglycemia). I fear to change the medicine without the knowledge of our regular doctor. Is it Ok to change?. And this doctor asked us to create AVF next week itself and to be prepared for Dialysis.  I would like to know about the effectiveness of renal transplant and its aftermath. What all thing we should take care. How much will be the cost and after transplant cost. What are the complications about rejection. I have heard about stem cell technique for that?   Waiting for your valuable comments Thank you so much\n\n",
    "posted_time": "Post  by pnranjith » Sun Jul 13, 2008 4:21 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=58800&sid=718853a88eb875ade3053b8ee252d7ec#p58800"
  },
  {
    "author": "sarah_jane1975  Guest Posts: 2 Joined: Mon Mar 10, 2008 4:10 pm Gender: Female",
    "title": "Severe, but short lasting, kidney pain",
    "content": "Hi, Just wondered if anyone can help me.  I'm 32 and have had blood in my urine since I was about 18.  I had tests, including cystoscopy, when I was about 20 and nothing was found to be abnormal.  The blood isn't visible and I have always just accepted it shows up in urine tests.   Over the last year I have been experiencing fairly mild pain in the region of my back exactly over where my kidneys are.  I have been diagnosed with UTIs from my urine samples and treated for them.  These have recurred a few times but the hospital recently checked a sample and I am apparently fine at the moment. I am now getting occassional severe pain from my kidney - usually one at a time - the pain appears without warning and lasts about ten minutes but it is severe, reminds me of being in labour, feeling like I am being stabbed in a kidney.  I usually feel like I could faint when this happens.  Then the pain goes and I am fine.   The doctor just tests my water, sees the blood show up and presumes it's another water infection and treats it but I'm starting to wonder if it is yet another infection. I'm a bit worried as my mum has chronic renal failure - mainly due to the duplex kidneys she was born with- now partly removed.  I know I don't have duplex from the tests I had when I was 20 but could other kidney probs be genetic?  I really want to look after my kidneys in case I need to give my mum one someday. Thanks for any advice Sarah x\n\n",
    "posted_time": "Post  by sarah_jane1975 » Mon Mar 10, 2008 4:26 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=55595&sid=718853a88eb875ade3053b8ee252d7ec#p55595"
  },
  {
    "author": "R. Zein, Pharm D  Pharmacist Posts: 157 Joined: Tue Jul 12, 2005 9:16 pm Location: USA",
    "title": "Re: Severe, but short lasting, kidney pain",
    "content": "Dear Sarah  you said that your pain is often treated as a urinary tract infection, i wonder was the possibility of other renal causes  eliminated? like calculi or kidney stones? obstructive uropathy?  i hope you feel better  thanks\n\n",
    "posted_time": "Post  by R. Zein, Pharm D » Fri Mar 21, 2008 11:55 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=56579&sid=718853a88eb875ade3053b8ee252d7ec#p56579"
  },
  {
    "author": "sarah_jane1975  Guest Posts: 2 Joined: Mon Mar 10, 2008 4:10 pm Gender: Female",
    "title": "Re: Severe, but short lasting, kidney pain",
    "content": "Hi, Thanks for your reply.  No I have never had kidney stones etc ruled out.  I have suggested to the doctor that this could be a possible cause but I feel like I'm coming up against a brick wall, told it's only a UTI.  I don't think the doctor's believe how severe the pain gets for me.  I have no tests or scans on my kidneys for 12 years now. Thanks  Sarah x\n\n",
    "posted_time": "Post  by sarah_jane1975 » Mon Mar 24, 2008 5:23 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=56809&sid=718853a88eb875ade3053b8ee252d7ec#p56809"
  },
  {
    "author": "Meredith_Pierson  Guest Posts: 4 Joined: Mon Nov 12, 2007 9:39 am",
    "title": "Elevated GFR 58 - normal creatinine",
    "content": "Had blood test, my GFR came back at 58.  My dr. told me since my creatine levels were in the normal range, that I shouldn't worry about the 58 GFR, that that's just an \"estimated\" range.  Should I be concerned?\n\n",
    "posted_time": "Post  by Meredith_Pierson » Thu Jan 17, 2008 3:06 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=53232&sid=718853a88eb875ade3053b8ee252d7ec#p53232"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "Re: Elevated GFR 58 - normal creatinine",
    "content": "Hello Meredith_Pierson,  A glomerular filtration rate (GFR) of 60 is considered normal in women (plus or minus about 10).  In men it is closer to 70 plus or minus about 14.  I would not be concerned about a GFR of 58.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Fri Mar 14, 2008 12:19 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=55920&sid=718853a88eb875ade3053b8ee252d7ec#p55920"
  },
  {
    "author": "emmalis  Guest Posts: 2 Joined: Fri Feb 16, 2007 1:23 am",
    "title": "protein and blood in urine",
    "content": "Hi, I am a 24 yr female. About 2 years ago my doctor told me that I had protein in my urine. I had a 24hr urine test that he said was not a large amount of protein but all my urine tests always show 2+ or 3+ protein. Then 1 1/2 years ago I noticed my urine was dark brown/red. I had an IVP, cytoscopy and CT. The IVP was normal, cytoscopy showed blood coming from R ureter and CT showed 2mm x 3mm stone that they did not think was the source of my bleeding. The blood in urine went away and I did not have further tests. Well all of it has started again a few months ago. I will have dark brown/red urine for few days and then it goes away and so on. One episode (a couple months ago) I had a CT that was normal and the last episode (2 weeks ago) of brown urine I called my doctor and he had me drop off a urine sample. He said it had blood, protein and bilirubin in it. I had yet another IVP that was normal and he wants me to get another CT when the blood comes back. By the way the doctor I am refering to is a urologist that I was referred to 1 1/2 years ago when this all started. I feel they keep doing the same tests and they are all normal. What should I do? Is there another test I should have? All my blood tests as of a few months ago were normal. My only medical hx. is I had ITP for which my spleen was removed in 2002 and my platelets have been normal since that time. Thank you for your time.\n\n",
    "posted_time": "Post  by emmalis » Sun Feb 18, 2007 10:51 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=38818&sid=718853a88eb875ade3053b8ee252d7ec#p38818"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Protein and blood in urine",
    "content": "Dear Emmalis,  Proteins and blood in the urine usually point to a kidney disease usually of the inflammatory type especially if other causes have been ruled out.  i think at this point that you should be seen by a nephrologist if you were not already seen by one.  Thank you very much for using our website http://doctorslounge.com and I hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Fri Mar 09, 2007 11:39 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=39406&sid=718853a88eb875ade3053b8ee252d7ec#p39406"
  },
  {
    "author": "mjmlam  Guest Posts: 1 Joined: Tue Feb 12, 2008 8:40 pm",
    "title": "Re: protein and blood in urine",
    "content": "I do not know if this helps or not; my son - who is now 13 was diagnosed w/ \"streptacaucus (sp)\" when he was about 3 years old.  His urine was a dark, almost brown color.  Our doctor found that he may be a strept carrier and as he did not show signs of strept throat, it was still in his system.  Whenever someone in our family would contact strept, our son would not show it, but sure enough his urine would start to show protein (blood).  When on an antibiotic, then the discoloration would gradually go away.  We are told that his kidney was damaged during the original episode and that he would always have traces of protein, but we know that when it is apparent to the naked eye that he probably has strept.  A few years ago, we had his tonsils removed and that helped.  He didn't have any episodes with strept until recently.  I hope that information helps, but now I too have further questions that I hope someone can help with.  I recently had strept.  I became nervous and kept asking my son to check his urine color (norm for our family w/ my son).  He kept saying all was fine until yesterday, he told me that his kidneys were hurting, which had never happened in the years previous.  Sure enough he had blood in his urine as well.  We went to the doctor and he was prescribed an antibiotic as expected, so although he's only been on it a few days, he is still feeling a lot of pain (on a scale of 1-10, about a 7 or 8) in his kidneys, primarily the right side, but also the left and even feels like someone is wringing them inside of him when he is urinating.  We are hoping that the antibiotics will resolve the infection (assuming that is what has caused this bout), but are concerned w/ the pain, potential for further damage, and of course if this will continue to linger or God forbid, even get worse.  He also is complaining of pain in his hands; not sure if this can be associated w/ the kidneys?  He saw a nephrologist a few years ago at a Children's hospital and this was the doctor that recommended the removal of the tonsils.  We are trying to set up appts. w/ a ureologist at present to have an ultrasound and scope performed.  In the last few years, other symptoms have presented themselves as well.  He has been having problems with upset stomach; sometimes diahrea - more frequent that what should be normal, headaches.  He has seen a gastroentologist and blood work has indicated that his stomach isn't the problem; just allergic to seafood.  If anyone has any insight to what I am describing, please respond.  Thank you.\n\n",
    "posted_time": "Post  by mjmlam » Tue Feb 12, 2008 9:03 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=53714&sid=718853a88eb875ade3053b8ee252d7ec#p53714"
  },
  {
    "author": "captedwardteach  Guest Posts: 1 Joined: Thu Dec 27, 2007 8:48 am",
    "title": "41y/o Diagnosed with acute renal failure",
    "content": "Greetings, all...  Well, here goes my issue. Approximately two years ago, I had a 3am trip to the emergency room with chest pains. Blood pressure was extremely high: 165/110 but after several hours of observation and a cardiac catheter (sp?) which showed \"I have the arteries of a 15-year old\" I was released to return home and referred to a kidney doc for follow-up, based upon elevated creatinine levels found during the myriad of tests performed during whatever episode occurred that put me in the ER at 3am.  To this day no doctor has been able to tell me exactly what happened.  However, my trip to the renal doc was less than I expected. I'm 6'4\", 240 pounds, non-smoker, etc...I work out approx. 5 days per week, an hour of cardio, blah, blah, blah, blah...basically, at 41, I'm in better shape than when I was 21.  However, the renal doc also agreed that the elevated creatinine levels were a cause for concern, as was my cholesterol levels (according to him, I have an abnormally low \"good\" cholesterol number, and even though my \"bad\" cholesterol is in the \"normal\" range, the ratio is off so I have \"high cholesterol\"). Also at that time (two days after the ER trip) my blood pressure was still elevated at 140/90. During the consultation, I explained to him that my wife and I had just started \"two-a-days\" where we would do our cardio training in the morning and weight training in the afternoon. As part of this, we had just started the loading phase of Creatine as a supplement to aid in the recovery process of our muscles.  Now, I'm a computer programmer by trade and not a physician, but to me Creatine and creatinine sound awfully similar, and considering the two perform the same function of removing waste material from muscle tissue, I asked him if that could lead to an elevated reading of creatinine. He didn't know, but promised to research it for me.  Fast forward two years: My blood pressure has returned to normal and I have not taken blood pressure meds for a year. My cholesterol remains \"odd\" with the abnormally low \"good\" number and average \"bad\" number, and my wife and I still work out regularly.  The problem is I have just been declined medial insurance because I still have a diagnosis of \"Hypertension, High Cholesterol and Acute Renal Failure\" thanks to this doctor.  How can I show this doctor and the blood-suckers at the insurance company that I'm in good health and no longer suffering from (and probably never did suffer from) the above-mentioned diagnosis?  I look forward to your responses.\n\n",
    "posted_time": "Post  by captedwardteach » Thu Dec 27, 2007 9:16 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=52093&sid=718853a88eb875ade3053b8ee252d7ec#p52093"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "Re: 41y/o Diagnosed with acute renal failure",
    "content": "Hi Captedwardteach,  This is a difficult situation.  Creatine breaks down into creatinine so theoretically an increased amount of creatine would translate into an increased amount of creatinine.  However, the kidneys should be able to filter off the excess creatinine with no problem such that the creatinine level in the blood would remain normal despite the increased creatine.  Unfortunately, I cannot say this with 100% certainty, though.    If all your symptoms are now resolved and have not returned you may want to see a doctor again and have all the lab work repeated so that the doctor can now declare that you do not have hypertension, high cholesterol and acute renal failure.  Perhaps having your physician write a letter to the insurance company explaining that these were brief issues that are questionable in regards to their origin but have now resolved completely will help.  I am actually fairly suspicious that you may have had a post-infectious cause of the acute renal failure.  There are several viruses and bacteria (most notably group A streptococcus) that can cause an acute renal failure following these infections.  The acute renal failure then leads to elevated creatinine and hypertension.  As the renal failure resolves, the blood pressure and creatinine return to normal.  In some cases this can lead to permanent renal failure but if the BP and creatinine have returned to normal it would indicate that this is not going to happen since the kidneys have recovered properly.  Regarding the hypercholesterol issue.  I would not consider a low HDL, the good cholesterol, with a normal overall cholesterol level as hypercholesterolism.  A low HDL can be an issue but based on the definition of hypercholesterolism it does not satisfy the criteria for this diagnosis.  I would recommend talking with your primary care doctor about all these issues.  Best wishes.  I hope this all works out for you.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Fri Jan 18, 2008 10:34 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=53261&sid=718853a88eb875ade3053b8ee252d7ec#p53261"
  },
  {
    "author": "KDCwv32  Guest Posts: 14 Joined: Sat Mar 03, 2007 6:16 pm",
    "title": "Kidneys cause low K+ levels?",
    "content": "I was wondering if my kidneys cause lower K+ levels. It was 3.4 barely low with the min being 3.5. They told me to drink OJ or eat bananas and the next time my K was normal. My next blood test I had 3.2 K level. I drink plenty of water because my kidneys seem to filter better when hydrated. Could this cause the problem too? Am I drinking too much water?\n\n",
    "posted_time": "Post  by KDCwv32 » Fri Jan 04, 2008 10:27 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=52725&sid=718853a88eb875ade3053b8ee252d7ec#p52725"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "Re: Kidneys cause low K+ levels?",
    "content": "Hi KDCwv32 , Generally speaking, depleted potassium levels may be caused by severe episodes of vomiting and diarrhea, diuretic medications, impaired renal function, acute renal failure, inadequate diet, etc. To my knowledge I am not aware of water intake affecting potassium levels. A physicians evaluation can determine the causative factor in relationship to the potassium levels. Best wishes. Sincerely, Theresa Jones, RN\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Thu Jan 10, 2008 12:23 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=53060&sid=718853a88eb875ade3053b8ee252d7ec#p53060"
  },
  {
    "author": "lindzyb  Guest Posts: 25 Joined: Tue Jul 24, 2007 9:50 am",
    "title": "Kidney function/Ultrasound?",
    "content": "22 Female, PCOS, Hypothrydoidism, had a kidney infection a few weeks ago.  On Synthroid & taking cranberry pills.  I had a kidney infection a few weeks ago, took 5 days of Levaquin.  The pain in my flank never really stopped, so I went back for an ultrasound of my Kidneys.  The Doc said there was no sign of a stone & said he didn't find anything abnormal.  I am still having occasional pains & was wondering if on the ultrasound the doctor could tell how well my kidneys were functioning?  I know it's kind of weird to be worried about that at a young age, but it worries me because it's been so long (about 3 to 4 weeks) since I was first diagnosed w/ the Kidney Infection.\n\n",
    "posted_time": "Post  by lindzyb » Mon Nov 26, 2007 11:33 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50851&sid=718853a88eb875ade3053b8ee252d7ec#p50851"
  },
  {
    "author": "Sandy Tracy RN  Nurse Posts: 60 Joined: Wed Nov 07, 2007 6:57 pm",
    "title": "[no title]",
    "content": "hi, Lindzyb  Thanks for writing.  During an ultrasound of the kidneys you can see the size and shape of the kidneys.  The ultrasound is used to see kidney stones, malformed kidneys or obstructed kidneys.    You may not be over the kidney infection, have you had your urine retested after the antibiotics?  You may want to try this. If your urine was not cultured prior to the antibiotics you may want to consider this also.  A culture will tell if a specific antibiotic is resistant or sensitive to the strain of infection.  So in response to your questions, you can tell several things from an ultrasound.  In order to see the true functioning of the kidneys more testing is required.  Such as a voiding cystogram.  You may want to follow up again if the pain has not resolved.  Thanks again and good luck Sandy RN\n\n",
    "posted_time": "Post  by Sandy Tracy RN » Mon Nov 26, 2007 5:23 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50857&sid=718853a88eb875ade3053b8ee252d7ec#p50857"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Dear Lindzyb,  Yes I agree with Sandy, your ultrasonography could reveal several things. One of the most important things your doctor would want to rule out at this stage is that your kidney infection has not resulted in the formation of an abscess (perinephric abscess).  Kidney function can rather crudely be assessed by ultrasound by noting the echogenicity (brightness) of the kidneys. However, as Sandy explained there are better tests for assessing renal function (e.g. creatinine clearance or even simple renal function tests).  A voiding cystography, on the other hand, is performed to detect abnormalities of the bladder and the urethra.   Best regards,\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Mon Nov 26, 2007 11:32 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50871&sid=718853a88eb875ade3053b8ee252d7ec#p50871"
  },
  {
    "author": "lindzyb  Guest Posts: 25 Joined: Tue Jul 24, 2007 9:50 am",
    "title": "[no title]",
    "content": "I went this morning to do a 2nd Urinalysis.  He did do a culture on the urine the first time I went in, and said that there was not very much bacteria in the urine so he doesn't understand why I'm still having pain or might still have an infection.  I have been taking cranberry pills & AZO's in moderation & drinking water to try to help out my kidneys while we try to figure out what's going on.  After he does the 2nd Urinalysis, & see's that I have a kidney infection still, what will he do?  Will I be put on long term antibiotics?\n\n",
    "posted_time": "Post  by lindzyb » Tue Nov 27, 2007 9:47 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50898&sid=718853a88eb875ade3053b8ee252d7ec#p50898"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "A culture will help determine the 'right' antibiotic for you. Antibiotics are given for a specific course never long term.  Please update this thread with the results.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Tue Nov 27, 2007 10:06 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50899&sid=718853a88eb875ade3053b8ee252d7ec#p50899"
  },
  {
    "author": "lindzyb  Guest Posts: 25 Joined: Tue Jul 24, 2007 9:50 am",
    "title": "[no title]",
    "content": "I forgot to mention, he also told me that the bacteria had not affected my bladder.  What exactly does that mean?  Wouldn't an infection go up through the bladder first then to the kidneys?  I have not heard back from him yet regarding the Urinalysis this morning, I will post again when I do.\n\n",
    "posted_time": "Post  by lindzyb » Tue Nov 27, 2007 1:12 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50915&sid=718853a88eb875ade3053b8ee252d7ec#p50915"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Actually ascending infection is one way but hematogenous (via the bloodstream) is another possibility. You would have to ask your doctor about this, as I am not sure what he meant exactly.  Keep us posted!\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Tue Nov 27, 2007 7:46 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50930&sid=718853a88eb875ade3053b8ee252d7ec#p50930"
  },
  {
    "author": "lindzyb  Guest Posts: 25 Joined: Tue Jul 24, 2007 9:50 am",
    "title": "[no title]",
    "content": "Ok, well, he put me on 10 days of antibiotics & told me to come back 2 weeks after I finish them and do another urinalysis.    I have another question, which I posted in a separate topic but it got deleted so I'm guessing I should have posted it here in the first place.  About 2 years ago I had a significant period of swelling in my ankles & feet.  It lasted 8 weeks, maybe 3 months, (i think, i can't really remember).  It would come & go for several days at a time.  I still get very slight swelling, usually just of the inside of my ankle and it's usually just one day every few weeks, but I was kind of worried about it.  Isn't that a sign of kidney function problems?  I have hypothyroidism too, which I have read can also make you swell, but I'm still worried.\n\n",
    "posted_time": "Post  by lindzyb » Thu Dec 06, 2007 7:52 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=51254&sid=718853a88eb875ade3053b8ee252d7ec#p51254"
  },
  {
    "author": "lindzyb  Guest Posts: 25 Joined: Tue Jul 24, 2007 9:50 am",
    "title": "[no title]",
    "content": "Well today I had another weird symptom that scared the pants off me.  I was sitting here at my work desk, all the sudden (in the same area I get the pains from my kidney infection) I have this sensation of something blowing up, like somebody putting air into a balloon... it goes up and up and up then all the sudden like a bubble pops (that was the feeling I got) & it goes away.  Afterward  I had a little bit of pain in that area, not much but enough to make me worry.  Has anyone ever heard of this happening before?  My mom told me it was just gas, but being that I am already scared about my kidneys I just wanted to be sure...\n\n",
    "posted_time": "Post  by lindzyb » Fri Dec 07, 2007 1:06 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=51271&sid=718853a88eb875ade3053b8ee252d7ec#p51271"
  },
  {
    "author": "lindzyb  Guest Posts: 25 Joined: Tue Jul 24, 2007 9:50 am",
    "title": "Re: Kidney function/Ultrasound?",
    "content": "Just to update: My doctor did some blood tests & said my kidneys were functioning perfectly.  I am going to take that answer and roll with it, and stop worrying so much :P\n\n",
    "posted_time": "Post  by lindzyb » Mon Dec 17, 2007 3:01 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=51733&sid=718853a88eb875ade3053b8ee252d7ec#p51733"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "Re: Kidney function/Ultrasound?",
    "content": "Yes, I agree with your doctor. Good to hear you're feeling better.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Thu Dec 20, 2007 10:48 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=51830&sid=718853a88eb875ade3053b8ee252d7ec#p51830"
  },
  {
    "author": "tigertiger  Guest Posts: 3 Joined: Sun Nov 11, 2007 4:35 pm",
    "title": "weightlifting?",
    "content": "Hi, I am SO glad I found this forum as I am NOT confident in my doctors advice. So if I may, let me give you a brief overview of my problem: I am a 45yr. old black male, 6'0\" 209lbs., moderate body fat (about 17%) very muscular as I am an AVID weight lifter (at least up until the kidney specialist suggested that I not lift heavy weight any more which depresses me!) non diabetic, excellent blood pressure, no family history of kidney problems, never had any surgery, and I am not taking any meds. I have not eaten beef in over 10yrs., and I have always made it a point to drink water, especially when weight training. Since I have been bodybuilding, I have made it a point to increase my protein intake for muscle building purposes, and I have taken amino acid, and creatine monohydrate supplements periodically, along with vitamins and other dietary supplements like garlic and omega 3 tablets. About 3 years ago, my general practitioner began to talk to me about test showing elevated levels of muscle enzymes. She finally concluded that it had to do with my weight training, but about a year ago, she told me my test showed a slight decrease in kidney function, and referred me to the kidney specialist that I referred to earlier. I have seen him twice in a year so far, and he has basically been taking test (GFR, CK, etc.) and  having come to the same conclusion as she did, he has advised me not to take any supplements, cut back on protein intake, and not to lift heavy weight (he complains that it damages muscle tissue) In the mean time, he has been tracking my test results, and tells me that he is considering referring me for a biopsy (which I absolutely do NOT want to do! ) Based on this, I like to ask two questions: Is it really necessary for me to lift only light weights (what effect does heavy lifting have on my kidneys?)  Do you think that my use of so many supplements may be responsible for the slowing kidney function, and if so, can this reduced function be halted and even reversed?  I do not have the exact lab values (I wish I had remembered to record them) but it appears that as of my last test, the decline in function is not significant (at least not yet).  Thanks.\n\n",
    "posted_time": "Post  by tigertiger » Sun Nov 11, 2007 5:58 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50100&sid=718853a88eb875ade3053b8ee252d7ec#p50100"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Tigertiger,  Based on this information I would agree with your kidney specialist.  Weight lifting can cause kidney issues by an indirect route.  Strenous weight lifting can damage the muscles.  In fact, this is basically how the muscles get bigger.  They get damaged a little and heal back stronger.  When muscle tissue is damaged a protein called myoglobin is released.  Myoglobin breakdown products can crystalize in the kidneys and damage them.    Many supplements can affect kidney function.  I am less familiar with this aspect of things so I cannot say for certain regarding your supplements but I would tend to agree that it is safest to stop the supplements as well.  If the supplements are causing the problem (or if the muscle breakdown is) the damage may very well improve and your kidney function may return to normal.  If your kidney function continues to decline a kidney biopsy is very likely to be warranted.  This is the best way to determine why the function is decreasing.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sun Nov 11, 2007 6:19 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50103&sid=718853a88eb875ade3053b8ee252d7ec#p50103"
  },
  {
    "author": "tigertiger  Guest Posts: 3 Joined: Sun Nov 11, 2007 4:35 pm",
    "title": "[no title]",
    "content": "Dr. Chan Lowe wrote:Hi Tigertiger,  Based on this information I would agree with your kidney specialist.  Weight lifting can cause kidney issues by an indirect route.  Strenous weight lifting can damage the muscles.  In fact, this is basically how the muscles get bigger.  They get damaged a little and heal back stronger.  When muscle tissue is damaged a protein called myoglobin is released.  Myoglobin breakdown products can crystalize in the kidneys and damage them.    Many supplements can affect kidney function.  I am less familiar with this aspect of things so I cannot say for certain regarding your supplements but I would tend to agree that it is safest to stop the supplements as well.  If the supplements are causing the problem (or if the muscle breakdown is) the damage may very well improve and your kidney function may return to normal.  If your kidney function continues to decline a kidney biopsy is very likely to be warranted.  This is the best way to determine why the function is decreasing.  Best wishes.Thanks doc, that explanation is clearer than any I've received from my doctor (which explains my lack of confidence in him) He says that I can lift weights, just not to the point where I am adding any new muscle growth, do you concur?\n\n",
    "posted_time": "Post  by tigertiger » Sun Nov 11, 2007 6:55 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50108&sid=718853a88eb875ade3053b8ee252d7ec#p50108"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "This sounds reasonable.  I suspect the thought is to limit muscle breakdown, so doing light lifting to maintain muscle tone should be fine.  Please keep in mind, though, that I have not examined you, nor do I have all the details of your chart so my advise is based solely on what you have provided me.  I may be missing something important.  If there is concern, it is always safest to trust the doctor that has evaluated you.    Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sun Nov 11, 2007 9:17 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50127&sid=718853a88eb875ade3053b8ee252d7ec#p50127"
  },
  {
    "author": "tigertiger  Guest Posts: 3 Joined: Sun Nov 11, 2007 4:35 pm",
    "title": "[no title]",
    "content": "Dr. Chan Lowe wrote:This sounds reasonable.  I suspect the thought is to limit muscle breakdown, so doing light lifting to maintain muscle tone should be fine.  Please keep in mind, though, that I have not examined you, nor do I have all the details of your chart so my advise is based solely on what you have provided me.  I may be missing something important.  If there is concern, it is always safest to trust the doctor that has evaluated you.    Best wishes.I gotcha doc, I am only interested in another point of view, and yours has been most helpful. You have said basically the same things he has said, but you have been just a bit clearer than him.  Have you seen apparently otherwise healthy people with lab results that indicate slowing kidney function, successfully stop or even reverse the decline at some point?  Thanks\n\n",
    "posted_time": "Post  by tigertiger » Mon Nov 12, 2007 9:03 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50176&sid=718853a88eb875ade3053b8ee252d7ec#p50176"
  },
  {
    "author": "Logansmommy  Guest Posts: 3 Joined: Mon Aug 27, 2007 12:06 am",
    "title": "Urologist, Nephrologist, OBGYN, or Internist?",
    "content": "Please help. I am a 25 year old female that recently gave birth to my 1st child 5 months ago. During my pregnancy, I was hospitalized twice for kidney stones and hydronephrosis. I have never experienced a bladder infection, kidney problems, flank pain, or mucous in the urine, prior to my pregnancy. I did have a Mirena IUD inserted 3 months post delivery, and since have experienced unusual cramping, which my OBGYN advised can be common. I have passed mucous in my urine since delivery, but this seems to decrease and increase with no significant pattern. During my pregnancy, all of my symptoms were on my right side. Now I am having left flank pain, and changes in my urine. It varies from dark yellow to dark amber. It doesn't seem to matter how much cranberry juice or water I drink. I have had a low grade fever, nausea, and an overall weak feeling since delivering my healthy little boy. These symptoms seem to be increasing with time and not decreasing. My OBGYN advised that once I had the baby these symptoms would dissapear. Who should I have look into this? Should I see a Urologist, could it be from my IUD? Are these symptoms normal after pregnancy? Could I have a kidney problem? I don't have a family history of Kidney problems other than my grandfather having multiple kidney stones. I am not taking any medications, or have I ever had a surgery. My child was born naturally, with no complications. Help! What should I do?\n\n",
    "posted_time": "Post  by Logansmommy » Mon Aug 27, 2007 12:34 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=46975&sid=718853a88eb875ade3053b8ee252d7ec#p46975"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Logansmommy,  Your symptoms may all be from a chronic urine infection.  Some bacteria that cause urine infections can also induce kidney stone formation.    I would recommend you follow up with your obstetrician.  This way you can discuss the possibility of the IUD causing problems as well as be tested for a UTI and get a thorough evaluation.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Mon Aug 27, 2007 12:48 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=46978&sid=718853a88eb875ade3053b8ee252d7ec#p46978"
  },
  {
    "author": "derek57  Guest Posts: 1 Joined: Tue Jul 24, 2007 12:07 pm",
    "title": "Kidney puzzle",
    "content": "45 Female - I was in the hospital twice for left kidney pain. I have a partial obstruction that I'm being treated for, and I have a followup in a week for it. I have a dual collecting system on the left with two ureters, which is why I'm having problems.Now, today I'm having sharp pain in my right flank. This has never happened, I've only had problems with my left side. This has me very confused. It hurts sharply in my right back(kidney area) when I inhale. I've also had my gall bladder removed 9 months ago, the first time my left kidney hurt. I'm on Cipro for infection.\n\n",
    "posted_time": "Post  by derek57 » Tue Jul 24, 2007 12:20 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=45146&sid=718853a88eb875ade3053b8ee252d7ec#p45146"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Derek57,  There are a few possibilities.  You may have a kidney stone that has formed on the right.  You may also have an infection that managed to infect the right kidney.  This could occur if you developed a UTI that spread up the ureter.    Another possibility is that it is unrelated to your kidneys.  You may have a small pneumonia or area of pleurisy (inflammation of the lung lining) in the lower right part of the lung.  I would recommend you see your doctor to have this further evaluated.  You may need an abdominal CT scan to look for stones or signs of infection in the kidney or elsewhere.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Mon Jul 30, 2007 10:31 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=45518&sid=718853a88eb875ade3053b8ee252d7ec#p45518"
  },
  {
    "author": "deenap  Guest Posts: 1 Joined: Wed Apr 25, 2007 5:03 am",
    "title": "transplanted kidney with problem",
    "content": "hi i am a 25 year male and my wife is 22 she had sufferd from nephrotic syndrome and progressed into end stage failure for the passed year and on the 20/03/2007 she had a transplant done and the kidney was donnated by her twin sister, a perfect match,its been like a month now and apon her urine test done they picked up a high protein leak in her urine at 3mg and after doing the 24 hr urine test its gone up to 5mg, her blood tests are all clear and all other levels are normal and good,  her existing two kidneys are still in there and the doctor told her that it could be the nephrotic syndrome again affecting the new kidney and medication can help  control it or it could be the two shruken kidneys that could have produced urine and if so that would have to be removed, a scan has shown that the kidney is healthy and not shruken and blood  flow is good and its healthy but just the protien leak..  she is on 6 medications  1. omeprazole 2. prednisone 3. pyridoxide 4. simvastatin 5. isoniazid 6. prazosin  please could you give me more insight on this and its outcome  or what does this mean\n\n",
    "posted_time": "Post  by deenap » Wed Apr 25, 2007 5:30 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=41385&sid=718853a88eb875ade3053b8ee252d7ec#p41385"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "My knowledge of transplant medicine is limited but I'll answer the best I can.  Your doctor's two explanations both seem possible.  The big question is does her transplanted kidney have problems or is it the old kidneys causing the problems.  If the old kidneys are still producing urine they can very much continue to spill protein until they stop functioning.  If the new kidney is beginning to have problems it is possible that what ever caused the nephrotic syndrome in the old kidney is now affecting the new one.  Another possibility is that the new kidney is being damaged by rejection.  In this case, one would generally see changes in the renal function (elevated creatinine) I would think.  If the problem continues, she may need a biopsy of her transplanted kidney to see if anything is going on.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Fri May 11, 2007 9:23 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=42328&sid=718853a88eb875ade3053b8ee252d7ec#p42328"
  },
  {
    "author": "wesman200098  Guest Posts: 19 Joined: Sat Dec 09, 2006 9:24 pm",
    "title": "PKD",
    "content": "I am a 24 yr. old male, and I am concerned about PKD.  My brother was just diagnosed with PKD at 27 yrs. old.  My family learned that PKD is an inherited disease and is very common if it runs in your family.  My family has no history of PKD.  My parents never have been screened; however, they are both in their 60s and have never had any kidney problems.  Since PKD isn't known to run in our familiy, my brother's nephrologist said that a gene most likely mutated when he was conceived causeing him to get PKD.  They diagnosed him with PKD by using ultrasound when he was having back pain and when they found blood in the urine.    I told my famly doctor about it, and he didn't seem too concerned since a gene mutation was rare.  He did say that if they find something wrong wtih my urinalysis that they would probably screen my kidneys.  I know that 2 years ago, I had trace (microscopic) amounts of blood in my urine which my doctor said that this can be normal.  Last year , my urinalysis came back perfect with no microscopic amounts of blood.  I just had a urinalysis this week, so we'll see what it says.    I feel that I should be aware of this illness, but is it likely that I would have this too since my brother has it eventhough it doesn't run in our family?  What are the odds?  Do I have a less chance of having this disease since only my brother has PKD, and not a family history of it? Do I need to get screened?  I am hesitant on getting screened withou symptoms as insurance may not pay for it.  I know that PKD ranges in severity; from being very mild to being very severe.  I only hope and pray that my brother's PKD will be mild.  Thank you so much.\n\n",
    "posted_time": "Post  by wesman200098 » Thu Jan 25, 2007 9:36 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=37999&sid=718853a88eb875ade3053b8ee252d7ec#p37999"
  },
  {
    "author": "wesman200098  Guest Posts: 19 Joined: Sat Dec 09, 2006 9:24 pm",
    "title": "[no title]",
    "content": "I also want to add that I rarely have middle-lower back pain where the kidneys are located.\n\n",
    "posted_time": "Post  by wesman200098 » Thu Jan 25, 2007 9:45 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=38000&sid=718853a88eb875ade3053b8ee252d7ec#p38000"
  },
  {
    "author": "miclus  Guest Posts: 4 Joined: Mon Dec 25, 2006 4:12 pm",
    "title": "Kidney Problems",
    "content": "Hi. I'm not able to get in to a kidney specialist here because I need a referral and some test that shows something wrong.  Basically, I have a lot of pain near my right kidney area and ribs and seems to radiate into my groin and buttock.  I've had Abdominal CT and Abdominal US and some urine studies and blood work for kidney function.  They have all been normal.  I am a 25 year old white male.  Based on this info, what would be the likelihood I still have a kidney problem?\n\n",
    "posted_time": "Post  by miclus » Mon Dec 25, 2006 4:15 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=36722&sid=718853a88eb875ade3053b8ee252d7ec#p36722"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "You may consider doing a 24 hour urine test for urine calcium.  Hypercalciuria (too much calcium in the urine) can still cause pain, even though there are no overt kidney stones.  Also, did they do the CT scan with contrast specifically looking for kidney stones?  A general abdominal CT may miss renal stones.    When you refer to blood tests, does this include calcium?  Hypercalcemia can cause abdominal pain, among other things including things unrelated to the kidneys.  Can you describe the pain in a little more detail?  I.e. how long it lasts, is it stabbing pain or more of a dull ache, how often it occurs, etc?  This may be helpful to give you a bit better information as to how to proceed.  As always, follow up with your doctor is important as the internet is no substitute for direct evaluation.  Merry Christmas.  Keep us updated.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Mon Dec 25, 2006 5:52 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=36724&sid=718853a88eb875ade3053b8ee252d7ec#p36724"
  },
  {
    "author": "miclus  Guest Posts: 4 Joined: Mon Dec 25, 2006 4:12 pm",
    "title": "[no title]",
    "content": "Hi.  Thanks for writing.  They did an Abdominal CT first without contrast, and then an abdominal ultrasound.  I don't think they were looking for anything specific though.  The second Abdominal CT added oral and iv contrast.  Also, I forgot to mention I did an IVP.  The pain I have is like a bad burning/bruised feeling to the tough near the ribs.  Seems to eithe radiate down into my groin and right testicle, or actually be from my groin and right testicle area and somehow referred upwards.  Basically, it's much worse when I sit or lay, but better when I'm standing.  It's basically a permanent pain, it can get worse, but never actually goes away for any period.  It's just stuck the way it is it seems.  This is all part of a group of symptoms I just posted about in the Urology forum here:  http://www.doctorslounge.com/urology/fo ... hp?t=13934  It's really puzzling me.  My doc is prescribing me Lexapro so I know he thinks I'm crazy.  But, I just don't know what to look into.  My plan is to rule out urological problems 100% if I can then move on to the muscles/nerves/skeleton type problems.  Also, I have always wondered about a hernia in my groin.  I've done all the cough tests, but I just wish I could get something more definitive.\n\n",
    "posted_time": "Post  by miclus » Mon Dec 25, 2006 10:55 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=36735&sid=718853a88eb875ade3053b8ee252d7ec#p36735"
  },
  {
    "author": "miclus  Guest Posts: 4 Joined: Mon Dec 25, 2006 4:12 pm",
    "title": "[no title]",
    "content": "Also, I'll add I don't think I had any calcium test.  I had just your basic tests to test kidney function, urine tests and a urine culture and eps culture and some other tests for like lupus.  Anyway, it's like I know what I want to do but it's harder than people think to get someone to listen.  I feel like it's a Christmas present if the doc actually listens and orders tests.  I don't know what it is, but I guess there's some insurance problem where they have to provide a reason to do tests.  I just wish they could just order them and then we can figure something out hopefully.  My urological plan, if it's safe to say it's not my kidneys, is to do these further tests.  1.  Pelvic CT/MRI. 2.  Cystoscopy. 3.  Repeat EPS/Semen culture. 4.  Transrectal Ultrasound.  My doc never fails to remind me that I'm not a doctor, and makes it seem like I'm self diagnosing, but these symptoms are crazy and my research for the past 20 months tells me that those tests are very useful, I don't care if they have to make up some problem to order them.  I think if those are normal, I'll basically have to move on from urological stuff.    Do you agree with those tests or think there's any to add or remove?\n\n",
    "posted_time": "Post  by miclus » Mon Dec 25, 2006 11:01 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=36736&sid=718853a88eb875ade3053b8ee252d7ec#p36736"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Suspecting that your pain may be coming from a urological source is reasonable.  I would suggest a work up for kidney stones.  Usually a stone can be seen on CT scan with contrast, but if they weren't looking specifically for kidney stones small stones can be overlooked.  Also, it may be that the stone has passed and now is not being seen; however, with persistent pain this is less likely.  The best way to assess calcium in the urine is via 24 hour urine collection.  I would suggest a thorough work up for urine calcium, renal stones, etc. before proceding to other CT scans, etc.  The cystoscopy is unlikely to be helpful unless there is a specific finding that is being looked for.    Things such as prostatitis, epidymitis, testiculitis should present with pain on palpation of the respective structure.  A self testicular exam that reveals pain is concerning for something along these lines.    Hope this helps.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Tue Dec 26, 2006 1:15 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=36757&sid=718853a88eb875ade3053b8ee252d7ec#p36757"
  },
  {
    "author": "clairebear9898  Guest Posts: 30 Joined: Fri Dec 23, 2005 1:19 pm Location: Georgia",
    "title": "microscopic hematuria",
    "content": "I'm an 18 y/o female and I have painless microscopic hematuria. Every once and awhile, though, there will be some visible blood, but only about one time once a month. Recently I went to my doctor for a pre-college physical, and there was a small trace of protein in my urine. I've been to a urologist and had ultrasounds, urine cultures, and bloodwork, and since he couldn't find a cause with any of that, he kind of dismissed it. I read a doctor reply in someone's previous post about Ibprofuen causing hematuria. I take prescription Ibprofuen a few times a month when I'm on my period....could that be a cause??\n\n",
    "posted_time": "Post  by clairebear9898 » Thu Jul 06, 2006 11:27 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=33264&sid=718853a88eb875ade3053b8ee252d7ec#p33264"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi clairebear9898, In a small percentage of people, there may be small amounts of protein and blood in the urine without an identifiable cause. Asymptomatic/painless hematuria has a variety of causes it may also be drug induced by, ie., NSAID's (Ibuprofen). However, this typically occurs with significant usage. Even though you have had an evaluation by a Urologist, I would suggest that you also be evaluated by a Nephrologist to rule out any renal abnormalities.  Sincerely, Theresa Jones, RN\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Fri Jul 14, 2006 7:17 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=33400&sid=718853a88eb875ade3053b8ee252d7ec#p33400"
  },
  {
    "author": "angie23  Guest Posts: 2 Joined: Mon Apr 25, 2005 10:40 am Location: Canada",
    "title": "urinalysis",
    "content": "If my urinalysis came back clear after the dipstick tested positive for trace blood, should I still be concerned? Or should I still be trying to find out why they keep finding red blood cells in my urine?.  I don't understand this test well enough...if something came back on the urinalysis is that when they start exploring further?\n\n",
    "posted_time": "Post  by angie23 » Wed May 04, 2005 7:59 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=13371&sid=718853a88eb875ade3053b8ee252d7ec#p13371"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Dear angie23, When the urine looks normal and blood is detected only by microscopic examination, the condition is known as Microscopic haematuria. A normal individual can excrete small amount of  blood in urine daily ( up to one million red blood cells (RBC) in the urine each day) and the condition is not considered hematuria.  In females, hematuria is common due to the high incidence of urinary tract infection (due to their short urethra). Urinary tract infection is usually associated with burning micturition, frequency and urgency.   Other conditions that lead to hematuria include Kidney  and ureteric stones , in which pain (colicky ) is usually present. Kidney disease, such as nephritis . Medications such as warfarin, aspirin, ibuprofen and naproxen.   Since you had a sporadic single spisode of traces of blood in urine, the condition seems to be not serious. If the condition is repeated or persists or associated with any other symptoms suggestive of pathological cause.  Iif any of these conditions are suspected,  your  doctors  would recommend you one or more of the following tests , after complete history and physical examination,  Urine tests (urinalysis), in this case not only to check for blood in urine but also for pus cells which if present indicate the presence of infection. Urine Culture is to be considered in this condition. Blood tests to check also for infection and to rule out any systemic causes of bleeding tendency. Kidney,  ureter and bladder-imaging   with (IV) or without dye stenography or X- ray, to detect stones or any masses.  If no cause is found but the condition is persistent or increasing, Cystoscopy, is recommended to visualize the urethra and bladder, Keep on follow up with your doctor and update him with any new symptoms. Best of luck,\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Fri Jun 30, 2006 5:41 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=33212&sid=718853a88eb875ade3053b8ee252d7ec#p33212"
  },
  {
    "author": "LISA30  Guest Posts: 1 Joined: Tue Apr 12, 2005 6:19 am Location: WEST MIDLANDS",
    "title": "microscopic blood in urine",
    "content": "Hi I would like some advice on microscopic haemituria please. During my routine smear test my urine was checked and blood was found on the labstix. A specimen was sent off and came back clear so my Gp did another one to make sure which came back with red blood cells present.   She has now referred me to a urologist. Is this a precaution? I feel a bit of a fraud going to see him as I have no pain and no frequency. Does it require investigation? and can you advise on what tests the urologist may do please.  Thanks Lisa\n\n",
    "posted_time": "Post  by LISA30 » Tue Apr 12, 2005 6:27 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=12244&sid=718853a88eb875ade3053b8ee252d7ec#p12244"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Hi lisa, When the urine looks normal and blood is detected only by microscopic examination , the condition is known as Microscopic haematuria. A normal individual can excrete small amount of  blood in urine daily ( up to one million red blood cells (RBC) in the urine each day) and the condition is not considered hematuria. In females, hematuria is common due to the high incidence of urinary tract infection (due to their short urethra). Urinary tract infection is usually associated with burning micturition, frequency and urgency.  Other conditions that lead to hematuria include Kidney  and ureteric stones , in which pain (colicky ) is usually present. Kidney disease, such as nephritis . Medications such as warfarin, aspirin, ibuprofen and naproxen   To investigate the cause your  doctors  would recommend you one or more of the foll lowing tests , after complete history and physical examination,  Urine tests (urinalysis), in this case not only to check for blood in urine but also for pus cells which if present indicate the presence of infection. Urine Culture is to be considered in this condition. Blood tests to check also for infection and to rule out any systemic causes of bleeding tendency. Kidney,  ureter and bladder-imaging   with (IV) or without dye stenography or X- ray, to detect stones or any masses. If no cause is found but the condition is persistent or increasing, Cystoscopy, is rec commended to visualize the urethra and bladder  Best regards,\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Sat Jun 24, 2006 3:10 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=33119&sid=718853a88eb875ade3053b8ee252d7ec#p33119"
  },
  {
    "author": "gesjad01  Guest Posts: 4 Joined: Thu Feb 23, 2006 9:05 am",
    "title": "Kidney pain with urination",
    "content": "I am a 22-year-old female, with pelvic floor dysfunction, a family history includes diabetes, and on no current medications. My urologist used to think I have interstitial cystitis, but he no longer does. My symptoms are more of pelvic floor dysfunction, apparently. But lately I have had pain in my right kidney as I urinate. Its as though my kidney is draining in addition to my bladder (I doubt this is the correct terminology). In the past I had a kidney ultrasound that showed I had an enlarged right kidney. I also had pain in the kidney. Now it is apparently no longer enlarged. But I still have occasional pain, and moreover, the pain in that kidney with urination. Please advise!\n\n",
    "posted_time": "Post  by gesjad01 » Fri Jun 09, 2006 2:24 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=32942&sid=718853a88eb875ade3053b8ee252d7ec#p32942"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi gesjad01, Pelvic floor dysfunction may cause a wide variety of symptoms, including flank pain. I certainly hope you were instructed on exercises to decrease symptoms. Have there been any diagnostic studies (IVP/Intravenous Pyelogram)  to assure, for example, the presence or absence of kidney stones, which may also cause flank pain? If not, I would suggest inquiring about such a diagnostic study. Sincerely, Theresa Jones, RN\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Wed Jun 21, 2006 8:18 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=33097&sid=718853a88eb875ade3053b8ee252d7ec#p33097"
  },
  {
    "author": "Sunshine31A  Guest Posts: 2 Joined: Tue Jan 03, 2006 5:24 am Location: Yongsan Army Garrison",
    "title": "Worsening Recurring Right Abdominal Pain",
    "content": "I have had recurring lower right abdominal pain, which first originated in March 2005. The first time the pain was a 10 on the pain scale. The original diagnosis was kidney stones. However the pain never completely went away which made the doctors rethink their diagnosis and then amend it by saying that they did not know the cause. Sometimes I can barely feel it and sometimes it is so bad that I can't stand the pain. With in the last week the pain in my lower right abdomen has been getting worse. It also feels a little bit different. It is more sever and the only thing that makes it better is laying in one position and not moving. I am in the military and have been shuttled from one doctor to another and do not have a primary care physician. Is there anything you can recommend?\n\n",
    "posted_time": "Post  by Sunshine31A » Tue Jan 03, 2006 5:45 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=27614&sid=718853a88eb875ade3053b8ee252d7ec#p27614"
  },
  {
    "author": "Dr. Anthony Solomon  Medical Doctor Posts: 510 Joined: Mon Nov 15, 2004 6:04 pm",
    "title": "[no title]",
    "content": "If this pain is still unresolved, can you confirm if any imaging procedure was conducted on you? Is the pain associated with any gastrointestinal disturbances, such as nausea, vomiting and loss of appetite?   Dr Anthony Solomon\n\n",
    "posted_time": "Post  by Dr. Anthony Solomon » Sat Mar 25, 2006 7:14 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=32189&sid=718853a88eb875ade3053b8ee252d7ec#p32189"
  },
  {
    "author": "Sunshine31A  Guest Posts: 2 Joined: Tue Jan 03, 2006 5:24 am Location: Yongsan Army Garrison",
    "title": "Right Side pain",
    "content": "Yes, I did have all of those symptoms. After dealing with this for about a year my DR referred me to a surgeon. My new DR ordered quite a few tests and in the end diagnosed me with biliary diskenisia. I underwent a lap chole a week ago and already I feel better.\n\n",
    "posted_time": "Post  by Sunshine31A » Thu Apr 06, 2006 10:31 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=32301&sid=718853a88eb875ade3053b8ee252d7ec#p32301"
  },
  {
    "author": "hollyhock  Guest Posts: 2 Joined: Wed Feb 22, 2006 8:55 pm Location: kalamazoo, mich.  Contact:   Contact hollyhock       Yahoo Messenger   AOL",
    "title": "elevated creatine level",
    "content": "I am a 61 year old female.  I have had an elevated creatine level of 1.3 for 5-6 years.  I have hypothyroidism, had hysteromectomy, gallbladder, apendix,tonsils, ruptured ovary.  My thyroid level is \"within range\" but feel I need more synthroid.  However, the question I have for you is the elevated creatine leve (I took lithium for a few years)l.  I feel \"sick\" all the time, no energy, lack of appetite, dizzy, muscle weakness.  The Dr.'s have dismissed this because the elevation is so low.  I have been around the block with doc's and no answers.  After so many years with this level could it be possible I should see a nephrologist? I'm at the end of my rope.  It seems the anti nausia medication has no effect.  Please help.   I take synthroid, premarin, efexor, atavan, seroquil, triliptal.  Please, please give me an idea what to do.  Family history, I come from a relatively healthy family, dad passed away from complications from parkinsons disease.  Mom is 84 good health, 3 sisters doing well, two healthy sons.  Hollyhock\n\n",
    "posted_time": "Post  by hollyhock » Fri Feb 24, 2006 4:36 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=31299&sid=718853a88eb875ade3053b8ee252d7ec#p31299"
  },
  {
    "author": "Dr. Anthony Solomon  Medical Doctor Posts: 510 Joined: Mon Nov 15, 2004 6:04 pm",
    "title": "CREATININE LEVEL",
    "content": "I am sure that what you are referring to is creatinine, a marker of renal function, and not creatine. If your level of creatinine is 1.3 mg/dL  for the past 5 - 6 years, this should be regarded as within the normal range. Some laboratories have their normal ranges as 0.4 - 1.2mg/dL, 0.4 – 1.4mg/dL, or  0.6 - 1.5mg/dL.   Creatinine estimation alone is not a perfect indicator of kidney function because of the following reasons: an individual's muscle mass or meat intake may increase the concentration; muscle damage may increase the level;  certain drugs decrease excretion of creatinine, increasing the blood level and falsely indicating kidney dysfunction.    For this reason, creatinine clearance and urea clearance are better indicators of renal function.  This link constitutes additional information on the same subject matter: http://www.doctorslounge.com/urology/fo ... highlight=   Dr Anthony Solomon Consultant Physician, Tropical & Genitourinary Medicine\n\n",
    "posted_time": "Post  by Dr. Anthony Solomon » Sat Mar 25, 2006 7:02 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=32188&sid=718853a88eb875ade3053b8ee252d7ec#p32188"
  },
  {
    "author": "kt7373  Guest Posts: 5 Joined: Fri Apr 15, 2005 11:27 pm Location: md",
    "title": "severe muscle pain, tightening, and pulling",
    "content": "Lately I've been having very bad muscle pain in my arms and legs. It started in my arms about a month ago, it started to hurt and feel tight in my right arm, by the end of one day at work I couln't move it, it hurt and felt like rubber bands  snapping. within a few days it began in my left arm, it felt stiff as a board and numb. I took a week off work and began wearing splints, which help, they don't take the pain away but they make it so I am able to work without much interference. however they still hurt a lot. It had begun to start in my legs though, the same feelings, pain tightening, pulling, they feel like they are going to tear and I can't stand on them now without switching from one foot to the other and having to sit down. after i rest after work i am able to go the next day but it is getting harder and harder each day. my electrolytes were fine, x rays were also fine. it feels as though my bones in my hands and wrists ache and the other day my knees were very stiff, my right knee was soo stiff and hurt that I could not bend it at all, but it returned to normal after a few days. I've had a lot of pain in upper spine and near the shoulders for the about the past year, but i thought that may have just been a posture thing. myt hands and feet have always fallen asleep a lot, but it seemed to get a lot worse a few years ago. a few years ago my lips were feeling numb a lot also. i am going for an EMG in a few days, what will this tell me, and should i make an appointment with another doctor to check for anything else? the doctor wanted to do MRI's of the neck and brain but I don't have any medical insurance, is there any cheaper way to check these areas. Do you have any ideas? Thank you.\n\n",
    "posted_time": "Post  by kt7373 » Sun Jul 31, 2005 12:03 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=17789&sid=718853a88eb875ade3053b8ee252d7ec#p17789"
  },
  {
    "author": "R. Zein, Pharm D  Pharmacist Posts: 157 Joined: Tue Jul 12, 2005 9:16 pm Location: USA",
    "title": "[no title]",
    "content": "dear i was wandering whether you have talked to your doctor about a condition known as fibromyalgia....the way you described your pain all over could be due to that....  i hope you always feel better. thank you\n\n",
    "posted_time": "Post  by R. Zein, Pharm D » Sun Oct 30, 2005 12:32 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=24333&sid=718853a88eb875ade3053b8ee252d7ec#p24333"
  },
  {
    "author": "Irishgirl65  Guest Posts: 1 Joined: Tue Jan 17, 2006 10:38 pm Location: Canada",
    "title": "Aches and pains in wrists, hands and feet",
    "content": "I am going through the same aches.  My hands, arms and feet swell, ache and have no strength. It feels sometimes  when I stand that my ankle is busted. Sometimes my lips go numb also.  I am having blood tests for Rhematoid arthritis. I sitll feel it is somehow related to my kidney problems. When it flares up, I am going to keep a diary.  In the summer my legs ached so bad I thought my electrolytes were off but they were fine. One time I has charlie horses in both calfs and wanted to die, that time my electrolytes were off and they discovered my body had a vitamin D deficency in which I could not absorb calcium.  Anyways, frustrated as all hell, do not think it is fibramylagia, but who knows. You hate to complain but your quality of life sucks. Keep a diary and track what you eat and what you were doing during the flare ups, that is what I am doing.  If I find out what I have I will let you know. Vice Versa/  Cheers and good luck.  TD\n\n",
    "posted_time": "Post  by Irishgirl65 » Fri Jan 20, 2006 7:45 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=28846&sid=718853a88eb875ade3053b8ee252d7ec#p28846"
  },
  {
    "author": "squab  Guest Posts: 2 Joined: Fri Nov 25, 2005 10:15 pm Location: WV",
    "title": "Stage 2 Kidneys....Question",
    "content": "Hi,  I was told by my doctor that I was at stage 2 for my kidneys.. Can you please tell me more on stage 2 and what I need to do to keep my kidneys from going to other stages? I have high blood pressure and  prediabetes... I am 42 years old... My doctor did say that she thought the reason I am at stage 2 is my blood pressure and sugar spiking up... I have my blood pressure under control most times... Please answer me so I can do what I have to do to help myself....  Thank you so much\n\n",
    "posted_time": "Post  by squab » Tue Jan 03, 2006 10:22 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=27666&sid=718853a88eb875ade3053b8ee252d7ec#p27666"
  },
  {
    "author": "squab  Guest Posts: 2 Joined: Fri Nov 25, 2005 10:15 pm Location: WV",
    "title": "Stage 2 Kidneys....Question",
    "content": "I forgot to say that I use to take between 22 to 24 tablets of ibuprofen aday for years for bad teeth... Could this have caused my kidneys to go to stage 2? My creatinine serum is 0.09,  Glom Filt Rate, est is 63.8L. They also found Traces of Wbc Esterase and Occult blood. Should I be concerned...    Thank you..  Belinda\n\n",
    "posted_time": "Post  by squab » Tue Jan 03, 2006 10:45 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=27667&sid=718853a88eb875ade3053b8ee252d7ec#p27667"
  },
  {
    "author": "kermode  Guest Posts: 1 Joined: Mon Dec 05, 2005 3:45 am Location: Seattle",
    "title": "Nephrology Symptoms",
    "content": "I am a 59 year-old male. I had my left kidney removed 4.5 years ago as a result of renal cancer.  The cancer was discovered only after several visits to my internal medicine M.D., when I insisted on a CT scan. The tumor was very large, and very aggressive.  Since then, I have had regular follow-up visits to a nephrologist. All tests have indicated that my remaining kidney is functioning normally. My nephrologist has told me that I now need to see him only once a year. However, I am concerned because I continue to have many of the same symptoms that preceded my original diagnosis. These are: bloating after meals, significant pitting edema in both legs, edema in both hands (especially fingers) and foamy bubbles in my urine each time I void. In addition, for the past year, I have had frequent episodes of what I believe is hypoglycemia (shaking, dizziness, slurred speech, loss of concentration). Do you believe that I need to seek a second opinion? Do you believe that my symptoms are of any immediate concern? Do you have any recommendations for tests I should have done? Other suggestions? Many thanks for your counsel.\n\n",
    "posted_time": "Post  by kermode » Mon Dec 05, 2005 4:09 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=26192&sid=718853a88eb875ade3053b8ee252d7ec#p26192"
  },
  {
    "author": "Dan Theman  Guest Posts: 7 Joined: Fri Aug 13, 2004 2:09 pm Location: US",
    "title": "Second Opinion-YES!",
    "content": "Hello,  First of all, do not wait on any professional advice on this forum as responses are not timely.  You should definitely get a second opinion.  It sounds like you are in nephrotic syndrome and if you are not being treated for the edema and proteinuria then you should be.  Your kidney functions may be stable but depending on the amount of protein you are spilling they could get worse with time.  If possible, see a Nephrologist at a medical university for a second opinion.  He will either validate your regular physician's protocol or determine that treatment is required.  If anything, it will bring you peace of mind.  Good luck.\n\n",
    "posted_time": "Post  by Dan Theman » Mon Dec 05, 2005 11:30 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=26203&sid=718853a88eb875ade3053b8ee252d7ec#p26203"
  },
  {
    "author": "bpangel3  Guest Posts: 5 Joined: Sun Nov 13, 2005 9:07 pm Location: London, Ontario",
    "title": "rta/fanconis and hypokalemia",
    "content": "Hi, I'm 23 yr old female diagnosed with proximal rta (renal tubular acidosis), fanconis and severe chronic hypokalemia. the rta and fanconis is result of heavy metal poisoning. I have a history of frequent kidney stones and am on amiloride and slow k (8-16 mlqv) a day. I was on k-dur 20 mlqv x 12 a day but was unable to hold them down.  Lately, I have noticed my finger nails have been purple and my toe nails too. I am wondering if this may be related to anything renally. Also heavy palpitations and heaviness in my chest when I lay on my side. I currently self diagnosed a kidney infection, see my dr tuesday for antibiotics and have passed two stones in less then 2 weeks. Also, the current amount of potassium is not enough to keep my levels up, averaging between 2.5 to 3.0. Dietary potassium is not enough and I cannot take k-dur without vomitting and k-lor with vomitting due to the chloride. Any suggestions? In order to match the k-dur doseage I would require over half a bottle of slow k per day.  thank you :!:\n\n",
    "posted_time": "Post  by bpangel3 » Sun Nov 13, 2005 9:13 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=25099&sid=718853a88eb875ade3053b8ee252d7ec#p25099"
  },
  {
    "author": "bpangel3  Guest Posts: 5 Joined: Sun Nov 13, 2005 9:07 pm Location: London, Ontario",
    "title": "[no title]",
    "content": "I also forgot to ask, when I'm doing cardio exercises, my heart rate jumps into the 170's, 180's and sometimes higher, within a few minutes of starting. Is this somehow related? Could my repeated bouts of hypokalemia have caused permanent heart damage and should I be seen by a cardiologist to be sure? Is the exercise thing normal, even when accompanied by shortness of breath and chest pain. I have asthma as well.\n\n",
    "posted_time": "Post  by bpangel3 » Sun Nov 13, 2005 9:26 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=25103&sid=718853a88eb875ade3053b8ee252d7ec#p25103"
  },
  {
    "author": "angelgee  Guest Posts: 6 Joined: Tue Oct 04, 2005 6:43 pm Location: los angeles",
    "title": "dicomfort pain on side",
    "content": "Hello I am hoping that someone can help me with a question. Well for the past, I think, month 1/2 I've been having slight pain on my right side of my back, where I believe are my kidneys. I've noticied that when I'm laying on the floor on that side It feels worse. I've been drinking cranberry juice and trying to drink a lot of water so maybe it would go away. I'm concern because this is the longest I've had pain on my sides.  Could help me with some advice or what you think it could be?  Thanks, Gloria\n\n",
    "posted_time": "Post  by angelgee » Mon Oct 17, 2005 11:46 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=23524&sid=718853a88eb875ade3053b8ee252d7ec#p23524"
  },
  {
    "author": "R. Zein, Pharm D  Pharmacist Posts: 157 Joined: Tue Jul 12, 2005 9:16 pm Location: USA",
    "title": "[no title]",
    "content": "dear with the limited information you have provided, it is better to go see a doctor, than tolerating a bothersome pain. it might be kidney related, it might be muscle spasms in your back, etc...you need to be physically checked.  thank you and i hope you feel better soon\n\n",
    "posted_time": "Post  by R. Zein, Pharm D » Sun Oct 30, 2005 12:22 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=24332&sid=718853a88eb875ade3053b8ee252d7ec#p24332"
  },
  {
    "author": "onlinehelp  Guest Posts: 4 Joined: Sat Oct 29, 2005 10:40 am Location: south east",
    "title": "early morning flank pain with strong odor urine",
    "content": "Please help; when awakening in the mornings I have flank pain that goes laterally down both sides.    When I urinate my urine smells like cornflakes (seriously!!)    Sometimes this pain continues for an hour or two after getting out of bed; it is a sharp pain that increases when moving, stooping, beding or walking then it seems to get bette after being up awhild.   This pain is NOT across my lower back only laterally down both sides.  I wake up at least once every night to urinate.    What could this possibly be??  Thanks for your assistance.\n\n",
    "posted_time": "Post  by onlinehelp » Sat Oct 29, 2005 10:51 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=24271&sid=718853a88eb875ade3053b8ee252d7ec#p24271"
  },
  {
    "author": "R. Zein, Pharm D  Pharmacist Posts: 157 Joined: Tue Jul 12, 2005 9:16 pm Location: USA",
    "title": "[no title]",
    "content": "DEAR  the way you describe pain, especially flank pain, with a strong smell in your urine, might be indicative of urinary tract infection.  have you visited a doctor, did you have during these symptoms, or when they started some blood in your urine, and or fever. i suggest that you see your doctor, since your symptoms are bothersome. thank you , and i hope you feel better\n\n",
    "posted_time": "Post  by R. Zein, Pharm D » Sat Oct 29, 2005 1:44 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=24276&sid=718853a88eb875ade3053b8ee252d7ec#p24276"
  },
  {
    "author": "onlinehelp  Guest Posts: 4 Joined: Sat Oct 29, 2005 10:40 am Location: south east",
    "title": "[no title]",
    "content": "Thanks for your reply:  I do have a documented kidney stone in right K; has been there about 3 or 4 years now was told not to worry unless it started to pass which I wouldn't be able to due to the size.  Was told location of it was high in the meat of the K and not to be alarmed unless it begins to pass IF it ever does.    Last time it was checked it had increased in size to approx 10-12 CM at that time and this was approx a year and a half ago.  I had liptotripsy at that time but it didn't break it or dissolve it.  I'm now curious if this might be causing the problem.  I've just recently started experiencing nausea at times with last episode last night which 15mg of Reglan didn't relieve.  I also have this knawing pain in epigastric region when I'm nausated.  Could this possibly be caused by the kidney stone or stone(s)??  Thanks for your advice!!\n\n",
    "posted_time": "Post  by onlinehelp » Sun Oct 30, 2005 12:12 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=24330&sid=718853a88eb875ade3053b8ee252d7ec#p24330"
  },
  {
    "author": "R. Zein, Pharm D  Pharmacist Posts: 157 Joined: Tue Jul 12, 2005 9:16 pm Location: USA",
    "title": "[no title]",
    "content": "THANKS for your reply having provided extra information, yes, your kidney stone problem might be causing this flank pain, and nausea.  due to the size of your stone, it might be better to remove them. talk to your doctor, and see what he/she might recommend.  thank you, and get well soon\n\n",
    "posted_time": "Post  by R. Zein, Pharm D » Sun Oct 30, 2005 12:20 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=24331&sid=718853a88eb875ade3053b8ee252d7ec#p24331"
  },
  {
    "author": "joe0987  Guest Posts: 1 Joined: Tue Sep 13, 2005 9:58 pm Location: Mi",
    "title": "need opinion elevated potassium",
    "content": "I'm a 45 year old male,  hypertensive and on beta blockers since age 22 (controlled, rarely over 140/90, typically 133/82, lower in evening),  taking lipitor and 1 asperin every day .   One year ago my comp metabolic panel came back with elevated potassium ( 5.8 on a 5.4 max scale), but the nurse stabbed me good so on the repeat test they were careful and it was 5.5 on 5.4 max scale.   6 months ago everything fell into normal range (BUN,Creatine etc.)     I just had another comp metabolic panel and the nurse had to use a syringe (sp?) to draw my blood; stabbed me really bad  ( They historically always have trouble finding my viens).      Now my potassium is elevated again, every thing else was normal.  GP wants me to repeat in 1 month.  I am worried about kidney failure because I read about it on the web as a cause of elevated potassium and scared myself because the one test they right did a year ago showed 5.5.   Am I really at risk for kidney failure??  Should I be evaluated by a nephrologist?? I don't have diabetes and no one in my family has ever had kidney problems.\n\n",
    "posted_time": "Post  by joe0987 » Tue Sep 13, 2005 10:29 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=20582&sid=718853a88eb875ade3053b8ee252d7ec#p20582"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi joe0987, Hypertensive states may affect all body organs. In answer to your question, yes, your kidneys may become affected and an evaluation by a Nephrologist is certainly warranted with periodic follow-ups to be sure that there are no anomalies. My concern is elevated potassium levels may cause complications, for example, arrhythmia's of the heart. Have your elevated potassium levels been treated? If not I would certainly inquire about this with your physician. Sincerely, Rntdj\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Wed Sep 14, 2005 8:54 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=20615&sid=718853a88eb875ade3053b8ee252d7ec#p20615"
  },
  {
    "author": "scorbin53  Guest Posts: 1 Joined: Thu Aug 11, 2005 10:10 pm Location: Blaine, MN",
    "title": "PKD",
    "content": "Can PKD cause me to have Leg Fatigue and feet pain?? I have troubles even having enough energy to make it through the day.\n\n",
    "posted_time": "Post  by scorbin53 » Thu Aug 11, 2005 10:19 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=18634&sid=718853a88eb875ade3053b8ee252d7ec#p18634"
  },
  {
    "author": "R. Zein, Pharm D  Pharmacist Posts: 157 Joined: Tue Jul 12, 2005 9:16 pm Location: USA",
    "title": "[no title]",
    "content": "Leg , back, and joint pain can be symptoms associated with PKD.  so the answer is yes, it can.  thank you\n\n",
    "posted_time": "Post  by R. Zein, Pharm D » Thu Sep 08, 2005 10:10 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=20149&sid=718853a88eb875ade3053b8ee252d7ec#p20149"
  },
  {
    "author": "Scooby2  Guest Posts: 2 Joined: Fri Aug 19, 2005 10:35 am Location: work",
    "title": "Need Opinion",
    "content": "My son is 21 yrs. old and has diabetes- he is currently incarcarated and has been for about 13 months and will be getting out in about 3 1/2 weeks, he has had many problems  while in jail and they just recently did a creatin and a hemoglobin a1c test and his creatin level is 1.2 and the other was 10.7 he has trouble breathing and pain in his lower back and muscles,  please explain what all this means?          Thank You,      Worried Mom\n\n",
    "posted_time": "Post  by Scooby2 » Fri Aug 19, 2005 11:06 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=19080&sid=718853a88eb875ade3053b8ee252d7ec#p19080"
  },
  {
    "author": "Janice H, LPN  Nurse Posts: 3 Joined: Sun Aug 07, 2005 8:26 pm Location: NY",
    "title": "[no title]",
    "content": "Hi worried Mom,    First, relax and take some deep breaths - he will be home in a few weeks and you can have these tests done again at your family doctor who can sit and explain what these tests mean. And you absolutely should make sure he has this done. Make an appointment for him now, so that you don't have to wait after he gets home. But for now, to answer your questions and help ease your mind if I can - creatinine levels are considered in the reference range if they are about .7 - 1.3 . At 1.2, he seems to be ok here. This test is frequently done in conjunction with others to determine that all is well with things like kidney function in someone who has diabetes. Creatinine is produced by the body as a byproduct of muscle activity. Men tend to have a higher level than women because they have more muscle mass.   Hemoglobin is the protein within blood that carries the oxygen to the cells . a1c tests effectively measure the glucose levels in the blood over a period of time, rather than tests that reflect what the patient may or may have not eaten recently.  This test is not used to  monitor a daily regimen, but again, how he is doing over time. A goal for this is considered around 7%. Because you did not relate whether his test info was 10.7 \"%\" or some other value, it is hard to determine whether this is relevent, other than to say that diabetics do historically have higher percentages and these need to be interpreted by your Dr as each patient is different.    So it sounds like the institution he is in, is running the right types of tests to monitor his condition and that should ease your mind knowing that.   Best wishes!    nys1emt\n\n",
    "posted_time": "Post  by Janice H, LPN » Sat Aug 20, 2005 12:59 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=19120&sid=718853a88eb875ade3053b8ee252d7ec#p19120"
  },
  {
    "author": "Scooby2  Guest Posts: 2 Joined: Fri Aug 19, 2005 10:35 am Location: work",
    "title": "Worried Mom",
    "content": "Nys1EMT - Thank you for your response and I will get him set up with a Dr. right away so he can follow up!             Thank You again\n\n",
    "posted_time": "Post  by Scooby2 » Sat Aug 20, 2005 9:26 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=19141&sid=718853a88eb875ade3053b8ee252d7ec#p19141"
  },
  {
    "author": "AG64  Guest Posts: 2 Joined: Fri Aug 12, 2005 1:35 am Location: Battle Creek",
    "title": "Nephrologist or Urologist?",
    "content": "I'm not sure who to see.  I have had recurrent UT infections for years, especially the past 2.  I have a lot of pain in my right back (internally, not muscular) just under rib about in the middle of right side (radiates to lower also).  My right ankle keeps swelling, especially by evening.  A year ago both ankles swelled severely and I had a kidney infection.  The swelling went away after several antibiotic treatments for infection.  I have had an MRI and Cat scan on my kidney.  No identifyed problems.  I have had an Xray on my ankle and been tested for rhrumatoid factor.  No problems there either.  The pain feels like it is in my kidney.  The swelling of my ankle is present when the pain is present.  Any other tests that I might try to see what this is?  I know that something is wrong.  Thanks.\n\n",
    "posted_time": "Post  by AG64 » Fri Aug 12, 2005 1:50 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=18648&sid=718853a88eb875ade3053b8ee252d7ec#p18648"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi AG64, Have you had any urine studies, for example, 24 hour urine collection? Have you had an IVP (kidney study)? If not those would be two suggestions as well as having an evaluation by a nephrologist if either of the above tests show abnormalities. Sincerely, Rntdj\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Fri Aug 12, 2005 8:35 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=18657&sid=718853a88eb875ade3053b8ee252d7ec#p18657"
  },
  {
    "author": "AG64  Guest Posts: 2 Joined: Fri Aug 12, 2005 1:35 am Location: Battle Creek",
    "title": "Nephrologist or Urologist?",
    "content": "No I have had neither of the tests (IVP or 24 hr urine collection).  My doctor was going to test uric acid levels to check for gout.     Thanks.\n\n",
    "posted_time": "Post  by AG64 » Fri Aug 12, 2005 8:09 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=18699&sid=718853a88eb875ade3053b8ee252d7ec#p18699"
  },
  {
    "author": "MDB  Guest Posts: 2 Joined: Sat Jul 09, 2005 11:01 am Location: VANCOUVER,WA",
    "title": "CONFUSING SYMPTOMS.PLEASE HELP!PAIN IN BOTH KIDNEYS/BLADDER",
    "content": "I am a 44 year old male.For about 3 years ,give or take a year,I have had pain in both of my kidneys(deep pain/ache in back and sides)and bladder irritation.I have no pain urinating. At night, I get up 3 to 5 times with the urge to urinate(my bladder feels especially irritated generally accompanied with mild to alot of  kidney pain).I felt nothing especially tender when the doctor pushed on my stomach area,back and sides.However,there is some tenderness pressing on the bladder area.A urinalysis was done and the results given to me on the very same visit came up normal.The doctor seemed unsure, but thought it might be a bladder/kidney infection undetectable through urinalysis(Which she says happens sometimes with males).I told her I was afraid of a more serious kidney disease.She responded by having a \"kidney functionallity test\" done by means of a blood draw.The blood draw was done on wednesday, July 6 2005.She told me, if it came up abnormal they would call me in 1 or two days from then.I have received no calls so far as of todays date saturday,July 9 2005.The doctor did prescribe for me to take Bactrim DS 800-160 2 tablets a day for 3 weeks.I used to take alot of excedrin in the past, 3 pills when I had a headache,which was about a couple of times a week.This was before I had the kidney problems .When the kidney problems began,if I took excedrin  it would increase the pain in my kidneys. Thus, several months ago, I  started to eliminate taking excedrin.My questions are; 1.Are these symptons of a more serious kidney disease etc.. or is it more likely just an infection? 2.What does a kidney functionality test able to indicate, as far as a kidney disorder/disease.What kind of kidney abnormalitys will it not show, that may be present?                                           Thank you for your help!\n\n",
    "posted_time": "Post  by MDB » Sat Jul 09, 2005 12:57 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=16567&sid=718853a88eb875ade3053b8ee252d7ec#p16567"
  },
  {
    "author": "Shannon Morgan, CMA  Medical Assistant Posts: 530 Joined: Fri May 06, 2005 6:28 pm Location: Dallas, Texas. USA.",
    "title": "[no title]",
    "content": "A blood test measures the amount of toxins in the urine, because the kidneys are a filter, not just the liver.  If levels of these toxins are high, indicates the kidney are not working effectively.  Have there been any imaging tests?  Sonograms, etc.  You can also have problems if you are chronically dehydrated as most people are.  If you drink caffeine, (cofffee, tea, soda) it dehydrates you.  You must drink at minimum 32 oz. of water a day.    Have you had a postate exam?  Enlarged prostates (BPH) can inhibit the flow of urine as well.\n\n",
    "posted_time": "Post  by Shannon Morgan, CMA » Mon Jul 11, 2005 10:04 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=16660&sid=718853a88eb875ade3053b8ee252d7ec#p16660"
  },
  {
    "author": "MDB  Guest Posts: 2 Joined: Sat Jul 09, 2005 11:01 am Location: VANCOUVER,WA",
    "title": "Response to Shannon Morgan CMA and a question",
    "content": "Thank you for responding.The following is answers to your medical questions you asked:   I have not been given a prostrate exam nor a sonogram.The doctor said she wanted to try and see if its an infection and prescribed Bactrim for 3 weeks.She was not  forthcoming when asked \"what would be done next if bactrim doesn't bring relief\".   I have been a heavy coffee drinker and its been the same with sodas.I stopped drinking the sodas a few months ago and coffee last week and have been drinking alot of water every day.I have been taking Bactrim for 5 days.I wished I knew when you typically get relief if what I have is truly an infection.The first few days of taking Bactrim I had severe kidney pain, than that subsided. Than my bladder became severely irritated for a few days with little pain in my kidneys.Today I drank alot of water and was doing fine with little pain in my bladder or kidneys (which they will do that from time to time).Than I was working outside and got dehydrated (not drinking for a few hours)and my kidneys really started to hurt than the pain subsided some when I drank alot of water.I have not received a call from the Doctors office so my kid?ney function test and urinalyises may have been normal since they said would call in 1or 2 days if any abnormalities show up. That was last wednesday.  When does a male typically feel relief when prescribed  bactrim for 3 weeks if you have a bladder & kidney infection?Should I be feeling some relief after 5 days of the 3 weeks?I still get up 3-5 times a night.What are the symptoms of a more serious kidney disease\n\n",
    "posted_time": "Post  by MDB » Mon Jul 11, 2005 11:52 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=16694&sid=718853a88eb875ade3053b8ee252d7ec#p16694"
  },
  {
    "author": "Shannon Morgan, CMA  Medical Assistant Posts: 530 Joined: Fri May 06, 2005 6:28 pm Location: Dallas, Texas. USA.",
    "title": "[no title]",
    "content": "I really don't know why you're having the pain intermittently.  Keep drinking the water and no caffeinated beverages, though.    It depends upon how severe the infection as to how long it takes to feel better.  I'm not saying you have a severe infection; just keep taking the medicine.  If you are still getting up several times a night to urinate, you might also want to be checked for an enlarged prostate, which is very common in middle aged and older men.\n\n",
    "posted_time": "Post  by Shannon Morgan, CMA » Wed Jul 13, 2005 12:55 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=16748&sid=718853a88eb875ade3053b8ee252d7ec#p16748"
  },
  {
    "author": "zfelix  Guest Posts: 2 Joined: Wed Feb 04, 2004 5:07 pm Location: Lakewood, CA",
    "title": "extreme kidney pain/no stones",
    "content": "Hi,  i've had lupus for the past 8 years.  awhile back i had extreme kidney pain in my right kidney i went to the ER, and they thought it was  a kidney stone, as well as i did.  THey did a ultra sound and found nothing but traces of blood and also traces of blood in my urine.  They had no explanation, cause i didn't have a stone.  well now and then i have the same sharp quick pain there and there always seems to follow traces of blood in my urine, doesn't burn or doesn't hurt when someone pushes there.  Yesterday i had  a extreme sharp pain again that just knocks me over in pain and then suddenly just goes away there is a ache later but goes away in about a hour.  Then i started bleeding again.  Any suggestions? or anything once i go see my doctor that i might ask or mention>  Any help you can give me is appreciated!  Thank you, Mandy\n\n",
    "posted_time": "Post  by zfelix » Wed Feb 04, 2004 5:12 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2387&sid=718853a88eb875ade3053b8ee252d7ec#p2387"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Extreme kidney pain/no stones.",
    "content": "Dear Mandy,  Thank you very much for using our website.  Having blood in the urine with kidney pain can be caused by: 1. Stones: This is the most probable diagnosis. 2. Renal vein thrombosis: In your case (lupus), one has to suspect it, but this is not the typical presentation as in addition to kidney pain and blood in the urine you must have proteins in the urine, your kidney functions shoud have gotten worse and you start having swelling in your legs. 3. Infection: You never said anything about the white cells in your urine and whether you have any bacteria or not. 4. Dissecting aortic aneurysm: This is unlikely as it usually has a progressive course not an intermittent one like your case.  5. Crystalluria: You have not told me whether you had crystals in your urine or not and if yes what kind as they can the cause of your recurrent kidney pain and blood in the urine.  My suggestion for you is to have a ct scan done to rule out stones and a doppler study (type of ultrasound) on the renal veins to rule out renal vein thrombosis.  Once more, thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Wed Feb 04, 2004 6:21 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2389&sid=718853a88eb875ade3053b8ee252d7ec#p2389"
  },
  {
    "author": "zfelix  Guest Posts: 2 Joined: Wed Feb 04, 2004 5:07 pm Location: Lakewood, CA",
    "title": "[no title]",
    "content": "thank you so much, now at least i'll have some questions and suggestions to my doctor about this situation..  -Mandy\n\n",
    "posted_time": "Post  by zfelix » Thu Feb 05, 2004 10:05 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2397&sid=718853a88eb875ade3053b8ee252d7ec#p2397"
  },
  {
    "author": "winslow  Guest Posts: 5 Joined: Thu Dec 30, 2004 7:59 pm Location: USA",
    "title": "[no title]",
    "content": "Mandy-  I wasn't diagnosed with kidney stones until after my third episode. They have never shown up on plain xrays or ultrasounds but the blockages do show up on an IVP Nephratogram. My episodes always follow the same pattern: I have soreness in the area of my kidney for several days before the acute pain sets in. Nothing that interrupts my daily routine, but enough to make me aware of it. When the actual \"attack\" comes on I have steadily increasing pain and pressure in my back that usually becomes unbearable after about 45 mintues or an hour. At that point I either pass the stone into my bladder (which brings almost immediate relief) or my vision gets very blurry and I begin vomitting. This is usually when I head to the ER. They always find blood in my urine and my normally perfect blood pressure is always very high. But, like I said, nothing on the xrays. The doctors have offered the explanation that my stones are very small (2-3mm) and I have other calcium deposits that make them difficult to see. Makes me wonder how such tiny stones can cause such a painful  blockage (mine have lasted anywhere from 2-12 hours). Strangely, while I have felt stones pass from my kidney to my bladder I have never felt one pass out of my bladder. This is a blessing from a pain perspective, but it also means that I have been unable to collect a stone for analysis.   Anyway. I thought this information might help you. Best of luck with it.\n\n",
    "posted_time": "Post  by winslow » Thu Dec 30, 2004 9:56 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=7526&sid=718853a88eb875ade3053b8ee252d7ec#p7526"
  },
  {
    "author": "Leslies  Guest Posts: 1 Joined: Fri Jun 03, 2005 7:42 am Location: Newton",
    "title": "pain in kidney",
    "content": "I started to have a sharp quick pain in my mid right back about a month ago. The pain only lasted about a 2-3 seconds but it was enough to take my breath away. I would get the pain every few days so I went to get my urine checked for blood to rule out kidney stones. There was trace blood found in my urine yet  the ulta sound showed nothing. The doctor thought perhaps I was passing a stone. 2 weeks later I went back to have my urine checked again...no blood found. They also gave me a full blood work up and found nothing. No explanation for the pain. Yesturday I had about 6-7 episodes of the same sharp pain so it seems to be occuring more frequently.   Mandy, did you ever find out what you had?  Doctors...Any ideas?? Thanks for you time. Leslie[/b]\n\n",
    "posted_time": "Post  by Leslies » Fri Jun 03, 2005 7:55 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=14570&sid=718853a88eb875ade3053b8ee252d7ec#p14570"
  },
  {
    "author": "LibertyGirl  Guest Posts: 5 Joined: Sat May 28, 2005 5:58 pm Location: Massachusetts  Contact:   Contact LibertyGirl       Yahoo Messenger   AOL",
    "title": "A lot of pain everywhere.",
    "content": "Hello.  I am new and have a lot of pain. Its been 2 months and so far, we don't know what it is. Seen multiple doctors and done multiple tests.  Here are my symptoms: § Excruciating pain along the spine, ribs and shoulder blades (Somedays) § Deep, intense stabbing pain that comes in various locations – abs, spine, chest, finger, head rtc. § Abdominal stiffness and upper-abdominal pain. Muscle twitches in the mid-upper abdomen and around the navel. Worse with hiccupping, burping, yawning and bowel movements.  § Chest Pain- intense chest pain and muscle spasms/twiches in the chest and abs; also in legs with certain kind of activity - Heartburn?§ Constant burping (every 2-3 seconds) and yawning  Never had this before - Perhaps the side effects from the meds § Numbness of hands and legs during sleep ( Only 3 times so far, not an everyday thing) § Very bad Migraines with facial pain and visual disturbances (blurriness) § The muscle tissues and tendons under the skin in the trunk area, are very tender to touch  § Constipation - always had this but has gotton worse - perhaps the side effects by the  use of drugs   They did a bunch of Rheumatic blood work and they all came negative. The hla-b27 and lyme's test were negative. The CT of the head and abdomen were negative. The Rheumatologist did not see any inflammations. She tried to put me on Piroxicam (NSAID) and Cyclobenzaprine (muscle relaxant). Did not work out. Stopped that. PCP advised me to take Zantac, helped for a while but has made things worse since i stopped the anti-inflammatory. So, i stopped that. My neurologist put me on Amitriptyline for managing the migraines and other pains. The frequency of random stabbing pains have reduced.  However, i still have pain along the ribs, spine in addition to the random pains. I am getting my Bowels checked soon. Hopefully the GI specialist i am seeing would consider getting it done. My neurologist did not think it was necessary to get an MRI or lumbar puncture done. The numbness, eye symptoms and migraines all started happenning around the same time. The Neurologist said that this may be an onset of migraines.   I have also posted on cardiac forum to figure out if the chest pain and belching is related to any cardiac disorder. Right now the only medication i am taking is Amitriptyline. Thats helping a lot. I can sleep well at nights. I'm not very worried because I do not have any family history of this kind. But ya never know.  Please advise. Thanks\n\n",
    "posted_time": "Post  by LibertyGirl » Sat May 28, 2005 7:07 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=14325&sid=718853a88eb875ade3053b8ee252d7ec#p14325"
  },
  {
    "author": "Shannon Morgan, CMA  Medical Assistant Posts: 530 Joined: Fri May 06, 2005 6:28 pm Location: Dallas, Texas. USA.",
    "title": "[no title]",
    "content": "LIbertygirl  I posted an reply on your other post.  This one gives much more information.  I did forget to add that the fact the amytriptaline is helping is significant in suggesting that your problem could be due to depression and anxiety.  (It is an antidepressant). I am definitely not saying this is all in your head - it comes out in many physical ways that don't show on tests.  You also indicated that you had not been sleeping at night - one of the signs of depression/anxiety.  You need to be cleared of any medical conditions of course.\n\n",
    "posted_time": "Post  by Shannon Morgan, CMA » Tue May 31, 2005 9:00 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=14436&sid=718853a88eb875ade3053b8ee252d7ec#p14436"
  },
  {
    "author": "angelforever34  Guest Posts: 33 Joined: Fri Dec 31, 2004 10:38 am Location: Hurricane, West Virginia",
    "title": "kidney problems worsening",
    "content": "I'm starting to have stabbing pains radiating down my abdomen and in my back. The pain gets so intense that I feel like I'm going to vomit. My appetite is decreased and when I do manage to eat, it just hurts my stomach. I haven't felt like drinking much at all though I know I need to be. About every medication I take, I have a reaction to now including over the counter meds. I have tried to quit taking most of them but what I really need. But I sleep excessively and get really painful numbing sensations from the one's I'm still taking. What kind of kidney problems could cause this?\n\n",
    "posted_time": "Post  by angelforever34 » Sat Jan 22, 2005 7:14 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8424&sid=718853a88eb875ade3053b8ee252d7ec#p8424"
  },
  {
    "author": "vyrl  Guest Posts: 1 Joined: Sun May 15, 2005 12:33 am Location: cape coral   fl",
    "title": "pain on left side for almost a year",
    "content": "I have had every test imaginable  Cat scans radium xrays colonoscopy and gallbadder test nothing shows up. Last June supposably had a kidney attack and in hospital showed up on cat scan but since then have had an attack same time in evening about once a month. No longer can find a stone and now I am having bloating in abdomen and constant pain in left side. Pictures show nothing. HELP!\n\n",
    "posted_time": "Post  by vyrl » Sun May 15, 2005 12:59 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=13735&sid=718853a88eb875ade3053b8ee252d7ec#p13735"
  },
  {
    "author": "jtf2002  Guest Posts: 1 Joined: Sat May 14, 2005 10:47 am",
    "title": "Painful lump left flank?",
    "content": "For the past year I have had painful lumps on my left flank these lumps have started to make me feel ill when bending over too much or when I exert myself.  The lumps are quite large maybe an inch and a half long and an inch in diameter I can feel them with my hands but they are not visible on the surface. I have a history of systs on my skin such as polinoidal syst and acne systs in my growing and armpits. I went to see a doctor this week who has sent me for biopsy on monday may 16th. He didn't give me any ideas as to what it could be.  My first question is should I have a ct scan first and does a biopsy pose any risks of spreading whatever it is?    Are there any questions I should ask the surgen that I will see on monday?  He is the same doctor that helped me with my Polinoidal syst.   I would also like to know what some of the possibilities are so I can do some research on my own by compairing symptoms.  I do not have any insurance so any research I can do on my own will be helpfull?  thanks john\n\n",
    "posted_time": "Post  by jtf2002 » Sat May 14, 2005 11:17 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=13710&sid=718853a88eb875ade3053b8ee252d7ec#p13710"
  },
  {
    "author": "Dr. S. Adhikari  Medical Doctor Posts: 68 Joined: Sat May 14, 2005 1:49 pm Location: India",
    "title": "[no title]",
    "content": "Hi! It's difficult to decide by history alone what might be the cause of your lumps. The fact that they are not visible from the skin surface excludes a cutaneous origin. Just check out if you have a chronic problem of constipation or if you are having urinary problems. The etiology might range from an innocuous condition to quite serious ones. A biopsy is a good option but a CT scan in the first place would have been more informative. Best wishes....\n\n",
    "posted_time": "Post  by Dr. S. Adhikari » Sat May 14, 2005 2:03 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=13712&sid=718853a88eb875ade3053b8ee252d7ec#p13712"
  },
  {
    "author": "angelforever34  Guest Posts: 33 Joined: Fri Dec 31, 2004 10:38 am Location: Hurricane, West Virginia",
    "title": "mild to severe kidney pain",
    "content": "3 1/2 months ago, I developed a UTI and severely decreased urination from an antidepressant I was taking. It caused severe pain in both of my kidneys. Got rid of the infection after using 3 prescriptions of antibiotics (bactrim & cipro). But the pain continued, constantly in my left kidney and occasionally in my right kidney. A couple of weeks ago, I went to hurting continously in both kidneys and the pain got worse. A few days ago, I got another UTI and developed decreased urination again and the decrease may have been due to a muscle relaxant I started taking. The bactrim has helped that. The pain can range from moderatly bad to severe (throbbing, achy and burning). It hurts both of my kidneys when I am sitting back on the couch. I have had variations of decreased urine output and then have frequent urination since this started. I gained 20 lbs in two months time. For weeks, I noticed my urine looked almost clear white as it seemed too much water was in my urine and it wasn't concentrating. My specific gravity at that time ranged from less than or equal to 1.005 to 1:015. Now it is staying at 1:030 and my doctor told me that I may have mild dehydration because my hemoglobin and hematocrit are elevated. When these problems first started, I was checked for kidney stones and had none but since have not been checked to see why I am having the flank pain other than urinalysis which always shows higher than normal levels of red blood cells. My blood pressure has been staying in pre-hypertension range and sometimes has been as high as 140 over 90. I sweat really bad in the palms of my hands and in my feet. I get hot flashes, feel flushed and break out in a sweat on my face. I have severe muscle cramps and continous headaches. And I can't seem to tolerate my medications now. Muscle relaxants make me very sick. I recently had bad reactions to Skelexin and was put on Diazepam (5mg twice a day) but it caused me to sleep 28 of 31 hours and I am afraid that is because of my kidney problem. I am sore to the touch in both of my kidneys. My stomach has been hurting alot recently too, having pain, diarrhea and feeling bloated alot. My questions are: could these be signs of chronic kidney inflammation? Could the sweating, hot flashes and muscle cramps be due to kidney disease? I am only 34, it is definetly not menapausal related. And is it normal to be able to feel your kidneys because I can easily feel both of mine and could they be swelled because of that? I have been feeling generally very sick and having a really tough time dealing with this pain. Hope you can provide some help. Thanks.\n\n",
    "posted_time": "Post  by angelforever34 » Tue Jan 18, 2005 3:47 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8256&sid=718853a88eb875ade3053b8ee252d7ec#p8256"
  },
  {
    "author": "angelforever34  Guest Posts: 33 Joined: Fri Dec 31, 2004 10:38 am Location: Hurricane, West Virginia",
    "title": "latest test results PLEASE HELP",
    "content": "There were quite a bit of abnormaities in the last urinalysis I had done in the ER. It showed Appearance: cloudy Specific Gravity: 1:035 Protein: trace Keytone: trace Blood 2+ Leuk Esterase 1+ PH 5.0 (in normal limits) On the microscopic it showed RBC, URINE, AUTO 15.9 H WBC, URINE, AUTO 23.2 H, BACTERIA, AUTO 748.9 H CASTS, OTHER, AUTO 1.7 (in normal limits). The urine culture showed colony count: 50,000 CFU/ml urine workup: mixed contanimants three organisms - no sensitivity. I was diagnosed with a UTI but is there anything in these test results that could indicate this is a kidney infection and not a bladder infection? My bladder pain went away but my kidneys still continuously hurt. The flank pain has been ignored by my doctors because I had a left ovarian lesion but it's went away and then they try to tell me my bladder cystitis is causing my flank pain and I know that's not true. I don't know what to do to get the help I need. Can someone  please give me some advice (pleaseeeeeeee)? Thanks in advance. My doctor also did a urinalysis the day before this test and at that time I quit burning for only two trips to the bathroom but the UTI did not show up. Why would it do that just because I quit burning for about a half an hour? That makes no sense whatsover.\n\n",
    "posted_time": "Post  by angelforever34 » Wed Jan 19, 2005 4:03 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8333&sid=718853a88eb875ade3053b8ee252d7ec#p8333"
  },
  {
    "author": "dcmarie  Guest Posts: 1 Joined: Sun Dec 19, 2004 5:19 pm Location: new york",
    "title": "need opinion",
    "content": "went to the doctor mid november doctor diagnosed me with uti, i was given levaquin for 7 days.  went back to the doctor 2 weeks later for repeat urine analysis.  blood still in the urine now i'm given bactrim.  before all of this happened i went for a pelvic and abdominal ct because of pelvic pressure, everything came back fine except for a couple of cyst on the kidney.  doctor dosen't think it's anything to worry about, but i am nervous because my father had a kidney tumor.  anyway now the urologist is sending me for a ct scan with contrast. and they want to do a cystoscopy in the bladder.  meanwhile i'm experiencing very dull back pain between my shoulder blades.  what could all this mean? do you think the blood in the urine has to do with cystitis or the kidney cyst.  thanks. dcmarie\n\n",
    "posted_time": "Post  by dcmarie » Sun Dec 19, 2004 5:29 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=7181&sid=718853a88eb875ade3053b8ee252d7ec#p7181"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Hello, The blood in your urine is more likely to be caused by cystitis. What they are going to be doing is to make sure using the cystoscopy is that they are going to search for a cause in your bladder. A CT scan can easily tell if there is a tumor in the kidneys. However, renal cysts are common and are probably nothing to worry about. Best regards,\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Mon Dec 20, 2004 12:17 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=7185&sid=718853a88eb875ade3053b8ee252d7ec#p7185"
  },
  {
    "author": "kenneth  Guest Posts: 1 Joined: Wed Sep 22, 2004 9:45 am Location: usa",
    "title": "lower right abdominal pain",
    "content": "for over a week I have been having worsening lower right quadrant abdominal pain.  I have had my appendix removed, so it cant be that, but the pain is right below that scar.  I have no fever, nausea, vomiting. I have had increase in urination, sometimes painful. One doctor said sesame seed size kidney stone, but urologist doesn't think so because pain is so severe and long lasting. no penile discharge either - have had only one sexual partner for over a year. first urine showed some blood, but week later clean urine.  Please help.\n\n",
    "posted_time": "Post  by kenneth » Wed Sep 22, 2004 9:57 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5497&sid=718853a88eb875ade3053b8ee252d7ec#p5497"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi kenneth, Since the pain is beneathe your appendectomy scar, you may want to consider adhesions. They can be quite painful. Ask your doctor if this is something that he/she has considered. Since you are having increased  urination along with discomfort, and blood, at the very least an urinalysis to check for an infection (UTI) along with a 24 hour urine to assess kidney fuction is certainly in order.  Sincerely, Rntdj\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Sun Oct 17, 2004 8:38 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5910&sid=718853a88eb875ade3053b8ee252d7ec#p5910"
  },
  {
    "author": "saintj  Guest Posts: 2 Joined: Tue Oct 12, 2004 6:26 pm Location: IL",
    "title": "Flank Pain/Hematuria",
    "content": "I have had a pain in my flank that originally came on with moderate fever and chills about a year ago. The pain has been there all this time - sometimes less, sometimes more. Tonight is somewhat more. I've had fever and chills a couple more times, but usually not.  If I move wrong it feels like someone punched me. I actually involuntarily grunt from the pain. I am also experiencing urinary frequency, (sometimes as many as 20 times per day), I have to get up at least once per night and urinary urgency. This can be episodic also - sometimes is's just 8-10 times per day, but always once per night. I also can be very thristy sometimes, but my blood sugar is normal.  I mentioned this pain to my doctor and told him the above symptoms. He ordered a urinalysis in which the only abnormal values were Occult blood in the urine (small) and Erythrocytes 6 to 10/HPF. I don't believe I've ever had blood in my urine before. I did have a strep infection in my bladder a number of years ago (3) and took meds for it.   I am feeling extremely fatigued and can barely get through the day. Also, I'm nauseated frequently.  Am I right to be concerned about these symptoms? I don't know how much blood in urine would be a cause for alarm. I do take ibuprofen as needed, but other than that I can't understand why I would have this.  Thanks.  saintj\n\n",
    "posted_time": "Post  by saintj » Tue Oct 12, 2004 6:45 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5846&sid=718853a88eb875ade3053b8ee252d7ec#p5846"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi saintj, It is abnormal to have blood in your urine. Although a small percentage of people do have a minute amout of blood that shows up on a urinalysis for no apparent reason. Some also have blood in their urine as a result of, for example, excessive exercise and medications.I would suggest that you call your doctor especially since you are still having pain. He/she may want to do additional testing, blood work, urine tests, etc. and possibly send you to a nephrologist to rule out any potential problems if he/she is unsure of the cause. Sincerely, Rntdj\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Wed Oct 13, 2004 9:10 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5854&sid=718853a88eb875ade3053b8ee252d7ec#p5854"
  },
  {
    "author": "MadiHayHai  Guest Posts: 5 Joined: Tue Sep 28, 2004 1:21 pm Location: Pa",
    "title": "Has UTI gone to my kidneys?",
    "content": "I am a 28 yaer old female. My problem now is. I was diagnosed with a UTI by my GYN on Sept. 15th after 3 days of symptoms. I went becasue I could see blood in my urine. (I only ever had one UTI and that happened after a stay in the hospital with a catheter in place.) I also had back pain and nausea, and buring after urination that lasted for awhile after urinating.  They took a urine sample through a catherter and put me on Cipro.  That Friday the 17th, I had a physical with my family Dr. and told him that I had been diagnosed with a UTI, but I had not recieved the results back yet, and I was NOT feeling better, actually my back was killing me even more. I still could see blood in my urine and still had buring more AFTER I urinated. He pulled up the results and told me I definitly had a UTI but the bacteria I had was Staph and the Cipro wouln't take it away. He put me on Augmentin. In the mean time my right flank pain is slowing progressing.  Tuesday the 21th my GYN Dr. calls back and asks how I am feeling. Not any better. I told her of my appointment with my Family Dr. and how he changed my med. She said he only got the puliminary results and I needed to go on Bactrim. This was my 3rd antibiotic. I took the Bactrim for 2 days and got really sick. I was allergic to the Bactrim. I got itchy and slept for the two days I was on it. My family Dr. told me to stop it and to come in the next day for an appointment.  He was booked I needed to see another Dr. in the practice. Although the burning was gone, but still have pain, no more \"seen\" blood  in urine, I still have this flank pain. This Dr. looked at the urine results again. He said the Bactrim would get rid of the UTI symptoms but there was something on the test I didn't understand. Something came up and I can't remember the exact name but all I can refer to was \"Rod\" and he said the test didn't specify what it was. But whatever that was the Bactrim wouldn't get rid of it and I can't take it anyway. So he put me on Levaquin 750 mgs. for 5 days. this is my 4th antibiotic. Today is my last dose.   But since yetserday the flank pain got worse. I can't bend, breathing hurts, just sitting down feels like I'm shoving my kidney under my ribs. The pain goes all the way around to the front under my rib cage. It's very painful. And makes me short of breath.  I get some relief from sitting with my heating pad, but otherwise Tylenol, or Alleve doesn't alleviate the pain. I have to get another urine sample on Oct. 2nd. He said if that comes back postive then they will start looking into other things.  But in the mean time should I be concerned?\n\n",
    "posted_time": "Post  by MadiHayHai » Tue Sep 28, 2004 2:53 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5661&sid=718853a88eb875ade3053b8ee252d7ec#p5661"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi MadiHayHai, It certainly sounds as though the current antibiotic therapy regimen has not been very effective and possibly another method of therapy may be initiated, for example IV. It's good to know this is being further investigated.  Sincerely, Rntdj\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Mon Oct 04, 2004 5:34 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5792&sid=718853a88eb875ade3053b8ee252d7ec#p5792"
  },
  {
    "author": "lyndabee1007  Guest Posts: 2 Joined: Tue Sep 07, 2004 8:49 am Location: Detroit, MI",
    "title": "Elevated Creatine levels",
    "content": "Hi - My mother is a 74 year old women with a history of Breast Cancer, hypertension, and has a family history of diabetes- though she has not had any symptoms of this yet.  She's been feeling puny for about a month now, with flu-like symptoms (diarrhea, nausea - some vomiting).  The doctor ran some blood tests and said that her creatine level was at a 5.  I'm just wondering what some of the causes of this might be.  As always, we're always scared of cancer, but if I can tell her some other obvious causes - it may get her mind off the scary ones - and give her some other options to look - and hope for.  This is an excellent site - and I've already found a great deal of information on this.  I appreciate your reply.  Thanks.\n\n",
    "posted_time": "Post  by lyndabee1007 » Tue Sep 07, 2004 8:59 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5166&sid=718853a88eb875ade3053b8ee252d7ec#p5166"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Elevated creatinine levels",
    "content": "Dear Lynda,  The increased creatinine in your mother's case could be secondary to dehydration because of the diarrhea and the vomiting she has been having and she might need iv fluids as hydration.  The hypertension can be the cause for this renal failure.  Cancer per se does not cause renal failure unless it causes obstruction of the urinary passages with urine backup into the kidneys and that's why an ultrasound has to be done and a ct scan of the abdomen sometimes has to done as well.  Another important cause that should not be overlooked is new medications that your mom started to take or any medication in general that can cause kidney problems and the most notorious ones in general and in elderly population in particular are the pain killers such as ibuprofen, advil, aleve and the like. They are used more by the elderly population because of arthritis issues.  All nephrotoxins (harmful substances to the kidneys should be avoided). If she is taking medications that are cleared by the kidneys, the doses of these medications have to be reduced and adjusted and she has to have an ultrasound of the kidneys as mentioned above.  It is up to her primary care physician to decide whether or not her case needs to be supervised by a nephrologist or not.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Tue Sep 07, 2004 11:04 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5168&sid=718853a88eb875ade3053b8ee252d7ec#p5168"
  },
  {
    "author": "lyndabee1007  Guest Posts: 2 Joined: Tue Sep 07, 2004 8:49 am Location: Detroit, MI",
    "title": "Thank you!",
    "content": "Dr. Mokhtar - thank you so much for responding.  My mother actually had an ultrasound on her kidneys this morning.  I think your comments about the medications may well be the culprit.  It sounds like her primary care physician is following the best course of action, and has already replaced one of her meds.  (don't have the details on this).  Your information has been a big help.  thanks again!\n\n",
    "posted_time": "Post  by lyndabee1007 » Tue Sep 07, 2004 12:14 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5172&sid=718853a88eb875ade3053b8ee252d7ec#p5172"
  },
  {
    "author": "neer_sainik  Guest Posts: 5 Joined: Thu Aug 05, 2004 1:34 am Location: india",
    "title": "high cretinine",
    "content": "my father is 50 yrs .he is having the kidney problem as said by doctors.his cretinine is 10.5 and blood urea is 88.8.what does it indicate .what is the best treatment\n\n",
    "posted_time": "Post  by neer_sainik » Thu Aug 05, 2004 1:39 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=4378&sid=718853a88eb875ade3053b8ee252d7ec#p4378"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: High creatinine",
    "content": "Dear Neer_sainik,  This indicates that your father has renal failure and most probably he is going to need dialysis soon.  But this does not tell us though what is the cause of the renal failure. The cause of the renal failure has to be investigated to see whether there is a reversible cause for the renal failure.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Thu Aug 05, 2004 9:29 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=4381&sid=718853a88eb875ade3053b8ee252d7ec#p4381"
  },
  {
    "author": "suej723  Guest Posts: 4 Joined: Thu Jun 24, 2004 7:47 pm Location: USA",
    "title": "Opinion Needed",
    "content": "I have a history of multiple UTI's for 10+ years. Have had 2 urethra dialations, been on prophalactic antibiotics several times.  I have been having severe pitting edema in my calves, ankles and feet for approximately 14 months. Initially my family practice doctor ordered blood tests (results fine), Echocardiogram (results normal), CT scan kidneys (normal.).  I have recently went back to my doctor again, as the edema is continuing to get worse. Doctor put me on Lasix which has helped some. I lost 8 lbs the first day of taking the Lasix. When I press on my shins, it leaves about a 1/2 inch indentation.  I have had new symptoms start recently whether or not they're related I'm not sure. A couple weeks ago, I woke up and could not urinate although I tried many times. Only after taking my Lasix was I able to urinate - about 5 hours after waking. I told my physician, and she said if it happens again she was sending me to a renal doc. My doctor recently has found protein in urine test. But my blood tests continue to come back fine. I am noticing more foam/bubbles in urine lately. She told me this can be a sign of protein in urine.   My new symptoms: insomnia - over the counter sleeping pills did nothing. Perscription sleeping pill helps. foam/bubbles in urine. Bad taste in mouth that doesn't go away. Decreased urination. Woke today at 9am, urinated at 11:30 and not since, it's now 2pm.  My question is, is it possible to have the beginnings of renal problems and my blood work come back normal? Should I request to be sent to a nephrologist?\n\n",
    "posted_time": "Post  by suej723 » Sun Jul 18, 2004 3:55 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=4133&sid=718853a88eb875ade3053b8ee252d7ec#p4133"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Hello Sue, Protein in urine is a significant finding which requires proper evaluation. Tests such as 24 hour urinary proteins and glomerular filtration rates may be required. The best person to evaulate your condition is a nephrologist. This will probably be the key to the edema problem that you have been experiencing. It could be the begining of nephrotic syndrome.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Sun Jul 18, 2004 5:38 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=4134&sid=718853a88eb875ade3053b8ee252d7ec#p4134"
  },
  {
    "author": "suej723  Guest Posts: 4 Joined: Thu Jun 24, 2004 7:47 pm Location: USA",
    "title": "[no title]",
    "content": "Thank you for your reply. I called my doctor and requested a referral to a nephrologist. But she wanted me to do a 24 hr urine test first. Now my next question is, my edema has been really bad this week. My legs hurt so bad, it's hard to walk and I feel like I keep losing my balance. I took 40 mg of Lasix today, and urinated more than I normally do (twice as much), will this affect the 24 hr test? Will it dilute it, or should I restart it and try not to take the Lasix the day I do the test?  Thanks again for your response.\n\n",
    "posted_time": "Post  by suej723 » Fri Jul 23, 2004 4:31 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=4216&sid=718853a88eb875ade3053b8ee252d7ec#p4216"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Hi Sue, Lasix will dilute your urine, thats a fact and hence it will make the protein show at a lower concentration than it is without lasix. However, the 24 hours urine test depends on precipitation of the total amount of protein in urine per day. Hence making avoiding misinterpretation due to dilution. Dilution can also be caused by excessive drinking of water. In other words its safe to continue your 24 hour urine test.  Twenty-four hour urine collections are subject to collection errors. The laboratory method, depending on an aliquot and varying dilutions, is subject to calculation errors, which must be carefully guarded against. When protein is determined by precipitation methods, x-ray contrast media, tolbutamide, penicillin or cephalosporin analogs, and sulfonamides may cause false-positives. Pyridium® also interferes with the reaction by causing color interference.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Fri Jul 23, 2004 6:24 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=4219&sid=718853a88eb875ade3053b8ee252d7ec#p4219"
  },
  {
    "author": "taahern  Guest Posts: 2 Joined: Fri Jul 09, 2004 10:09 am Location: Delray Beach, FL",
    "title": "Renal failure and confusion",
    "content": "This question is really about my mother.  She had renal failure approximately 5 weeks ago.  She's 71 and diabetic but she's always been good with her sugar.  She had a heart attack at 50 (triple-bypass) and a stroke at 63.  She's been in the hospital for 3 weeks and is receiving dialysis, however, she is still really confused and babbling.  She has a pacemaker so an MRI is out of the question.  The doctors are baffled and are taking a wait-and-see approach.  Is it possible that she will recover neurologically?  Could she be permanently brain-damaged?  Do you have any suggestions for trying to bring her back to lucidity?  I'm at the hospital every day and would be willing to try anything. Thanks.\n\n",
    "posted_time": "Post  by taahern » Fri Jul 09, 2004 10:19 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=4008&sid=718853a88eb875ade3053b8ee252d7ec#p4008"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Hello, Sorry to hear about your mothers condition. Confusion is a known symptom of renal failure. It should be noted that her blood glucose level may be more difficult to control given her current situation and may also lead to confusion. Another cause of confusion common in renal failure patients is electrolyte imbalance and/or blood pH changes. I am sure these have all been checked by her doctors. I think a CT scan of the brain should also be done to determine the possibility of stroke since she has multiple risk factors.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Fri Jul 09, 2004 4:37 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=4012&sid=718853a88eb875ade3053b8ee252d7ec#p4012"
  },
  {
    "author": "taahern  Guest Posts: 2 Joined: Fri Jul 09, 2004 10:09 am Location: Delray Beach, FL",
    "title": "[no title]",
    "content": "Thank you, Doctor.\n\n",
    "posted_time": "Post  by taahern » Mon Jul 12, 2004 7:47 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=4030&sid=718853a88eb875ade3053b8ee252d7ec#p4030"
  },
  {
    "author": "ASTOCKBROKER  Guest Posts: 1 Joined: Fri Jun 25, 2004 7:57 pm Location: MILWAUKEE WI",
    "title": "extreem burning lesions groin pain",
    "content": "i am having buring pain in my groin with redness an skin subdermal lisions extreem pain like someon is pouring  boiling water in my crotch worsen with walking both sides of my groin apprecaite any comments\n\n",
    "posted_time": "Post  by ASTOCKBROKER » Fri Jun 25, 2004 8:07 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3832&sid=718853a88eb875ade3053b8ee252d7ec#p3832"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Its very hard to judge clinical presentations over the internet with any degree of certainty. It could be eczema.  Have a look at our eczema page for more details: click here! You are best to check with a dermatologist.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Sat Jun 26, 2004 10:29 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3835&sid=718853a88eb875ade3053b8ee252d7ec#p3835"
  },
  {
    "author": "grinaldi  Guest Posts: 3 Joined: Sat Apr 10, 2004 11:16 am Location: NY",
    "title": "Interpretation of test results",
    "content": "My husband, age 52, on tricor for ><8 months, alcoholic (drinks daily), has the following results (doctor indicates he will want more tests). Need an interpretation of whether these could be an indicator of not only renal malfunction but could they also indicate a cirrhotic liver:  urea nitrogen =29 creatinine = 1.7 bun creatinine ratio=17.1 cholesterol total=237 HDL = 37L Chol/HDL ratio=6.4 LDL calculated=137 triglycerides=317  ast, alt, bilirubin in range   What could this mean?  My husband has gained 30 - 40 lbs in the past year, has sleep apnea, looks bloated, color off and has dark circles around his eyes.  What wld a doctor be testing for next?  Thanks for any help.\n\n",
    "posted_time": "Post  by grinaldi » Sat Apr 10, 2004 11:25 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3054&sid=718853a88eb875ade3053b8ee252d7ec#p3054"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Interpretation of test results",
    "content": "Dear Grinaldi,  Liver cirrhosis is a descriptive term which means that the liver is fibrotic (scarred), it does not necessarily mean that the patient who has cirrhosis has liver failure clinically meaning that it is not used to describe the function of the liver.  In addition to clinical stigmata of liver failure which are many, liver functions are tested by doing a coagulation profile and an albumin level in the blood. Also, an ultrasound of the liver is a dependable imaging technique to visualize the liver and see its size and texture and know whether it is cirrhotic or not.  A normal bilirubin is an indication that the liver is working enough to clear the bilirubin of the blood but this is not the earliest function to be affected by liver failure.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Wed Apr 21, 2004 11:53 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3149&sid=718853a88eb875ade3053b8ee252d7ec#p3149"
  },
  {
    "author": "vze3qdxk  Guest Posts: 3 Joined: Sun Jan 25, 2004 2:54 pm Location: PA",
    "title": "Renal Length",
    "content": "What is considered to be \"significant\" when it comes to renal length?  I understand that it's not unsual for the sizes of the kidneys to be different, however at what point does it become a point of concern?  Also, what causes kidney lengths to change?  Thank you.\n\n",
    "posted_time": "Post  by vze3qdxk » Tue Mar 02, 2004 4:37 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2686&sid=718853a88eb875ade3053b8ee252d7ec#p2686"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "On the contrary, they usually have a slightly different length. RIGHT KIDNEY-adult  length  9.4cm  max: 12.1cm   LEFT KIDNEY – adult  length  9.95cm  max: 12.25cm    Increase in length can be caused by many things such as tumors or hydronephrosis.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Thu Mar 11, 2004 1:28 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2735&sid=718853a88eb875ade3053b8ee252d7ec#p2735"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Renal length",
    "content": "Dear vze3qdxk,  Usually, a difference of 1 cm or more especially if one of the kidneys is getting smaller (atrophic) warrants a work up for the reason why this kidney is getting atrophic.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Sun Mar 14, 2004 4:29 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2769&sid=718853a88eb875ade3053b8ee252d7ec#p2769"
  },
  {
    "author": "JoyS  Guest Posts: 1 Joined: Mon Feb 09, 2004 6:29 pm Location: San Antonio TX",
    "title": "Cipro may not be working?",
    "content": "Have been taking Cipro since Friday after seeing my regular physician re: pain in lower left back and temperature around 100F.   Pain in my back is no better, and may in fact be worse.  Am still running a temperature (about 99-100).  Is there something this could be besided a kidney infection?  Pain is so bad I cannot sleep at night.  I have had an ovary removed after a tumor engulfed it.  I am concerned I may be having similar problem now, is that possible?    Thank you!  Joy\n\n",
    "posted_time": "Post  by JoyS » Mon Feb 09, 2004 6:33 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2449&sid=718853a88eb875ade3053b8ee252d7ec#p2449"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Joy, Have you done a urine microscopic analysis and a urine culture and sensitivity test? How have these turned out?\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Tue Feb 10, 2004 12:49 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2451&sid=718853a88eb875ade3053b8ee252d7ec#p2451"
  },
  {
    "author": "noragz  Guest Posts: 5 Joined: Thu Feb 05, 2004 7:54 pm Location: sac",
    "title": "a trace of protein in my urine",
    "content": "this has me stressed out .....but I know its not not necessarily a sign of anything serious..could someone elaborate please\n\n",
    "posted_time": "Post  by noragz » Thu Feb 05, 2004 8:14 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2402&sid=718853a88eb875ade3053b8ee252d7ec#p2402"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: A trace of protein in my urine",
    "content": "Dear Scott,   Presence of trace proteins in the urine is normal. Having said that, however, i would like to have a little medical background about you. Why did you have a urine analysis and was it a random urine analysis or was it a 24 hours collection?   Thank you very much for using our website http://doctorslounge.com and i hope that this information helped and waiting for your response.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Thu Feb 05, 2004 10:36 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2405&sid=718853a88eb875ade3053b8ee252d7ec#p2405"
  },
  {
    "author": "noragz  Guest Posts: 5 Joined: Thu Feb 05, 2004 7:54 pm Location: sac",
    "title": "This was random...",
    "content": "i was having stomach pains....consistent with constitpation...But my doctor being thourough thought a urine test would be a good idea. i also did an ex-ray. the ex-ray of the abdomin showed nothing unusual. The urine test came back with a little or a trace.of protein..can't remember there exact words. So they had me do a 24 hr urine test. This test included the following. 1. urine creatinine test  2. urine creatinine clearence test .........3. urine protein test.....i wont know the results until i turn in my urine tomorrow morning along with a blood test. But my doctor did not give me any particulars or concerns he may have had. please elaborate. PS my diet is pretty high in protein and I had acedaminaphen (Tylenol )the day before the initial urine test. I understand that pain  medication can affect the result\n\n",
    "posted_time": "Post  by noragz » Fri Feb 06, 2004 12:57 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2406&sid=718853a88eb875ade3053b8ee252d7ec#p2406"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: This was random...",
    "content": "Dear Scott,  Thank you very much for the update.  A random specimen is not the best and unless the patient has other signs of renal disease or diabetes or hypertension, i wouldn't have gone to the 24 hours urine test. i think your doctor is a little bit cautious.  Keep me updated about the results of your test.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Fri Feb 06, 2004 10:18 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2415&sid=718853a88eb875ade3053b8ee252d7ec#p2415"
  },
  {
    "author": "Felinelover  Guest Posts: 1 Joined: Wed Aug 27, 2003 11:20 pm Location: Chicago, IL",
    "title": "URIC ACID KIDNEY STONES WITH PROTEIN MATRIX",
    "content": "I am looking for some advice to my problem with kidney stones.  I have been with the same urologist since 1999 and am wondering if I should maybe see a nephrologist?  I have been getting kidney stones since 1999.  I went for a second opinion they recommended I go on a low protein diet, which I have been on for 3 months but, just recently had another attack.  I am very concerned because my attacks have been every year or less and wondering if can or has caused any damage to my right kidney.  Oh and I faithly drink about 8-12 glasses of water a day!  Thanks for any advice that may help me!\n\n",
    "posted_time": "Post  by Felinelover » Thu Aug 28, 2003 12:08 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1271&sid=718853a88eb875ade3053b8ee252d7ec#p1271"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Uric acid kidney stones with protein matrix",
    "content": "Dear Felinelover,  Do you have gout? and if yes do you take any medications for gout? Are you taking any other medications? Do you have any chronic medical problems for which you are treated?  Was any stone caught and analysed? This will help a lot in the diagnosis of what type of kidney stone you have and then direct the treatment.  i think that seeing a nephrologist would be very helpful.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Sat Aug 30, 2003 7:19 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1285&sid=718853a88eb875ade3053b8ee252d7ec#p1285"
  },
  {
    "author": "lbenkel  Guest Posts: 5 Joined: Mon Jun 09, 2003 9:42 am Location: Michigan",
    "title": "Pain in left waist area",
    "content": "Pain developed about two days ago in my left side at waist.  Sometimes it is crampy, tender to the touch.\n\n",
    "posted_time": "Post  by lbenkel » Mon Jun 09, 2003 9:50 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=909&sid=718853a88eb875ade3053b8ee252d7ec#p909"
  },
  {
    "author": "Dr. Russell M  Medical Doctor Posts: 650 Joined: Mon Jun 09, 2003 12:34 pm Location: USA",
    "title": "[no title]",
    "content": "Your age/gender/medical/surgical histories??\n\n",
    "posted_time": "Post  by Dr. Russell M » Mon Jun 09, 2003 1:28 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=911&sid=718853a88eb875ade3053b8ee252d7ec#p911"
  },
  {
    "author": "lbenkel  Guest Posts: 5 Joined: Mon Jun 09, 2003 9:42 am Location: Michigan",
    "title": "re:pain in left waist area",
    "content": "angioplasty in Oct, 2002 with stent, appendectomy in the 1970's, hysterectomy in 1996 Taking lamisil for toe fungus for the past 2.5 months.  Also taking Levoxyl, dyzide and aleve. Female 72.\n\n",
    "posted_time": "Post  by lbenkel » Mon Jun 09, 2003 3:14 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=914&sid=718853a88eb875ade3053b8ee252d7ec#p914"
  },
  {
    "author": "Dr. Russell M  Medical Doctor Posts: 650 Joined: Mon Jun 09, 2003 12:34 pm Location: USA",
    "title": "[no title]",
    "content": "Dear Ibenkel,  I am of the opinion that you require an examination by a physician/surgeon if the problem persists.  Regards,  -bill\n\n",
    "posted_time": "Post  by Dr. Russell M » Wed Jun 11, 2003 3:10 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=927&sid=718853a88eb875ade3053b8ee252d7ec#p927"
  },
  {
    "author": "lbenkel  Guest Posts: 5 Joined: Mon Jun 09, 2003 9:42 am Location: Michigan",
    "title": "Pain in left waist",
    "content": "Oh, you tell that to all the girls\n\n",
    "posted_time": "Post  by lbenkel » Wed Jun 11, 2003 7:48 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=929&sid=718853a88eb875ade3053b8ee252d7ec#p929"
  },
  {
    "author": "lbenkel  Guest Posts: 5 Joined: Mon Jun 09, 2003 9:42 am Location: Michigan",
    "title": "Pain in left waist",
    "content": "Seriously now. Why would I see a doctor for a side ache. What are the possible causes?\n\n",
    "posted_time": "Post  by lbenkel » Wed Jun 11, 2003 7:55 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=930&sid=718853a88eb875ade3053b8ee252d7ec#p930"
  },
  {
    "author": "Dr. Russell M  Medical Doctor Posts: 650 Joined: Mon Jun 09, 2003 12:34 pm Location: USA",
    "title": "[no title]",
    "content": "Dear Ibenkel,  Seriously, there is no substitute for medical examination, though the Internet definitely helps information explosion. Your ‘left waist/side ache’ could be insignificant or could be a sign of disease affecting regions of the human body ranging from the skin and muscles to the bowels, the kidneys or the ureter, depending on the findings of medical examination.  As age advances, homeostasis (the ability to stabilize internal milieu of the body) decreases, and the presentation of various diseases could be completely different when compared to the younger age groups. Problems we might feel trivial could be harbingers of serious illnesses at extremes of age. Besides, from this side of our interface, your 'left waist/side ache' would seem a no man’s land by layman’s terms. A doctor would want to know your site of pain more specifically in his map of the human body, and find out the character of the symptom, and the signs that get elicited. But most of us wouldn’t want to see a doctor unless our problems annoy us, and most often than not our troubles prove trivial than threatening.  -Bill\n\n",
    "posted_time": "Post  by Dr. Russell M » Wed Jun 11, 2003 12:42 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=932&sid=718853a88eb875ade3053b8ee252d7ec#p932"
  },
  {
    "author": "dstephan4949",
    "title": "Thin Lining inKidney",
    "content": "After having a kidney biopsy, I was told that I have a very thin lining in my kidneys, has anyone heard of anything like this.  I understand there is no cure and blood will remain in urine forever.\n\n",
    "posted_time": "Post  by dstephan4949 » Tue May 27, 2003 12:50 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=826&sid=718853a88eb875ade3053b8ee252d7ec#p826"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "Thin Basement membrane nephropathy  - TBMN",
    "content": "The Good News:  Thin Basement membrane nephropathy (T.B.M.N) is not associated with early end stage renal disease and in fact survivors into the ninth decade are recorded! The prevalence of T.B.M.N. is reported as being similar to that of IgA nephropathy. Haematuria (blood in urine) is thought to occur from thinning of the basement membrane allowing easier passage of red blood cells into the urinary space. Alternatively, the thin basement membrane may be more likely to rupture and result in haematuria. Approximately 95% of these patients present with haematuria with 12% having 3+ haematuria.   Trials have now followed up this condition for 15-17 years with the first case being diagnosed in 1973. Review articles on this condition are favourable with a benign course being described in most instances. In a review article in the Quarterly Journal of Medicine, 43 patients were followed up for a mean period of 88 months and all had a benign prognosis with no change in creatinine over this period. There does not appear to be any association with prognosis and amount of haematuria/proteinuria or age. The association with hypertension however is important, as there is an increased risk of renal dysfunction in these patients. T.B.M.N has been linked to a number of other conditions including Crohn’s disease, co-existence with IgA nephropathy and mesangial proliferative glomerulonephritis.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Tue May 27, 2003 7:19 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=828&sid=718853a88eb875ade3053b8ee252d7ec#p828"
  },
  {
    "author": "SCOOK",
    "title": "KIDNEY PAIN",
    "content": "MY SON IS 23 YEARS OLD,6'2\", AND ABOUT 220 LBS. HE IS HAVING PAIN IN HIS KIDNEYS. SONOGRAM SHOWED NO ABNORMALITY IN KIDNEYS. SPLEEN WAS SLIGHTLY ENLARGED. HE IS FEELING NAUSEATED AND HAS VOMITED TWICE IN 24 HRS. Dr. SAYS CREATININE LEVEL IS 3. PAIN IS ALSO IN LOWER ABDOMEN REGION. HE HAS A GREAT THIRST AND IS DRINKING A LOT. AT THIS TIME HE IS IN THE HOSPITAL WITH AN IV FOR FLUIDS. SUGAR LEVEL IS FINE. ANY IDEAS ON WHAT THIS COULD BE OR WHAT QUESTIONS I SHOULD BE ASKING? IS THERE SOMETHING I MIGHT SUGGEST FOR THE DOCTOR TO INVESTIGATE?\n\n",
    "posted_time": "Post  by SCOOK » Fri Mar 07, 2003 10:18 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=504&sid=718853a88eb875ade3053b8ee252d7ec#p504"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Kidney pain",
    "content": "Dear Scook,   What do you mean by \"kidney pain\"?  Your son has a creatinine of 3 (this means that according to his weight and age his kidneys are funtionning at 50% of their abilities.   You did not say why he went to the hospital to begin with. Is he known to have kidney problems in the past?   It does not necessarily mean that your son has \"kidney pain\" if his kidney functions are abnormal. The pain could be coming from somewhere else.   Does he have any other medical problems? Is he being treated for any chronic medical problem?   Thank you very much for using our website http://doctorslounge.com and waiting for your update.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Fri Mar 07, 2003 10:19 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Nephrology Symptoms",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=505&sid=718853a88eb875ade3053b8ee252d7ec#p505"
  }
]