[
  {
    "author": "Eggmas  Guest Posts: 1 Joined: Wed Aug 04, 2010 9:19 pm Gender: Male",
    "title": "Sore White Node On Tip Of Tongue",
    "content": "One of the papillae on the tip of my tongue has turned white and is very sore and sensitive. I have tried treating with hydrogen peroxide, ice, warm salt water rinse and oral gel. All provide only temporary relief. Any other treatment suggestions and a diagnosis would be greatly appreciated.\n\n",
    "posted_time": "Post  by Eggmas » Wed Aug 04, 2010 9:39 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=99722&sid=d8ced93bef0173d174fd057d02b25aff#p99722"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: Sore White Node On Tip Of Tongue",
    "content": "Hi, From your description, the exact location of the lesion and the type of papilla that you are referring to are not clear.In diagnosing lesions over the tongue, a clinician has to go by - the history, - the morphology of the lesion and - digital palpation(especially to look for \"induration\"-which may indicate a malignant lesion and in 'whitish' lesions, and also to see if the whitish 'lesion' can be easily wiped off or not).  Therefore, i will confine myself to a brief account on some of the probable lesions.  - Hypertrophied foliate papillae: located over the posterior part of the lateral borders of the tongue.These may enlarge due to infection or chronic irritation and cause concern. - Hypertrophied circumvallate papillae: These papillae, 8-12 in number, are located over the dorsum of the tongue in a 'V' shape at the junction of the oral and oropharyngeal parts of the tongue. When hypertrophied, they frequently mimic a malignant tumor. - Glossodynia: seen mostly in > 50y old women, is said to be associated with cancerophobia. Affected individuals may complain of an itching sensation over the tip and adjoining lateral borders of the tongue.The fungiform papillae are enlarged and the area appears raised and red. This condition also may be associated with a number of other diseases (iron deficiency anemias, pernicious anemia, candidiasis, diabetes mellitus, xerostomia, lichen planus etc). - minor salivary gland tumors. - malignant tumors (squamous cell carcinoma, lymphoepithelioma, lymphomas as well as others)  Although some of the lesions mentioned may not be intrinsically 'whitish' in color, they may get coated by food particles and aquire such an appearance.   In managing these lesions, generally, the threshold for biopsy is understandably low. Any such lesion, which persists beyond a reasonable period of conservative measures must be biopsied. Best wishes!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Fri Aug 06, 2010 12:23 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=99851&sid=d8ced93bef0173d174fd057d02b25aff#p99851"
  },
  {
    "author": "UTGal  Guest Posts: 1 Joined: Sat Dec 05, 2009 2:16 am Gender: Female",
    "title": "White spot on tongue that does not hurt",
    "content": "Hello,  I am a 21-year-old female, and I do not drink or smoke. I am in relatively good health, although I do suffer from mild asthma and acid reflux, which has not acted up since June.   This week I bit the back of my tongue (accidentally, of course), and when I tried to investigate the healing process today, I noticed a white bump on the underside of my tongue, with about a 0.5cm diameter. It does not hurt, and although there appears to be some redness around the white area, it has not impeded my eating or drinking of any type of food. I was wondering whether or not what I'm noticing is a version of the common canker sore, or if it is something that I should take more seriously.  My family does not have a serious history of cancer, although my uncle passed away from a brain tumour four years ago. Along with this white spot, I also noticed small amounts of blood emerging with mucous expulsions from my nasal cavity. I was also wondering if these phenomena were related, and if you recommend professional evaluation.  Thank you for your time, UTGal\n\n",
    "posted_time": "Post  by UTGal » Sat Dec 05, 2009 2:34 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=88143&sid=d8ced93bef0173d174fd057d02b25aff#p88143"
  },
  {
    "author": "Dr.M.jagesh kamath  Medical Doctor Posts: 1303 Joined: Mon Aug 03, 2009 7:24 am Gender: Male",
    "title": "Re: White spot on tongue that does not hurt",
    "content": "Hello,Apart from yeast infections which are commoner in childhood and in the immunodeficient,the likely diagnosis would be leucoplakia or oral lichen planus.Leucoplakia would be commoner at pressure spots like a denture or cheek area due to biting and with tobacco use.Lichen planus is a condition for which cause is not known produces lacy white nonpainful affecting areas of cheeks or tongue.This can be treated with with external application of steroids.If this persists do get biopsied to get a firm diagnosis.Bcarotene contaning foods like papayya,tomatoes and watermelon would be most useful for prevention.Bestwishes.\n\n",
    "posted_time": "Post  by Dr.M.jagesh kamath » Wed Dec 09, 2009 9:31 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=88561&sid=d8ced93bef0173d174fd057d02b25aff#p88561"
  },
  {
    "author": "LemonDelight  Guest Posts: 1 Joined: Sun Nov 02, 2008 8:54 pm Gender: Female",
    "title": "Cold sore or canker sore?",
    "content": "I have always had reoccurring breakouts of what I assumed were canker sores inside my mouth. I know that cold sores (caused by herpes) are generally found on the outside of the mouth, but I've read conflicting reports on whether they occur on the gums or not. I also read conflicting reports on whether canker sores appear on the gums or not. Some say they do, others say they don't.   I have had ulcers break out in my mouth everywhere from my tongue, my cheeks, the base of my gums, and the inside of my lip. They have all the appearances of a canker sore. White coating, red halo...I have never had a breakout outside of my mouth. Which is where cold sores typically break out.  I know that canker sores aren't contagious while cold sores are. Recently my boyfriend had an ulcer come out at the base of his gums. It had a white coating and looked like the ones I have gotten. But he's never had canker sores before, so now I'm worried that maybe what I've always thought are canker sores are actually cold sores...  So, to clarify my question. Can canker sores break out on the base of your gum or not? Could I possibly have cold sores?\n\n",
    "posted_time": "Post  by LemonDelight » Sun Nov 02, 2008 9:06 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=62991&sid=d8ced93bef0173d174fd057d02b25aff#p62991"
  },
  {
    "author": "Debbie Miller, RN  Nurse Posts: 4746 Joined: Mon Apr 16, 2007 2:41 pm Gender: Female Location: USA",
    "title": "Re: Cold sore or canker sore?",
    "content": "Hello, Yes, you can get canker sores on your gums and this is not where people usually get oral herpes.   Canker sores usually heal in about 10 to 14 days.  Avoid sharp foods that may injure your mouth further to facilitate healing.  Best wishes.\n\n",
    "posted_time": "Post  by Debbie Miller, RN » Fri Nov 07, 2008 11:58 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=63460&sid=d8ced93bef0173d174fd057d02b25aff#p63460"
  },
  {
    "author": "flower4545  Guest Posts: 1 Joined: Fri Jan 23, 2009 5:48 pm Gender: Female",
    "title": "Re: Cold sore or canker sore?",
    "content": "my mom is suffering from cold sores on her mouth. Her lips are so swollen it looks like she got botox injections. Is this normal? She is just getting over phenonoma.  Please any help with this. She is to sick to go to the Doctors.  Thanks\n\n",
    "posted_time": "Post  by flower4545 » Fri Jan 23, 2009 6:00 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=69521&sid=d8ced93bef0173d174fd057d02b25aff#p69521"
  },
  {
    "author": "Dr.M.jagesh kamath  Medical Doctor Posts: 1303 Joined: Mon Aug 03, 2009 7:24 am Gender: Male",
    "title": "Re: Cold sore or canker sore?",
    "content": "Hello,Sure this could happen especially if there is secondary bacterial infection.A course of antibiotic could help her.However most of these settle in a few days.Best wishes.\n\n",
    "posted_time": "Post  by Dr.M.jagesh kamath » Mon Nov 23, 2009 1:41 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=87523&sid=d8ced93bef0173d174fd057d02b25aff#p87523"
  },
  {
    "author": "ZephyrWolf31  Guest Posts: 2 Joined: Sun Nov 08, 2009 4:26 am Gender: Male",
    "title": "Can a canker sore appear far up inside the cheek by gumline?",
    "content": "I have what FEELS like a canker sore, inside of my mouth, against the back of the cheek, about 1/2 cm. below the point where the cheek meets my gums.  It is slightly higher up then the surface of my top row of teeth, so I don't think it was caused by tooth-to-cheek friction.  I know what a canker sore looks like, but I can't look at it in a mirror because it is so high up, so I cannot say if it looks like a normal canker sore.  I can only feel it with my tongue.  I've had them in the past, but only on the inside of my lip.  Therefore, I don't know if they can appear in the location I describe.  The sore is not round, but oblong shaped, approximately 1.5 cm. long, and slightly raised from the surface of the cheek.  This sore is painful to pressure, suction (via cigarette or drinking straw), and mouthwash.  I woke up with it 4 days ago and it does not seem to be improving.  Any insight would be appreciated.\n\n",
    "posted_time": "Post  by ZephyrWolf31 » Sun Nov 08, 2009 4:41 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=86219&sid=d8ced93bef0173d174fd057d02b25aff#p86219"
  },
  {
    "author": "Dr.M.jagesh kamath  Medical Doctor Posts: 1303 Joined: Mon Aug 03, 2009 7:24 am Gender: Male",
    "title": "Re: Can a canker sore appear far up inside the cheek by gumline?",
    "content": "Hello,The location seems typical of aphthous stomatitis and are painful ulcerations and could be round or ovoid.Smoking,vitamin deficiencies,immune deficiency states all could play a role in causation.Rarely autoimmune conditions like behcets could present like this.Fusospirochetal organisms some times cause painful ulcerations and respond to metronidazole.You should get examined by a oral surgeon and treated.Best wishes.\n\n",
    "posted_time": "Post  by Dr.M.jagesh kamath » Mon Nov 09, 2009 10:43 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=86338&sid=d8ced93bef0173d174fd057d02b25aff#p86338"
  },
  {
    "author": "ZephyrWolf31  Guest Posts: 2 Joined: Sun Nov 08, 2009 4:26 am Gender: Male",
    "title": "Re: Can a canker sore appear far up inside the cheek by gumline?",
    "content": "Thanks for the reply.    This morning I found a flashlight and was able to stretch my cheek out enough to finally see it in a mirror, and it does indeed look exactly like the typical canker sores I used to get inside my lower lip as a kid.  So, hopefully, it will clear up in the same manner as canker sores of my past.  Sadly, I cannot afford to be treated by a professional right now.  I'll have to stick with some vitamin B12, liquorice root and milk of magnesia and hope it helps.\n\n",
    "posted_time": "Post  by ZephyrWolf31 » Mon Nov 09, 2009 12:56 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=86353&sid=d8ced93bef0173d174fd057d02b25aff#p86353"
  },
  {
    "author": "Dr.M.jagesh kamath  Medical Doctor Posts: 1303 Joined: Mon Aug 03, 2009 7:24 am Gender: Male",
    "title": "Re: Can a canker sore appear far up inside the cheek by gumline?",
    "content": "Hello,Guess that should be ok and you are back to normal now.With my best wishes.\n\n",
    "posted_time": "Post  by Dr.M.jagesh kamath » Mon Nov 23, 2009 1:38 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=87522&sid=d8ced93bef0173d174fd057d02b25aff#p87522"
  },
  {
    "author": "misnomer  Guest Posts: 1 Joined: Fri Nov 07, 2008 12:32 pm Gender: Male",
    "title": "Green \"Slime\" On Top of Tongue, Can Rub Off",
    "content": "I have had a green \"slime\" on the top of my tongue for quite some time.   Using my fingernail I can scrape it off, although not completely. The severity seems to wax and wane, although it is always there. I am pretty orally hygenic, have missed brushing every once in awhile but not often.  I first noticed it about a month ago, and my mother who is an FNP thought it was a yeast infection, so I started taking Fluconazole. It did not help.   Afterwards I tried taking an adult probiotic, just to see if that helped. It did not. Vigorously brushing and using mouthwash seems to help, but still cannot get it to go away.  I plan on going to a doctor as soon as I have money, as this doesn't seem to be a life-threatening symptom, but it is still rather gross and something i'd like fixed, or at least to have an idea on what it is.  Also, I do not smoke nicotine, rarely (as in once a month, if that) smoke cannabis, drink with friends maybe once/twice a month, and sexually inactive for quite some time. Pretty fit and healthy otherwise, although living in a damp climate like where I live has not been good for my sinuses, which i'm not sure has anything to do with this.  I have had sinusitis twice, and surgery twice.\n\n",
    "posted_time": "Post  by misnomer » Fri Nov 07, 2008 12:43 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=63462&sid=d8ced93bef0173d174fd057d02b25aff#p63462"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: Green \"Slime\" On Top of Tongue, Can Rub Off",
    "content": "Hi, Greeish coat on the tongue may be a variant of \"black hairy tongue\".The tongue has a variety of papillae, some of which are called the 'filiform papillae' (mostly in the oral part of the tongue).  When these get sorrounded by mycelial threads of certain fungi such as Aspergillus Niger, a black,furry tongue results. Candida albicans also can produce a similar picture.  Chlorophyll containing chewing gums have been sited as a reason for conferring the green colour seen some cases with this condition.Antibiotic therapy is a prominent risk factor.  Best wishes!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Mon Nov 16, 2009 11:27 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=87088&sid=d8ced93bef0173d174fd057d02b25aff#p87088"
  },
  {
    "author": "Philosophy  Guest Posts: 1 Joined: Tue Sep 08, 2009 1:22 am Gender: Female",
    "title": "Diagnosed with Odontogenic Myxoma",
    "content": "Background: Female Age: 28 Never had a single cavity, filling, or any other form of work done on my teeth. Wisdom teeth have never been removed. Very good health, physically active, married 10 years. Have mild asthma, treated by rescue inhaler Non-smoker and non-drinker Do not take any medications regularly  For the past 7 years I thought a knot in my front mandible was a Mandibular Torus. It grew slowly and has been painless. However I have come to find out in recent days, after a trip to the Mayo clinic in Rochester, MN for a biopsy, that it is a rare tumor called a Odontogenic Myxoma. I have been informed that they will be doing a block excision that will also includes the removal of 6 of my front teeth. They will not be doing a bone graft as it will need to be monitored over the next 3-5 years to watch for recurrence. I will be fitted with some kind of a bridge over the missing  area of jaw bone about a month after surgery, and eligible for implants after 2 years.  These recent developments have me wondering a few things.  1) How rare is this tumor. I asked one of the 2 surgeons who will be doing my surgery this question and she was unable to say, but just stated it was very rare. That she had never seen it before. The second surgeon who has been in this field 30+ years spoke as though he had only seen it twice, and both cases the patient was quite deformed in the mouth by the time he treated them. I have tried to look up some statistics online, however the most I have been able to find is a few sites stating .07 people for every 1 million. But I am unsure how reliable these sources are.  2) When I have have a block excision of the tumor and the removal of the 6 teeth, what kind complications should I expect by not having a graft of any kind to replace the missing area of my jaw? Will I be able to talk? Are there any pictures of people who have had a block excision this large in the front mandible to give me an idea of how little or how much I should be expecting to have left of my mouth when I come out of surgery? I'm a bit concerned something this extensive being missing from my mouth for this long my frighten my children and I just want to get an idea of what I may look like afterward.  I have attached an x-ray done of the tumor a few weeks ago. I have been in for a full work up of CT scans (with and without the iodine IV), chest x-rays, blood work and biopsies. It took the pathology department 3 days longer then the surgeons expected because of the rarity of the tumor and they have determined it is benign. They have found nothing else anywhere. Nothing in my lymph nodes, and they checked my heart as I am told this tumor is usually found there instead of the mouth.  Any help, thoughts or opinions would be greatly appreciated.  Thank you...\n\n",
    "posted_time": "Post  by Philosophy » Tue Sep 08, 2009 1:54 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=82075&sid=d8ced93bef0173d174fd057d02b25aff#p82075"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: Diagnosed with Odontogenic Myxoma",
    "content": "Hi, Tissue that is cell-poor and  mucopolysaccharide(ground substance) -rich is said to be myxoid tissue.Tumors that have these histologic features are called myxoma.   They are uncommon (odontogenic myxomas represent  1% -17.7% of all odontogenic tumors).  Within the skeleton, they occur almost exclusively in the jaws. Outside of the jaws, they are extremely rare. Those that occur in the jaws are said to be of odontogenic origin(believed to arise from the dental papilla or follicular mesenchyme).  Odontogenic tumors pose a considerable challenge not only to the clinician (many of them resemble each other clinically), but to the histopathologist and radiologist as well.  I hope this information is useful to you.Good day!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Mon Nov 09, 2009 1:43 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=86302&sid=d8ced93bef0173d174fd057d02b25aff#p86302"
  },
  {
    "author": "rhenaneanne  Guest Posts: 1 Joined: Tue Sep 08, 2009 10:14 pm Gender: Female",
    "title": "Sore Patches on Roof of Mouth",
    "content": "It's happened to me maybe three times before where I just kind of develop these areas on the roof of my mouth. They usually just start out as a raised-feeling area that I can feel with my tongue, and then they start to hurt. This is made worse by acidic kinds of foods (like tomatoes, etc) and obviously it hurts more when i touch it. I can't really say how long they last but I'd hazard a guess at around one to two weeks... this soreness occurs months after the previous occurence. The soreness doesn't originate from just one area of the roof of my mouth, it varies. But it is always on the roof.  What is it?  I get both canker and cold sores (I'm lucky that way) if that info helps.\n\n",
    "posted_time": "Post  by rhenaneanne » Tue Sep 08, 2009 10:24 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=82180&sid=d8ced93bef0173d174fd057d02b25aff#p82180"
  },
  {
    "author": "Dr.M.jagesh kamath  Medical Doctor Posts: 1303 Joined: Mon Aug 03, 2009 7:24 am Gender: Male",
    "title": "Re: Sore Patches on Roof of Mouth",
    "content": "Hello,Herpes virus infections do involve the palate and cause recurrent sores.More common are aphthous stomatitis related to stress and possibly virus.Vitamin deficiencies do play a role so do acidic foods.Antibiotics when taken for a long course lead to growth of monilial yeasts and can lead to soreness so do drug eruptions.Ill fitting dentures,food preservatives,cinnamon,chewing gums all can cause erosions.Best to avoid foods you could be allergic to,like pineapple etc.Hope this helps.Good wishes.\n\n",
    "posted_time": "Post  by Dr.M.jagesh kamath » Thu Nov 05, 2009 9:35 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=85985&sid=d8ced93bef0173d174fd057d02b25aff#p85985"
  },
  {
    "author": "bluepepe  Guest Posts: 1 Joined: Wed Oct 14, 2009 1:20 am Gender: Male",
    "title": "Sores on Tounge",
    "content": "I have been getting sores on my tongue every two to three weeks and only last for about three days. This has been happening for a while now; I started getting them in the summer. Right now, though, the roof of my mouth is sore and little swollen and tender. Does anyone now what it could possibly be?\n\n",
    "posted_time": "Post  by bluepepe » Wed Oct 14, 2009 1:32 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=83744&sid=d8ced93bef0173d174fd057d02b25aff#p83744"
  },
  {
    "author": "Dr.M.jagesh kamath  Medical Doctor Posts: 1303 Joined: Mon Aug 03, 2009 7:24 am Gender: Male",
    "title": "Re: Sores on Tounge",
    "content": "Hello,Recurrent sores on the tongue can be caused by herpes simplex type1.Monilial and fungal infections can cause such a problem in immunodepressed,and who are on antibiotic therapy.Vitamin Bcomplex deficiencies do cause burning sensation and sores.Aphthous stomatitis is associated with stress and viruses.Allergy to certain foods like pineapple can cause sores.Take foods rich in vitamins,and a course of Bcomplex should be good to settle the issue.If it still persists do consult a oral surgeon.Best wishes.\n\n",
    "posted_time": "Post  by Dr.M.jagesh kamath » Thu Nov 05, 2009 9:24 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=85981&sid=d8ced93bef0173d174fd057d02b25aff#p85981"
  },
  {
    "author": "gordo634  Guest Posts: 2 Joined: Wed May 27, 2009 9:05 am Gender: Male",
    "title": "tmj? pinched nerve? wisdom teeth? anxiety?",
    "content": "I've had some strange symptoms going on for about a month now.  It all started when I heard a grinding sound (like bone on bone) on the right side of my face when I opened my mouth.  I also experienced some slight dizziness at this time.  The grinding subsidded later that night and then I started to experience a burning sensation on my tongue which moved around to different areas of my tongue.  After about a week or so the burning sensation went away and I began to experience jaw discomfort.  I would describe it as tension or tightening which would come and go at random times.  Now it seems the jaw tension has gone away but I'm noticing a tickly, tingling, burning sensation on my chin and lips which comes and goes and sometimes moves to just the right corner of my mouth.  I also feel a crawling skin sensation from time to time on the right side of my face and experience twitches in various parts of my body.  Every time it seems to be getting better another symptom pops up.    At first I thought it might be wisdom teeth, then I started investigating TMJ, just wondering if anyone can shed some light on this before I go to the doctor.\n\n",
    "posted_time": "Post  by gordo634 » Wed May 27, 2009 9:59 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=79748&sid=d8ced93bef0173d174fd057d02b25aff#p79748"
  },
  {
    "author": "Dr.M.jagesh kamath  Medical Doctor Posts: 1303 Joined: Mon Aug 03, 2009 7:24 am Gender: Male",
    "title": "Re: tmj? pinched nerve? wisdom teeth? anxiety?",
    "content": "Hello,TMJ ie temporo mandibular joint syndrome classically covers all the features that you mentioned.Most cases need the care of a dental surgeon who would be able to guide you with a few exercises for the joint,anti inflamatory drugs which are conservative methods.The condition is self limiting in many.\n\n",
    "posted_time": "Post  by Dr.M.jagesh kamath » Wed Sep 02, 2009 2:59 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=81740&sid=d8ced93bef0173d174fd057d02b25aff#p81740"
  },
  {
    "author": "cheriemonty  Guest Posts: 9 Joined: Sun Sep 12, 2004 7:31 am Location: Ohio",
    "title": "teeth grinding",
    "content": "I grind my teeth at night, because of this my jaw is usually stiff and cracks a lot. My dentist says I need a special mouth guard that costs $500. Would wearing a sports guard at night help?\n\n",
    "posted_time": "Post  by cheriemonty » Tue Nov 02, 2004 9:21 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6231&sid=d8ced93bef0173d174fd057d02b25aff#p6231"
  },
  {
    "author": "ttlewis  Guest Posts: 3 Joined: Sun Oct 31, 2004 11:13 am Location: New Jersey",
    "title": "Another option...",
    "content": "I was grinding/clinching my teeth at night and sometimes during the day. Doctor believes it is a type of nervous/anxiety thing. (I recently got my braces taken off and wear a clear retainer to bed) I asked my doctor what I should do and told me to start wearing the retainer more often - as a type of mouth/teeth guard. A clear retainer is very comfortable and you can wear it during the day without notice. The reason I mention this is because wearing a sports mouth piece can be somewhat unfortable plus it is hard to talk in one (should you want to answer the phone or talk to someone after putting in the mouth piece.   My mother has the same problem of grinding her teeth and tried wearing a sports mouth piece and found it to be bothersome and finally broke down and bought the expensive $500 mouth piece. In opposition, I paid half the cost and got a clear retainer from my dentist.   hope this helps\n\n",
    "posted_time": "Post  by ttlewis » Tue Nov 02, 2004 9:54 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6232&sid=d8ced93bef0173d174fd057d02b25aff#p6232"
  },
  {
    "author": "cheriemonty  Guest Posts: 9 Joined: Sun Sep 12, 2004 7:31 am Location: Ohio",
    "title": "[no title]",
    "content": "Thanks for the info.I will probably end up getting the $500 mouth piece too.\n\n",
    "posted_time": "Post  by cheriemonty » Tue Nov 02, 2004 1:22 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6242&sid=d8ced93bef0173d174fd057d02b25aff#p6242"
  },
  {
    "author": "courage  Guest Posts: 18 Joined: Fri Oct 29, 2004 9:13 pm Location: USA",
    "title": "[no title]",
    "content": "I also grind my teeth.  I heard about the mouth piece from the dentist but never knew it would cost so much...that seems a bit expensive!  Oh well...i guess it's better to pay now than have a lot of damage done later.  Thanks for posting this\n\n",
    "posted_time": "Post  by courage » Tue Nov 02, 2004 3:43 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6247&sid=d8ced93bef0173d174fd057d02b25aff#p6247"
  },
  {
    "author": "AnAppleADay  Guest Posts: 3 Joined: Thu Apr 23, 2009 11:37 am Gender: Female",
    "title": "Re: teeth grinding",
    "content": "I grind my teeth at night as well. It gets a lot worse when I'm really stressed! I actually had to have my front teeth fix bc I chipped a piece off. I had  a mouth guard made a while back but I was never able to fall asleep with it in:(\n\n",
    "posted_time": "Post  by AnAppleADay » Thu Apr 23, 2009 12:24 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=75544&sid=d8ced93bef0173d174fd057d02b25aff#p75544"
  },
  {
    "author": "ella46  Guest Posts: 1 Joined: Fri Mar 27, 2009 3:09 pm Gender: Female",
    "title": "impacted wisdom tooth & facial pain",
    "content": "hi  i have had pain/numbness in the left side of my face for almost 7 years. i have had mri, ct scans, x-rays, drugs (antidepressants, anti convulsant drugs, etc) but to no avail.  i recently had an xray on my wisdom tooth again and the specialist says it has not changed, and i don't have an infection, but it is very close to my main nerve and if he removes the tooth it may damage the nerve and make my condition worst.  he also thinks i may have a cyst in that area too.  i am so fed up with the pain/discomfort.  eating and chewing gum makes it feel better and so does sleep.  sometimes i just go to sleep to relieve the feeling.  should i try to have the operation or can the pain of nerve damage be worst than what i have at the moment.....burning, numbness, aching, pulling?\n\n",
    "posted_time": "Post  by ella46 » Fri Mar 27, 2009 3:28 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=72098&sid=d8ced93bef0173d174fd057d02b25aff#p72098"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: impacted wisdom tooth & facial pain",
    "content": "Hello --  What's most likely to result if the nerve is damaged during a removal would be numbness. While this is probably preferable to pain, it's a close second at times. Fortunately there may be another way to approach this, and that would be to have a consult with a neurosurgeon. If the tooth is impingeing one or more branches of the facial nerve (and apparently it is) then this would be every bit as much a job for a neurosurgeon as for an oral surgeon or dentist. They could (and should) work in tandem in planning the extraction, and perhaps the  neurosurgeon could actually do the removal. That's no guarantee there wouldn't be problems, but with a neurosurgeon at least you'd have the best prediction of potential problems and, if he were to do the surgery, you'd likely also have the best chance of the best outcome. While relief of pain is ultimately necessary, avoidance of numbness or loss of range of motion is equally important.   I hope this is helpful. Please follow up with us here as needed. Good luck to you.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Mon Mar 30, 2009 8:21 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=72499&sid=d8ced93bef0173d174fd057d02b25aff#p72499"
  },
  {
    "author": "susanzzw7  Guest Posts: 1 Joined: Mon Nov 10, 2008 12:53 pm Gender: Female",
    "title": "Agent Orange Vietnam-teeth link?",
    "content": "My friend was in Vietnam and exposed to Agent Orange.  He has many problems stemming from this, such as diabetes, neuropathy,(sp?), etc. my question is--is there a link from agent orange and teeth rotting out? (they have been systematically rotting out.  He only has a few left, and finds (understandably) that when he cannot chew food enough, he has digestion problems. Do you know if the agent orange could have caused the tooth problem?  If not, do you know where I can get this information?   He needs his teeth attended to, but the VA won't fix anything for him unless it is attributed to agent orange...and he can't afford it on his own.   thank you in advance for your help! Susanzzw7\n\n",
    "posted_time": "Post  by susanzzw7 » Mon Nov 10, 2008 1:01 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=63758&sid=d8ced93bef0173d174fd057d02b25aff#p63758"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Agent Orange Vietnam-teeth link?",
    "content": "Hello --  While I'm unaware of any first-generation dental effects, there is a significant body of information regarding rare dental problems in children of Vietnam vets, so I can't but believe this is also agent orange-related. How to prove this is another question,  and since there are still various types of agent orange-caused problems surfacing, I will try and learn what I can from a former VA contact (high-ranking). I may not have any luck, but if I do I will notify you here for sure. That the VA won't consider treating this or any condition without some sort of proof...well,  that's a subject for another forum, I guess. I'll do what I can and will get back to you, though. It seems likely. We just have to have some cause-and-effect evidence.   My best to you and to your friend. Give him my personal thanks for his sacrifice. I'll be in touch.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Sun Mar 15, 2009 10:00 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=71404&sid=d8ced93bef0173d174fd057d02b25aff#p71404"
  },
  {
    "author": "Alicejjenkins  Guest Posts: 1 Joined: Tue Jan 13, 2009 1:00 pm Gender: Female",
    "title": "Recurring Cold Sores: Every two to three weeks.",
    "content": "Hi,  I've been dealing with recurring cold sores, one after the other since August of 08'.  They appear on different parts of my lips.  They look like the regular cold sores I usually get.  I don't understand why this is happening since I've never had it this bad since childhood.  My doctor prescribed me Zovirax.  If I catch it in time, the cream quickly heals the cold sore but it comes right back within 2 to 3 weeks.  I've also been taking lysine and vitamins to boost my immune system but it doesn't seem to be working.  My doctor thinks that there is nothing more I can do, and that I should take lots of vitamin C and lysine.  He thinks its common that colds sores reoccur in the winter.  But how can that be in my case when this started in the late summer?  What I didn't tell my doctor is that I think its something more then just recurring  cold sores.  This may be far-fetched, but about a year and sometime earlier, I was with a man whom I had oral sex with.  The first time I performed oral sex on him, I woke up with a cold sore.  It went away and I thought nothing of it.  Later on I got two yeast infections and a sore throat that had white puss and looked inflamed.  I went to the doctor to get it looked at.  I told the doctor the story, and she thought it could just be Mono.  The test went through, and I tested negative for Mono and  any STD of the throat.    Since then I've been single, not dealing with anyone, and out of no where this coldsore thing happens.  I really worried, and these coldsore are taking over my life.  I want to start a new relationship, but I'm afraid that I might give him cold sores.  What should I do?    Thank you in advance\n\n",
    "posted_time": "Post  by Alicejjenkins » Tue Jan 13, 2009 1:25 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=68163&sid=d8ced93bef0173d174fd057d02b25aff#p68163"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Recurring Cold Sores: Every two to three weeks.",
    "content": "Hello --  It is the nature of cold sores, usually caused by herpes simplex virus, to be somewhat erratic, random and unpredictable, except the reasonable certainty that at some time they will show up again. There are also often periods when they are especially active, but they are usually aggravated most, to my understanding of the subject, during the summer, due to exposure to sunlight. Continue to use the Zovirax, which is excellent for suppressing this until outbreaks die down. There really is little else that can be done other than the vitamin C, which does seem to help.  Your theory about oral sex may not be so far fetched, it just may not make a lot of difference. While you may now have herpes simplex type II acting in concert with the original virus, the two are so similar as to make little difference, and either can be transposed to the \"other end\" depending upon sexual habits, etc. There's really little to differentiate between the two and the treatment is exactly the same.  I hope this is of some help to you. Good luck with this and please, by all means, be up front in any future relationships, as your partner will certainly either thank you for your honesty or, if of questionable character, may just walk away from the possibility of infection. I suppose that comment is judgemental, but if the relationship is an honest and solid one, something like this really shouldn't get in the way. On  the other hand, if more casual sex is in play, you certainly still owe your partner the heads-up.   Best of luck to you with this. Hopefully the current flareup will soon resolve and give you some peace for a while.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Thu Mar 12, 2009 11:07 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=71363&sid=d8ced93bef0173d174fd057d02b25aff#p71363"
  },
  {
    "author": "imagine72  Guest Posts: 1 Joined: Wed Jan 28, 2009 2:31 am Gender: Male",
    "title": "canker sore turned into blister",
    "content": "I often had canker sores growing up and now get them 2-3 times a year.  They are painful and go away in about 10 days.  I recently had one on the inside of my lower lip that stopped hurting after a week yet turned into a blister.  The blister pops then looks like it's going to heal and turns back into a blister again.  This cycle has been going on for about a month now and I've never experienced this before with any canker sores.    Any ideas about why this keeps blistering and when it should heal?  I've tried popping it AND leaving it alone and neither seems to make it finally heal and go away.\n\n",
    "posted_time": "Post  by imagine72 » Wed Jan 28, 2009 2:34 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=70046&sid=d8ced93bef0173d174fd057d02b25aff#p70046"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: canker sore turned into blister",
    "content": "Hello --  Some recurrent canker sores can cycle numerous times, depending upon what the trigger may be. If this one is in a single spot and keeps recycling itself, it may be getting irritated by something like a rough edge of a tooth or ingestion of something that aggravates canker sores, like citrus or other acidic fruits or juices, figs, and they also can be caused or aggravated by certain conditions like low levels of vitamin B-12. If it doesn't resolve on its own pretty soon you might want to try GlyOxide, if you haven't already. It's available over the counter and is a combo of peroxide and glycerine, so it stays put where it's placed with a dropper (unlike plain peroxide, which only serves as a momentary mouthwash). If that doesn't clear this one up, or if you start to have more recurrent ones, you may have advanced to a more complex form of the original problem. It's benign, but obviously can be very painful.   I hope this  is helpful. Good luck to you. Follow up with us here as needed.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Mon Mar 02, 2009 10:19 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=71135&sid=d8ced93bef0173d174fd057d02b25aff#p71135"
  },
  {
    "author": "sherbear343  Guest Posts: 1 Joined: Thu Jan 15, 2009 11:54 pm Gender: Female  Contact:   Contact sherbear343       Yahoo Messenger",
    "title": "Infection or nerve exposed",
    "content": "I have a bad tooth that has been getting worse over time it never hurt much before but now its terrible. My doctor prescribed me penicillin but i am still pretty nervous how I would know if the infection has spread past my tooth. My face is not swollen but the tooth gets a sharp shooting pain that goes almost all the way up into my jaw, if i rinse it with a little salt water it does feel somewhat better but now my cheek is hurting me and it almost feels like a sinus infection. I have a dentist appointment in a couple days after the antibiotics have been in my system for a while but i am still worried about the infection possible spreading to my brain or heart because i do have a mild mitrovalve prolapse. What would be the symptoms of it spreading and when should i go to the emergency room.\n\n",
    "posted_time": "Post  by sherbear343 » Sat Jan 17, 2009 2:14 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=68734&sid=d8ced93bef0173d174fd057d02b25aff#p68734"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Infection or nerve exposed",
    "content": "Hi there -  Generally an abcess will cause marked local swelling and local fever in addition to pain. Early on there may just be pressure on some part of the nerve, which can cause excruciating pain without having gotten that much worse. Although an infected tooth could once upon a time cause systemic infection and mitral valve prolapse (MVP) used to be a concern and cause for premedication, it's now not considered to be a major concern. Add to that the fact that you're already on antibiotics and things should be fully managed for now, except, of course, for the  pain. The pain is a direct result of pressure on the nerve of the  tooth,  which can sometimes  simply be nothing more than air pressure. Those nerves are very, very sensitive when exposed or touched by anything. You're covered by the antibiotics you're taking and needn't be concerned about endocarditis right now. Getting the tooth repaired or removed will  resolve the primary problem, which right now is pain.   I hope this is helpful. Best of luck to you and please update us after you've seen the dentist.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Wed Jan 21, 2009 9:53 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=69312&sid=d8ced93bef0173d174fd057d02b25aff#p69312"
  },
  {
    "author": "zdoyle  Guest Posts: 1 Joined: Sun Jan 04, 2009 4:17 am Gender: Male",
    "title": "Broken Porcelain Crown Lower Molar",
    "content": "Hello,  I'm currently travelling in South East Asia for the next two months and a portion of the crown on my bottom left molar (about two teeth from the back with white crown) has broken off.  The top portion of the crown must have broken off over the past month and I just noticed it a day ago.  I went to a dentist in Bangkok who picked around at the area that broke off (the dentin area) and I did not experience any pain or tenderness in the area.  He believes that it would be okay to not fix it right away and that I could continue travelling for the next 1-3 months.  I would be back home in February or March.  Can you please let me know if you think that this is something that needs to be fixed immediately?  I'm not sure what the pros and cons are for not fixing it right away.  Plus I can't say I fully trust hte Dr.  Thanks!\n\n",
    "posted_time": "Post  by zdoyle » Sun Jan 04, 2009 4:22 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=66867&sid=d8ced93bef0173d174fd057d02b25aff#p66867"
  },
  {
    "author": "Debbie Miller, RN  Nurse Posts: 4746 Joined: Mon Apr 16, 2007 2:41 pm Gender: Female Location: USA",
    "title": "Re: Broken Porcelain Crown Lower Molar",
    "content": "Hello, In the absence of pain you should be fine to wait on this repair.  I think this is sound advice.  Of course if you develop symptoms of infection or pain, you should return to the dentist.  Best wishes.\n\n",
    "posted_time": "Post  by Debbie Miller, RN » Mon Jan 05, 2009 11:47 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=67096&sid=d8ced93bef0173d174fd057d02b25aff#p67096"
  },
  {
    "author": "shawshaw010  Guest Posts: 3 Joined: Wed Dec 31, 2008 2:35 am Gender: Male",
    "title": "Osteomyelitis of the Jaw?",
    "content": "I have developed an abcess on the outside of my lower jaw. It drains a thick yellow pus multiple times throughout the day and is oftentimes accompanied by blood... I would not be so worried about it, but there is more... It is in someway connected to my gums and what I think is the base of my tooth. There is some sort of channel connecting the outside of my lower left jaw to my gum(or tooth)... after searching for a while I had thought that it might be osteomyelitis of the jaw (which is, to the best of my understanding, an infection that spreads from the meat, or pulp, of the tooth , into the jaw.)... However, after reading, none of the described symptomes include draining on the OUTSIDE of the skin. All of the sites I veiwed described pockets of pus draining within the hosts mouth and not on the outside. And of course, I am tempted to assume the worst of things by what I have read. I have been to the MedClinic, A local dentist and even the ER... I have been perscribed \"ammoxicillon\", (if that is indeed the correct spelling) which aided the swelling, nut for the most part left all of them stumped... Any medicaal advice would be greatly appreciated. Thank you.    -S.\n\n",
    "posted_time": "Post  by shawshaw010 » Wed Dec 31, 2008 2:48 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=66440&sid=d8ced93bef0173d174fd057d02b25aff#p66440"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Osteomyelitis of the Jaw?",
    "content": "Hello -  This doesn't sound like osteomyelitis, but rather perhaps an abcessed tooth which has created a fistula (or even just infectious tooth abcess material having drained into one of the parotid glands via fistula, and which has now maybe created a secondary pocket). Amoxycillin is a reasonable first-line antibiotic for this, but probably something stronger, like ciprofloxacin, may become necessary, as well as possible intervention by an oral surgeon to clear  up any residual problems, may be necessary. In fact, that's where I'd go next, and see an oral surgeon, who might be have better insight into this sort of thing.  Hope this is helpful. Please follow up with us as necessary and also update us as to progress.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Sat Jan 03, 2009 9:23 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=66829&sid=d8ced93bef0173d174fd057d02b25aff#p66829"
  },
  {
    "author": "shawshaw010  Guest Posts: 3 Joined: Wed Dec 31, 2008 2:35 am Gender: Male",
    "title": "Re: Osteomyelitis of the Jaw?",
    "content": "Thank you, this is very helpful. Yes, I will definitely be doing that once insurance rolls over. What you say makes alot of sense. It began as a sore tooth. I would put oragel on it and leave it alone until it began to hurt again. Then it formed a rather large absesss, without drainage. And now that is has started draining, it has become more of a small crater. When I went to the ever trusty MedClinic, the doctor told mee that it was an inflammed salivary gland and only suggested that i eat sour foods. Well after enduring about 2 bags of warheads without any change, I assumed he wasn't correct. I let it be for a while until, one night i was poking around the inside of my mouth and discovered the channel... and after being prodded, the yellow pus began draining. This scared me half to death, and I overreacted a bit and made a night visit to the emergency room. They were the ones to perscribe the antibiotic, and it helped with the swelling. Wwell, now i just have a big, leaky crater on my jaw. The emergency room suggested that I saw a dentist, and he did absoloutley nothing except reffer me to a dermatologist.... and my best guess is that the dermatologist will only send me to a plastic surgeon! It does not hurt that often anymore, and it does not hinder my day to day routine, so I thought of just leaving it be, because i figured that it couldn't possibly drain forever... but now, I believe it could indeed drain forever. I will make an attempt to see an oral surgeon soon, but unless it is more severe than I imagine it is, it will be a short wait until I get it checked out again. Again, thank you for your quick response. I will keep you updated as I find out more information. -S.\n\n",
    "posted_time": "Post  by shawshaw010 » Sat Jan 03, 2009 11:25 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=66848&sid=d8ced93bef0173d174fd057d02b25aff#p66848"
  },
  {
    "author": "nathanid95  Guest Posts: 1 Joined: Sun Dec 28, 2008 8:15 pm Gender: Male",
    "title": "Holes in roof of mouth, severity?",
    "content": "I have two holes in the hard part of the roof of my mouth. I can suck air through them sometimes, but I don't know if I should. Is this a serious issue? They are too small to see or feel but I can suck air through them.\n\n",
    "posted_time": "Post  by nathanid95 » Sun Dec 28, 2008 8:31 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=66188&sid=d8ced93bef0173d174fd057d02b25aff#p66188"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Holes in roof of mouth, severity?",
    "content": "Hello -  It would help to know if these holes have been  present for a long time (forever?) or if you've just recently discovered them. If  they're congenital they probably won't cause any problems. In fact, if they are as small as you say, it's  likely they won't cause any problem anyway, unless they are the product of a disease process such as some localized infection which may have caused them and which could recur or cause them to become larger.   If you could fill us in on the  details regarding these holes,  especially how long you've been aware of them and if there was ever any sort of lesion or lesions on the roof of your mouth prior to discovering these,  it would be helpful.  Good luck to you. Hope to hear from you soon.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Sat Jan 03, 2009 9:29 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=66832&sid=d8ced93bef0173d174fd057d02b25aff#p66832"
  },
  {
    "author": "ajpviau  Guest Posts: 41 Joined: Wed Mar 30, 2005 9:24 am Location: Toronto",
    "title": "[no title]",
    "content": "I saw a doctor finally and he says it is a deep tissue pimple. Does this sound like a proper diagnosis. He also said that if it doesn't go away in a week or two to go back and see him. The exact location of my lump/pimple is in the Parotid Gland area, is there anything in this gland that could cause a lump?  Thanks in advance!\n\n",
    "posted_time": "Post  by ajpviau » Thu Mar 31, 2005 9:01 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=11646&sid=d8ced93bef0173d174fd057d02b25aff#p11646"
  },
  {
    "author": "Rhonda P, CEP  Paramedic Posts: 252 Joined: Wed Mar 16, 2005 8:37 am Gender: Female Location: USA",
    "title": "parotid gland",
    "content": "Hello,  The parotid gland is the same glands that swell when you get the mumps. They are the 2 largest of our salivary glands and they empty into our mouth. Being that the Doctor actually saw the swollen gland, I wouldn’t want to downplay his diagnosis. If it turns out not to be a pimple, another thought would be that you could have a viral or bacterial infection in the parotid gland called parotitis, you may have a salivary duct stone/stones or it can be infected from poor oral hygiene. Being that it is a salivary gland, sour will increase the pain, so will pinching it. Treatment consists of antibiotics, warm compresses, massaging the gland and try to express the content through the duct into your mouth and if it doesn’t get any better, your doctor may have to drain it surgically.\n\n",
    "posted_time": "Post  by Rhonda P, CEP » Fri Apr 01, 2005 12:25 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=11680&sid=d8ced93bef0173d174fd057d02b25aff#p11680"
  },
  {
    "author": "ajpviau  Guest Posts: 41 Joined: Wed Mar 30, 2005 9:24 am Location: Toronto",
    "title": "[no title]",
    "content": "Thanks for your response! At least I know what to possibly expect now if it isn't a pimple. I have a feeling this might be what it is though. It just seems different than other pimples I have had. Thanks again!!\n\n",
    "posted_time": "Post  by ajpviau » Fri Apr 01, 2005 7:18 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=11693&sid=d8ced93bef0173d174fd057d02b25aff#p11693"
  },
  {
    "author": "Rhonda P, CEP  Paramedic Posts: 252 Joined: Wed Mar 16, 2005 8:37 am Gender: Female Location: USA",
    "title": "[no title]",
    "content": "You are very welcome     Thank you for contacting us here at The Doctors Lounge\n\n",
    "posted_time": "Post  by Rhonda P, CEP » Fri Apr 01, 2005 9:15 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=11701&sid=d8ced93bef0173d174fd057d02b25aff#p11701"
  },
  {
    "author": "ajpviau  Guest Posts: 41 Joined: Wed Mar 30, 2005 9:24 am Location: Toronto",
    "title": "[no title]",
    "content": "I saw my doc again as the lump has been there for 4 weeks now. I am getting an ultrasound done this week hopefully as he thinks it may be a stone now. It is not as big as before, but when he pressed on it (rather strongly) it hurt like heck!!! If it is a stone...what are the next steps in treatment?\n\n",
    "posted_time": "Post  by ajpviau » Mon May 02, 2005 8:05 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=13241&sid=d8ced93bef0173d174fd057d02b25aff#p13241"
  },
  {
    "author": "ajpviau  Guest Posts: 41 Joined: Wed Mar 30, 2005 9:24 am Location: Toronto",
    "title": "[no title]",
    "content": "I had my ultrasound done on May 9th and finally got my results yesterday (via phone cause Doc hadn't called me). Apparently the ultrsound showed nothing. What does this mean? My lump has turned into more of a flat mass now then a specific lump. Is an ultrasound 100% conclusive? If this is just a swollen gland would that show on the results? What about a tumors or stones, can these things be missed?   There is something in my cheek in the Parotid area, that I am not imagining. It hurts when pressed very firmly (as the doc did) and it is causing me some discomfort. I get little headaches that shoot along the jaw up to my temple now (not sure if this is related).   I am visiting my doctor for a follow-up soon. Is there any other kind of test that I can get done to confirm that this is nothing? It's been there for almost 2 months now, it has to be something. Could it really have been a deep pimple and this is just the remnants?\n\n",
    "posted_time": "Post  by ajpviau » Thu May 19, 2005 9:56 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=13946&sid=d8ced93bef0173d174fd057d02b25aff#p13946"
  },
  {
    "author": "Lisa K, RN  Nurse Posts: 36 Joined: Fri May 20, 2005 10:20 am Location: Canada",
    "title": "[no title]",
    "content": "Hello,  Did he prescribe you any kind of anti-inflammatory med?  Even like Ibuprofen? (aka Advil, Motrin)....what about antibiotics?  How soon is your follow-up appt?  That's good that it's now a flat mass as opposed to an actual lump - at least it's not increasing size - that's a good sign.\n\n",
    "posted_time": "Post  by Lisa K, RN » Sat May 21, 2005 9:47 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=14080&sid=d8ced93bef0173d174fd057d02b25aff#p14080"
  },
  {
    "author": "ajpviau  Guest Posts: 41 Joined: Wed Mar 30, 2005 9:24 am Location: Toronto",
    "title": "[no title]",
    "content": "Thanks for the response. My follow-up is in a couple of weeks. I have been taking Advil whenever I get the headaches so that is helping. I guess it is a positive that it is no longer a lump. I'll ask my docotor about some antibiotics as well.  Thanks again\n\n",
    "posted_time": "Post  by ajpviau » Sat May 21, 2005 8:32 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=14103&sid=d8ced93bef0173d174fd057d02b25aff#p14103"
  },
  {
    "author": "ajpviau  Guest Posts: 41 Joined: Wed Mar 30, 2005 9:24 am Location: Toronto",
    "title": "[no title]",
    "content": "I think I am being extremely paranoid about this now, but in the past couple of days i have started to get a ringing in my left ear throughout the day. Along with the ringing, my left ear plugs up as if I was flying or had a cold. My ear doesn't really hurt, but the same headaches from before seem to occur around the same time as the ear problem. Could these be related in anyway to the flat mass on my parotid? Or could all these symptoms just be coincidence? I am seeing my doctor in about 2 to 3 weeks time, but if the ear ringing and plugging persists for another day or so, I may go visit him earlier.   Any ideas of what I can ask my doctor or have him test would be very helpful.\n\n",
    "posted_time": "Post  by ajpviau » Wed May 25, 2005 9:45 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=14208&sid=d8ced93bef0173d174fd057d02b25aff#p14208"
  },
  {
    "author": "Rhonda P, CEP  Paramedic Posts: 252 Joined: Wed Mar 16, 2005 8:37 am Gender: Female Location: USA",
    "title": "Parotitis",
    "content": "Dear ajpviau,  I’m sorry it took so long to respond, I have been gone. Canadian_RN is correct, anti-inflammatory meds and antibiotics are next. Parotitis (inflammation of parotid gland) can be caused by stones as well as a viral or bacterial infection. You have ruled out a duct stone and if the gland remains swollen and tender or if you can see pus coming from the Stenson’s duct intraorally (inside your mouth) or you can have a swabbing done. Do you have the luxury of seeing an Ear, Nose and Throat Specialist?\n\n",
    "posted_time": "Post  by Rhonda P, CEP » Mon May 30, 2005 1:06 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=14372&sid=d8ced93bef0173d174fd057d02b25aff#p14372"
  },
  {
    "author": "ajpviau  Guest Posts: 41 Joined: Wed Mar 30, 2005 9:24 am Location: Toronto",
    "title": "[no title]",
    "content": "Thanks for your response again! I really appreciate all the help!   I am hoping to get a referal from my doctor to see an ENT specialist. I see my doctor next week so I will ask him then, as well as question him about the possibility of an infection of some sort in the parotid. The mass (or former lump) seems to be disappearing more which is a good thing. While it is hard to notice now, it is still there. As I said before, it is kind of a flat (quarter sized) area that is ever so slightly raised but feels a lot firmer then my right cheek in comparison. I'm feeling better about this though as it seems to be going away. We'll see what we find out next week I guess. I am sure some more test will be conducted in regards to my parotid and my new ear problem. I will keep you all posted.  Thanks again for all your help!\n\n",
    "posted_time": "Post  by ajpviau » Mon May 30, 2005 7:55 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=14381&sid=d8ced93bef0173d174fd057d02b25aff#p14381"
  },
  {
    "author": "ajpviau  Guest Posts: 41 Joined: Wed Mar 30, 2005 9:24 am Location: Toronto",
    "title": "[no title]",
    "content": "I saw my doc on Friday and it seems like everything is okay with my parotid. The lump can't be felt anymore although I feel like it is still tender (could just be in my head). The ringing and plugging of my ear has subsuded a bit and my doc thinks it may be related to seasonal alergies.  Thanks for all the help everyone has given me in this post. I will be sure to write again if anything new arises regarding my parotid.\n\n",
    "posted_time": "Post  by ajpviau » Mon Jun 13, 2005 7:53 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=15032&sid=d8ced93bef0173d174fd057d02b25aff#p15032"
  },
  {
    "author": "btbmom  Guest Posts: 2 Joined: Thu Jul 21, 2005 4:26 pm Location: MS",
    "title": "Lump on jaw line",
    "content": "I am experiencing the same thing.  I have had a severe pain on the left side of my jaw line for almost a week now.  A small bump (about the size of a nickle) has formed under the skin.   The bump is directly on my jaw line between my mouth and ear.  I do not have any dental problems, but I have had severe headaches for a week as well.  I f anyone has any advice, I would greatly appreciate it.\n\n",
    "posted_time": "Post  by btbmom » Thu Jul 21, 2005 4:43 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=17214&sid=d8ced93bef0173d174fd057d02b25aff#p17214"
  },
  {
    "author": "ajpviau  Guest Posts: 41 Joined: Wed Mar 30, 2005 9:24 am Location: Toronto",
    "title": "[no title]",
    "content": "It sounds very similar to what I had. I would suggest seeing a doctor and having it checked. An ultrasound will tell you whether or not it is a stone or something else. I never did get an official answer from my docs as to what mine was, but it gradually went away, over two or three months. Definitely keep an eye on the size of the lump though. I was told if mine got bigger to go back to my doc right away.  Good Luck!\n\n",
    "posted_time": "Post  by ajpviau » Fri Jul 22, 2005 8:43 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=17238&sid=d8ced93bef0173d174fd057d02b25aff#p17238"
  },
  {
    "author": "btbmom  Guest Posts: 2 Joined: Thu Jul 21, 2005 4:26 pm Location: MS",
    "title": "[no title]",
    "content": "Thanks for the advice. It is starting to worry me.  It has gotten a little bigger and hurts.\n\n",
    "posted_time": "Post  by btbmom » Fri Jul 22, 2005 9:17 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=17240&sid=d8ced93bef0173d174fd057d02b25aff#p17240"
  },
  {
    "author": "shawshaw010  Guest Posts: 3 Joined: Wed Dec 31, 2008 2:35 am Gender: Male",
    "title": "Re: Lump on jawbone...",
    "content": "Is there some sort of channel connecting this flat mass to your gum, or the base of a tooth? I am curious because alot of your syomtoms are all to familiar to me... It was a rather large abcess at first, but after taking some antibiotics, the swelling went down and it is now roughly the size of a nickle as well. But it drains a thick yellow pus from the outside. Could we share the same problem or is this something else? Thank you, S. Shaw\n\n",
    "posted_time": "Post  by shawshaw010 » Wed Dec 31, 2008 2:58 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=66441&sid=d8ced93bef0173d174fd057d02b25aff#p66441"
  },
  {
    "author": "Meliny66  Guest Posts: 2 Joined: Sat Dec 27, 2008 6:14 am Gender: Female Location: ATLANTA GA",
    "title": "Abcessed tooth",
    "content": "I have a bad tooth that needs to come out, but rightnow I have a large abcess and my whole R side of my face is swollen. I don't have insurance. What can I do to releive the pressure? I've tried everything but, its getting bigger.\n\n",
    "posted_time": "Post  by Meliny66 » Sat Dec 27, 2008 6:23 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=66004&sid=d8ced93bef0173d174fd057d02b25aff#p66004"
  },
  {
    "author": "Debbie Miller, RN  Nurse Posts: 4746 Joined: Mon Apr 16, 2007 2:41 pm Gender: Female Location: USA",
    "title": "Re: Abcessed tooth",
    "content": "Hello, You are going to need to see a dentist one way or another.  You may get some relief from ibuprofen but it will be temporary and infection can cause serious trouble if it moves into your blood stream.  You may ask your local health department for a referral to a dental clinic or facility that may use a sliding fee schedule or offer discounts to cash paying patients.    Without health and dental insurance it is wise to start a health savings account for such needs.  These days it even makes sense for the insured since higher copays, premiums and fewer benefits often put them in the same crisis situation at times.  Health problems do happen to almost everyone eventually.  Best wishes\n\n",
    "posted_time": "Post  by Debbie Miller, RN » Sat Dec 27, 2008 10:21 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=66020&sid=d8ced93bef0173d174fd057d02b25aff#p66020"
  },
  {
    "author": "ceciliahi  Guest Posts: 1 Joined: Fri May 11, 2007 11:21 pm",
    "title": "Swelling under chin",
    "content": "I am a 24 year old female with a large swelling under my chin and jaw on the right side. I am having three teeth removed in 10 days, because of 2 painful wisdom teeth, and one decaying tooth that has been broken because of the pressure. It started as a small lump, and over the past week or so, has grown and become more tender. It is very sore, and now affecting eating. I have been taking penicillin for a week now, as well as rinsing with warm salt water. Should I just wait until the oral surgery, or do something now? Is there any way to get the swelling down?\n\n",
    "posted_time": "Post  by ceciliahi » Fri May 11, 2007 11:43 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=42339&sid=d8ced93bef0173d174fd057d02b25aff#p42339"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi ceciliahi, Have you notified the oral surgeon regarding the increased swelling? If you have not I would strongly suggest that you do so. He/she may want to change you antibiotic regimen. Sincerely, Theresa Jones, RN\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Thu May 17, 2007 12:45 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=42631&sid=d8ced93bef0173d174fd057d02b25aff#p42631"
  },
  {
    "author": "Meliny66  Guest Posts: 2 Joined: Sat Dec 27, 2008 6:14 am Gender: Female Location: ATLANTA GA",
    "title": "Re: Swelling under chin",
    "content": "I HAVE THE SAME PROBLEM. i HAVE USED EVERYTHING TO MAKE THE SWELLING GO DOWN BUT, iTS GETTING BIGGER. i LOOK LIKE THE ROCKY DENNIS.\n\n",
    "posted_time": "Post  by Meliny66 » Sat Dec 27, 2008 6:28 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=66005&sid=d8ced93bef0173d174fd057d02b25aff#p66005"
  },
  {
    "author": "sandos  Guest Posts: 4 Joined: Wed Dec 13, 2006 10:03 pm",
    "title": "Hard Invisable Bump on Inside Lower Lip",
    "content": "Hello there...  A few days back I had this sore on the inside of my left lower lip that I couldn't leave alone (lol).  I kept biting at it, etc.  It was a little red and white at the head (kind of like a pimple if there were pores in my mouth).  It hurt a little when I would bite it, but nothing too bad.  It was right in the middle of my lip on the left side of the inside of my mouth.   A couple of days went by and the white head and redness went away completely.  Now however, in exactly the same spot (I'm assuming) there is this hard, 'invisible' bump.  It doesn't hurt at all, I just notice it and can feel it from the inside of my mouth and out. It's hard, and its size would lead me to describe it as a small pebble.  Is this a by-product of me biting my mouth sore?  Should I give it a few days and see if it shrinks or grows? Should I just go see the dentist ASAP?  Any help is appreciated.  Thank you.\n\n",
    "posted_time": "Post  by sandos » Thu Aug 28, 2008 12:55 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=59452&sid=d8ced93bef0173d174fd057d02b25aff#p59452"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Hard Invisable Bump on Inside Lower Lip",
    "content": "Hello -  It  sounds like you're describing apthous stomatitis (common caker sore), and sometimes these, as they heal, can leave a firm, painless bump, especially if accidentally bitten repeatedly while chewing or if nibbled on habitually by the \"owner\" as it is healing. These usually go away on their own. If it should remain for weeks or if it becomes larger, then you should definitely bring it to the attention of a doctor or dentist, but these  little lumps almost always go away in time on their own.   I hope this is helpful.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Mon Sep 22, 2008 10:56 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=61233&sid=d8ced93bef0173d174fd057d02b25aff#p61233"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "Re: Hard Invisable Bump on Inside Lower Lip",
    "content": "I hope you are feeling better. Please keep us updated.  Best regards,\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Sun Dec 14, 2008 5:31 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=65348&sid=d8ced93bef0173d174fd057d02b25aff#p65348"
  },
  {
    "author": "californiagal1990  Guest Posts: 2 Joined: Wed Nov 05, 2008 9:30 pm Gender: Female",
    "title": "very small clear blisters on my lips",
    "content": "well ok here's my story, last year i had to be tested got herpes because i had this serious out of nowhere outbreak. i had ulcerations on my tongue and on my lips which got infected. the doctor i saw had just simply stated i had genital herpes, i kinda didn't argue because it had gone through my head also. so i was prescribed viral medication along with a bacterial because it was infected. i got tested a few days later and the test apparently came back negative with no acute signs of herpes. so my question is what was that? ever since then i have been getting these very very little small clear blisters that are firm, they sometimes itch and if i do scratch them they flare up for a few mins and then they go back down and you don't notice them again. it frightens me because i wanna know what they are! if anyone has any idea please help!\n\n",
    "posted_time": "Post  by californiagal1990 » Tue Nov 11, 2008 9:51 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=63947&sid=d8ced93bef0173d174fd057d02b25aff#p63947"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: very small clear blisters on my lips",
    "content": "Hi there -  It sounds like you do have herpes which first blossomed as oral stomatitis, responded to the initial treatment, then returned a false negative test result, probably because you'd just been treated for it. While it should show up anyway,  sometimes immediately after (or during) treatment the virus will go dormant and not show up.   Your current symptoms still sound like herpes. I can't prove this at a distance, of course, but the description of the original outbreak and the subsequent symptoms, plus the fact that you say the possibility had crossed your mind early on, suggests you had placed yourself at risk of infection, so having it show up isn't surprising. A follow-up test would be useful, and it doesn't matter whether it's genital herpes or just a flareup from an early case of chickenpox; it is treated the same, and is essentially the same thing. It's uncomfortable and can be communicated to others, so it should be treated and, more importantly, should be accurately and definitively diagnosed. I'd either go back to the original doctor or a different one, and be re-tested, then do whatever it takes to get the symptoms  under control and watch out for future flareups, which can be fairly infequent or can be somewhat regular, depening upon the individual.   I hope this is helpful. Best of luck to you. Follow up with us as needed.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Sat Dec 06, 2008 7:25 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=65145&sid=d8ced93bef0173d174fd057d02b25aff#p65145"
  },
  {
    "author": "californiagal1990  Guest Posts: 2 Joined: Wed Nov 05, 2008 9:30 pm Gender: Female",
    "title": "Re: very small clear blisters on my lips",
    "content": "well, i hadn't recieved treatment before i got tested, which is still a confusing factor. well thank you very much for the reply.\n\n",
    "posted_time": "Post  by californiagal1990 » Mon Dec 08, 2008 11:56 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=65196&sid=d8ced93bef0173d174fd057d02b25aff#p65196"
  },
  {
    "author": "Diondranicole  Guest Posts: 1 Joined: Sun Nov 02, 2008 11:51 pm Gender: Female",
    "title": "Possible TMJ? pain increasing fast, panicked, in tears help!",
    "content": "For the last week or two i have been in a considerable amount of pain, and have seen a few doctors for multiple reasons.  In early AUGUST i began experiencing frequent headaches on and around my left temple/ left side of my head.  I began to notice these headaches were usually accompanied by aching of my top left teeth, the 2 back most ones, so after feeling this for about a month i called my dentist.    I pointed this pain out to the dentist when i saw him around SEPT. 15 and they took x-rays and assured me there was no cavity, so i just assumed that these newly developing headaches caused the teeth to ache, and i'd just have to deal with it. (I am no stranger to headaches)  These headaches/toothaches continued and seemed to worsen, and i began developing a lot of pain in my left shoulder and left side of my neck, so by mid OCTOBER i began seeing a chiropractor for my now very painful neck and shoulder.  Around the same time i began seeing the chiro, i went to a family med. center because i was experiencing symptoms that seemed typical of sinusitis.  I have been taking amoxicillin antibiotics for almost 10 days now, and to no avail.  Within the last two weeks my jaw and mouth have been: -popping and cracking all over the place, both sides -getting REALLY bad toothaches, mostly on the left side, mostly upper teeth -getting pain pressure or plugged feeling in ears, mostly left side -limited movement with jaw -when i smile or open mouth wide i get pain in temple, ear, and pulling pain in the spot where i had been getting my headaches -its hard to eat, yawn, etc. -i feel dizzy or like my eyes are being affected somehow  The pain has gotten really bad and has been progressing really quickly to the point where i am in tears frequently and the pain is moderate in the morning but by the early evening is severe.  Please what should i do i am panicking and i feel like i'm going to be in pain forever and there is something seriously wrong!\n\n",
    "posted_time": "Post  by Diondranicole » Mon Nov 03, 2008 12:17 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=63009&sid=d8ced93bef0173d174fd057d02b25aff#p63009"
  },
  {
    "author": "Debbie Miller, RN  Nurse Posts: 4746 Joined: Mon Apr 16, 2007 2:41 pm Gender: Female Location: USA",
    "title": "Re: Possible TMJ? pain increasing fast, panicked, in tears help!",
    "content": "Hello, Sometimes your doctor will prescribe a course of steroids to quickly reduce inflammation and muscle relaxers to allow your jaw to return to its normal position.  You may benefit from massage as well as chiropractic help.  As you tense your jaw with the pain, it just gets worse.  This is why the treatment may help.  Good luck.\n\n",
    "posted_time": "Post  by Debbie Miller, RN » Fri Nov 07, 2008 5:20 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=63494&sid=d8ced93bef0173d174fd057d02b25aff#p63494"
  },
  {
    "author": "sj  Guest Posts: 21 Joined: Sat Mar 24, 2007 1:49 pm",
    "title": "Is it normal to have some whiteness on the tongue?",
    "content": "Hi,  I am otherwise healthy, not on any medication.  I'm not sure how long this whiteness has been there, but I've only recently noticed it.  It doesn't cover the entire tongue, but is not \"patchy\" either.  It can mostly be scraped on with a fingernail, but some does not seem to come off.  There appears to be thicker whiteness in the back of the tongue since that part is harder to reach.  There seems to be no whiteness in any other part of my mouth.  From what I have read, this can be oral thrush.  Am I correct?  What could be some reasons that I have this?  I am aware that thrush can be a sign of a compromised immune system, as is caused by HIV.  But I'm not sure whether that can be the cause since I've never had unprotected sex and haven't shared needles.  Could you please also tell me how this can be remedied?  I've tried brushing the tongue, which doesn't quite seem to help.  I'd greatly appreciate the help.  Thanks so much.\n\n",
    "posted_time": "Post  by sj » Wed Nov 05, 2008 1:43 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=63188&sid=d8ced93bef0173d174fd057d02b25aff#p63188"
  },
  {
    "author": "Debbie Miller, RN  Nurse Posts: 4746 Joined: Mon Apr 16, 2007 2:41 pm Gender: Female Location: USA",
    "title": "Re: Is it normal to have some whiteness on the tongue?",
    "content": "Hello, This is a common condition and it can be aggravated by smoking.  It is not necessarily thrush but often is just accumulated dead skin cells, bacteria and debris.  Brushing is advised as well as quitting smoking, avoiding dehydration by drinking plenty of water and increasing fiber in your diet. Crunchy foods — such as apples, broccoli and popcorn — help scrape debris from your tongue.  It is usually temporary and harmless.  I hope this helps.\n\n",
    "posted_time": "Post  by Debbie Miller, RN » Wed Nov 05, 2008 11:06 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=63293&sid=d8ced93bef0173d174fd057d02b25aff#p63293"
  },
  {
    "author": "sj  Guest Posts: 21 Joined: Sat Mar 24, 2007 1:49 pm",
    "title": "Re: Is it normal to have some whiteness on the tongue?",
    "content": "Thank you very much for the response, Nurse Miller.  I am a non-smoker, and my diet is healthy as well.  As I said, I am otherwise fit, healthy, no bad habits, and no medication.  Would your opinion remain that this is likely not thrush?  Also, if you do not mind, can I ask what precise symptoms would have to be there for an oral thrush diagnosis?  Thanks again.\n\n",
    "posted_time": "Post  by sj » Wed Nov 05, 2008 11:45 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=63297&sid=d8ced93bef0173d174fd057d02b25aff#p63297"
  },
  {
    "author": "gib  Guest Posts: 1 Joined: Wed Oct 29, 2008 4:41 pm Gender: Male",
    "title": "Small bump on right side of jaw.",
    "content": "Hello,  About a month ago I had oral surgery to extract a wisdom tooth on the right side of my mouth.  Since then, the extraction sight has healed nicely, but I've noticed a small bump present in my jaw close to where the tooth used to be.  Now, usually I would not be concerned and would assume that it is simply a side effect of the surgery.  However, my wife was diagnosed with HPV about a year ago, which means that I've certainly contacted it as well.  My wife and I engaged in oral sex frequently and I have recently become aware that HPV can cause oral cancer in individuals who practice oral sex.  Should I be concerned that this lump is more than a side effect of the oral surgery or am I just freaking myself out over nothing?  Are there any other symptoms or signs that would let me know one way or the other?    I've scheduled an appointment with my dentist soon and plan to ask her about it.  Is there any specific questions I should ask her?\n\n",
    "posted_time": "Post  by gib » Wed Oct 29, 2008 4:51 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=62626&sid=d8ced93bef0173d174fd057d02b25aff#p62626"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "Re: Small bump on right side of jaw.",
    "content": "Hello,  This is more likely to be an enlarged lymph node as it occurs in a lymph node region (submental). Following throat, gum, or dental infections or inflammation, the draining lymph nodes become enlarged, painful and tender.   After control of infection or inflammation with adequate course of antibiotics, they should regress in size but never to normal size. These enlarged nodes are usually soft to firm, not painful, mobile and less than 1 cm.  Since it occurred after tooth extraction, the possibility that it is reactionary to inflammation in this area is high, however, direct clinical examination and a thorough history is the best way for identification of its possible causes.  If your physician would see it of benign origin he may recommend serial examination, as nodes who become smaller or stationary are reassuring while those increasing in size or number are concerning and are investigated promptly.   It is true that there is an increase in the risk of oral cancers in those who practice oral sex, but mainly in those exposed to multiple partners (more than 5), however, there is no approved test to find HPV in men. To my knowledge, this subject is still an area of research.  I would advise you to follow up with your doctor.  Please keep us updated.  Best regards.\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Tue Nov 04, 2008 4:35 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=63157&sid=d8ced93bef0173d174fd057d02b25aff#p63157"
  },
  {
    "author": "bluebomber85  Guest Posts: 1 Joined: Wed Oct 29, 2008 7:42 pm Gender: Male",
    "title": "Wisdom Teeth and Smokeless Tobacco",
    "content": "Hello,  I just got all four of my wisdom teeth removed today. I was wondering how long I should wait until I can chew tobacco? I've asked people I know who have had this done, and they have said they started doing it again as soon as two days after, some have waited a week.  Thanks for the help in advance!\n\n",
    "posted_time": "Post  by bluebomber85 » Wed Oct 29, 2008 7:45 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=62642&sid=d8ced93bef0173d174fd057d02b25aff#p62642"
  },
  {
    "author": "Debbie Miller, RN  Nurse Posts: 4746 Joined: Mon Apr 16, 2007 2:41 pm Gender: Female Location: USA",
    "title": "Re: Wisdom Teeth and Smokeless Tobacco",
    "content": "Hello, I would wait at least two weeks.  But then again, I would see this as a good time to stop the habit and reduce your risk for oral cancers.    Best wishes.\n\n",
    "posted_time": "Post  by Debbie Miller, RN » Sat Nov 01, 2008 10:45 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=62917&sid=d8ced93bef0173d174fd057d02b25aff#p62917"
  },
  {
    "author": "XComsGirl  Guest Posts: 1 Joined: Sun Sep 21, 2008 4:02 am Gender: Female",
    "title": "Consistent Bump on Inside Lower Lip",
    "content": "Hi.   About two months ago I noticed a bump on the inside of my lower lip. Thinking it was a cold sore, I left it alone.   It started to grow and shrink in size, however, and has not gone away. It is obviously not a cold sore, but it does not seem like a mucous cyst either (since the descriptions I've seen of those are clear/blueish bumps). Mine looks very much like a pimple (red sides with tiny white bump in the middle).   Also, a large, whiteish bump often grows from the main bump which makes eating and drinking difficult since I keep biting it and rubbing food against it accidentally. I started putting hydrogen peroxide on it a few weeks ago, once or twice a day, and that seems to help with the white growth. However, it never makes the original bump go away. At times, when it grows larger, it looks like a blister (with the white bump in the middle of a clearer seal), so perhaps it is a mucous cyst.   I don't even know which kind of doctor to go to for this, and I don't want to go to a regular doctor just to be told I'll have to go to a different one. Also, from what I've read about mucous cysts, they have to be surgically removed. I really don't want to have that. If this thing in my mouth is annoying but not harmful, that really doesn't seem necessary. If it is a cyst, is there any way of getting rid of it without surgery?\n\n",
    "posted_time": "Post  by XComsGirl » Sun Sep 21, 2008 4:17 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=61115&sid=d8ced93bef0173d174fd057d02b25aff#p61115"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Consistent Bump on Inside Lower Lip",
    "content": "Hello -  What you describe sounds like oral stomatitis, a canker sore which sometimes forms spontaneously and, with luck, will resolve within a week or two. However, sometimes these things, which are actually usually caused by a virus, can be re-aggravated so often by being in the wrong spot and getting bitten, that they develop a bacterial superinfection (meaning superimposed, not a super bug). This is why stubborn ones tend to respond to hydrogen peroxide, and I'd continue using that as often as practical. Also, if you can find it, there's a product  called Gly-Oxide, which is peroxide in a glycerine suspension, which makes it thicker so that it stays put and is able to work longer on the actual spot. You might ask a pharmacist if this is still available. It's a lot easier to use than pure peroxide.   If the lesion doesn't resolve soon, you may need to have a doctor look at it -- most general practitioners should be able to deal with this -- and either be started on a special anti-viral medication or perhaps have the lesion cauterized. It should be looked at if it stays much longer, as it could cause a scar (with a permanent bump at the site) which could attract yet more biting, additional lesions, etc.  I hope this is helpful. Please follow up with us as needed.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Thu Oct 23, 2008 10:41 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=62420&sid=d8ced93bef0173d174fd057d02b25aff#p62420"
  },
  {
    "author": "eireann_t  Guest Posts: 1 Joined: Thu Sep 25, 2008 7:15 pm Gender: Female",
    "title": "small white lump on back of mouth",
    "content": "hi!  i am a 24 yr old female. i have a small white lump on the right hand side of my mouth about 1 cm away from my tonsills  its not painfull but uncomfortable when u press it, it goes away then returns after i close my mouth  just wondering what this could be !!! can anyone help ????? thanks\n\n",
    "posted_time": "Post  by eireann_t » Thu Sep 25, 2008 7:27 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=61473&sid=d8ced93bef0173d174fd057d02b25aff#p61473"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: small white lump on back of mouth",
    "content": "Hi there -  What you describe could be a cyst or enlarged lymph node, or possibly a canker sore that hasn't fully develped yet. These latter are usually painful, but since it isn't open as yet, it may not have fully developed. Then again, it could be something that's been there all along and you've just recently noticed, an anatomical anomaly that isn't important. So long as it's not causing symptoms I wouldn't be too concerned, but you should have it looked at regardless. It doesn't sound as though it's anything urgent, and if it does become painful and red then it's probably a canker sore (stomatitis). These tend to run their course and go away.   Nonetheless, if this thing doesn't disappear within a week, or if it becomes larger, painful, etc., then it should be looked at by a doctor.  Hope this is helpful. Best of luck to you.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Thu Oct 09, 2008 9:12 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=62037&sid=d8ced93bef0173d174fd057d02b25aff#p62037"
  },
  {
    "author": "Stephfriend  Guest Posts: 1 Joined: Fri Aug 29, 2008 10:22 am Gender: Female",
    "title": "Dry Socket and the Contraceptive Pill",
    "content": "Hi all,  I'm having all 4 of my wisdom teeth removed in 1 months time under GA, and obviously will be doing everything I can to avoid dry socket. I've read that women who take the contraceptive pill are more prone to dry socket, and I was wondering if I should stop taking my pill in the run up to the operation to try and avoid it?  many thanks!\n\n",
    "posted_time": "Post  by Stephfriend » Fri Aug 29, 2008 10:25 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=59510&sid=d8ced93bef0173d174fd057d02b25aff#p59510"
  },
  {
    "author": "Debbie Miller, RN  Nurse Posts: 4746 Joined: Mon Apr 16, 2007 2:41 pm Gender: Female Location: USA",
    "title": "Re: Dry Socket and the Contraceptive Pill",
    "content": "Hello, I have never heard this side effect associated with oral contraceptives.  Your best shot at avoiding dry socket is to follow your doctors orders exactly, do not suck out of a straw, rest until you recover and try not to do anything that might dislodge the clot that forms following extraction.  In some cases it just cannot be avoided as the cause is something you can't control.  It can be related to a difficult extraction, a fragment of tooth or root left there, or even some bacterial infection at the site.  Some people develop this in spite of everything going \"right\" otherwise.  Best wishes and good luck with the coming procedure.\n\n",
    "posted_time": "Post  by Debbie Miller, RN » Tue Sep 16, 2008 3:47 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=60669&sid=d8ced93bef0173d174fd057d02b25aff#p60669"
  },
  {
    "author": "BIRD4UM  Guest Posts: 1 Joined: Wed Feb 27, 2008 12:38 pm Gender: Male",
    "title": "BUMPS ON THE ROOF OF MOUTH",
    "content": "I travled to Colorado from Miami on plane.  I got back, the top of my throat felt raw.  I looked with a flashlight and saw red stripes on the top of my mouth, going back to my throat. Also there were red bumps, like pimples. No pain.  My primary said he has never seen anything like it, and ask a dentist.  Please help.  B\n\n",
    "posted_time": "Post  by BIRD4UM » Wed Feb 27, 2008 1:01 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=54513&sid=d8ced93bef0173d174fd057d02b25aff#p54513"
  },
  {
    "author": "Debbie Miller, RN  Nurse Posts: 4746 Joined: Mon Apr 16, 2007 2:41 pm Gender: Female Location: USA",
    "title": "Re: BUMPS ON THE ROOF OF MOUTH",
    "content": "Hello, I hope you followed up with the dentist as your doctor suggested.  I don't know what it was either but would guess some type of infection or abrasion but it could also be something you have had for a while without being aware of it.   I doubt it is serious but if it is still present and you haven't seen a dentist, please do so for peace of mind.   Best wishes.\n\n",
    "posted_time": "Post  by Debbie Miller, RN » Mon Mar 31, 2008 6:44 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=57371&sid=d8ced93bef0173d174fd057d02b25aff#p57371"
  },
  {
    "author": "jmhop23  Guest Posts: 1 Joined: Sun Mar 23, 2008 1:20 pm Gender: Male",
    "title": "Chewing Tobacco",
    "content": "How long does it take for Tobacco (Nicotine) to get out of the bloodstream or, maybe more significantly, out of the saliva (for chewing tobacco like myself) in order to have a clean saliva test?\n\n",
    "posted_time": "Post  by jmhop23 » Sun Mar 23, 2008 1:33 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=56726&sid=d8ced93bef0173d174fd057d02b25aff#p56726"
  },
  {
    "author": "Debbie Miller, RN  Nurse Posts: 4746 Joined: Mon Apr 16, 2007 2:41 pm Gender: Female Location: USA",
    "title": "Re: Chewing Tobacco",
    "content": "Hello, I have not been able to find this information and I suspect it is because people metabolize products at individual rates and it may not be possible to say exactly when you will be clean.  Some substances can remain in the body for many years; others clear more rapidly, as a rule.    The best thing to do is just make sure you do not use tobacco products at all.  Best wishes.\n\n",
    "posted_time": "Post  by Debbie Miller, RN » Mon Mar 31, 2008 3:26 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=57345&sid=d8ced93bef0173d174fd057d02b25aff#p57345"
  },
  {
    "author": "fluffygirl  Guest Posts: 1 Joined: Fri Feb 22, 2008 6:12 pm Gender: Female",
    "title": "White coating on tongue, raised papillae",
    "content": "My tongue has had a thick white coating for about 6 months now.  My doctor says it's normal but I havent been to the dentist.  THe papillae in the back of my tongue is raised.  This is extremely unsightly.  Do you know what this could be?    Please help!\n\n",
    "posted_time": "Post  by fluffygirl » Fri Feb 22, 2008 6:23 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=54175&sid=d8ced93bef0173d174fd057d02b25aff#p54175"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "Re: White coating on tongue, raised papillae",
    "content": "Hello Fluffygirl,  Just based on the picture I suspect everything is normal.  Occasionally this white coloring occurs from chronic irritation (such as from smoking) or from dehydration.  Your dentist may also be able to evaluate this as a second opinion for you.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sat Feb 23, 2008 8:52 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=54234&sid=d8ced93bef0173d174fd057d02b25aff#p54234"
  },
  {
    "author": "Kate1982  Guest Posts: 5 Joined: Sun Dec 10, 2006 4:44 am Location: Ohio",
    "title": "Painful red bump under tongue",
    "content": "I have a really sore, red, swollen bump on the underside of my tongue from it rubbing over my bottom teeth.  It's too the point where every time I move my tongue this spot get's pinched between my teeth and it makes it hurt that much worse.    Is there anything I can do to speed up the healing and reduce some of the swelling?  It's driving me crazy. Thanks\n\n",
    "posted_time": "Post  by Kate1982 » Sun Feb 17, 2008 1:43 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=54006&sid=d8ced93bef0173d174fd057d02b25aff#p54006"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "Re: Painful red bump under tongue",
    "content": "Hello Kate1982,  Most likely, you had a small area that may initially have become inflamed due to a viral infection or some trauma that now is having a hard time getting better due to continued trauma.  These can be difficult to manage.  If you feel that there may be an infection setting in you should see your doctor since you may need antibiotics.  If it seems more like it is irritated due to the continued trauma you may want to try using a topical numbing medicine such as orajel to help some with the pain.  Another idea, which I have never tried but could work, is to try covering the gap between your teeth with a dental strip or tape.  Keep in mind I just thought of this and have never actually seen anyone do it but it may help.  If this doesn't get better soon I would recommend you see your doctor.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Thu Feb 21, 2008 9:27 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=54137&sid=d8ced93bef0173d174fd057d02b25aff#p54137"
  },
  {
    "author": "sop22  Guest Posts: 25 Joined: Sat Sep 22, 2007 7:05 am",
    "title": "rootcanal redone Vs extraction",
    "content": "i have been told today that i either have to have a root canal or extracion on a tooth that a root canal had been unsuccesful on last year. i was wondering what the better option is considering is has already failed once before. i don't particularly 'want' my tooth extracted but if it is likely that its going to happen in the end anyway id rather save myself the pain and money. i tried asking my dentist but he just handed me a leaflet about root canal treatment (which was strange because ive had it done before) and then gave me a prescription for antibiotics but never said when to start taking them as he hasnt booked me back in until the end of march, so im really rather confused about what to choose to do?\n\n",
    "posted_time": "Post  by sop22 » Wed Jan 30, 2008 8:04 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=53437&sid=d8ced93bef0173d174fd057d02b25aff#p53437"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "Re: rootcanal redone Vs extraction",
    "content": "Hello Sop22,  My knowledge of dental issues is limited but it is my understanding that it is uncommon for a root canal to fail so I suspect the odds of a successful root canal the second time would be high.  If you prefer to have the tooth saved and a crown placed rather than having it pulled and having a bridge put in I think the repeat root canal is reasonable.  I cannot comment on the antibiotics since I don't know what they were prescribed for.  I would recommend you call your dentist about this.  It would also be reasonable to request a second opinion from another dentist if you feel this is needed.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Thu Feb 07, 2008 9:18 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=53611&sid=d8ced93bef0173d174fd057d02b25aff#p53611"
  },
  {
    "author": "john551  Guest Posts: 1 Joined: Wed Dec 26, 2007 7:27 pm",
    "title": "Loose teeth",
    "content": "I have been taking simvastatin. Since taking this drug several of my teeth are becoming loose. I have heard that this drug makes the skin in the mouth and gum area become loose. Any chance this drug is affecting my teeth???\n\n",
    "posted_time": "Post  by john551 » Wed Dec 26, 2007 7:37 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=52061&sid=d8ced93bef0173d174fd057d02b25aff#p52061"
  },
  {
    "author": "Sandy Tracy RN  Nurse Posts: 60 Joined: Wed Nov 07, 2007 6:57 pm",
    "title": "Re: Loose teeth",
    "content": "Hi John551  I have been unable to find a link between loose teeth and zocor.  I suggest following up with your dentist as well as your doctor.  They may be able to find a direct cause of your problem.  Sorry for the delay in response.  I wish you Luck Sandy Tracy RN\n\n",
    "posted_time": "Post  by Sandy Tracy RN » Sat Jan 19, 2008 8:53 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=53266&sid=d8ced93bef0173d174fd057d02b25aff#p53266"
  },
  {
    "author": "Rosh  Guest Posts: 1 Joined: Wed Dec 26, 2007 1:17 pm",
    "title": "Annoying! Back of mouth...",
    "content": "HI, I searched the forums and I could not find a discreet answer regarding this, the thing is, since I came back from Japan in the summer, I've noticed (this was whie in Japan to) that in the back left of my mouth (back right if you are facing me), there's a relatively large hole... I am pretty sure it should not be there, and I took a white light and flashed it into my mouth and looked at the opposite side, and the hole is there, but not nearly as big, and not protruding outwards either. Anyway, regarding the hole that is protruding outward, I thought at first maybe food was getting stuck into it, so (I know this is bad but it was really annoying and I didnt have anything else to use at the times.) I ended up trying to use my finger at first to get it out, but my finger was to big to fit in the hole so I poured alcohol over a paper clip and ran it through hot water and stuck that in, the white thing came out just fine, it was a little solid so I wondered what it could have been. The next time it happened though,  I tried the same way, but it felt like it was attached to the inside of the hole, and it took a long time to get it out, now its back AGAIN and I'm getting irritated with it so I want to know what exactly it is, and the best way to rid myself of it. The thing that gets stuck in the hole is always white and is increasingly becoming harder to get out. Also I am not sure why the hole in the back left of my mouth is popping out so much when the back right is not. Any ideas?\n\n",
    "posted_time": "Post  by Rosh » Wed Dec 26, 2007 1:28 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=52025&sid=d8ced93bef0173d174fd057d02b25aff#p52025"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "Re: Annoying! Back of mouth..",
    "content": "Hi Rosh,  I suspect that the thing you are seeing the hole is your tonsil.  The tonsils frequently have pits in them.  They can also form stones, called tonsilliths. This may be what you are seeing with the white substance.  Since this is persisting I would suggest you see your regular doctor or an Ear/Nose/Throat doctor for further evaluation to find out for sure what is going on.  If it is a tonsillith it may be necessary to have a tonsillectomy to help cure the issue.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sun Jan 06, 2008 11:02 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=52877&sid=d8ced93bef0173d174fd057d02b25aff#p52877"
  },
  {
    "author": "pjcard  Guest Posts: 1 Joined: Fri Dec 28, 2007 1:26 pm",
    "title": "Pain in upper rear tooth",
    "content": "Hi, I've been getting a sharp pain in my upper rear left tooth on and off for a while now. It will come and go for about an hour and then disappear again for sometimes days at a time. By the time its gone it usually feels my throat feeling a little sore as well. As far as I'm aware, my wisdom teeth have all come through and my dentist did an x-ray in that area not so long ago and found nothing. What could it be? Pressing down on it doesn't hurt and it doesn't seem to be strictly associated with eating anything particular.  Thanks\n\n",
    "posted_time": "Post  by pjcard » Fri Dec 28, 2007 1:50 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=52187&sid=d8ced93bef0173d174fd057d02b25aff#p52187"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "Re: Pain in upper rear tooth",
    "content": "Hi Pjcard,  Tooth pain can be caused by several things.  Sensitive teeth can cause the pain as can a dental abscess.  Pain coming from the tooth is often worse when pressing on the tooth.  Tooth pain may also be referred from another place, most commonly the ear or the sinuses.  It may be that you are actually having some inflammation of the middle/inner ear or the maxillary sinus (located in the cheek bone).    If this pain continues I'd recommend you see your doctor for an evaluation.  An Ear/Nose/Throat specialist may also be of help.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Fri Dec 28, 2007 9:02 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=52225&sid=d8ced93bef0173d174fd057d02b25aff#p52225"
  },
  {
    "author": "BhamautRetsu  Guest Posts: 3 Joined: Sat Nov 17, 2007 5:37 am",
    "title": "Wisdom Teeth or TMJ?",
    "content": "I am 18 years old. Male. All of my 4 Wisdom teeth started to grow 1 year ago... And that's when I started to  have the following symptoms:  1-Occasional wisdom teeth pain (from small gum infections) 2-Dizziness 3-Brain fog 4-\"Strange\" feeling in head (I can't explain what it's like) 5-Feeling of pressure in the center of the head, behind nose, and in the center of the upper jaw. I can almost feel it coming from the upper wisdom teeth. 6-Itchy frontal teeth (from time to time) 7-Occasional numbness/paresthesia in upper lip and left cheek. 8-Pain in all upper teeth, like a nerve pain (It's barely noticable and is not constant) 9-And rarely some strange vertigo (it's barely noticable) 10-Also, some noises (like violin) irritate my ears and cause this strange feeling in the head, along with the nerve pain in the upper teeth.  I went to a dentist, and he said that they are growing fine. But I think that he was wrong. My lower teeth stopped growing, but they are still almost completely covered in gum, and that already makes them vertically impacted (soft tissue impaction?). And my upper teeth grow completely sideways, but not towards the other teeth, or towards the back of the head. They grow towards the cheek. I can see in the mirror that they grow in the wrong direction. I also asked for an x-ray, but the dentist said that there was no need for it.  I have also read about TMJ, and I have some symptoms that fit. And now I wonder what exactly do I have? If my dentist was right then I am only left with TMJ... My question is: \"Can above symptoms be caused by wisdom teeth? And from the description that I gave you, can you tell me if my teeth grow wrong/impacted?\". I would be very grateful for any help!\n\n",
    "posted_time": "Post  by BhamautRetsu » Sat Nov 24, 2007 3:23 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50736&sid=d8ced93bef0173d174fd057d02b25aff#p50736"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi BhamautRetsu,  Actually, your symptoms make me wonder if you have sinusitis.  It would be uncommon for either TMJ or wisdom teeth pain.   I would recommend you talk with your doctor about this.  If you do have sinusitis it can be treated with antibiotics to clear it up.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Wed Nov 28, 2007 8:49 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50961&sid=d8ced93bef0173d174fd057d02b25aff#p50961"
  },
  {
    "author": "butrfly395  Guest Posts: 1 Joined: Sun Nov 25, 2007 9:14 pm",
    "title": "Passing out during gum surgery",
    "content": "I am a 24 year old  healthy female and I am having gum surgery next month.  I am having gum removed from the roof of my mouth and stiched on to my front teeth.  For the surgery I will be on valium and gas.  I am worried because I pass out very easily and I am afriad that I will pass out during the surgery.  Will being on valium and gas make it more dangerous if I pass out?  I'm scared that being on those drugs will be a problem if I pass out.  Is there anything to be worried about??\n\n",
    "posted_time": "Post  by butrfly395 » Sun Nov 25, 2007 9:19 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50828&sid=d8ced93bef0173d174fd057d02b25aff#p50828"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Butrfly395,  Passing out should not be a problem.  Just be sure to let your doctor know about this so that any necessary precautions can be arranged.  The valium may actually help you relax and keep you from passing out.  The gas will actually make you very sleepy itself since it is an anesthetic.  I think you'll do fine during the surgery.  Let your doctor know about your concerns so you can discuss them beforehand.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sun Nov 25, 2007 9:33 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50833&sid=d8ced93bef0173d174fd057d02b25aff#p50833"
  },
  {
    "author": "scanto  Guest Posts: 1 Joined: Sat Nov 17, 2007 12:23 am",
    "title": "PLEASE HELP PLEASE! LOCKED JAW QUESTION",
    "content": "I visited a friend in mexico for a couple of weeks and while i was there I went to the dentist.  After the procedure, my jaw locked and the dentist was trying to push it back in place.  I was able to close my mouth but now, everytime i open my mouth, there is a temporal pain on the left side of my head.  The pain is pretty much on the entire left side of my head.  I looked online and they said that lockjaw could be associated with tetanus.  Is this pain normal, or did I get a bacterial infection at the dentist? I had my tetanus shot a very long time ago.  PLEASE HELP i'm so worried.  Thank you in advance.\n\n",
    "posted_time": "Post  by scanto » Sat Nov 17, 2007 12:32 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50452&sid=d8ced93bef0173d174fd057d02b25aff#p50452"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Scanto,  It is very unlikely that your symptoms are due to tetanus.   This infection would not be expected to cause one sided pain.  More likely, you got an injury to your temporomandibular joint (TMJ) on that side.  If this doesn't improve in the next day or so I would recommend you see a dentist or oral surgeon to have this further evaluated.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sat Nov 17, 2007 3:03 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50488&sid=d8ced93bef0173d174fd057d02b25aff#p50488"
  },
  {
    "author": "kiki8282  Guest Posts: 2 Joined: Sat Nov 17, 2007 2:24 am",
    "title": "Recurring Canker Sores",
    "content": "Hi!  I am a 22 year old female and have been getting canker sores on the inside of my mouth for as long as I can remember.  I'd say I get them every 2-3 weeks, and I feel as though they keep getting more painful and larger each time I get them.  I've tried many kinds of over the counter ointments which help but only temporarily.  I know the causes of canker sores are generally unknown and that they are quite common, but I'm concerned about how they're becoming progressively larger and more painful.  What should I do?  Thank you so much for your advice!\n\n",
    "posted_time": "Post  by kiki8282 » Sat Nov 17, 2007 2:42 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50457&sid=d8ced93bef0173d174fd057d02b25aff#p50457"
  },
  {
    "author": "Debbie Miller, RN  Nurse Posts: 4746 Joined: Mon Apr 16, 2007 2:41 pm Gender: Female Location: USA",
    "title": "[no title]",
    "content": "Hello, There seems to be a genetic tendency to get these sores since some people are much more prone than others.  There is no known cure or definite cause of these mouth ulcers which can be very painful.    The usual preventive measures that may help reduce the incidence include being careful about eating any foods that may traumatize your mouth such as sharp-edged chips, high acid foods, nuts, and some spices.  Keep a food diary so you can discover if there is any food-link to your outbreaks.  Secondly, don't talk and chew at once - more likely to bite your mouth if you do this and the result can be a sore.  Use good dental hygiene and a soft toothbrush.  This can help get rid of offending foods that might linger in the mouth.    My son actually noticed that his occur when he doesn't eat enough vegetables.  He has never liked veggies but once he began eating them regularly (his Japanese wife is a good cook and uses lots of vegetables) he noticed the cankers didn't happen.  When his wife traveled back to Japan to visit her family, he slipped back into his bad American diet and the cankers started again.  Now, he eats the greens daily whether he wants to or not.  Just an interesting case that was easy enough for him to prevent the sores once he discovered what worked for him.  Once you have a sore, try not to irritate it by rubbing your tongue on it.  Healing will occur faster if it is not irritated further so eat soft foods and try to leave it alone.  There are some topical treatments that can reduce the pain and possibly speed the healing.  Some are by prescription and a doctor or dentist can recommend; others are available over the counter such as anesthetic solutions or ointments (numbing qualities in mouth products similar to what is used for teething babies.  Good luck.\n\n",
    "posted_time": "Post  by Debbie Miller, RN » Sat Nov 17, 2007 11:41 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50474&sid=d8ced93bef0173d174fd057d02b25aff#p50474"
  },
  {
    "author": "susieQ1  Guest Posts: 45 Joined: Thu Mar 01, 2007 3:57 pm",
    "title": "TMJ & meniere's",
    "content": "The bones in each jaw are deteoriated & my mouth has completely changed.  I now have an overbite plus bilateral meniere's & tinnitus.  I have had meniere's for several years & have a constant feeling of fullness in jaws, one worse than other.  It feels like there is fluid that get in the area & can't get out.  Is there an inexpensive mouth piecce  a dentist could fit me with to try & see if wearing it temporarily would relieve the fullness?\n\n",
    "posted_time": "Post  by susieQ1 » Wed Nov 14, 2007 5:25 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50361&sid=d8ced93bef0173d174fd057d02b25aff#p50361"
  },
  {
    "author": "Sandy Tracy RN  Nurse Posts: 60 Joined: Wed Nov 07, 2007 6:57 pm",
    "title": "[no title]",
    "content": "hi, SusieQ1.  I am unsure of the cost, but orthodontists, physical therapists and dentists all have the skills to assist in treatments for TMJ.  There is a mouthpiece that your dentist can fit you for.  Check with your dentist or insurance company to see what the cost may be or if it is covered.  I wish you well, good luck Sandy RN\n\n",
    "posted_time": "Post  by Sandy Tracy RN » Wed Nov 14, 2007 5:49 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50366&sid=d8ced93bef0173d174fd057d02b25aff#p50366"
  },
  {
    "author": "sop22  Guest Posts: 25 Joined: Sat Sep 22, 2007 7:05 am",
    "title": "erupting wisdom tooth",
    "content": "ive not had my wisdom teeth come out yet, but today whilst i was eating nuts i thought i had some stuck on my gum, upper left, where my tooh should be, i tried to mov eit but i couldnt, then i suddenly realised it was a tooth, in three out of four corners i have a tooth poking through, so its started coming out.  my question is, if one is coming, do the other 3 come too? i wonder this because in two areas of my mouth ive had aching teeth recently, and if they are on their way i would have thought this may be the cause in the other areas. also how quickly do they take to fully come out. And, for the last four weeks ive had a sore throst that no doctor can explain, however could that be from the wisdoms coming? ive also been feeling dizzy and having mild headaches for the past 3/4 days would this be due to the tooth and would this happen even if the tooth is completely normal? i just don't want it to be impacted, ive had enough trouble with my root canal (as a side not that either hasnt been successful or my gum around that tooth is still infected) im still on the waiting list for my dentist so this is all coming at a very very bad time. Oh, is it normal tat if i run my finger over the outside of my gum (behind my lip) my other wisdom areas feel flat, where as the area that is partially erupted is slightly swollen, not majorly, just noticably - i don't actually have pain in the area\n\n",
    "posted_time": "Post  by sop22 » Sun Oct 21, 2007 3:55 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=49216&sid=d8ced93bef0173d174fd057d02b25aff#p49216"
  },
  {
    "author": "Debbie Miller, RN  Nurse Posts: 4746 Joined: Mon Apr 16, 2007 2:41 pm Gender: Female Location: USA",
    "title": "[no title]",
    "content": "Wisdom teeth can cause distress, that's for sure.  Some people are able to have them come in without difficulty but for most it's crowded in there.    They can come in one at a time or all at once - totally individual.  Also, some people have genetically absent wisdom teeth (one or more) so it is possible that there could be less than four total.  Your dental xrays should be able to determine this.  Wisdom teeth can also erupt partially, stay completely impacted, or erupt fully - in short time or over a long time.  Again, it's all up to the individual, how much room is in the mouth, etc.  Your pain could well be coming from this tooth but I can't determine that for sure.  If your sore throat and headache continue you should have it checked out.  You could be experiencing some type of seasonal allergy that is causing a little drainage, making your throat sore, but I would think the doctor would be able to visualize redness if this were the case.    Take pain relievers such as acetaminophen to get you by until your dental appointment but if that doesn't do the trick or you have other symptoms of infection such as fever, swelling, etc. you should call the office to see if they can work you in sooner for a non-routine exam.  Good luck with this.\n\n",
    "posted_time": "Post  by Debbie Miller, RN » Sun Oct 21, 2007 9:08 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=49224&sid=d8ced93bef0173d174fd057d02b25aff#p49224"
  },
  {
    "author": "sj  Guest Posts: 21 Joined: Sat Mar 24, 2007 1:49 pm",
    "title": "TMJ problems? please advise",
    "content": "hi,  my left jaw joint had, upon chewing, been making clicking noises, without pain, for some years now.  just recently, i woke up to a dull pain in that very joint.  at times, it's better, but at times it can become somewhat painful, when i, for instance, try to fully open my mouth or try to chew on tough meat.  my normal daily functions are not hindered as long as i can sustain the mild-to-moderate level of pain.  i tried taking tylenol a few times, but i feel it provides a very short-lived, and even negligible, amount of relief.  also, my wisdom teeth on that side have come out for the most part, so i don't think it's due to a dental issue.  what kind of disorder am i looking at here?  is there anything i can do?  thank you very much.\n\n",
    "posted_time": "Post  by sj » Wed Oct 03, 2007 7:52 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=48631&sid=d8ced93bef0173d174fd057d02b25aff#p48631"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Sj,  TMJ is a condition where the joint at the top of the jaw (near the ear) becomes inflamed.  It sounds like this is probably what is going on in your case.  There are several different reasons this inflammation can occur.  Treatment depends on the cause.  I would recommend you see an Ear, Nose, and Throat specialist for further evaluation and treatment recommendations.  Your dentist may also be able to evaluate this and make sure it isn't related to your wisdom teeth.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Wed Oct 03, 2007 8:19 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=48633&sid=d8ced93bef0173d174fd057d02b25aff#p48633"
  },
  {
    "author": "sj  Guest Posts: 21 Joined: Sat Mar 24, 2007 1:49 pm",
    "title": "[no title]",
    "content": "thanks so much for the response, doctor.  i'll try to get to a doctor, but in the meantime, how serious or harmful are TMJ conditions? also, is there anything i may be able to right now to alleviate the pain?    thank you very much\n\n",
    "posted_time": "Post  by sj » Wed Oct 03, 2007 8:24 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=48634&sid=d8ced93bef0173d174fd057d02b25aff#p48634"
  },
  {
    "author": "caligirl072007  Guest Posts: 2 Joined: Sun Sep 16, 2007 9:54 pm",
    "title": "Painful gums, metallic taste in mouth",
    "content": "For the past two days I have been suffering from gum pain on the lower right side of my gums. There is a strip of healthy looking gum right underneath the teeth, and then the whole area below that looks reddish and thin. It's extremely tender. I have been using Crest mouthwash, flossing, and brushing my teeth as normal. My newest symptoms are inside cheek inflammation and pain and a metallic taste in my mouth.  I am currently taking Spironolactone and Loestrin 24 Fe for my PCOS symptoms. Could these medicines be causing my symptoms? I also attempted to use Crest white strips for the first time yesterday. Could this be the culprit? The strips didn't touch the area of affected gum. If not, what could this mean? I have always had a perfectly healthy mouth (no cavities ever! just a warning that I had the beginnings of receding gums and should floss regularly) and don't think something like gingivitis would come upon me so suddenly now. I am 25 years old and a female.   In addition to an attempted diagnosis, does anyone have some advice on pain relief? Thank you.\n\n",
    "posted_time": "Post  by caligirl072007 » Sun Sep 16, 2007 10:21 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=47893&sid=d8ced93bef0173d174fd057d02b25aff#p47893"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Caligirl072007,  I would recommend you stop the white strips until you see your doctor.  As I responded to your other post, the spironolactone isn't commonly known to cause this.  The white strips may be a possibility.  Regarding pain, you can try ibuprofen and tylenol.  You may also want to try a topical pain reliever like oragel.  Seeing your doctor is important.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sun Sep 16, 2007 10:41 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=47895&sid=d8ced93bef0173d174fd057d02b25aff#p47895"
  },
  {
    "author": "Matt Foertsch  Guest Posts: 2 Joined: Mon Aug 20, 2007 1:43 am",
    "title": "BB shot in Mouth 7years ago. Pain in that area?",
    "content": "Hello, I'm a healthy 23 year old Male. When I was about 16 I accidently shot myself in the mouth with a BB gun. I didn't think it was loaded and I stuck it in my mouth and pulled the trigger. The BB lodged in the fleshy sort of area on the upper left side of mouth, not quite at the jaw or the throat thank god. Anyways I didn't tell my parents or anybody about it because I was scared. Dumb, I know. So a few years went by and it never really bothered me or anything and then when I was about 18 or 19 it started to worry me because I thought maybe it could travel through my body or hurt me in some way. I went to the dentist who took X-rays and found the BB still in the place where I fired it. He suggested I see an oral surgeon to have it removed. I saw the oral surgeon and he said since it had been so long that anything bad would have already happened and there was no need to take it out because the body forms some kind of shell around it and it will just stay where it is. All of the sudden two days ago I started getting pretty bad pain, especially when I chew, right around that area and I'm really scared it's related to the BB. Could it, this many years later, be doing harm? Can it travel to my heart or brain? If it was a copper BB can it poison me some how?  I would greatly appreciate any advice. I am going to make an appointment with my dentist tomorrow and have an X-ray done as soon as possible to make sure it hasn't moved anywhere over the last few years. And if the pain doesn't go away I might go to the hospital in the next few days because it really does hurt. thanks\n\n",
    "posted_time": "Post  by Matt Foertsch » Mon Aug 20, 2007 2:07 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=46614&sid=d8ced93bef0173d174fd057d02b25aff#p46614"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Matt Foertsch,  I agree with your oral surgeon that after this long it is unlikely to cause you any problems such as eroding deeper into the bone/brain or getting into a blood vessel and traveling elsewhere.  It does occasionally happen where a foreign body begins causing pain after many years, sometimes related to recent trauma in the area (even mild).  Seeing a dentist or oral surgeon about this is appropriate to make sure it is OK.  If it is not causing you any problems I agree with the surgeon that it probably does not need to come out.  If it beginning to cause pain it should probably be removed.  Regarding the copper issue, cases have been described where a person has developed lead poisoning from an embedded bullet that was leeching out the lead from within it.  This is an unusual occurrence and I am not aware of such reports with BB's; however, I cannot guarantee that this won't happen.    Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Wed Sep 12, 2007 10:43 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=47757&sid=d8ced93bef0173d174fd057d02b25aff#p47757"
  },
  {
    "author": "sally1980  Guest Posts: 2 Joined: Sun Apr 29, 2007 7:38 pm",
    "title": "jaw coming forward",
    "content": "Hi,  i have been bulimic for sometime it is better now but i had severe erosions on my teeth especially the upper ones, since i got them fixed (filling the gaps) i am not feeling good, my whole jaw is coming forward especially the upper one and my face shape changed completely with sever headache, I  prefer bulimia pain than this headache, I do not know how to open my mouth or close it or chew food the proper way at times i feel i should just not move it at all (speaking, chewing ,just keep it shut), i do not know how the jaw should behave any more. I am really thinking of ending my life. i feel the bulimia is not as bad as this,  what can i do about this?, i went back to my dentist she said any thing is fine with the fillings but this is my head and it is not fine, please please help\n\n",
    "posted_time": "Post  by sally1980 » Sun Aug 26, 2007 9:51 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=46908&sid=d8ced93bef0173d174fd057d02b25aff#p46908"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Sally1980,  Your symptoms seem quite significant.  You can always request a second opinion from another dentist or an oral surgeon if you need.  I would encourage you to stay in contact with your current dentist as well.  You mention that you are thinking of ending your life.  If you are seriously considering this I urge you to talk to someone about it.  If you are feeling significantly in danger call 911.  Talking to someone can be of huge benefit in helping to get through these difficult times  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Fri Aug 31, 2007 12:26 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=47108&sid=d8ced93bef0173d174fd057d02b25aff#p47108"
  },
  {
    "author": "TMalonson  Guest Posts: 6 Joined: Sun Aug 26, 2007 2:36 pm",
    "title": "Infected gums and foul rotted flesh smelling blood",
    "content": "I'm 32 yr old female for the past 13 yrs I have gone to dentist after dentist and all they ever do is give me antibiotics and do deep tissue gum cleaning, one dentist did however pull my top wisdom teeth thinking that they where getting food stuck in them and making things worse.  the only past surgeries was a removal of a ruptured tubule pregnancy about 9 yrs ago  as far as family history all I know is my grandmother has peoria and got dentures by the time she was 20  I'm not on any current meds.  ok so like I said for the last 13 yrs or so I have been getting really bed gum infections I now have loose teeth and blood that smells like rotting flesh drains out of my gums often while I sleep and I wake up with blood all over my pillow, not to mention any slight suction and blood will start pouring down the drain,  I want all my teeth pulled but have had no luck finding a dentist that is willing due to my age and the fact that I still have all of my teeth minus the two wisdom.  My real concern however is that i'm swallowing this blood in my sleep and it is makeing me sick because I always feel tired, I suffer from chest pains and gerd, sometimes I wake feeling nauseous.  Could my teeth be killing me and is it reasonable to be wanting them all pulled at the age of 32\n\n",
    "posted_time": "Post  by TMalonson » Sun Aug 26, 2007 9:56 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=46952&sid=d8ced93bef0173d174fd057d02b25aff#p46952"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi TMalonson,  My knowledge of dental issues is not sufficient enough to be able to comment on having your teeth removed.  However, I am very suspicious that you may have a deep seated infection in the bone since multiple courses of antibiotics are not clearing it.  I would suggest you see an oral-maxillary surgeon for further evaluation.  Specifically, you may want to ask to be evaluated for osteomyelitis (the bone infection).  If osteomyelitis is present it takes long term antibiotics to clear and may need surgical debridement to fully heal.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Mon Aug 27, 2007 12:09 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=46970&sid=d8ced93bef0173d174fd057d02b25aff#p46970"
  },
  {
    "author": "TMalonson  Guest Posts: 6 Joined: Sun Aug 26, 2007 2:36 pm",
    "title": "[no title]",
    "content": "thank you for answering so quickly.  I must admit your answer sounds a little more serious than I thought it to be, so I'm glad I asked here or I might not have ever realized just how serious it is.  Could long term infection in the bone make me sick in other ways? I always feel sick. If yes does it mean once I get It fixed I wont feel this bad all the time?  again thank you for caring and answering my questions.\n\n",
    "posted_time": "Post  by TMalonson » Mon Aug 27, 2007 6:45 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=46984&sid=d8ced93bef0173d174fd057d02b25aff#p46984"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "If you do have a deep infection like osteomyelitis it can most definitely make you feel ill and cause other symptoms including fever and fatigue.  If the infection is causing these symptoms they should get better once the infection is being treated.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Mon Aug 27, 2007 11:42 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=47025&sid=d8ced93bef0173d174fd057d02b25aff#p47025"
  },
  {
    "author": "wesman200098  Guest Posts: 19 Joined: Sat Dec 09, 2006 9:24 pm",
    "title": "White Bump on Side of Tongue",
    "content": "About 3 days ago, I noticed a small, white bump on the side of my right tongue.  It is sore, but not painful, and it has not grown any in the past couple of days.  I am 25 male, and I do not smoke, drink alcohol execessively, or chew.  What could this be?  Should I get it examined by a doctor?\n\n",
    "posted_time": "Post  by wesman200098 » Mon Aug 13, 2007 11:34 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=46245&sid=d8ced93bef0173d174fd057d02b25aff#p46245"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Wesman200098,  What you are seeing is most likely a bump from a virus.  This time of year the enteroviruses re-emerge and classically can cause these type of spots in the mouth.  If it is getting larger or if it is not going away in 3-5 days I would advise you to have it evaluated.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Tue Aug 14, 2007 7:43 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=46318&sid=d8ced93bef0173d174fd057d02b25aff#p46318"
  },
  {
    "author": "wesman200098  Guest Posts: 19 Joined: Sat Dec 09, 2006 9:24 pm",
    "title": "[no title]",
    "content": "Dr. Lowe,  I just wanted to say thank you for all the help that you and your colleagues have provided.  You guys are wonderful and have no idea how much I appreciate you all.  Thank you for all you do.\n\n",
    "posted_time": "Post  by wesman200098 » Wed Aug 15, 2007 10:36 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=46371&sid=d8ced93bef0173d174fd057d02b25aff#p46371"
  },
  {
    "author": "wesman200098  Guest Posts: 19 Joined: Sat Dec 09, 2006 9:24 pm",
    "title": "[no title]",
    "content": "When I brought this up to the dentist last week when I had a regular check-up, he said that this bump looked like a clogged salivary gland.  This bump has now been here for 2.5 weeks, and it hasn't changed a bit.  Well, sometimes it seems like it goes down, and then it swells up again.  I am just wondering, should this go down eventually?  I asked my dentist and he said that if it is still there in a month, he may send me to an oral surgeon just so that he can look at it.  He also told me that if it grew or started bleeding to let him know.  He wasn't worried about it all, but it worries me a little.  I have never smoked and I rarely drink.  What causes a blocked salivary gland anyway and how much time should I give it?  I am going to on a job assignment for 5 weeks, so I hope it does not grow or give me any trouble.  It doesn't hurt or anything.  Thanks.\n\n",
    "posted_time": "Post  by wesman200098 » Mon Aug 27, 2007 6:49 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=46999&sid=d8ced93bef0173d174fd057d02b25aff#p46999"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Salivary glands can become blocked for several reasons, most commonly due to a small stone that forms (usually from calcium or some other substance solidifying) in the gland that subsequently becomes lodged in the duct.  If you aren't experiencing pain they usually are not harmful and will resolve eventually.  Eating things that make you salivate (such as sour foods, etc) can help wash out the stone and resolve the problem.  It shouldn't stop your trip but if it hasn't resolved by the time you get back it's probably a good idea to have it evaluated by the oral surgeon.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Mon Aug 27, 2007 11:33 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=47021&sid=d8ced93bef0173d174fd057d02b25aff#p47021"
  },
  {
    "author": "dempseysm14  Guest Posts: 1 Joined: Wed Jan 12, 2005 12:56 pm Location: Wisconsin  Contact:   Contact dempseysm14       AOL",
    "title": "Sore tongue and swelling",
    "content": "I am a 23 year old woman with some allergies.  During the early evening last night, my tongue became sore and swollen.  The sides of my tongue are the sorest, but my guess is that is due to brushing against my molars.  My entire tongue is really red, and feels like it is burning.  My only guess is it could be allergy related, but I don't think I ate anything I was allergic to yesterday.  It is difficult to talk or to eat anything, but I have no other symptoms that I am aware of.  Could anyone give me a little insight?  Thanks, Stephanie\n\n",
    "posted_time": "Post  by dempseysm14 » Wed Jan 12, 2005 1:04 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8044&sid=d8ced93bef0173d174fd057d02b25aff#p8044"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi Stephanie, If an allergy to something has been essentially ruled out, have you had a recent fever etc.? Also keep in mind that vitamin deficiencies etc. can also cause this problem and you may want to call your family physician to have any anomolies ruled out. Sincerely, Rntdj\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Tue Jan 18, 2005 5:24 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8261&sid=d8ced93bef0173d174fd057d02b25aff#p8261"
  },
  {
    "author": "loriann  Guest Posts: 1 Joined: Sun Aug 12, 2007 4:20 pm",
    "title": "soreness on side of tongue",
    "content": "Hello, I am a 37 year old female.  I have had a sore tongue on the right side for about 3 weeks.  I went to the dentist a week ago to have it looked at and he said there was nothing wrong and I was fine.  It does look like the normal bumps on the side of my tongue towards the back are larger than the left side.  What could be causing this constant pain.  I have been taking Advil for pain and it takes the edge off but it comes right back.    I plan on going to see another dentist this week.  Any ideas what could be causing this? Lori\n\n",
    "posted_time": "Post  by loriann » Sun Aug 12, 2007 4:29 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=46184&sid=d8ced93bef0173d174fd057d02b25aff#p46184"
  },
  {
    "author": "porschedrifter  Guest Posts: 17 Joined: Thu Apr 12, 2007 6:04 pm Location: NJ",
    "title": "Cut in both corners of my mouth",
    "content": "I have this really annoying slit like cut in each corner of my mouth. Every time I sleep it seems to start to heal but when I wake up and open my mouth at all the skin stretches and they just reopen again.   I've tried putting vaseline and chapstick on regularly to help it heal but nothing seems to work. This has been going on for about  7 months now and whenever I eat especially they just rip open again. Once it does finally heal I end up tearing it open some how. Is this anything I should be concerned about?  thanks\n\n",
    "posted_time": "Post  by porschedrifter » Thu Jun 28, 2007 5:37 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=43841&sid=d8ced93bef0173d174fd057d02b25aff#p43841"
  },
  {
    "author": "Debbie Miller, RN  Nurse Posts: 4746 Joined: Mon Apr 16, 2007 2:41 pm Gender: Female Location: USA",
    "title": "[no title]",
    "content": "I think what you are doing is good but you may want to try a different healing ointment - perhaps Calmoseptine, Aquaphor, or even something with purified lanolin or aloe.  If your air is dry, you might try sleeping with a humidifier as well.  I'm guessing you might even have a little mouth breathing going on.    Good luck with this.\n\n",
    "posted_time": "Post  by Debbie Miller, RN » Sun Jul 01, 2007 3:21 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=43871&sid=d8ced93bef0173d174fd057d02b25aff#p43871"
  },
  {
    "author": "porschedrifter  Guest Posts: 17 Joined: Thu Apr 12, 2007 6:04 pm Location: NJ",
    "title": "[no title]",
    "content": "Now that I think of it, I have been sick for about 9 months now and most my symptoms have diminished. I'm left with a itching feeling in my throat as well as pains in the front and these cuts on the sides of my mouth. The skin also seems to be pealing on my lips leaving them red and raw as well.  So i went and bought some neosporin, it worked well and healed both sides of my mouth but now about 3 days after finally healing today the left side got another slit in it and soon after the right side was open again with two slits.  This is driving me nuts, They seem to just be appearing for no reason. Is there anything else this could be or to go get tested for?\n\n",
    "posted_time": "Post  by porschedrifter » Fri Jul 13, 2007 2:21 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=44669&sid=d8ced93bef0173d174fd057d02b25aff#p44669"
  },
  {
    "author": "Debbie Miller, RN  Nurse Posts: 4746 Joined: Mon Apr 16, 2007 2:41 pm Gender: Female Location: USA",
    "title": "[no title]",
    "content": "Perhaps a fungal infection.  Maybe some Nystatin.  You should have this evaluated by a doctor because you shouldn't have to deal with this chronically.  Need to get to the root of the problem for sure.  Good luck.\n\n",
    "posted_time": "Post  by Debbie Miller, RN » Mon Jul 30, 2007 7:02 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=45506&sid=d8ced93bef0173d174fd057d02b25aff#p45506"
  },
  {
    "author": "LoneWonderer  Guest Posts: 1 Joined: Fri Jun 01, 2007 8:00 am",
    "title": "Lump Near Jaw",
    "content": "A friend of mine has a lump near his jaw that moves. It swells and goes down periodically. It can be moved from his upper jaw to underneath his jaw. It's located around the bone. I was just curious if it could an infection or what. Thank you.\n\n",
    "posted_time": "Post  by LoneWonderer » Fri Jun 01, 2007 8:38 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=43214&sid=d8ced93bef0173d174fd057d02b25aff#p43214"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Your friend's lump is probably a lymph node.  There is a lymph node chain that runs along the jaw line.  Lymph nodes can swell from time to time.  If it becomes painful or seems to be changing somehow it should be evaluated.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Fri Jun 01, 2007 6:16 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=43246&sid=d8ced93bef0173d174fd057d02b25aff#p43246"
  },
  {
    "author": "shaz29  Guest Posts: 24 Joined: Mon Apr 23, 2007 3:13 pm",
    "title": "soreness under my top lip for about 2 days",
    "content": "Hi I will try to describe this as best as i can, I have been experiencing some soreness under my top lip for about 2 days, i looked under my lip and it was red in the middle, if you stretch your top lip outwards the bit in the centre that is attached to the gum is sore and theres a bit of reddish growth on it, a little like an ulcer, i am scared that it could be mouth cancer, im 32 years old and don't smoke... is this possible? i have been using bonjela on it but it hasnt made any difference, the growth isnt very big, its like a tiny lump or boil.. i hope i have explained it well enough.  Shazad\n\n",
    "posted_time": "Post  by shaz29 » Mon May 07, 2007 12:32 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=42051&sid=d8ced93bef0173d174fd057d02b25aff#p42051"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Most likely you have a viral infection causing a little inflammation in  your mouth.  Many of the enteroviruses that are starting to appear during this season can do this.  Cancer is much less likely.  If it isn't getting better in the next few days you should have it checked out.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Mon May 07, 2007 4:11 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=42075&sid=d8ced93bef0173d174fd057d02b25aff#p42075"
  },
  {
    "author": "shaz29  Guest Posts: 24 Joined: Mon Apr 23, 2007 3:13 pm",
    "title": "[no title]",
    "content": "Thanks doctor, I hope you are right\n\n",
    "posted_time": "Post  by shaz29 » Mon May 07, 2007 5:36 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=42092&sid=d8ced93bef0173d174fd057d02b25aff#p42092"
  },
  {
    "author": "felicia  Guest Posts: 2 Joined: Sat Mar 24, 2007 11:43 pm",
    "title": "white patches",
    "content": "I am a 25 yr old female.  I have noticed white growth patches in my inner lip and cheeks.  I doesn't hurt.  I am able to bit some of it off but it continues to grow back daily.  I try to brush my teeth to see if it will come off while brushing but that doesn't work.\n\n",
    "posted_time": "Post  by felicia » Thu Mar 29, 2007 7:06 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=40163&sid=d8ced93bef0173d174fd057d02b25aff#p40163"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "It sounds as if you may have thrush.  This typically takes an antifungal medication such as nystatin to clear up.  I would recommend that you see your doctor.  There are a few other possibilities.  If it is thrush you should have some immune system testing as occasionally thrush in adults is a signal of immunocompromise.  (I do not mean to alarm you as this is not a definite thing.)  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sun Apr 01, 2007 9:58 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=40342&sid=d8ced93bef0173d174fd057d02b25aff#p40342"
  },
  {
    "author": "worried123  Guest Posts: 6 Joined: Thu Feb 22, 2007 8:16 pm",
    "title": "jaw \"pops\" when I yawn",
    "content": "20 Male  Recently I noticed that whenever I yawn, my jaw makes a \"popping\" noise. It doesn't hurt, it just feels kind of odd. Should I worry about this?\n\n",
    "posted_time": "Post  by worried123 » Thu Mar 01, 2007 7:45 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=39120&sid=d8ced93bef0173d174fd057d02b25aff#p39120"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "This is a fairly common thing, although most people never really notice it.  It is likely that you are feeling a little snapping of one of the ligaments or tendons in the area.   As long as you are not having pain it is not concerning.  If you do start having pain I would recommend that you see your doctor for an evaluation.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Fri Mar 02, 2007 11:19 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=39131&sid=d8ced93bef0173d174fd057d02b25aff#p39131"
  },
  {
    "author": "zena21  Guest Posts: 6 Joined: Fri Dec 09, 2005 10:45 pm Location: canada",
    "title": "gray/blueish growth on gums",
    "content": "Hi, Just like about 2 days a go, i realized when brushing my teeth, i had a slight growth on my gums, at the back of my mouth, in the spaces between where the cheeks meet the teeth, i don't have the same thing on the other side, and today i tried to have a look in the mirror and it was greyish/blue. it is not painful, and its not hard mass, its soft. Im not sure what this is, but i scheduled my appointment with my dentist and its not until the 9th of may. I was wondering if a nurse or a Doctor look in to this and let me know if i need to see someone right away. thanks\n\n",
    "posted_time": "Post  by zena21 » Fri Apr 14, 2006 3:25 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=32404&sid=d8ced93bef0173d174fd057d02b25aff#p32404"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi zena21, Aside from bleeding gums when brushing your teeth, another sign of peridontal disease is soft, bluish discolorations noticed on the gums. I would strongly suggest that you keep your dental appointment so that the cause of the discoloration can be identified. Sincerely, Theresa Jones, RN\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Tue Apr 25, 2006 6:52 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=32452&sid=d8ced93bef0173d174fd057d02b25aff#p32452"
  },
  {
    "author": "johnhelp  Guest Posts: 3 Joined: Tue Jan 23, 2007 7:38 pm",
    "title": "I hope a simple Question",
    "content": "25,male healthy Ok here  the Question I have a grown on both my cheeks on the same spot in my mouth. one seem to be a lil swollen and  tender right now. just want to know is this normal and when I open my cheeks wide to see them they kinda move like fingers are something to that affect. just want your take on it  thanks. hope Im not a alien LOL ps that one is really sore\n\n",
    "posted_time": "Post  by johnhelp » Wed Feb 28, 2007 1:10 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=39060&sid=d8ced93bef0173d174fd057d02b25aff#p39060"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "What you may be seeing is the opening of your parotid salivary gland into your mouth.  There is one on each side and are generally located about half way back on the cheek just above the middle.  When you are at your dentist or doctor have them take a look.  They should be able to tell you for sure.  Hope this helps.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Wed Feb 28, 2007 9:20 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=39098&sid=d8ced93bef0173d174fd057d02b25aff#p39098"
  },
  {
    "author": "jypsy_rose_lee  Guest Posts: 17 Joined: Sat Jan 14, 2006 9:47 pm Location: Missouri",
    "title": "Denal care before stemcell transplant:",
    "content": "I am due to have a stemcell transplant.I am in between dentists right now,so my new oncoligist sent me to an oral surgaen who works in their building.I told him I wasn't having any problems with my teeth.The surgean took xrays of my teeth and told me that 18 that had decay plus my good ones had to come out.I told him I do not want them takin out at all!He said if I didn't I couldn't have my autologous transplant using my own stemcells.The surgean hasn't even consulted my stemcell doctor about this,he just kept telling me they have to come out or no transplant.I feel backed up against the wall.I called the stemcell transplant floor at the hospital that I am having the transplant done at and they said that they keep pateints on around the clock antibiotics and other antimicrobial drugs. I have had quite a bit if work done to my teeth awhile back.My teeth aren't lose or falling out.He isn't in the bussiness to repair teeth only maxifacial surgery and remove teeth.I'm wondering if this may have something to do with why he wants to just pull them all out.I'v talked to others who have had transplants and they said that they still have their teeth and they were pretty bad during transplant. Thank you for any information or advice.\n\n",
    "posted_time": "Post  by jypsy_rose_lee » Thu Mar 23, 2006 12:47 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=32140&sid=d8ced93bef0173d174fd057d02b25aff#p32140"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi jypsy_rose_lee, Optimal periodontal health prior to your stem cell transplant is very important in eliminating possible sources of dental infection. However, I would strongly encourage you to contact the physician whom is going to be performing the transplant and request an evaluation by another dental specialist.  Sincerely, Theresa Jones, RN\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Fri Mar 24, 2006 5:25 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=32148&sid=d8ced93bef0173d174fd057d02b25aff#p32148"
  },
  {
    "author": "jypsy_rose_lee  Guest Posts: 17 Joined: Sat Jan 14, 2006 9:47 pm Location: Missouri",
    "title": "Dental care before transplant:",
    "content": "Dear Theresa,                        Thank you for your response,I am looking to find another dentist.\n\n",
    "posted_time": "Post  by jypsy_rose_lee » Mon Mar 27, 2006 10:05 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=32205&sid=d8ced93bef0173d174fd057d02b25aff#p32205"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi jypsy_rose_lee, Our best wishes and I hope you will consider posting an update when your time permits. Sincerely, Theresa Jones, RN\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Tue Mar 28, 2006 5:08 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=32209&sid=d8ced93bef0173d174fd057d02b25aff#p32209"
  },
  {
    "author": "rsmo77  Guest Posts: 1 Joined: Thu Oct 28, 2004 3:32 pm Location: Florida",
    "title": "Chapped Lips?  Bumps",
    "content": "Its been a week and I had this one bump on my upper lip, it was also on my lower lip but alot smaller with a white dot.  The bump on the lower lip hurt everytime I smiled and I thought it would be chapped lips.  Then the upper lip got a lil bigger and its been there ever since, now it looks like its moved to the other side of my upper lip.  There is no puss or any fluid inside, it is just a bump.  I've used chapstick medicated to see if that would help but it seems like its taken too long to get rid of.  What could it be?\n\n",
    "posted_time": "Post  by rsmo77 » Thu Oct 28, 2004 3:39 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6134&sid=d8ced93bef0173d174fd057d02b25aff#p6134"
  },
  {
    "author": "Game Over  Guest Posts: 3 Joined: Tue Oct 26, 2004 6:43 pm Location: United States of America",
    "title": "[no title]",
    "content": "My sister actually had a condition like that just a week ago, medicines do work, but usually just num it for a while but don't get rid of it, try staying away from warm foods and drinks even know it is freezing outside, try drinking and eating more cool foods, watermelon is especially helpful\n\n",
    "posted_time": "Post  by Game Over » Thu Oct 28, 2004 7:31 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6149&sid=d8ced93bef0173d174fd057d02b25aff#p6149"
  },
  {
    "author": "angelstation65  Guest Posts: 1 Joined: Sun Jan 22, 2006 3:42 pm Location: Oregon",
    "title": "Lip Bumps",
    "content": "I just started coming down with these translucent bumps on my lower lip. It started out just as a sore from having chapped lips, then it turned into multiple little clear liquid holding bumps. I don't know what they are and I don't know what to do about them. I would like to find a way to get rid of them because in my job I work around a lot of people. I don't want to weird them out or have to worry about the way I look. Does anybody have any pointers?\n\n",
    "posted_time": "Post  by angelstation65 » Sun Jan 22, 2006 3:46 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=28953&sid=d8ced93bef0173d174fd057d02b25aff#p28953"
  },
  {
    "author": "rc_woods  Guest Posts: 1 Joined: Tue Jun 17, 2003 5:41 pm Location: Canada",
    "title": "bad taste in mouth",
    "content": "Hi. For about the past week, off and on I have noticed an unpleasant taste in my mouth. Sometimes it appears more when I swallow, but normally I just notice it whenever. I've tried brushing my tongue, mouthwash, and of course brushing my teeth but nothing has gotten rid of it COMPLETELY. It does seem to have lessened the past 2 days. Is it some type of infection perhaps? I'd like any possible help. Thanks!\n\n",
    "posted_time": "Post  by rc_woods » Tue Jun 17, 2003 5:44 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=985&sid=d8ced93bef0173d174fd057d02b25aff#p985"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "Bad taste",
    "content": "Dear rc_woods, Does this bad taste bare any relation to your wisdom tooth extraction? If not then it could be an infection. The infection doesnt have to be in the mouth, it could also be in the gut or in the nose. It could be psychological. Taste is a complex sense that is composed of many elements (taste buds, smell, mental interpretation). Do you have any other complaints?\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Tue Jun 17, 2003 6:02 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=986&sid=d8ced93bef0173d174fd057d02b25aff#p986"
  },
  {
    "author": "concernedpatient  Guest Posts: 1 Joined: Tue Aug 03, 2004 3:50 am Location: USA  Contact:   Contact concernedpatient       AOL",
    "title": "I am having similar issues",
    "content": "I am also getting that same bad taste. It taste really bad. Its not a bitter taste, its more like a \"I've been eating pig intestines\" kind of taste. I don't know what could be the matter.\n\n",
    "posted_time": "Post  by concernedpatient » Tue Aug 03, 2004 3:55 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=4354&sid=d8ced93bef0173d174fd057d02b25aff#p4354"
  },
  {
    "author": "Aaron  Guest Posts: 1 Joined: Thu Jan 20, 2005 5:19 pm Location: Dallas, TX  Contact:   Contact Aaron       Yahoo Messenger   AOL",
    "title": "bad taste in mouth",
    "content": "I've had a nasty taste in the back of my mouth for a few days now, and it's nasty as can be.  It tastes like the rotten skin that was around my molar when i had it removed.  I brush my teeth on a regular basis, and the taste comes from the back of my throat.  What could this be, and how can i get rid of it?  please help.\n\n",
    "posted_time": "Post  by Aaron » Thu Jan 20, 2005 6:05 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8365&sid=d8ced93bef0173d174fd057d02b25aff#p8365"
  },
  {
    "author": "missems01  Guest Posts: 1 Joined: Fri Jan 13, 2006 1:17 pm Location: nc",
    "title": "gross taste",
    "content": "I had just got my wisdom teeth out about a week ago. Now I am having this gross taste that I have never tasted before. It comes and it goes. I called my oral surgeon and he said that it is were food is getting stuck in the holes left from the surgery. To solve this he said to take a syringe,  put warm salt water in it and flush out the holes in the back of the mouth. I havent tried yet. Maybe this would work for others too\n\n",
    "posted_time": "Post  by missems01 » Fri Jan 13, 2006 1:28 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=28317&sid=d8ced93bef0173d174fd057d02b25aff#p28317"
  },
  {
    "author": "elliemay  Guest Posts: 2 Joined: Tue Sep 21, 2004 4:49 pm Location: United States",
    "title": "tongue disturbance",
    "content": "Hello,   Can someone please tell me what this is?  For the last several months I have had this strange marking on my tongue.  It doesn't stick up, but it is a different color (red just a bit).  It is on the tip, kind of to the left and in a spiral shape.  It is hard to explain the shape, at first I just thought it was round like a cheerio.  Anyway every couple of weeks it goes kind of numb like I have burned it and I get a real soapy taste in my mouth.  It only lasts a few days and then goes away.  Does anyone have any ideas????  Thanks in advance.\n\n",
    "posted_time": "Post  by elliemay » Tue Sep 21, 2004 5:01 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5482&sid=d8ced93bef0173d174fd057d02b25aff#p5482"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Tongue disturbance",
    "content": "Dear Elliemay,  i think that this could be part of the normal degeneration and regeneration of the tongue but a little bit too fast.   On the other hand, it could be abnormal. i recommend that you pay a visit to your doctor to take a look at it when it is at its peak.  This could be either an abnormal exaggeration of the normal degeneration and regeneration of the tongue or could be a fungal infection even though the description is a little atypical.  Do you have any sharp tooth that is constantly rubbing against this part of your tongue and be the cause of this reaction by causing continuous irritation of the tongue at this specific point? This could the culprit.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Tue Sep 21, 2004 7:05 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5485&sid=d8ced93bef0173d174fd057d02b25aff#p5485"
  },
  {
    "author": "elliemay  Guest Posts: 2 Joined: Tue Sep 21, 2004 4:49 pm Location: United States",
    "title": "[no title]",
    "content": "Thank you Dr. Mokhtar,   I had no idea that the tongue had degeneration and regeneration phases.   That is interesting.  I have tried to research my issue on the internet and I don't really know what to look for.  I would like to see some images of other \"tongue disturbances\" to compare.  I do not have any teeth that constantly touch the area.  It is on the left side of the tip of my tongue about the circumfrance of a dime.  If you can picture a line a bit line thicker than thread that makes an incomplete circle.  That would be what it looks like.  It is baerly raised to where sometimes I don't think it is at all, but I can still tell that it is there because it has a type of sensation like it was burnt, but w/o pain.  Do you know what kind of doctor I should see?  I do not have a primary.  Also you mentioned that it could be a fungal infection.  Can you get ringworm on your tongue.  It possibly looks like that.  I have had ringworm several times.  I get it easily.    Thanks again in advance.\n\n",
    "posted_time": "Post  by elliemay » Wed Sep 22, 2004 9:03 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5495&sid=d8ced93bef0173d174fd057d02b25aff#p5495"
  },
  {
    "author": "jada  Guest Posts: 1 Joined: Mon Jan 31, 2005 10:09 am Location: Tennessee",
    "title": "[no title]",
    "content": "Hi,  Like elliemay, I have been searching the internet for my symptoms--and elliemay's come as close as anything I've seen.  I moved into a new house about a year ago, and at first I thought I was having allergic symptoms to the house--but there was no itchy eyes or sneezing.  The main symptom was this numb / burned feeling on my tongue, accompanied by a few red marks on the tongue--and like elliemay, occasionally a circular red mark on the tip (about the size of a dime) and a soapy taste in my mouth.  In addition, I feel dizzy (actually wobbly, not just lightheaded) a lot.  Also, my tongue sensation is almost daily, not every few weeks or months.  So, I would be interested to know whether elliemay was diagnosed and treated (or cured!). Or does anyone have any other suggestions for what this might be?  (FYI, I am also an insulin-dependent diabetic.)  Thanks for any and all help (and thank you, elliemay, for letting me know I'm not the only one with this weird tongue sensation!!).\n\n",
    "posted_time": "Post  by jada » Mon Jan 31, 2005 10:27 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8764&sid=d8ced93bef0173d174fd057d02b25aff#p8764"
  },
  {
    "author": "rozebud  Guest Posts: 1 Joined: Thu Dec 29, 2005 3:27 am Location: ccccccccc",
    "title": "Metal Taste",
    "content": "Hi Can anyone help me please,I went to the dentist to make a filling and the dentist said to me to have my wisdom tooth out and I said ok so two week after I had my filling I went in to have my wisdom tooth out, I was in pain after but thats not why Im writing here two weeks after that my toung was stinging and burning so I went to the dentist and he said all ok, but I was not so happy about that so I went to the Dr and he said I had a virous so he gave me this stuff to paint my tounge the burning has gone but now I feel the side of my toung not write feels a bit swallen as my speech is not all the same and I have this metal taste.I am a person that looks after my self.and I ahve been taking care of cleaning my teeth 3 times a day + mouth wash and also been doing salt and water rinse too.Do I go back to the Dr or the dentist.I have been with these mough problems for the past 6 week from when i took my wisdom tooth out. Thanks In Advance\n\n",
    "posted_time": "Post  by rozebud » Thu Dec 29, 2005 3:45 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=27346&sid=d8ced93bef0173d174fd057d02b25aff#p27346"
  },
  {
    "author": "HARTunderATTACKxx  Guest Posts: 1 Joined: Tue Dec 06, 2005 11:16 pm Location: Colorado",
    "title": "IM SCARED ABOUT MY LIP PIERCING",
    "content": "About 2 weeks ago to this day I pierced my own lip. At first it didn't go all the way through and I just developed a bump on the inside of the left side of my mouth. I was told that since I did it with a safety pin that there would be a scar left so I just decided to push it all the way through. Then without expecting it, I felt something rubbing hard against my gums and I found out that on its own the back of the earring had gone all the way through. I put a back on it and really liked it. About two days ago, the whole closed up and I started trying to reopen it. Now it is all the way through again, but I have a millimeter size circle surronding the hole where the piercing went in and its red and blue. On the inside of my mouth is a circle where skin has been removed and the exiting hole in the middle. Just like on the outside. I take the earring out at night because it hurts too much to keep it in and every morning I put it back in. It hurts from the my bottom teeth right to the hole for a moment and then goes away until I ethier hit it or play with it. Im scared to know if its infected because my parents don't know. I really like it, but I'm willing to take it out if it's going to cause health problems. I am also bulimic and that is probably affecting it too. I just need to know which would be a safer thing to do. I'm keeping it clean by disinfecting it 3 times a day using disinfectant and also washing my mouth out with saltwater. Anything would help me out a lot??  :lol:\n\n",
    "posted_time": "Post  by HARTunderATTACKxx » Tue Dec 06, 2005 11:56 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=26299&sid=d8ced93bef0173d174fd057d02b25aff#p26299"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi HARTunderATTACKxx, Piercings done without a sterile procedure are even more susceptible to infection. The appearance of blue may be a  result of bruising and the redness may be either irritation or infection. I am quite sure that even though you are attempting to \"hide\" this from your parents they probably already at least suspect that you have done this just by the appearance on your lip. I would suggest that you remove the piercing and if you like it as much as you say you do, talk it over with your parents and if they are agreeable have it done by a professional. Keep in mind that if they adamantly refuse you doing so they are only trying to do what is best for you. Now, my concern for you is that you stated that you are bulimic. Eating disorders (Bulimia) are very dangerous. Do you realize the consequences of having this disorder? Medical conditions that may result from this condition include erosion of tooth enamel, electrolyte imbalances, (which if are severe enough may cause death), irregular heart rhythms, (severe cases may result in heart attack and possible death), rupture of the esophagus or stomach, etc. etc. I would strongly suggest that you seek treatment for this disorder. Sincerely, Theresa Jones, RN\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Thu Dec 08, 2005 4:56 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=26354&sid=d8ced93bef0173d174fd057d02b25aff#p26354"
  },
  {
    "author": "anzac  Guest Posts: 2 Joined: Tue Apr 19, 2005 1:00 am Location: Sydney",
    "title": "Lip piercing + Braces.",
    "content": "G'day. im a 16 year male with braces and im wanting to get my lip pierced. I was wondering if it possible to get my lip peirce with a ring not a stud, and still have my braces on and with out them rubbing against each other?   Also people say with oral piercings there is a chance of it rubbing against your gum line and over time it can receed.....true? but it is mostly said with studs.....what about rings?   i had some advice stating * a ring would be better for me because it wouldnt rub the braces*.  please i need some help.  cheers\n\n",
    "posted_time": "Post  by anzac » Tue Apr 19, 2005 6:34 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=12588&sid=d8ced93bef0173d174fd057d02b25aff#p12588"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi anzac, According to documented literature lip or tongue piercing may cause recession of gums regardless of whether studs or rings are used. The problem is essentially aimed at long term wearers and if taken out at night along with proper dental care reduces complications. I certainly hope you have discussed this with your dentist. Sincerely, Rntdj\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Wed Sep 28, 2005 6:53 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=21786&sid=d8ced93bef0173d174fd057d02b25aff#p21786"
  },
  {
    "author": "tinksplace  Guest Posts: 15 Joined: Sat Apr 02, 2005 4:48 pm Location: l.a",
    "title": "my mouth hurts. *wails*",
    "content": "my mouth hurts  right at the back along the left side. lower down. i think its one of my wisdom teeth   .i had a wisdom tooth come through 2-3 years ago and now again. i wonder if its inflamed. i was going to go to the ucla dentsit school i hope they are free or can bill me as i have little money as it is  . i might after that take out dental insurance.is ther somewhere in west l.a i can go to be seen i am taking painkillers every 4 hours cosits hurting. *cries* anyone know? when  i take  painkillers its stops hurting as much.  even so its a bummer and all i need right now.   do wisdom teeth come once every 2 years till they are thru??.not sure what to do.i don't have any id as i lost my passport. i live in l.a but i am british.  [im trying to replace it]   _________________\n\n",
    "posted_time": "Post  by tinksplace » Mon Jul 18, 2005 3:23 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=16990&sid=d8ced93bef0173d174fd057d02b25aff#p16990"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi tinksplace, Wisdom teeth may cause a considerable amount of pain especially if there isn't enough room for them or if they are incorrectly angled/ impacted. Most larger universities have schools of dentistry where they can provide low cost or free dental treatment. I certainly hope that you have had an evaluation. Sincerely, Rntdj\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Wed Sep 28, 2005 6:42 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=21785&sid=d8ced93bef0173d174fd057d02b25aff#p21785"
  },
  {
    "author": "agentyandu  Guest Posts: 3 Joined: Mon Jan 03, 2005 12:02 am Location: elk grove california",
    "title": "lip piercing",
    "content": "i wanna get my lip pierced i just want to know what is the risk of it. a few of my friends have offered to do it is that safe. they have down it a few times before?\n\n",
    "posted_time": "Post  by agentyandu » Mon Jan 03, 2005 3:29 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=7658&sid=d8ced93bef0173d174fd057d02b25aff#p7658"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Dear agentyandu, Here at The Doctors Lounge, we do not recommend lip piercing. Lip piercing may be associated with several hazards. If you have a bleeding tendency disease that has not been diagnosed yet then you risk bleeding to a dangerous degree. There is always the possibilty of infection at the site of trauma. More dangerously, there is a risk of a slow infection that slowly enters the blood stream and silently causes damage of the heart valves and could later lead to stroke. There are cases 'bacterial endocarditis' that have been recorded after lip piercing.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Mon Jan 03, 2005 8:07 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=7670&sid=d8ced93bef0173d174fd057d02b25aff#p7670"
  },
  {
    "author": "anzac  Guest Posts: 2 Joined: Tue Apr 19, 2005 1:00 am Location: Sydney",
    "title": "re:",
    "content": "G'day. im a 16 year male with braces and im wanting to get my lip pierced. I was wondering if it possible to get my lip peirce with a ring not a stud, and still have my braces on and with out them rubbing against each other?  Also people say with oral piercings there is a chance of it rubbing against your gum line and over time it can receed.....true? but it is mostly said with studs.....what about rings?   Thanks.\n\n",
    "posted_time": "Post  by anzac » Tue Apr 19, 2005 1:04 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=12553&sid=d8ced93bef0173d174fd057d02b25aff#p12553"
  },
  {
    "author": "Acrobat  Guest Posts: 30 Joined: Sat May 29, 2004 11:51 pm Location: Temporarily in Canada",
    "title": "[no title]",
    "content": "wow don't get your friend to do it whatever you do! Someone at school i know had their ear pierced by their friend and it was a right mess.... all swollen up and septic and horrible. Imagine if that was your lip. Atleast he could just put a band aid on it and wait for it to heal.\n\n",
    "posted_time": "Post  by Acrobat » Tue Apr 19, 2005 5:20 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=12562&sid=d8ced93bef0173d174fd057d02b25aff#p12562"
  },
  {
    "author": "BiteMe69  Guest Posts: 1 Joined: Sun Aug 21, 2005 12:12 am Location: Canad",
    "title": "lip piercings",
    "content": "Hey    What will happen if i get my tongue pierced before i get braces...will i have to take out the tongue piercing or will it b okay to kepp it in with braces\n\n",
    "posted_time": "Post  by BiteMe69 » Sun Aug 21, 2005 12:16 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=19162&sid=d8ced93bef0173d174fd057d02b25aff#p19162"
  },
  {
    "author": "okin  Guest Posts: 1 Joined: Sun Mar 02, 2003 3:30 pm Location: Canada",
    "title": "itchy gums",
    "content": "for the last four days my gums have been driving me crazy by itching... i did not burn them or damage them in any way,  if im allergic to something it beats me what it could be...im getting small, barelly visible sores, they itch the most between teeth...if i wash with listerine or brush my teeth it makes it better for a while but as soon as i eat something or just wait half hour they start itching again.... can anyone help me ?\n\n",
    "posted_time": "Post  by okin » Sun Mar 02, 2003 3:38 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=430&sid=d8ced93bef0173d174fd057d02b25aff#p430"
  },
  {
    "author": "reeny  Guest Posts: 1 Joined: Fri Jul 22, 2005 2:09 am Location: michigan",
    "title": "itchy gums",
    "content": "Since I can remember, I've always had itchy gums. Only in certain spots in my mouth though. They feel like mosquito bites and when they itch bad, I scratch & poke them with things. I wake up scratching them in my sleep with my fingernails. I itch them until they bleed and are raw. I have had dental work to fix where I have \"scratched away\" the gums. No doctors or dentists could ever help me.\n\n",
    "posted_time": "Post  by reeny » Fri Jul 22, 2005 2:16 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=17228&sid=d8ced93bef0173d174fd057d02b25aff#p17228"
  },
  {
    "author": "andy_pao  Guest Posts: 1 Joined: Sat Jun 25, 2005 11:59 am Location: Manila, Philippines",
    "title": "Painful lip infection",
    "content": "Hello. I accidentally bit the inside of my upper lip about a week ago, and it developed a white sore after a couple of days. I've tried applying dequalinium chloride solution on it but the sore seems to have worsened, then I tried orally taking antibiotics for three days. Now on the 10th day since the accident, the sore is becoming more painful and doesn't seem to be improving. Even just a drink of water is agonizing. Is there anything  you can recommend? Please help. Thanks.\n\n",
    "posted_time": "Post  by andy_pao » Sat Jun 25, 2005 12:17 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=15814&sid=d8ced93bef0173d174fd057d02b25aff#p15814"
  },
  {
    "author": "stephanie0107  Guest Posts: 12 Joined: Sun Jun 26, 2005 1:18 am Location: United States  Contact:   Contact stephanie0107       AOL",
    "title": "Mouth ulcer",
    "content": "Hello Friend, I hope by now that your symptoms have improved. Due to the fact that it was initiated by trauma, you can pretty much rule out oral cancer. Cold sores (also may be referred to as canker sores or herpes simplex virus of the oral mucosa) should heal within 3-4 wks maximum. If not completely healed within this time frame, you will need to see your physician and have a biopsy (removal of small sample of tissue for analysis). Based on your history, most likely you have a simple mouth ulcer, which can be a  very painful white or yellow open sore that occurs anywhere on the mucous membrane of your mouth. If it developes into a cyst or unbearable swelling, go to your physician. In the meantime, decrease smoking and alcohol intake, maintain oral hygiene as tolerated and Ibuprofen may help to alleviate swelling which will in turn decrease some of the discomfort. Be sure to avoid spicy foods and lean toward bland foods and neutral liquids (water, Gatorade, or 7-Up as tolerated). Also, consider over the counter lidocaine  if available to you or something to that effect (ask the pharmacist or your dentist) if pain is unbearble.  Much luck. LMK how you are doing.\n\n",
    "posted_time": "Post  by stephanie0107 » Mon Jun 27, 2005 8:52 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=15909&sid=d8ced93bef0173d174fd057d02b25aff#p15909"
  },
  {
    "author": "Orc  Guest Posts: 2 Joined: Mon Apr 25, 2005 6:49 pm Location: New York  Contact:   Contact Orc       Yahoo Messenger",
    "title": "Inner right cheek irritation, stiffness",
    "content": "Hello  I’m a 23 year old male without any real bad habits (IE Smoking, drinking) and for the past several weeks I’ve been having an odd sensation on the inside of my right cheek. For awhile the skin inside my cheek felt raised, with a really intense coppery taste. That’s calmed a little, but it still feels ‘weird’ and sometimes the coppery taste goes away but comes back after eating or rubbing the area with my tongue. Sometimes it also feels a bit stiff, I can move it easily enough but the area just feels stiffer on the skin, but when I move it goes away for awhile. Other times it has a rather annoying ‘stinging’ pain sensation, not really terribly painful just really annoying. I’ve looked several times and can’t find anything different in comparison to my other cheek, other then the skin looks slightly more ‘wrinkled’ like the skin of your fingers would look after too much time in the water.  I went to see the dentist for a cleaning little over a week ago and she said she didn’t see anything unusual and that I may have just bit my cheek. But I’ve bit my cheek before and I can’t recall the symptoms lasting this long or being this irritating. I’m really scared it might be something serious, though I may be panicking over nothing I’d really rather be sure what it is and what I could do to help it. Any help would be greatly appreciated, thank you.\n\n",
    "posted_time": "Post  by Orc » Mon Apr 25, 2005 7:03 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=12918&sid=d8ced93bef0173d174fd057d02b25aff#p12918"
  },
  {
    "author": "Orc  Guest Posts: 2 Joined: Mon Apr 25, 2005 6:49 pm Location: New York  Contact:   Contact Orc       Yahoo Messenger",
    "title": "[no title]",
    "content": "well,it's still irritating me...I don't know what it is, I thought it might be a canker sore but I read up on those a little and the symptoms didn't really match, least the visual. The skin little all rippled and somewhat 'cracked' almost but the edges are smooth. It's really worrying me I don't know what it could be but it burns and stings sometimes and as careful as I am brushing and eating it doesn't seem to want to go away\n\n",
    "posted_time": "Post  by Orc » Mon May 02, 2005 4:36 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=13276&sid=d8ced93bef0173d174fd057d02b25aff#p13276"
  },
  {
    "author": "aprillm  Guest Posts: 1 Joined: Fri Dec 10, 2004 1:56 pm Location: Michigan",
    "title": "huge lip problem!",
    "content": "Yesterday morning, i woke up with a pain in my bottom lip, i looked in the mirror and only the left half of my bottom lip is swollen and it has a few of these boil type things on it, that are white colored, through out yesterday the lip just got more swollen and the boil things grew in size.. so i put zinc oxide on it and medicated chapstick, this morning i woke up and  still only the left side was HUGE.. and the boils were bigger too, but now they are yellow colored and it has like spread to a little below my lip onto my skin right under the lip just a little... please, im very scared and its very painful... thank you for any advice you could give me!!! please!.\n\n",
    "posted_time": "Post  by aprillm » Fri Dec 10, 2004 3:56 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6977&sid=d8ced93bef0173d174fd057d02b25aff#p6977"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Huge lip problem!",
    "content": "Dear April,  What you describe sounds like a simple herpes lip infection or shingles of the lip.   i think that if you try abreva it might disappear faster.  There is another possibility, that this might a side effect of a new medicine that you started taking recently, but this is a remote possibility as usually this develops faster than that and does not affect only one half of the lip.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.  Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Sat Dec 11, 2004 11:00 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6995&sid=d8ced93bef0173d174fd057d02b25aff#p6995"
  },
  {
    "author": "waqas  Guest Posts: 1 Joined: Mon Mar 28, 2005 2:34 pm Location: NY",
    "title": "Lip Problem!!!!!!!Please help",
    "content": "Hi, I also have this lip problem since my childhood. When I talk my bottom lip from the right side goes down....................I don't know what to do about it.... If any suggestions like medications or some excercises that can have my bottom lip straight would be really appreciated. Please help me with this matter.   Regards\n\n",
    "posted_time": "Post  by waqas » Mon Mar 28, 2005 2:38 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=11496&sid=d8ced93bef0173d174fd057d02b25aff#p11496"
  },
  {
    "author": "sylvia_c  Guest Posts: 1 Joined: Sat Feb 26, 2005 3:19 pm Location: Canada",
    "title": "salty taste in mouth",
    "content": "I have had a salty taste in my mouth for about 6 weeks. About 4 weeks ago I lost about 90 percent of my  sense of smell and sense of taste, which I am assuming has to do with the salty taste.  The only medication I am on is synthroid for hypothyroidism which has been stable for many years. My doctor has not been able to diagnos this. I have had a head xray for sinus problems, and a CT scan for brain tumor both of which turned out clear and negative.  I would appreciate any information or help on this subject.\n\n",
    "posted_time": "Post  by sylvia_c » Sat Feb 26, 2005 3:32 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=10001&sid=d8ced93bef0173d174fd057d02b25aff#p10001"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi sylvia_c, Apparently sinus disorders and any sort of brain lesion have been ruled out as causative factors, and this symptom is not generally a side effect of synthroid. The sense of smell and taste are very closely related and dysfunctions may have many causes, from recent infections, dehydration, smoking, vitamin deficiencies (B12 specifically), mineral deficiencies, etc. Have you had a recent dental exam to rule out any disorders? If you have had a dental exam then I would consider one of the other above problems. Sincerely, Rntdj\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Sun Feb 27, 2005 5:07 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=10025&sid=d8ced93bef0173d174fd057d02b25aff#p10025"
  },
  {
    "author": "mhaelal  Guest Posts: 1 Joined: Tue Feb 22, 2005 9:59 pm Location: san diego",
    "title": "SWEET MOUTH TASTE",
    "content": "Few days ago i start having very sweet taste in my mouth. I don't feel sick or anything.I am 112pounds,5'3'',exercise,eat1200calorie and drink 64 onces water a day.The only think i did, i was taking few days ago couple celebrex pills for my right arm pain.Also i like to mention that for a month i was having 6to 8 cloves of garlic with every dinner meal.Can any of those things be the problem?Please let me know what to do. I am concern.Thank you.\n\n",
    "posted_time": "Post  by mhaelal » Tue Feb 22, 2005 11:20 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=9839&sid=d8ced93bef0173d174fd057d02b25aff#p9839"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi mhaelal, Celebrex nor garlic probably should not leave a sweet taste in your mouth. With the absence of any infection, do you have a fruity breath odor? Have you had any excessive thirst or frequent urination? Some of these symptoms may be a sign of diabetes. In my opinion an endocrine or metabolic disorder is one of the first things I would consider with the above symptoms in the absence of any infection etc. Sincerely, Rntdj\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Wed Feb 23, 2005 8:31 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=9852&sid=d8ced93bef0173d174fd057d02b25aff#p9852"
  },
  {
    "author": "concerned05  Guest Posts: 1 Joined: Fri Feb 11, 2005 1:21 pm Location: Raleigh, NC",
    "title": "I need some guidance",
    "content": "I have been having tingling in the left side of my head for a few years now.  It started out very small and would not happen often.  I thought it was due to an abcess that I had. I took care of that and extracted the tooth but now the tingling is worse.  It travels to my neck and behing my eye and it causes my mouth to salivate but only on one side.  I can also feel it in my left breast. It is hard to sleep at night. I cannot lay on my left side because of the discomfort.  I cannot say that it effects my sight because my vision is not that great anyway.  I have asked my doctor but it has been passed over. Someone please help me to figure what is happening. Thanks\n\n",
    "posted_time": "Post  by concerned05 » Fri Feb 11, 2005 1:30 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=9259&sid=d8ced93bef0173d174fd057d02b25aff#p9259"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi concerned05, Have you ever had any diagnostic studies to evaluate for any type of nerve compression? If not I would suggest you discuss this with your physician. Sincerely, Rntdj\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Sat Feb 12, 2005 10:50 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=9315&sid=d8ced93bef0173d174fd057d02b25aff#p9315"
  },
  {
    "author": "Sandy1000  Guest Posts: 2 Joined: Wed Feb 09, 2005 2:36 pm",
    "title": "Is this possible?",
    "content": "Is it possible to bite your tongue while simply eating to the extent a chunk of the tongue is torn out.  The injury is  one quarter inch away from the edge to the  middle of the tongue, in the back (if you stick out your tongue all the way, the injured area would touch the front teeth), and does not penetrate the underside of the tongue.\n\n",
    "posted_time": "Post  by Sandy1000 » Wed Feb 09, 2005 2:59 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=9120&sid=d8ced93bef0173d174fd057d02b25aff#p9120"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Hello Sandy, I don't quite get the picture here. Did this injury actually happen? It seems unlikely.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Wed Feb 09, 2005 4:17 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=9123&sid=d8ced93bef0173d174fd057d02b25aff#p9123"
  },
  {
    "author": "Sandy1000  Guest Posts: 2 Joined: Wed Feb 09, 2005 2:36 pm",
    "title": "[no title]",
    "content": "The injury really did happen, the emergency room doctor provided 2 stitches.  It was actually worse than I could describe.  I just don't beleive it could have happened while eating.\n\n",
    "posted_time": "Post  by Sandy1000 » Wed Feb 09, 2005 5:13 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=9126&sid=d8ced93bef0173d174fd057d02b25aff#p9126"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Hello Sandy1000, I personally have not seen any cases like that. It is known to happen during epileptic fits and other seizure conditions but I have never heard of it happening during eating. Theoretically its possible.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Thu Feb 10, 2005 3:51 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=9200&sid=d8ced93bef0173d174fd057d02b25aff#p9200"
  },
  {
    "author": "mitch1973  Guest Posts: 1 Joined: Thu Jan 06, 2005 9:21 pm Location: florida",
    "title": "Dry mouth/eyes",
    "content": "Started about a week ago right about the time we turned on the heating system at our new rental house. At first I had excessive thirst, would always be thirsty no matter how much I drank...there was always a feeling of a parched mouth. After about 3 days of drinking tons of water, soda. milk whatever I decided that maybe it was the sugar in all those drinks that was making my dry mouth worse...ao I switched to nothing but seltzer water about a gallon of it a day with maybe a pint or 2 of water during the day. I did this for 2 days and it gave me massive acid relux for which I took pepcid complete to get rid of it (I am still taking this). At this time I began to realize that I wasn't really thirsty..My stomach felt like it was packed with water (which is pretty much all I drink now) I figured It was the dry mouth that was making me think I was thirsty.  Anyways here I am 2 days later, still have a very dry mouth and now my eyes are starting to get slightly dry. I drink nothing but water and the occasional cup of caffine free root beer and the occasional glass of milk. My appetite is low as I have a hart time chewing, so I'am relegated to weak stews and soups. Also I havent turned on the heater in our home since the day after I got the dry mouth. ..so its been almost a week with no heater.  Any help will be greatly appreciated\n\n",
    "posted_time": "Post  by mitch1973 » Thu Jan 06, 2005 9:41 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=7850&sid=d8ced93bef0173d174fd057d02b25aff#p7850"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi mitch1973, In my opinion the heating in your home and your symptoms may be a coincidence, especially since they are persisting even though you are not using your heat. My first thought when there is a complaint of unquenchable or unusual  thirst is symptoms of diabetes. Some of the symptoms of diabetes are: unusual thirst, excessive hunger,frequent urination, unusual weight loss, extreme fatigue or lack of energy, blurred vision, frequent or recurring infections,cuts and bruises that are slow to heal, tingling &/or numbness in hands &/or feet etc. I would strongly suggest an evaluation to rule this out, as well as any other anomolies. Sincerely, Rntdj\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Mon Jan 10, 2005 8:26 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=7969&sid=d8ced93bef0173d174fd057d02b25aff#p7969"
  },
  {
    "author": "angelof2005  Guest Posts: 1 Joined: Thu Jan 06, 2005 5:25 pm Location: England",
    "title": "Lips",
    "content": "Hi.I do not want surgery or anything i am 15 years old. I want advice. For years i have had an extra bit of skin on my top lip at the bottom. Some people have noticed it, if you look a lot at my face you will of course see it. I have had it about 4 years now. Is there any advice you could give me to get rid of it and have 'normal' looking lips.It makes me very self aware.\n\n",
    "posted_time": "Post  by angelof2005 » Thu Jan 06, 2005 5:33 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=7842&sid=d8ced93bef0173d174fd057d02b25aff#p7842"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi angelof2005, If you don't want any sort of surgical intervention one may use make up etc. to disguise any physical imperfections. The important thing to keep in mind is that true beauty comes from within. We all have some sort of physical imperfections. Sincerely, Rntdj\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Sun Jan 09, 2005 6:16 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=7926&sid=d8ced93bef0173d174fd057d02b25aff#p7926"
  },
  {
    "author": "DonnaRae  Guest Posts: 1 Joined: Thu Dec 23, 2004 1:16 am Location: spokane, wa",
    "title": "Salty taste",
    "content": "I have for the past month had a bad taste in my mouth and it also seems salty.  When I touch the sides of my mouth with my tongue it seems salty.  It is almost like it excretes in a large amount off and on.\n\n",
    "posted_time": "Post  by DonnaRae » Thu Dec 23, 2004 1:25 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=7282&sid=d8ced93bef0173d174fd057d02b25aff#p7282"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "What you are experiencing is an abnormal sensation in the tongue. Most of the authorities associate taste and smell together all the time so what you might think is related to taste could actually be related to smell.   Taste and smell dysfunctions have several causes  1. Common cold and influenza.  2. Nose and throat infections.  3. Dry mouth.  4. Smoking (especially pipe). Do you smoke?  5. Vitamin B-12 or mineral (like zinc) deficiency.  6. Gingivitis. 7. Drug side effects such as antithyroid drugs, captopril, griseofulvin, lithium, penicillamine, procarbazine, rifampin, vinblastine, or vincristine.  8. Sjogren's syndrome (Dry mouth and eyes associated with some autoimmune diseases).  9. Bell's palsy (Paralysis of the nerve going to the face causing facial droop). Does not sound like it in your case.  10. Here's one more really unlikely possibility: Since sensation ultimately resides in the brain, the problem could be upstairs. Migraine, epilepsy and brain tumor all come to mind, but each of these would be exceptionally rare explanations for your problem.  I would advise you to see your doctor and have an examination of the nerves of your face, nose, ears, throat and tongue if your symptoms persist or worsen, or if your symptoms appear to be associated with other unusual symptoms.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Fri Dec 24, 2004 5:04 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=7335&sid=d8ced93bef0173d174fd057d02b25aff#p7335"
  },
  {
    "author": "Woody  Guest Posts: 2 Joined: Sun Dec 12, 2004 12:41 pm Location: Norwalk, CT",
    "title": "Salty Taste in Mouth",
    "content": "I had a root canal in my lower right molar 4 weeks ago (only the first half of it was done).  The dentist gave me penicillan.  I took two the first day and the 2nd day I got a terrible taste of medicine in my mouth so I threw it out.  Since then, I've had a horrible medicine taste until a couple of days ago, it changed to a salty taste.  The dentist says its not the tooth.  My doctor said he didn't know what it was.  Its driving me nuts.  It feels like its leaching out of my gums but my tongue and lips are salty too now.  Do you have any suggestions or could you tell me what kind of doctor to go to?\n\n",
    "posted_time": "Post  by Woody » Sun Dec 12, 2004 12:47 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=7019&sid=d8ced93bef0173d174fd057d02b25aff#p7019"
  },
  {
    "author": "Dr. Russell M  Medical Doctor Posts: 650 Joined: Mon Jun 09, 2003 12:34 pm Location: USA",
    "title": "[no title]",
    "content": "Hi!  A peculiar taste is part of the side-effect profile of your drug Elavil, though I would not know how that can be related to your circumstance of tooth removal and subsequent medications. Sorry I don't think I could be of more help here.  bill\n\n",
    "posted_time": "Post  by Dr. Russell M » Wed Dec 15, 2004 11:11 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=7085&sid=d8ced93bef0173d174fd057d02b25aff#p7085"
  },
  {
    "author": "leanne  Guest Posts: 1 Joined: Thu Nov 18, 2004 4:55 pm Location: us",
    "title": "swollen cheek",
    "content": "Went to the dentist May 2005 then sometime this summer I woke up with a very swollen cheek.  So I returned to the dentist thinking related to teeth and had xrays that found nothing. I don't remember though if xrays were done on opposite side of mouth and this is the side that I do have a tooth that I worry about.  I had taken meds that I had at home from having a wisdom tooth removed that became infected.  Only because she wasn't able to get me in that day.  So I thought after it cleared up I thought it must have been related to a cold I had had.  Now the same cheek is swollen again when I woke this morning.  After doing a search what has me afraid is could this be  Lupus related ?  Which I have been told I do not have and don't want to think this but I don't know what is going on.\n\n",
    "posted_time": "Post  by leanne » Thu Nov 18, 2004 5:18 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6525&sid=d8ced93bef0173d174fd057d02b25aff#p6525"
  },
  {
    "author": "Dr. Russell M  Medical Doctor Posts: 650 Joined: Mon Jun 09, 2003 12:34 pm Location: USA",
    "title": "[no title]",
    "content": "Hi!  I am not aware of swollen cheek to be primarily indicative of lupus. I would be interested in your research that indicated so.  bill\n\n",
    "posted_time": "Post  by Dr. Russell M » Mon Nov 29, 2004 12:23 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6751&sid=d8ced93bef0173d174fd057d02b25aff#p6751"
  },
  {
    "author": "EMO25  Guest Posts: 1 Joined: Sat Oct 23, 2004 12:21 pm Location: louisiana",
    "title": "Under my tongue",
    "content": "for the past few days every time i would move my tongue around inside my mouth and the underside of my tongue slides on my teeth i would feel a slight sting. every time this would happen i would just blow it off and not think twice but this morning i got sick of it and looked under my tongue and i saw two rows of soft spiky looking things going down the underside of my tongue. every time i touch them it hurts I have no idea what they can possibly be. Please someone help me. will it go away???????? its very noticable\n\n",
    "posted_time": "Post  by EMO25 » Sat Oct 23, 2004 12:27 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6031&sid=d8ced93bef0173d174fd057d02b25aff#p6031"
  },
  {
    "author": "Dr. Russell M  Medical Doctor Posts: 650 Joined: Mon Jun 09, 2003 12:34 pm Location: USA",
    "title": "[no title]",
    "content": "Hi!  I cannot make out what goes on under your tongue without an examination. Nevertheless, as a household remedy, one may begin saline mouth wash (high concentration common salt in water), and maintain oral hygeine. If quite painful, over-the-counter oral anesthetic gels are available for temporary relief. But as always, it is best to consult your doctor for definite advice.  bill\n\n",
    "posted_time": "Post  by Dr. Russell M » Sun Oct 24, 2004 7:00 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6039&sid=d8ced93bef0173d174fd057d02b25aff#p6039"
  },
  {
    "author": "lchip  Guest Posts: 12 Joined: Sun Oct 10, 2004 11:03 pm Location: Cleveland, Ohio",
    "title": "Cracked Mouth Corners, Sore Tongue",
    "content": "Over the last few days, I've woken up with cracked mouth corners.  I've never had anything like this before.  I believe I recently had a yeast infection, and I was wondering if this was related (because I read somewhere online that the cracked mouth corners could be caused by the same kind of thing..).   Also, my tongue has been sore.  At first I thought it was due to the fact that I may have bitten it, or some other oral-related injury, but it's been sore now for a few weeks, mainly in the back, and it keeps moving from side to side.  I was wondering if these two could be related, and if not, what could be causing my tongue problems.\n\n",
    "posted_time": "Post  by lchip » Sun Oct 10, 2004 11:38 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5817&sid=d8ced93bef0173d174fd057d02b25aff#p5817"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Dear ichip, Oral ulcers are common and occur at times of stress when the body's immunity decreases. Given your history of depression it could well be the cause. It would be a combination of things really: lowered immunity combined with the oral injury.   Yeast infection (candida) is common in diabetics and those taking broad spectrum antibiotics. They could happen to anyone. If you still have them they should be checked out. Your doctor will prescribe an oral antifungal gel and rule out any underlying cause.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Mon Oct 11, 2004 12:55 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5821&sid=d8ced93bef0173d174fd057d02b25aff#p5821"
  },
  {
    "author": "temp  Guest Posts: 1 Joined: Tue Jul 06, 2004 9:56 am Location: Israel",
    "title": "A petty question",
    "content": "Hello, I have just come across your site and it was the best one I could find for receiving medical advice from professionals.  However, I have a very minor and quite stupid question and I'm not sure it is worthy of being posted here.  I would appreciate being redirected to a proper site.  Anyway, my question is this I believe I have bad breath and I was wondering if there is anything medical that can be done about it - such as treatments or a remedy. I would like to clarify my problem if I may - I do not sense that I have bad breath, nor has anyone ever told me so.  Instead, what I do sense is an unfavorable odor from my saliva. I have tried breath mints or breath sprays but they do not remove the odor from my saliva.  I was wondering if there were a way to solve my problem but I am too embaressed to ask my local doctor. I would appreciate any kind of advice, Sincerely, temp.\n\n",
    "posted_time": "Post  by temp » Tue Jul 06, 2004 10:13 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3956&sid=d8ced93bef0173d174fd057d02b25aff#p3956"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Saliva is the natural mouthwash we were born with. People who do not have sufficient flow of saliva tend to suffer from more dental caries and periodontal disease. They have more trouble wearing dentures.   Bad breath is worst when there is little or no saliva flow, for example after a night's sleep. As soon as one wakes up and starts to salivate, the smell recedes somewhat.   Another classic way to get saliva flowing is to drop a few drops of lemon on your tongue (also helpful for saxophone players).   It becomes obvious then that saliva should smell a little offensive as it is responsible for ridding the mouth of its bad odours.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Wed Jul 07, 2004 1:36 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3960&sid=d8ced93bef0173d174fd057d02b25aff#p3960"
  },
  {
    "author": "chameleon  Guest Posts: 1 Joined: Sun Jun 06, 2004 5:34 pm Location: Piedmont",
    "title": "Clustered Red Bumps on Tip of Tongue - Herpes?",
    "content": "For the last 5 weeks, I have noticed small red bumps on the tip of my tongue and along the sides.  This had made my tongue very sensitive.  It almost looks like strawberry tongue (usually happens to children I've heard), but I am 29 and as I said it still has not gone away after 5 weeks.  I visited a free clinic since I have no insurance and they said that they didn't know what it was nor did they prescribe anything.  They told me to rinse with hydrogen peroxide 3 times a day for a week and if that didn't help then to see a specialist.  Well its been a week and no change.  As a side note, I have been dating someone for the last 11 months who regularly breaks out in cold sores on his lips (not tongue).  I have no cold sores on my lips or on my gums.  Help.  Want to go to the hospital today but afraid I will just get the run around like at the free clinic and have to pay $400 for not being insured.\n\n",
    "posted_time": "Post  by chameleon » Sun Jun 06, 2004 5:53 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3601&sid=d8ced93bef0173d174fd057d02b25aff#p3601"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Chameleon, Sores on the tongue could arise from many causes ranging from a bacterial infection to cancer. The presence of bumps on either side of the tongue as opposed to only one side is against cancer (cancer usually develops as a painless bump on one side of the tongue). Other possible causes: oral herpes simplex infection, canker sores, tuberculosis, bacterial infections, or early-stage syphilis. It could also be an immune system problem or an allergy. The cause can usually be determined within the context of careful history taking and examination. Please keep these causes in mind during your next visit to the doctor and try to raise these possibilities for him/her.  Good luck.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Mon Jun 07, 2004 12:31 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3603&sid=d8ced93bef0173d174fd057d02b25aff#p3603"
  },
  {
    "author": "flyingfingers  Guest Posts: 1 Joined: Wed Apr 28, 2004 11:23 pm Location: MD",
    "title": "Tongue Ulcer",
    "content": "I noticed this morning my tongue was sore.  I have not eaten anything spicy and do not drink or smoke.  The soreness has progressed over the course of the day, and at this point, my tongue is very sore.  There is a white ulcer on the left side of my tongue, close to the tip.  The ulcer appears to stand out much more now than it did before.  It looks like the ulcer is going to become separated from the tongue but it has not at this point.  Is there any type of homeopathic or natural treatment for this?\n\n",
    "posted_time": "Post  by flyingfingers » Wed Apr 28, 2004 11:30 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3201&sid=d8ced93bef0173d174fd057d02b25aff#p3201"
  },
  {
    "author": "Dr. Russell M  Medical Doctor Posts: 650 Joined: Mon Jun 09, 2003 12:34 pm Location: USA",
    "title": "[no title]",
    "content": "Hi!  I am not aware of homeopathic/natural medicines for your tongue ulcer. I would ask to concentrate on oral hygeine, analgesics for local application, and vitamin B complex.  bill\n\n",
    "posted_time": "Post  by Dr. Russell M » Thu Apr 29, 2004 9:01 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3203&sid=d8ced93bef0173d174fd057d02b25aff#p3203"
  },
  {
    "author": "mynameismissy  Guest Posts: 2 Joined: Thu Apr 08, 2004 9:30 am Location: Michigan",
    "title": "Sore on Lip",
    "content": "Hello, I just started dating a man, and when I saw him yesterday he had a sore on his lip. He says he gets them from eating a lot of citrus. (We shared an orange the night before, and the sore was there in the morning.) It was not red and on the edge of the lip as most cold sores I've seen. It was white and in the middle of the bottom lip, and looked more like a canker sore, which from personal experience I know can be caused by acidic foods. However, in my research I see that canker sores are supposedly inside the mouth only. Do you think that this sore is contagious, or really just a food reaction? I have been kissing him...and getting cold sores is one thing that I never want to do. Thank you.\n\n",
    "posted_time": "Post  by mynameismissy » Thu Apr 08, 2004 9:37 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3041&sid=d8ced93bef0173d174fd057d02b25aff#p3041"
  },
  {
    "author": "Dr. Russell M  Medical Doctor Posts: 650 Joined: Mon Jun 09, 2003 12:34 pm Location: USA",
    "title": "[no title]",
    "content": "Hi!  Herpetic infections of the lips are quite common and could be transmitted to others as well as re-infect self by autoinoculation (eg. touching the lip sore and then wiping the eyes). As you rightly pointed out, canker sores are not found on the lips/gums/palate.  Topical (to apply over the lesion) antiviral medications may reduce viral shedding and increase patient comfort. For recurrent sores, that might not be enough, and emollients may be tried. If the recurrence is more than 6 time a year, oral antiviral medications may be tried so as to prevent it from happening. Immunodeficiency is another reason oral antiviral meds may be begun.  Hope this helps.  Warm regards,  Bill\n\n",
    "posted_time": "Post  by Dr. Russell M » Mon Apr 19, 2004 6:53 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3116&sid=d8ced93bef0173d174fd057d02b25aff#p3116"
  },
  {
    "author": "BD  Guest Posts: 1 Joined: Fri Sep 05, 2003 2:54 pm Location: USA",
    "title": "Tooth Abcess & Sudden Flu-like Symptoms",
    "content": "Hi I had a question.  This morning I woke up feeling not-so-great, and as the morning progressed it got worse until I was nauseus and had to leave class.  My symptoms include:  All-Over Headache, Stiffness on the lower neck/upper back, Nausea, 101.2 temperature, tiredness, Over-all malaise.  About 10 days ago I had a very corroded tooth built up (bottom back molar).  As soon as the novacaine wore off I got an amazing toothache.  I told my dentist but he couldn't do anything cause I was moving the next day.  Since then the toothache has continued (under my chin, on the side, and a small earache) and I have had to take Ibuprofen twice a day to get rid of the pain.  This morning when I woke up the pain was considerably less, I haven't had to take any pain killers at all today.  My question is - is it possible that the tooth could've drained an infection into another part of my body and that is why I am feeling so sick & sore now but the toothache has lessened?  Or am I just being paranoid and it's probably the flu?   Thanks.\n\n",
    "posted_time": "Post  by BD » Fri Sep 05, 2003 3:03 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1309&sid=d8ced93bef0173d174fd057d02b25aff#p1309"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "DB, Is your tooth tender when you press on it slightly? Caries can be a source of infection. I would advise you to see a dentist soon regardless of whether this is the cause of the fever or not. You should be examined and evaluated for fever. A simple physical examination can reveal the source of your infection most of the time.  Best wishes,\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Fri Sep 05, 2003 3:34 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Oral and dental diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1310&sid=d8ced93bef0173d174fd057d02b25aff#p1310"
  }
]