[
  {
    "author": "MCG  Guest Posts: 1 Joined: Tue Jul 27, 2010 4:18 am Gender: Male",
    "title": "Numbness in my leg, now pains in my arm.",
    "content": "My leg has now been numb for over a week, Its started off as painful pins and needles. I went to my docter who wanted me to have blood tests and a possible MRI scan. Over the past few days I have also began to have pains in my arm, lower back and occasionally headaches. Does anyone have any idea what this could be?\n\n",
    "posted_time": "Post  by MCG » Tue Jul 27, 2010 4:30 am",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=98811&sid=9a059bfae727ef74978292aae44a3dd2#p98811"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: Numbness in my leg, now pains in my arm.",
    "content": "Hello, Blood tests and MRI seem sound from considering the following 2 main possible diagnosis: diabetes lumbar disc disease (leg numbness)  Since the symptoms have started in the upper limb, the blood tests are further indicated.  But lumbar disc problems may be further suspected if the pain or symptoms worsen with activity or static postures such as extensive driving farther and farther down the road.   Take care.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Fri Aug 13, 2010 2:26 pm",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=100758&sid=9a059bfae727ef74978292aae44a3dd2#p100758"
  },
  {
    "author": "rheannonerinn  Guest Posts: 1 Joined: Sat Jul 17, 2010 8:44 am Gender: Female",
    "title": "fracture of patella",
    "content": "In 1988 I came off a motorcycle and sustained multiple fractures of the patellas.  In 2007 I sustained a communted fracture of the right patella.  With the injury in 2007 I could still walk, although painful.  After 3 days I decided to have an x-ray and I was then sent for an MRI, which found the commuted fracture.  My GP sent me to a specialist, who decided as I was walking, nil treatment was required.  Since the first accident in 1988, I have experienced pain over the years, however I have learnt to manage/block out the pain.  I think this is why I was able to walk etc with the second injury.    Currently I am experiencing hip pain and right knee pain.  I had an x-ray of the hip which showed calcification of the top of the hip bone.  The GP decided I have a bursa (don't think this is correct).    In the last week I have done alot of walking and my knee pain is the same as the pain I experienced when I fractured the patella the 2nd time.  Is it possible to get a stress fracture from walking?  Could my hip pain be related to my patella?   Thanks,\n\n",
    "posted_time": "Post  by rheannonerinn » Sat Jul 17, 2010 8:57 am",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=97517&sid=9a059bfae727ef74978292aae44a3dd2#p97517"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: fracture of patella",
    "content": "Hello, Yes the hip pain can occur secondary to the knee.  It's very common to experience pain in the joints above or below the injured area.    Regarding stress fracture from too much walking, under normal circumstances the bones should tolerated normal walking - even prolonged walking.  But in case of a fractured patella and prolonged walking the fracture site if not healed fully may cause great pain or poor healing.  It would worthwhile to re x-ray the knee and patella.  Take care.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Fri Aug 13, 2010 2:09 pm",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=100757&sid=9a059bfae727ef74978292aae44a3dd2#p100757"
  },
  {
    "author": "lisashere42  Guest Posts: 2 Joined: Mon Jun 07, 2010 7:21 pm Gender: Female",
    "title": "osteoporosis in teens",
    "content": "Hello.  I have a 16 year old son who was diagnosed with osteoporosis at age 14. They checked his bone density and said that his bones are not absorbing any vitamin d or e or calcium. They said that they will not do any more test to find out why because they probably will never find out why.  He eats and drinks alot of things that are high in vitamin d and e and in calcium.  He also takes vitamin pills everyday.  Why would a child his age develop this disease?  What kind of test can find the reason why?  He has already crushed his number 1 verbrae and split his number 5. Broke his wrist twice and his foot once.    I'm lost on what do to.  Please help.   Thank You and GOD Bless\n\n",
    "posted_time": "Post  by lisashere42 » Mon Jun 07, 2010 7:44 pm",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=93479&sid=9a059bfae727ef74978292aae44a3dd2#p93479"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: osteoporosis in teens",
    "content": "Hello, Thank you for writing in.  Osteoporosis is rare in teenagers.  I would recommend an evaluation by a pediatric endocrinologist as I suspect this is related to a metabolic bone disorder and should be further evaluated.  My differetial diagnosis would include:  Rare form of rickets Diabetes Metabolic bone disorder Growth hormone / short stature problem Malabsorbtion problem in the gut Kidney disease (not able to metabolize the Vitamin D) Parathyroid disease  As you can see from some possible diagnosis that the cause can be complex and he should benefit from seeing an endocrinologist.  Take care.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Wed Jun 16, 2010 11:18 am",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=94281&sid=9a059bfae727ef74978292aae44a3dd2#p94281"
  },
  {
    "author": "lisashere42  Guest Posts: 2 Joined: Mon Jun 07, 2010 7:21 pm Gender: Female",
    "title": "Re: osteoporosis in teens",
    "content": "Thank you for your reply.  He was seeing a genetics doctor, but he didn't seem to interested in doing any further test.  I will try what you said.  Again, Thanks.   GOD BLESS\n\n",
    "posted_time": "Post  by lisashere42 » Sat Jun 19, 2010 7:19 pm",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=94621&sid=9a059bfae727ef74978292aae44a3dd2#p94621"
  },
  {
    "author": "rajivb  Guest Posts: 8 Joined: Thu Jan 22, 2009 10:06 am Gender: Male",
    "title": "Osteopenia-   tread mill excercise",
    "content": "I am a 60 years old female  diagnosed last year with Osteopenia; my BMD readings in last one year have shown deterioration in AP Spine (old reading -1.4, new -2.0) and Right Fore arm (old -1.7, new- 2.4) and no change in Left Femur -1.8. What excercises will benefit me? Will 30 minutes walking on Tread Mill at 4 to 5 km per hour speed be helpful or this is not recommended.Please advise. I have recently started Fosavance 70 mg once a week. R. Bhatnagar\n\n",
    "posted_time": "Post  by rajivb » Tue Nov 03, 2009 9:25 am",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=85755&sid=9a059bfae727ef74978292aae44a3dd2#p85755"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: Osteopenia-   tread mill excercise",
    "content": "Hi,  It is well known that exercises have beneficial effects on bones. Human as well as animal studies have shown that exercises do increase bone mineral density (BMD), as well as bone mass and strength . In addition, exercise has been shown to protect against age-related bone loss.It is thought that the mechanical stresses generated by exercises play a crucial role in the osteogenic response. Human studies have investigated osteogenic responses to exercise in many types of training programs, such as running and walking, resistance training, aerobic exercise, and high-impact or jump exercise etc.   Most animal studies have investigated treadmill running and found beneficial effects on bone in induced osteopenia.Some isolated reports have noted that high-impact, low-repetition jump exercise has an osteogenic effect on lower limbs in middle-aged osteopenic rats.One must be careful in extrapolating these results in animal experiments to a human situation.   Weight-bearing exercises are those where one's muscles are working against gravity. These can be divided into low-impact and high-impact exercises.Low-impact weight-bearing exercises are advisable if one is already diagnosed with osteopenia and is at risk for fall or fracture. In low-impact, weight-bearing exercise, one should not jump or twist. Usually, one foot must always be on the ground.  Treadmills and stair-climbing machines provide low-impact weight-bearing benefit.Treadmills are OK as long as the speed is such that one does not start to run(in which case, it becomes a high impact exercise).Therefore, it is advisable to do treadmill exercises under supervision rather than to experiment with the speed settings. The other safer option is to join a low-impact aerobics class or go for a careful,brisk walk.  Best wishes!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Wed Dec 09, 2009 2:22 am",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=88542&sid=9a059bfae727ef74978292aae44a3dd2#p88542"
  },
  {
    "author": "rajivb  Guest Posts: 8 Joined: Thu Jan 22, 2009 10:06 am Gender: Male",
    "title": "Re: Osteopenia-   tread mill excercise",
    "content": "Thank you Doctor. RB\n\n",
    "posted_time": "Post  by rajivb » Tue Jan 12, 2010 12:09 am",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=90672&sid=9a059bfae727ef74978292aae44a3dd2#p90672"
  },
  {
    "author": "rajivb  Guest Posts: 8 Joined: Thu Jan 22, 2009 10:06 am Gender: Male",
    "title": "FOSAVANCE 70",
    "content": "I am 60 years old female with Oestopenia diagnosed in Oct 2008. Fosavance 70 is a combination of two medicines- alendronic acid and vitamin D-3. In India, this combination is not available but the two medicines are available separately.Is it better to take drugs individually or as a combination (combination can be found with some druggists as an imported drug)? Secondly are there any serious side effects of long term usage of Fosavance? My last two years BMD results are: AP Spine Bone: -1.4 (Oct 2008), -2.0 (Oct 2009) Left Femur: - 1.8 (oct 2008), -1.8 (oct 2009) Right Forearm: -1.7 (oct 2008), -2.4 (Oct 2009) I have started Fosavance in Oct 2009; for the last one year i was taking Caltrate (Wyeth) 600X2 i.e.calcium 1200mg and vitamin D 400. Will be grateful for advise if my treatment is on right lines and can further deterioration be arrested. I am also taking Meltformin 250 mg for mild diabetic condition. RBhatnagar\n\n",
    "posted_time": "Post  by rajivb » Tue Nov 03, 2009 9:11 am",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=85752&sid=9a059bfae727ef74978292aae44a3dd2#p85752"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: FOSAVANCE 70",
    "content": "Hello, A bisphosphonate can help prevent progression of osteoporosis. Potential side effects include: low calcium gastrointestinal irritation bone,muscle, or joint pain osteonecrosis of the jaw   Vitamin D3 is better supplement than D2 due to efficiency of creating activated Vit D (25-hydroxyvitamin D) which helps prevent fracture.  I see no reason other than convenience and cost why the two could not be taken separately.  Looks like you are on a good regimen.  Take care.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Fri Nov 20, 2009 7:37 pm",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=87468&sid=9a059bfae727ef74978292aae44a3dd2#p87468"
  },
  {
    "author": "rajivb  Guest Posts: 8 Joined: Thu Jan 22, 2009 10:06 am Gender: Male",
    "title": "Re: FOSAVANCE 70",
    "content": "Thanks Tom.  RB\n\n",
    "posted_time": "Post  by rajivb » Sat Nov 21, 2009 3:44 am",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=87481&sid=9a059bfae727ef74978292aae44a3dd2#p87481"
  },
  {
    "author": "priya1987  Guest Posts: 1 Joined: Mon May 11, 2009 8:20 am Gender: Female",
    "title": "knock knees coorrective surgery",
    "content": "hi i wanted to find out about corrective knock knee surgery..is it possible at age of 21? is there any side effects..? thanks\n\n",
    "posted_time": "Post  by priya1987 » Mon May 11, 2009 8:27 am",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=77684&sid=9a059bfae727ef74978292aae44a3dd2#p77684"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: knock knees coorrective surgery",
    "content": "Hello, Corrective knee surgery at 21?  It depends on what is needed to correct.  If we are talking about ligament damage e.g. ACL tear or cartilage damage then yes.  If the consideration is for a knee replacement, then no - that is not done until later in life (50 years old and up).  Hope this helps.  Take care.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Mon Jun 15, 2009 6:57 am",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=80628&sid=9a059bfae727ef74978292aae44a3dd2#p80628"
  },
  {
    "author": "neumja  Guest Posts: 1 Joined: Tue May 05, 2009 8:08 pm Gender: Male",
    "title": "occasionnal shoulder pain on both sides, limited mobilit",
    "content": "I have occasional shoulder pain on both sides for nearly 12 years, I am nearly 30 now.  When the pain comes on I am unable to raise my arms past horizontal, sometimes less.  There is some popping or clicking when moving the shoulder joint even when there is no pain.  There was once consideration that there was tendinitis.  I am wondering if I would need surgery or if this is even correctable.\n\n",
    "posted_time": "Post  by neumja » Tue May 05, 2009 8:18 pm",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=77068&sid=9a059bfae727ef74978292aae44a3dd2#p77068"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: occasionnal shoulder pain on both sides, limited mobilit",
    "content": "Hello, With the type of pain in your shoulder, tendinitis is certainly a consideration.  You may even call it impingement syndrome where the rotator cuff tendon pinches under the acromion about half way up as you lift your arms away from the body to the overhead position (lifting outward to the side - not in front of the body).    The bursa may also become inflamed in this area too.  The causes of impingement include bony spurs on the acromion, muscle weakness in the shoulder, and repetitive overhead work (like painting).    Treatment consists of an exercise program, NSAIDs, ice or heat.     Since rotator cuff impingement can lead to rotator cuff tear it is important to treat this correctly so physical therapy is often prescribed.  Take care and God bless.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Mon Jun 15, 2009 6:54 am",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=80627&sid=9a059bfae727ef74978292aae44a3dd2#p80627"
  },
  {
    "author": "sheila373  Guest Posts: 8 Joined: Tue May 08, 2007 6:15 pm",
    "title": "Preventing Osteoporosis",
    "content": "I am a healthy middle-aged woman and would like to stay that way.  Is running/jog-ing better for increasing bone density than weight-training is?  I thought you had to stress the bone somewhat but I am also concerned about OVER-stressing my knees and ankles.  A trainer at a gym told me the eliptical machine is better for your joints and that lifting weights is what helps prevent osteoporosis.  I'm very small and small-boned and it concerns me; I've broken bones in the past.  (I thought that if you strengthen the muscles supporting the joints enough, it is best to run.)\n\n",
    "posted_time": "Post  by sheila373 » Tue Feb 03, 2009 12:31 pm",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=70464&sid=9a059bfae727ef74978292aae44a3dd2#p70464"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: Preventing Osteoporosis",
    "content": "Hello, Thanks for writing in.  Yes, studies have shown that high impact exercise increases bone mineral density (especially in young women as they reach their peak bone mass usually in their 20's).  As women age, the Improvement lessens and exercise's goal is for maintenance of bone density.   Jogging can increase your risk of foot,ankle, knee and hip problem.  So if you plan to start a jogging program, I would recommend 6 weeks of leg strengthening and stretching before starting to run.  Also, you should be able to walk at least the same time or distance you plan to run (This should be obvious but some people go right into running - there was a recent report of an unconditioned man who was forced to run mile after mile as training in a \"prison boot camp\".  He suffered bilateral tibial plateau fractures...from running on unconditioned legs.)  This preparation will build a good strength and flexibility foundation.  The other benefits of running are cardiovascular and some say mental improvement.  The eliptical machine can be incorporated into the 6 weeks conditioning program and can be used as a cross training exercise during your running program.    Yes, smaller framed women tend to become osteoporotic more than heavier women.  The exact mechanism is unknown - whether it's thicker bones or the extra weight?  Other factors affecting bone density: hormones (parathyroid, estrogen), nutrition, amount of sun exposure, smoking, excessive alcohol use, and medication (glucocorticoids).  Hope this helps.  Keep us posted and happy exercising.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Sat Feb 07, 2009 1:08 pm",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=70641&sid=9a059bfae727ef74978292aae44a3dd2#p70641"
  },
  {
    "author": "sheila373  Guest Posts: 8 Joined: Tue May 08, 2007 6:15 pm",
    "title": "Re: Preventing Osteoporosis",
    "content": "Dear PA-C Plamondon,    Thank-you very much for your careful reply.  I really appreciate it.  Sorry it took me so long to look it up.      Am still working on getting in my best shape.      I am imagining that my bones will still respond to stimulation even though I'm way past my 20's.  But I will work on strenghtening the supporting muscles, etc.  I knew that trainer was mistaken!  People tend to doubt me because I am small.  Gyms hire unqualified people sometimes; I'd like to become a trainer myself!    Thanks again.\n\n",
    "posted_time": "Post  by sheila373 » Mon Mar 16, 2009 8:53 pm",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=71417&sid=9a059bfae727ef74978292aae44a3dd2#p71417"
  },
  {
    "author": "bgengine  Guest Posts: 2 Joined: Thu Nov 06, 2008 6:44 am Gender: Male",
    "title": "Pins and needles / numbness in thumb and index finger",
    "content": "Hi, I have pins and needles in my thumb, index finger and middle finger ( left hand)  for the past 2 weeks. I can't remember hurting any part of my body  - though I have a habit of sleeping in a curled up way on my left shoulder - and approx 2 weeks ago i did wake up with  apain in my sholder. the pain in my shoulder has since gone  - but the pins and needles ( some times numbness ) in my hand persists. I expect I may have damaged a nerve or something but am wondering if there is anything I can do to help remove the tingly feeling in my fingers. Should I put an ice pack or heat pack on it ? ( but where?  - what part of my arm?) Should I do excercises ? What would happen in the long term if it is left untreated ? - do nerves fix themselves ?  thanks\n\n",
    "posted_time": "Post  by bgengine » Mon Nov 10, 2008 5:03 am",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=63728&sid=9a059bfae727ef74978292aae44a3dd2#p63728"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Pins and needles / numbness in thumb and index finger",
    "content": "Hi there -  It sounds as though you may have something pressing on the radial or medial nerve on that side, probably in the area of the shoulder, but there's no guarantee it's there. It  could  be somewhere else higher up or further down. The problem is that nerves not only don't fix themselves, they also rarely get out from under things that are pressing them nor move themselves back into their native postions, at least without some outside help, which can  range from physical therapy to minor surgery.   First thing to do would be to see a neurologist who can help determine which nerve is causing the symptoms and locate where the impingement is located. Once that's done he (or she) can refer you to either physical therapy or a neurosurgeon who can free the entrapped nerve or get things back into proper alignment.  Sometimes with this sort of problem the solution is as simple as doing certain  types of stretching exercises. It  all depends. It seems likely the problem is fairly simple since there's no known trauma.   I hope this helps.  Best of luck to you with this.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Thu Dec 04, 2008 9:36 pm",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=65109&sid=9a059bfae727ef74978292aae44a3dd2#p65109"
  },
  {
    "author": "brat  Guest Posts: 5 Joined: Mon Jul 09, 2007 2:12 am",
    "title": "Boniva",
    "content": "My mother is a post menopausal patient. She has been suffering from osteoporosis. Our family doctor has prescribed with boniva that is generically called Ibandronate. What are your views on this medication??\n\n",
    "posted_time": "Post  by brat » Wed Nov 14, 2007 5:08 am",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50324&sid=9a059bfae727ef74978292aae44a3dd2#p50324"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Brat,  Ibandronate is a medication that is aimed at helping to maintain bone density and reduce the risk of fracture development.  This class of medication has been shown to be quite helpful in some cases.  These medicines can have significant stomach irritation so it is important to follow the directions for taking these medicines closely.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Thu Nov 15, 2007 12:12 am",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50383&sid=9a059bfae727ef74978292aae44a3dd2#p50383"
  },
  {
    "author": "beachfamily5  Guest Posts: 5 Joined: Fri Jun 01, 2007 8:10 am",
    "title": "Finger bone pain?",
    "content": "Hi. I am a 37 yo female. Just had 3rd child 6mo ago. I had noticed my hands bothering me while pg, but just chalked it up to that,being pregnant. Well it is 6mo later and they seem to be getting worse. It got much worse 2m ago and I then thought maybe my wedding ring was bothering my left ring finger so removed it. But the finger still hurts,as does pinky next to it and now all the finger joints in middle and top of finger closest to finger nail are basically achy,even to the touch. But the left ring finger in particular feels really almost like it has a bruise,but nothing is visible and it has been like this for over 2mo. It is whole top side mid section of finger. When I wake in morning they are worst,or if I wake in middle of night . I can not fully bend my hands,they feel somewhat swollen and stiff. By afternoon they are not too bad,except that left finger always hurts. I have been not feeling well since having baby, was finally dx w/ reflux about 3-4m ago and just finished nexium. My throat does feel maybe 85% better with all that,but now I have this hand thing really bothering me.I was thinking RA,lyme,something from the nexium maybe???(but I stopped nexium a couple w/ ago).\n\n",
    "posted_time": "Post  by beachfamily5 » Wed Oct 24, 2007 1:50 pm",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=49483&sid=9a059bfae727ef74978292aae44a3dd2#p49483"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Beachfamily5,  There are a few possibilities.  RA certainly can cause finger pain.  In addition, the distribution you are describing may indicate some inflammation or compression of the radial or ulnar nerve.  I would recommend you see your doctor about this for further evaluation.  I think it is unlikely that this is related to the nexium.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Fri Oct 26, 2007 11:46 pm",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=49564&sid=9a059bfae727ef74978292aae44a3dd2#p49564"
  },
  {
    "author": "cheney  Guest Posts: 1 Joined: Sat Sep 22, 2007 10:11 pm",
    "title": "numbness in small toe",
    "content": "37 f none female none none  Why does my little toe always be numb.  I do not  have diabetes.  My blood sugar is at the regular level.\n\n",
    "posted_time": "Post  by cheney » Sat Sep 22, 2007 10:36 pm",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=48113&sid=9a059bfae727ef74978292aae44a3dd2#p48113"
  },
  {
    "author": "Debbie Miller, RN  Nurse Posts: 4746 Joined: Mon Apr 16, 2007 2:41 pm Gender: Female Location: USA",
    "title": "[no title]",
    "content": "I'm afraid there are many conditions that can present with toe numbness.  I'm afraid you will have to get in to be examined by a doctor in order to get a diagnosis and treatment.  Sorry I can't be more helpful.\n\n",
    "posted_time": "Post  by Debbie Miller, RN » Mon Oct 01, 2007 1:21 pm",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=48525&sid=9a059bfae727ef74978292aae44a3dd2#p48525"
  },
  {
    "author": "Sedalia  Guest Posts: 1 Joined: Mon Aug 06, 2007 6:44 am",
    "title": "Strange Popping Noise",
    "content": "I am a 39 year old female and recently I have begun to notice an audible pop and feeling of something popping at the top of my right leg.  It does not hurt, but I am afraid it might develop into something worse.  What could it be?\n\n",
    "posted_time": "Post  by Sedalia » Mon Aug 06, 2007 8:28 am",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=45752&sid=9a059bfae727ef74978292aae44a3dd2#p45752"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Sedalia,  The popping you are experiencing may be a tendon that is \"tight\" and is popping over a bony prominence or other structure.  Another possibility is that your joint may be catching a bit and popping.  Both of these are harmless for the most part.  I would recommend you talk with your doctor about this the next time you are in and have your leg evaluated to be sure everything is OK.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sat Aug 11, 2007 2:45 pm",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=46075&sid=9a059bfae727ef74978292aae44a3dd2#p46075"
  },
  {
    "author": "jmgray  Guest Posts: 2 Joined: Sun Apr 29, 2007 12:08 am",
    "title": "Calcium Supplements - How Long?",
    "content": "eGreetings,  Thank you so much for this free service!  I would like to know how long does it take for Calcuim Supplements to start working?  And at what intervals should I have the bone density test done?  Thank you very much for your time and assistance.  Kind Regards, Jeri\n\n",
    "posted_time": "Post  by jmgray » Sun Apr 29, 2007 12:14 am",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=41635&sid=9a059bfae727ef74978292aae44a3dd2#p41635"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Restoration of bone density is a slow process.  Generally a follow up bone density scan can be done one or two years after calcium supplementation has been started.  Calcium supplementation should contain some vitamin D also to help improve calcium absorption from the GI tract.  Best wishes.  I'm glad you are enjoying our site.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sun Apr 29, 2007 5:54 pm",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=41656&sid=9a059bfae727ef74978292aae44a3dd2#p41656"
  },
  {
    "author": "jmgray  Guest Posts: 2 Joined: Sun Apr 29, 2007 12:08 am",
    "title": "[no title]",
    "content": "Thank you so much for your answer.  Have a terrific day!  Kind Regards, Jeri\n\n",
    "posted_time": "Post  by jmgray » Mon Apr 30, 2007 3:30 pm",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=41718&sid=9a059bfae727ef74978292aae44a3dd2#p41718"
  },
  {
    "author": "babsthom  Guest Posts: 1 Joined: Tue Mar 27, 2007 4:41 pm",
    "title": "Oseoporosis/Forteo treatment post Fosamax/Actonel use",
    "content": "Hello, I am a 56 year old female who has been treated for Cushing's Disease (surgical removal of the pituitary adenomai).  As a results of my disease, my bones were damaged and I became osteoporotic.  I have had somewhere between 8 and 10 vertebral fractures as well as rib fractures.  I have been on large doses of calcium and have been treated with Fosamax and Actonel (not at the same time).  The possibility of PTH injections has been mentioned but I do have some concerns about he fact that osteosarcoma is a possible complications of the medication as well as the fact there are not that many years of data to give a long-term  picutre.  Also I have recently heard that even though the durg was approved for people who have had unsuccessful results from Fosamar or Actonel, some are saying that the benefits of the injections are really not very good in people who have already been treated with the traditional osteoporosis medications, that it may be better for people with osteoporosis as a first-line of treatment.  Well, I'm a little confused as I have heard different ideas about how effective this might be.  Obviously I don't want to take any medication which presents a potentially serious complication but on the other hand, I don't want to rob myself of the possibility of having some significant improvement in my bone condition.  Thanks.\n\n",
    "posted_time": "Post  by babsthom » Tue Mar 27, 2007 5:10 pm",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=40047&sid=9a059bfae727ef74978292aae44a3dd2#p40047"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Medications such as Fosamax and Actonel have been around for a little while and are generally considered appropriate treatments for osteoporosis.  PTH injections are a relatively new thing, I suspect.  I was not aware that they were being done.  PTH works to increase calcium resorption from bone (taking the calcium out of bone) so I don't really understand how this would help.  Raising PTH levels would lead to decreased calcium supplies in bone-the opposite effect of what is desired.  My advise to you would be to discuss this possible treatment with 1) a doctor that is familiar with and has used this treatment (you don't want to be the first one to try it out) and 2) an endocrinologist who understands the mechanisms of PTH and calcium homeostatis very well.  This will give you the best information to make an informed decision.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Fri Mar 30, 2007 11:27 pm",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=40210&sid=9a059bfae727ef74978292aae44a3dd2#p40210"
  },
  {
    "author": "saintcal  Guest Posts: 8 Joined: Sat Dec 30, 2006 12:27 pm",
    "title": "CALCIUM WITHOUT CONSTIPATION?",
    "content": "After trying at least 5 different kinds of calcium supplements over the years, I have finally given up.  They all cause constipation  (and then hemorrhoids) even with a high fiber diet and drinking a lot of water.    I'm concerned that I won't be able to get enough calcium from my skim milk, etc., and know I need it.  I am a 63-year old female and my bone density has gone down 14% over ten years, and is just on the border of normal now.  I just don't want it to go down a lot more; I take glucosamine-chondroitin supplements also.   I'd be grateful for suggestions for a better form of calcium or other ideas.\n\n",
    "posted_time": "Post  by saintcal » Wed Jan 03, 2007 1:23 am",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=37140&sid=9a059bfae727ef74978292aae44a3dd2#p37140"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Have you tried calcium fortified foods, such as orange juice?  The citrate in orange juice helps absorption of calcium and is generally a little less constipating.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Wed Jan 03, 2007 1:53 pm",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=37164&sid=9a059bfae727ef74978292aae44a3dd2#p37164"
  },
  {
    "author": "Ladysmith52  Guest Posts: 10 Joined: Wed Mar 01, 2006 1:20 pm Location: Bakersfield, CA",
    "title": "Osteoporosis Qualifications?",
    "content": "Dear Doctors -  - Male - Age: 57 - No past surgeries or past diagnoses - Mother died from osteoporosis complications  - Never smoked - 1 glass of wine daily with dinner  I had a DEXA scan done because of my mother's osteoporosis and subsequent death.   My bone mineral density L1-L4 measures 0.62 gm/cm. My T-Score is -4.2 and Z-Score is -3.7 which was reported to me as being in the \"osteoporotic range\" (as defined by the WHO). Fracture risk is high.  My bone mineral density of the femoral neck measures 0.6272 gm/cm. My T-Score is -1.9 and my Z-Score is -1.0 which was reported to me as being in the \"osteopenic range\". Fracture risk is increased.  My bone mineral ensity of my left hip measures 0.787 gm/cm. My T-Score is -1.6 and my Z-Score is 1.2 which was reported to me to be in the \"osteopenic range\". Fracture risk is increased.  1. Does this mean that I currently have osteoporosis?  2. Should I start taking Fossamax?   3.  Do I need to take any  special precautions with regards to my daily activities?  Thank you for your time. S. Smith\n\n",
    "posted_time": "Post  by Ladysmith52 » Wed Aug 23, 2006 9:57 pm",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=33918&sid=9a059bfae727ef74978292aae44a3dd2#p33918"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Hello,  Dual-energy x-ray absorptiometry or DXA test is the most widely used to identify osteoporosis and determine your risk for fractures (broken bones), as well as a follow up measure for response to osteoporosis treatment.   The interpretation of the test results in men is controversial, the International Society for Clinical Densitometry recommends using separate guidelines when interpreting BMD test results in men.   Age-related bone loss (sometimes called senile osteoporosis) is not due to a secondary cause but is part of senile changes.  Therapy include: nutrition, exercise, and lifestyle guidelines for preventing increase bone loss and avoiding fracture.  Your consultant can prescribe one of the medications approved by the FDA for this disease and that would make you avoid complications under his follow up.  Keep us updated. Best regards.\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Fri Dec 15, 2006 10:19 am",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=36233&sid=9a059bfae727ef74978292aae44a3dd2#p36233"
  },
  {
    "author": "Ladysmith52  Guest Posts: 10 Joined: Wed Mar 01, 2006 1:20 pm Location: Bakersfield, CA",
    "title": "Osteoporosis Qualifications?",
    "content": "Thank you, Dr. Mahmoud.\n\n",
    "posted_time": "Post  by Ladysmith52 » Sun Dec 17, 2006 8:32 pm",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=36359&sid=9a059bfae727ef74978292aae44a3dd2#p36359"
  },
  {
    "author": "Ladysmith52  Guest Posts: 10 Joined: Wed Mar 01, 2006 1:20 pm Location: Bakersfield, CA",
    "title": "Osteoporosis in Final Stages?",
    "content": "Dear Doctor - My husband's mother is 92 y/o. She suffers extensively from osteoporosis. Last month, she dropped to the floor while the aide was helping her back into bed in the assisted living facility. She had hip surgery on her broken hipbone.   After a month, she is still not able to do more than stand - no walking and no rehab. Her abdomen is swelling up although her bowels seem to be working fine.   We've heard that elderly persons who break a hip tend to die during the healing process. Can you please tell us what stages elderly persons go through and what causes these deaths? Are there symptoms we should be watching for?  Thank you. Ladysmith52\n\n",
    "posted_time": "Post  by Ladysmith52 » Thu Jun 22, 2006 6:22 pm",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=33105&sid=9a059bfae727ef74978292aae44a3dd2#p33105"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi Ladysmith52, Some of the most common complications of a hip fracture typically occur post-operatively. For example, Infection, pneumonia, and blood clots are frequently the cause of mortality. In the elderly population, the mortality rates are highest during the first year following the hip fracture. After that, according to studies, the rate of mortality seems to decline as a direct result or complication of the fracture itself. Many elderly may not return to the activity function of the pre-injury level. Is she being treated for the osteoporosis? Is there a reason rehab has not been initiated? Have there been any diagnostics, ie, abdominal films, completed to identify any abnormalities of the abdomen? Best wishes to her for an uneventful recovery. Sincerely, Theresa Jones, RN\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Tue Jun 27, 2006 6:00 am",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=33164&sid=9a059bfae727ef74978292aae44a3dd2#p33164"
  },
  {
    "author": "VWilkins  Guest Posts: 1 Joined: Wed Feb 01, 2006 4:27 pm",
    "title": "Severe Hip joint pain",
    "content": "54 yrs., female white, hysterectomy 9/1983, hormone replacement is estraderm patch. HBP lisinopril 20 mg. a day and triamterene/hctz 37.5/25.  I was given Ibuprofen 800 mg. every 8 hrs.  I have been taking every 4 hrs. The Doctor wants me to have an MRI.  Can't sleep because of pain. It is even tender to touch the area. I have fallen several times last year, with no complications. After walking up/down stairs it hurts more. I have slight knee pain. I had neck surgery in 1995. Took bone from right hip to put in my neck. (Degenerative disk disease) I recently had a bone scan done and the results were femur neg. -2.12 and spine neg. -.86, but have not talked to the doctor yet. Please explain. Could this be creating the pain?\n\n",
    "posted_time": "Post  by VWilkins » Wed Feb 01, 2006 5:15 pm",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=29721&sid=9a059bfae727ef74978292aae44a3dd2#p29721"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi VWilkins, I hope you have had a follow up with your physician. Were you being evaluated for Osteoporosis? To my knowledge, one of the conditions that these values would be consistent with is Osteoporosis and may certainly cause significant pain. Sincerely, Theresa Jones, RN\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Thu May 11, 2006 9:14 am",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=32621&sid=9a059bfae727ef74978292aae44a3dd2#p32621"
  },
  {
    "author": "dstrase  Guest Posts: 1 Joined: Thu Mar 31, 2005 5:58 pm Location: Fairmount, In",
    "title": "Forteo",
    "content": "Bone density test have indicated ostepporis in my 63 year old wife.  She is 5'2 and weighs 105 lbs.  Our GP has her on Fosomax, but her OB/GYN doesn't think it is working and wants to put her on Forteo.  My concern is for safety first, and then on the reliability of the product. Will it do what the drug company says it will do?  Some say the drug is still to expermental, but her OB/GYN thinks it is the only thing to stop and actually regow bone.  What is your professional opinion of Forteo?\n\n",
    "posted_time": "Post  by dstrase » Thu Mar 31, 2005 6:14 pm",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=11667&sid=9a059bfae727ef74978292aae44a3dd2#p11667"
  },
  {
    "author": "Rhonda P, CEP  Paramedic Posts: 252 Joined: Wed Mar 16, 2005 8:37 am Gender: Female Location: USA",
    "title": "Forteo",
    "content": "Hello,  Forteo (Teriparatide) is a form of the naturally occurring human parathyroid hormone. Is only supplied and delivered to the body as a subcutaneous injection. Teriparatide forms new bone, increases bone mineral density and bone strength and reduces the chances of broken bones. It is used for the treatment of osteoporosis in both men and postmenopausal women who are at high risk for bone fractures, or who have failed or are intolerant of previous osteoporosis therapy. It may also be used for other purposes as prescribed by the Doctor.   Warnings: In male and female rats, Teriparatide caused an increase in the incidence of osteosarcoma (a malignant bone tumor) that was dependent on dose and treatment duration. The following categories of patients have increased baseline risk of osteosarcoma and should not be treated with Forteo: Paget’s disease, pediatrics, prior radiation therapy, patients with metabolic bone disease other than osteoporosis, patients with bone metastases or skeletal malignancies & patients with pre-existing hypercalcemia.  Use of the drug for more than 2 years has not been evaluated and is not recommended at this time. (all of the above information from the Physicians Desk Reference)\n\n",
    "posted_time": "Post  by Rhonda P, CEP » Thu Mar 31, 2005 11:48 pm",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=11679&sid=9a059bfae727ef74978292aae44a3dd2#p11679"
  },
  {
    "author": "Dr. P. M. Aries  Medical Doctor Posts: 41 Joined: Tue Jan 03, 2006 10:29 am Location: Europe",
    "title": "[no title]",
    "content": "Indeed, Forteo (or in Europe Forsteo) is a good drug for osteoporosis, but until now not in the first line. As the GP suggested, the drugs like Fosamax are in first line and should be prescribed before Forteo. Although Forteo is a promising drug, the scientific data are limited, the costs are high and there is no prove that it should be used before the bisphosphonates (like Fosamax). Recommendations suggest to use Forteo in case of side effects under bisphosphonates or refractory osteoporosis.\n\n",
    "posted_time": "Post  by Dr. P. M. Aries » Sun Jan 22, 2006 3:03 pm",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=28950&sid=9a059bfae727ef74978292aae44a3dd2#p28950"
  },
  {
    "author": "CrohnieToo  Guest Posts: 10 Joined: Sat Feb 18, 2006 11:57 am",
    "title": "Forteo Side Effect?",
    "content": "I'm a 63 yo female, 5'4\", small boned, w/mild Crohn's disease, 6 cm simple ovarian cyst I have opted to monitor for the past 3 years, osteoporosis and COPD. Altho my osteoporosis is severe I remain active (horseback riding, walking) and (knock on wood) no fractures.  Due to the Crohn's I admantly will not for a second consider the oral bisphosphonates. Just prior to the approval of Forteo I opted for a pamidronate infusion (Aredia - infusable bisphosphonate). With the advent of Forteo I read up on it thoroughly including the rat studies. Rats grow bone throughout their life, humans do not; rats were \"fed\" Forteo from birth to death; it is only approved for 2 years use in humans after maximum bone growth years. Despite my dread of self-injection I opted for the Forteo. Its been less than a year so far so I have no idea of any improvement in bone density.  However, a possible \"minor\" side effect has made an appearance. I've weighed 115-120 since the age of 13 except for pregnancies and 2 Crohn's exacerbations. I've always had a flat tummy and waist. I had some weight loss last year and was down to 98 lbs in July of last year. I've since gained back to 112-114 and have plateaued there. I started the Forteo injections in early August of last year. Since I am now retired I walk on a treadmill and ride an Airdyne exercise bike for a 1/2 hour each twice a week plus horseback riding and walking.   I have developed 3 \"spare tires\" or \"rolls\" slightly above the waist; below the waist and across the abdomen. I've spoken to 4 others on Forteo who have developed \"spare tires\" as well. My Endo is unaware of this as a Forteo side effect. Eli Lilly denies it as a reported side effect in 2% or more of clinical trial participants.  I would like to know how many others have encountered this \"spare tire\" whilst on Forteo. Side effect or coincidence?\n\n",
    "posted_time": "Post  by CrohnieToo » Sat Feb 18, 2006 12:45 pm",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=30928&sid=9a059bfae727ef74978292aae44a3dd2#p30928"
  },
  {
    "author": "CrohnieToo  Guest Posts: 10 Joined: Sat Feb 18, 2006 11:57 am",
    "title": "Re: Forteo",
    "content": "Recent research, including that of other PTH type meds for osteoporosis such as Preos, is indicating that bisphosphonate treatment prior to PTH treatment slows down the good effects of the PTH. The bisphosphonates do not boost new bone growth but rather slow natural bone death, the PTHs are proving to increase natural bone growth. Indications are that PTH therapy for two years followed by bisphosphonate therapy along with adequate calcium and vitamin D intake and weight bearing exercise is currently the most promising way to treat osteoporosis.\n\n",
    "posted_time": "Post  by CrohnieToo » Mon Feb 20, 2006 6:58 am",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=31017&sid=9a059bfae727ef74978292aae44a3dd2#p31017"
  },
  {
    "author": "kpd  Guest Posts: 1 Joined: Thu Jul 14, 2005 7:04 pm",
    "title": "pain in left arm and neck",
    "content": "i've recently started having a continuous pain in my upper left arm and some days wake up with tingling in fingers of my left hand. If i sleep funny i wake with a stiff neck. i'm 49 but still play lots of sport however about 15 years ago i had an x-ray on my neck after falling awkward playing football. It showed a wearing of 6@7 in the vertebrae could this be linked to my current problem because the pain is like having toothache in my arm.If so is thereany pain relief i can take.\n\n",
    "posted_time": "Post  by kpd » Thu Jul 14, 2005 7:18 pm",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=16818&sid=9a059bfae727ef74978292aae44a3dd2#p16818"
  },
  {
    "author": "Shannon Morgan, CMA  Medical Assistant Posts: 530 Joined: Fri May 06, 2005 6:28 pm Location: Dallas, Texas. USA.",
    "title": "[no title]",
    "content": "It does sound like the pain is coming from your neck; it causes shoulder and arm pain and/or tingling.  Since you did have an inury and have wear and tear between the vertebrae, it's most likely osteoarthritis.      You really should see a doctor if you are having not just tingling,  but numbness in the hand or arm.  It is treated with antiinflammatories, but with the possibly serious side effects of NSAIDs, talk to your doctor about it first.\n\n",
    "posted_time": "Post  by Shannon Morgan, CMA » Thu Jul 28, 2005 3:22 pm",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=17670&sid=9a059bfae727ef74978292aae44a3dd2#p17670"
  },
  {
    "author": "netswan  Guest Posts: 1 Joined: Thu Nov 24, 2005 11:22 pm Location: USA",
    "title": "[no title]",
    "content": "I'm not a nurse or a doctor.  I had the same symptoms two years ago. I ended up with a ruptured disk in my neck.....  I opted to self heal. It's been almost two years, and I'm finally not living in as much pain, but it is not all the way healed yet.  All, I did was sleep on my exercise mat, wake up and my arm killed, fingers were numb....  as the day progressed it got worse. It never occured to me that it was my neck, because my neck didn't hurt. In fact, my arm felt like it was a neck that had a crink in it......... Ouch.  I've had many people tell me they elected for surgery and were fixed up within a few months.  Good Luck,  Teresa King\n\n",
    "posted_time": "Post  by netswan » Thu Nov 24, 2005 11:27 pm",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=25632&sid=9a059bfae727ef74978292aae44a3dd2#p25632"
  },
  {
    "author": "celticgirl2000  Guest Posts: 1 Joined: Sat Nov 20, 2004 4:02 pm Location: Prince George BC Canada",
    "title": "muscle heat",
    "content": "When you have arthritis do your muscles feel warm even when your not exercising.\n\n",
    "posted_time": "Post  by celticgirl2000 » Tue Feb 08, 2005 1:13 pm",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=9066&sid=9a059bfae727ef74978292aae44a3dd2#p9066"
  },
  {
    "author": "Dr. A. Saif  Medical Doctor Posts: 101 Joined: Mon Oct 25, 2004 1:56 pm Location: UK  Contact:   Contact Dr. A. Saif       Yahoo Messenger",
    "title": "[no title]",
    "content": "Dear Celtic girl,  It can do...possibly.   Arthritis can be degenerative (due to wear and tear) or inflammatory (due to the the joint lining being inflamed for example beacuse of gout, or rheumatoid arthritis. Inflammatory arthritis is, as the name would suggest associated with warmth of the joint.   Generally it is not the muscles that feel warm though.  Warmth in the muscle itself (as opposed to the joints) can be as you suggest, due to increased activity. But when you are not exercising...well that I guess is more likely to be either due to systemic increased temperature (when you have a fever) or if localised to a particular area, one might expect that there may be an underlying focus of inflammation such as an infection or abscess...  Regards  Saif\n\n",
    "posted_time": "Post  by Dr. A. Saif » Thu Feb 10, 2005 4:59 pm",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=9207&sid=9a059bfae727ef74978292aae44a3dd2#p9207"
  },
  {
    "author": "Carolyn  Guest Posts: 14 Joined: Thu May 20, 2004 7:20 pm Location: Northern California",
    "title": "Generalized Joint Pain",
    "content": "I am a 54 year old woman with arthritis of the spine and knees.  Since about my twenties I have had episodes of extensive \"all over\" joint pain that lasts anywhere from 2 to 4 days, and which occur at least 2-3 times a month.  This pain is different from my arthritis pain in that it occurs in every joint at the same time and there is a feeling of burning fire in every joint also. Nothing seems to help relieve the pain.  I have taken medication from anti-inflammatories to narcotics and get no relief.  In fact, the only thing that feels good is a cool bath to ease the sensation of fiery heat.  During these episodes, I cant sleep, rest or function at all.  I spend the time curled up in bed with a cool fan blowing on me.  Can you explain to me what this might be?  Is there anything that can be done to ease the pain and/or make me more functional at this time. I appreciate any understanding you can give me on this. Thanks, Carolyn\n\n",
    "posted_time": "Post  by Carolyn » Thu May 20, 2004 7:38 pm",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3347&sid=9a059bfae727ef74978292aae44a3dd2#p3347"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Were you told what the type of arthritis was? From your description it looks like a generalized osteoarthritis. You could also have developed osteoporosis (decreased bone density) over the years. If this is the case, you will benefit alot from being treated for this condition.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Wed Jun 02, 2004 12:11 am",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3532&sid=9a059bfae727ef74978292aae44a3dd2#p3532"
  },
  {
    "author": "Carolyn  Guest Posts: 14 Joined: Thu May 20, 2004 7:20 pm Location: Northern California",
    "title": "Osteoarthritis",
    "content": "I have been told I have degenerative osteoarthritis of the entire spine, knees, one ankle and both hands.  In fact I am being scheduled for bilateral total knee replacements over the next few months because of total loss of cartilage in the knees.  I am very familiar with what that kind of joint pain feels like.  When it is my usual arthritis pain of just  a few joints that hurt they get a little red at the joint and I hear a grating sound and feel pain when moving the joint.  This other problem though feels more like a severe aching all-over from the flu and hurts whether I move or lay still.  Could all my joints actually start and stop hurting at exactly the same time?  Can anything be done to relieve the pain. All the doctors offer me is narcotics since all the antiinflammatories have failed.  They are now talking about putting in a pain pump due to my resistance to oral narcotics in relieving pain?  Help, I am too young for all this.    Thanks, Carolyn   Tamer Fouad, M.D. wrote:Were you told what the type of arthritis was? From your description it looks like a generalized osteoarthritis. You could also have developed osteoporosis (decreased bone density) over the years. If this is the case, you will benefit alot from being treated for this condition.\n\n",
    "posted_time": "Post  by Carolyn » Wed Jun 02, 2004 12:35 am",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3533&sid=9a059bfae727ef74978292aae44a3dd2#p3533"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Carolyn, Like I said earlier, you should have the possibility of osteoporosis ruled out. This condition is usually associated with generalized aching pains all over the body. Its also a condition that can be treated. Osteoporosis is diagnosed by a bone density scan.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Wed Jun 02, 2004 4:07 am",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3535&sid=9a059bfae727ef74978292aae44a3dd2#p3535"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Generalized joint pain",
    "content": "Dear Carolyn,  It seems like a long time (since you were in your twenties) for this to be going on without being seen a specialist. And if you were seen by a specialist, a rheumatologist in this case, what was the opinion given.  If your joints swell up and become red, this might be a kind of arthritis that has a recurrent course. But they are usually localized in certain joints though. The typical example for such kind is crystal-induced arthritis like gout and if this is the case then the degenerative arthritis that you have is most probably secondary to this arthritis as even though i am not a rheumatologist but i think that you are, like you said, still young for all this including to have both your knees replaced.  It is not a bad idea to check your bone density as well as part of the regular check up as you are post menopausal now (i would assume) and need your bones checked as it is very strongly recommended nowadays especially if you are a white woman, who used to smoke, exercise rarely, have a family history of osteoporosis or fractures in elderly women in the family.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Wed Jun 02, 2004 3:55 pm",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3549&sid=9a059bfae727ef74978292aae44a3dd2#p3549"
  },
  {
    "author": "Carolyn  Guest Posts: 14 Joined: Thu May 20, 2004 7:20 pm Location: Northern California",
    "title": "Re: Generalized joint pain",
    "content": "Actually the first sign of arthritis started at about age 13 when I had pretty bad pain in my finger joints and my hands were always so cold.  They did a test which included putting a tube down into my stomach and withdrawing gastric fluids.  This was done over several hours as I remember and was supposed to show them whether I had true arthritis or not. At age 14 the spinal pain started and I was diagnosed as having Scheurman\"s Disease of he back and wore a steel and leather back brace for over a year to help support my spine as they said the muscles were not strong enough to support the spine yet.  I don't know if this has any connection or not but thought it was worth mentioning.  Anyway,  I have been trying hard to get my doctors to take my current condition seriously but when you deal with a system like Kaiser Permenente, they don't seem do want to do anything unless it is life-threatening.  I just keep being told its just arthritis and I have to learn to live with it.  Well, I don't agree that it is that \"simple\", but I don't know what to tell them to get them to take this matter seriously.  Any suggestions?  Thank you again for spending so much time with this, it is rather heart-warming to find a doctor who seems to care. Carolyn    Yasser Mokhtar, M.D. wrote:Dear Carolyn,  It seems like a long time (since you were in your twenties) for this to be going on without being seen a specialist. And if you were seen by a specialist, a rheumatologist in this case, what was the opinion given.  If your joints swell up and become red, this might be a kind of arthritis that has a recurrent course. But they are usually localized in certain joints though. The typical example for such kind is crystal-induced arthritis like gout and if this is the case then the degenerative arthritis that you have is most probably secondary to this arthritis as even though i am not a rheumatologist but i think that you are, like you said, still young for all this including to have both your knees replaced.  It is not a bad idea to check your bone density as well as part of the regular check up as you are post menopausal now (i would assume) and need your bones checked as it is very strongly recommended nowadays especially if you are a white woman, who used to smoke, exercise rarely, have a family history of osteoporosis or fractures in elderly women in the family.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Carolyn » Wed Jun 02, 2004 11:36 pm",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3557&sid=9a059bfae727ef74978292aae44a3dd2#p3557"
  },
  {
    "author": "chrisy  Guest Posts: 11 Joined: Sun Nov 02, 2003 11:39 am Location: NY",
    "title": "osteoporosis",
    "content": "dear doctor,   my mothers is only 43 but she suffers from osteoporosis (she has the bones of 60+ old). recently (about one month ago) she felt pain in her chest. at first it was just parts, but now her ribcage is completely swollen. the results from her x-rays are normal, but she is in constant pain. i understand fosamax can cause chest pains, but the swelling started before she took the pills. she is also taking hormones (she had a complete histerectomy 2 years ago). please help us. thank you.\n\n",
    "posted_time": "Post  by chrisy » Tue Jan 27, 2004 11:19 pm",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2302&sid=9a059bfae727ef74978292aae44a3dd2#p2302"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Osteoporosis",
    "content": "Dear Chrisy,  Did your mom have any kind of trauma? What does her doctor think that this is due to? Does your mom have any skin rashes? Does she have any back pain?  If the x-rays are normal and you are suspecting a fissure fracture (fracture that is hair thin) not sometimes detected by x-rays, your mother can ask her doctor if he/she thinks that it is appropriate to do a bone scan to detect those subtle fractures if there are any.  Another thing is to make sure to check a spine x-ray to make sure that the pain is not due to spine fractures. Have your mother ever had herpes of the skin (shingles)?  These are some thoughts that you can ask your mom's doctor about. However, i have not examined your mother and these are only suggestions of course.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Wed Jan 28, 2004 7:34 am",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2304&sid=9a059bfae727ef74978292aae44a3dd2#p2304"
  },
  {
    "author": "chrisy  Guest Posts: 11 Joined: Sun Nov 02, 2003 11:39 am Location: NY",
    "title": "thank you",
    "content": "thanks for responding. my mother did not have a fracture and she has no skin rashes. i thought it has something to do with her liver (she right side protrude more than her left) or maybe it's costochondritis, but she going to see a bone doc.  thanks again, chrisy\n\n",
    "posted_time": "Post  by chrisy » Wed Jan 28, 2004 8:50 pm",
    "category": "Orthopedics",
    "sub_category": "Osteoporosis",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2314&sid=9a059bfae727ef74978292aae44a3dd2#p2314"
  }
]