[
  {
    "author": "kbkayani  Guest Posts: 1 Joined: Wed Aug 18, 2010 1:26 pm Gender: Female",
    "title": "can i become Mother if i have just one Ovary",
    "content": "Hello Doctor, I am a female and my age is 35, before 7 years my Uterus and Right Ovary had removed i have left Ovary I have two problems but first i explain my report of  Histopathology.  Cervix: Chronic Non Specific Cervicitis Endometrium: Proliferation Endometrium Myometrium: Leiomyomata Separate Tissue: Leiomyoma (in Pieces) Description: C55.9 , M889010 Sir now i have problem of infection in my internal part of lower apdaman always and face too much pain during the intercourse with my husband and we also want a baby. I have no baby before. tell me on one ovary i have can i become a mother if yes then what i can use for it. Thanks K.B.Kayani\n\n",
    "posted_time": "Post  by kbkayani » Wed Aug 18, 2010 1:54 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=101232&sid=7842654a5d38efc23337d8137afd525e#p101232"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "Re: can i become Mother if i have just one Ovary",
    "content": "Hello Kbkayani,  Having a baby with only one ovary is very possible; however, your post indicates that you had your uterus removed.  If this is the case, then, unfortunately, pregnancy will not be possible since the uterus is where the new baby grows.  Additionally, the uterus is the connection between the ovaries and the vaginal canal to allow for sperm to reach the egg for fertilization.    If you still have your uterus and only one ovary then pregnancy will likely be possible for you.   I hope this helps.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Mon Oct 24, 2011 11:38 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=102668&sid=7842654a5d38efc23337d8137afd525e#p102668"
  },
  {
    "author": "a-mkayne  Guest Posts: 1 Joined: Mon Aug 09, 2010 12:48 pm Gender: Female",
    "title": "Ca125 what is acceptable drop in count on post-op visit",
    "content": "I Have recently had an ovarian cyst discovered on my left ovary (6cm). Doctor was not concerned till he recieved the blood test (Ca125) result, it was 118. I was booked for a hystorectomy, but was  not sure what the test meant and requested a laporoscopic removal of the ovary and cyst. Upon removal it was discovered I had severe Endometriosis, which was removed with ovary, cyst and tube.  The doctor (Gyneacologist) said after the operation he was fairly sure that the endo caused the tumor count to be so elavated, and he is fairly sure it will drop. No mention was made re the pathologist tests on the tissue removed.The drop was only by 10 points  two weeks after the op was done. Is this acceptable and how long should it be average to drop to normal levels. I am afraid now that perhaps I made the wrong decision to have the laporoscopic removal and not the hystorectomy.\n\n",
    "posted_time": "Post  by a-mkayne » Mon Aug 09, 2010 1:16 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=100195&sid=7842654a5d38efc23337d8137afd525e#p100195"
  },
  {
    "author": "RHarper1969  Guest Posts: 1 Joined: Sun Aug 01, 2010 8:37 am Gender: Female",
    "title": "DEPLETED URANIUM AND OVARIAN CANCER",
    "content": "Is there a link between Ovarian Cancer and depleted uranium? Can this uranium cause ovarian cancer, any opinions about this?\n\n",
    "posted_time": "Post  by RHarper1969 » Sun Aug 01, 2010 8:42 am",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=99350&sid=7842654a5d38efc23337d8137afd525e#p99350"
  },
  {
    "author": "Libby76  Guest Posts: 1 Joined: Thu Jul 29, 2010 5:15 pm Gender: Female",
    "title": "Tests for ovarian cancer when pregnant with cysts?",
    "content": "Hi I am 20 weeks pregnant (with one child, conception dat certain) and have cysts on one ovary. I recently had a triple t test which revealed elevated hcg levels (4 times greater than the norm) and had a amniocentesis which came back as all clear (no abnormalities). What tests can i ask my doctor for if i am concerned that the elevated hcg levels could be due to ovarian cancer? Thanks Libby\n\n",
    "posted_time": "Post  by Libby76 » Thu Jul 29, 2010 5:21 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=99111&sid=7842654a5d38efc23337d8137afd525e#p99111"
  },
  {
    "author": "taybell  Guest Posts: 1 Joined: Fri Jun 11, 2010 9:07 pm Gender: Female",
    "title": "second ruptured cyst is that bad?",
    "content": "I was 16 when i had an ovarian cyst rupture on my right side and then the second time it happened i was 17 also on the right side and the same exact week as the other one. Is that bad could it mean something more serious\n\n",
    "posted_time": "Post  by taybell » Fri Jun 11, 2010 9:21 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=93881&sid=7842654a5d38efc23337d8137afd525e#p93881"
  },
  {
    "author": "Krispyz  Guest Posts: 1 Joined: Mon Jun 14, 2010 7:41 am Gender: Female",
    "title": "Having the same problem",
    "content": "I am having this same issue. I had an ovarian cyst rupture a little over a year ago when I was 22. I believe I had another one last night. I had the same pain, in the same area, but I toughed it out and was fine after about an hour and a half. I know I should have gone in, but it was 3AM and my memory of the potential side effects wasn't very good, I had forgotten there can be complications from the rupture. I know it's hard to diagnose since I didn't go in, but I am about 80% sure it was another ruptured cyst.  My question is the same as the one above, does persistent rupturing of cysts indicate cancer or any other malignancy of the cysts above normal? Another question would be if persistent rupturing will likely continue.\n\n",
    "posted_time": "Post  by Krispyz » Mon Jun 14, 2010 7:48 am",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=94071&sid=7842654a5d38efc23337d8137afd525e#p94071"
  },
  {
    "author": "jyotsnam60  Guest Posts: 1 Joined: Sun Feb 28, 2010 11:53 am Gender: Female",
    "title": "Ovarian Clear cell adenocarcinoma - platinum resistant",
    "content": "My mother (59, F) was diagnosed Ovarian cancer in June 2009 through CT Scan and CA 125 test. She had gone through 1 cycle of Chemotherapy (Pactitaxel-260 + Carboplatin 450) before Surgery (22nd Aug 2009). Her both ovaries (having large tumors), Uterus, Omentum & Appendix were removed.  In Biopsy the type was detected as Clear Cell Adeno-carcinoma admixed with Endometroid Carcinoma.  Post-operative, she has gone through 6 cycles of Chemotherapy using Pactitaxel-260 + Carboplatin 450 (till end of December). She responded during initial cycles (confirmed through decreased level of CA 125 results), but assessment after the 6th cycle showed that disease has comeback (confirmed through USG, PET CT and CA 125 results).  It seems that her disease is Platinum resistant, as it has come back / progressed during platinum treatment itself.  As a 2nd line , she has gone through 1 cycle of PLD, which didn’t have any effect as the disease progressed further (symptoms are gross ascites in peritoneal cavity, raised CA 125 levels).  Can you help me with the options ? I heard that some combination chemotherapy is the best option, but no real guidance on what best to use.  Regards\n\n",
    "posted_time": "Post  by jyotsnam60 » Sun Feb 28, 2010 12:21 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=92129&sid=7842654a5d38efc23337d8137afd525e#p92129"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "Re: Ovarian Clear cell adenocarcinoma - platinum resistant",
    "content": "Dear jyotsnam60,  First of all please accept my sincere apology for the delayed reply. I am sorry to hear about your mother's suffering as advanced cancer no doubt inflicts a severe physical and psychological suffering both to the patient and her family.  I will attempt to reply to your question because it is an important one, in the hope that others who find themselves in a similar situation may benefit from your question. As you mentioned your mother would be classified as platinum resistant which is a obviously a poor indicator of response to therapy in general. Ovarian tumors that resist platinum are difficult to treat and very aggressive.  The best second line option is again as you mention: PDL (Pegylated liposomal doxorubicin HCL). Whether a patient should receive a 3rd line would depend on her tolerance to chemotherapy. Is she strong enough to undergo a further attempt at controlling disease. If the answer is yes then the next viable option would be Topotecan. Another option is to use Gemcitabine as a single agent with response rates of approximately 20%.  For those that are deemed unable to undergo IV chemotherapy a viable alternative is oral vepside capsules.  Again, I am so sorry if this answer comes too late - I felt obliged to respond to you due to its significance.   With best wishes, Tamer\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Sat May 22, 2010 11:25 am",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=93326&sid=7842654a5d38efc23337d8137afd525e#p93326"
  },
  {
    "author": "indrasis  Guest Posts: 10 Joined: Mon Sep 15, 2008 3:40 am Gender: Male",
    "title": "Yellowing of eye and urine after etoposide.",
    "content": "The history of my mom's OVCA.  First detection March 2006. CA 125= 48..Total hysterectomy foloowed by cisplatin + Taxol. CA 125 remained 11-12.  2nd Detection  January 2008 (After 21 months) Isolated recurrence on Omentum. CA 125 =62.5  Treatment: Infracolic Omentectomy done,  4 cycles doxrubicin +Cyclophophomide and 2 cycles of 5FU.  After 8 moths another isolated recurrence in a Single lymph node 3cmx2.17 (Co eliac region).  CA 125 =128.... and after 3 months 537 and Lymph node slightly enlarged than earlier.(No treatment in between).  Treatment : Gemzar +Carbo.....   Result: After 3 cycles Lymphnode became NECROTIC and CA 125 =81 from 537 and CT scan showed everything clear except Necrotic LN.   But After 4th cycle CA 125= 230 but no symtoms of disease anywhere.  Doctor Now Starting Etoposide and CyclophosphamideDoctors saying the disease is very slow progressing and always ocurrring in an isolated place.  Lymphnode is dead now, so  can we try these drugs? But she is havinng Yellowish Eye and urine I got from net that it is a side effect from Etoposide.  What should be the treatment for taking her Liver back to normal position?    Thank you very much for your time. Indrasis\n\n",
    "posted_time": "Post  by indrasis » Fri Jun 12, 2009 11:50 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=80584&sid=7842654a5d38efc23337d8137afd525e#p80584"
  },
  {
    "author": "Camille Stubbs, RN  Nurse Posts: 7 Joined: Sat Sep 26, 2009 7:51 am Gender: Female",
    "title": "Re: Yellowing of eye and urine after etoposide.",
    "content": "Hello indriasis,  First, it is important to have the fifth cycle of chemotherapy related to the incidences that your mother has had reoccurences in different areas; cancer growth has not been contained in one area.  Yes, it would be ok to start this fifth cycle as ordered by her physician if she/he has cleared your mother to have it.       Secondly, Etoposide and Cyclophosphamide have side effects that can cause yellowing of the skin, eyes (jaundice).  It is important the physician is ordering liver function labs/tests to make certain the functioning is adequate while your mother is receiving chemotherapy.  These symptoms will most likely subside after treament.    Thirdly, it is also important for your mother to keep the lines of communication open between her and her physician.  Any problems experienced during treament should be reported and discussed with her physician(s) as soon as possible.  When in doubt, ask questions.   Good luck.\n\n",
    "posted_time": "Post  by Camille Stubbs, RN » Sun Oct 11, 2009 6:01 am",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=83599&sid=7842654a5d38efc23337d8137afd525e#p83599"
  },
  {
    "author": "Dr. Ramy M. El-Helw  Medical Doctor Posts: 6 Joined: Wed Nov 19, 2008 3:15 pm Gender: Male",
    "title": "Re: Yellowing of eye and urine after etoposide.",
    "content": "Dear Original Poster,   Etoposide, as with any drug of this nature has a laundry list of side effect. Most of them are unpleasant. One of the more serious side effects is hepatotoxicity. With liver failure or anything that may hinder the ability of the liver to do its job, Jaundice occurs which causes the yellowing of the whites of the affected persons eye. As soon as treatment ends, liver function usually returns and the jaundice dissipates. This is normal and expected and although should not be taken lightly, it is not severely alarming.  In terms of the decision of your chemotherapy cycles this is something your physician would have to judge depending on your progression or lack there of. It is very important that you find a physician who takes his time to listen and understand what you are going through, especially in the field of oncology. It is vital that a person suffering from any form of illness find a doctor he or she is comfortable with so that you take it upon your self to explain all of your questions, concerns and side effects you are experiencing so that the proper measures can be taken to ensure you have a speedy and healthy recovery.\n\n",
    "posted_time": "Post  by Dr. Ramy M. El-Helw » Tue Feb 23, 2010 11:24 am",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=91889&sid=7842654a5d38efc23337d8137afd525e#p91889"
  },
  {
    "author": "manmeet  Guest Posts: 1 Joined: Thu Nov 05, 2009 8:05 am Gender: Female",
    "title": "Cyst in right ovaries",
    "content": "I have been diagnosed with a cyst in my right ovaries.My ultrasound report says as follows:  \" Rt. adenexa shows a thick walled, irregular cyst of size 89mm X 98mmX118mm with volume of 543.70 cc. There are medium to low level internal echoes seen within this cyst. Two other cysts of size 35mm and 23mm seen adjoining to the larger one. Rt. ovary is not localized separately. Lt. ovary is normal in size and echopattern.\"  This cyst was diagnosed when I went for my check up to gynae after 3 months pregnancy. The baby is growing normal. And my doctor tells me since its in ovaries, it wont affect the baby's growth. And I have been advised to carry on with my pregnancy and have been told that at the time of delivery they would operate on this cyst and take it out and for this they will also have to take out my right ovaries. I now want to know what are the risks involved in this? Can this cyst rupture or burst in this long duration? Will taking out my right ovaries affect my chances of conceiving again? I have never experienced any pain due to this cyst till date.How are these cysts formed? What can be the possible cause? Is it right for me to continue with my pregnancy with this cyst. As this cyst was diagnosed quite late, reason being that I was taken for my check up only after 3 months pregnancy.Please advise. Also do I need to take any special precautions in this type of pregnancy.\n\n",
    "posted_time": "Post  by manmeet » Thu Nov 05, 2009 9:28 am",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=85982&sid=7842654a5d38efc23337d8137afd525e#p85982"
  },
  {
    "author": "Debbie Miller, RN  Nurse Posts: 4746 Joined: Mon Apr 16, 2007 2:41 pm Gender: Female Location: USA",
    "title": "Re: Cyst in right ovaries",
    "content": "Hello, This is a fairly common condition and before ultrasound examinations women were completely unaware of it unless it ruptured and caused pain.  Sometimes a little knowledge is a scary thing!  While the doctor will likely follow you closely to see any changes, you should not have to do anything differently in the pregnancy.      Your doctor is correct that the ovaries and cysts on them do not usually affect the baby in your uterus, though pain could be a problem.  If there is a rupture, infection is not usually a problem either.  I'm glad you are not having pain with this.  Enjoy your pregnancy and take good care of yourself generally.  Nobody knows why these cysts occur - just one of those things.  It would have made no difference to have an earlier diagnosis with earlier prenatal care so don't stress over this.  Monitoring is about all that can be done and usually it is enough.  Once the ovary is removed, you have a slightly reduced chance of achieving pregnancy only because typically one ovary releases an egg one month and the other the next.  But, it only takes one egg, one month to conceive.  In the case of fraternal twins, two eggs are released so you see that sometimes you still ovulate even more than this.  Most women with just one ovary are able to have the family they desire in absence of other problems.    Good luck with your pregnancy.\n\n",
    "posted_time": "Post  by Debbie Miller, RN » Fri Nov 13, 2009 12:36 am",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=86802&sid=7842654a5d38efc23337d8137afd525e#p86802"
  },
  {
    "author": "valchrisjust  Guest Posts: 2 Joined: Tue Jan 27, 2009 4:34 pm Gender: Female",
    "title": "Pain on lower left side of stomach, ovarian cancer?",
    "content": "Im 24 yr old female, Ive had a pain on my lower left side among other symtoms for about 2 years. For the first 6 months I had the pain about 2-3 times a month so I didnt think much of it. After the 6 months the pain started to come more frequently about 2-3 timea a week I also noticed a bulge on my groin area and on my left rib cage right where my spleen is at there is no pain just a little uncomfortable when I sleep on my stomach. Then my menstrual cycles became irregular. Now for the past year Ive had bowel problems, urinary frequency and bloating.I will either have diarhea or constipation. I don't have much of an appetite cause I tend to feel full to quickly. For the past 4 months ive had pain during and after intercourse along with the feeling of pressure. Now the pain is everyday and unbearable, gets worst with stress, prolonged sitting or after full day activities.I am very concerned and all my net surfing and family advice points to ovarian cancer. I have no family history of cancer of any sort. I know ovarian cancer is very hard to diagnos but I was just curious on what other possibilities it might be. Also the probability of me having ovarian cancer due to my history, symtoms, and age.\n\n",
    "posted_time": "Post  by valchrisjust » Tue Jan 27, 2009 5:42 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=69997&sid=7842654a5d38efc23337d8137afd525e#p69997"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Pain on lower left side of stomach, ovarian cancer?",
    "content": "Hello --  I sincerely hope that by now you've brought all this to the attention of a doctor and been evaluated and maybe have had your mind eased about all this. I'm going to answer, though, as if you've not yet done that. This has been going on a while, and while cancer is a possibility whenever we have things going on we can't explain, it would seem rather far down the list, given no clinical findings but only signs and symptoms as relayed here. You see, if this were cancer you would very likely, by now, have experienced profound sickness and wasting. This sounds more like it may be any one of a number of things, possibly more than one: And that's the catch here, that there's no rule saying you can't have more than one thing going on at the same time. The trouble is, we have no clinical findings to match with these signs and symptoms. I suspect, among other things, endometriosis. This could explain many of your symptoms. By the same token, for any number of reasons, your spleen could be enlarged. This is, in general, a problem, not necessarily because of the underlying cause but because of the increased fragility of the spleen. You could have an ovarian cyst. These are not difficult to visualize once they've developed for a while, and this may be the most likley culprit if there is only one. You may also have some inflammatory lower gastrointestinal problem. There could be a number of things going on, and it sounds as though there are at least two, most likely. The only way to know, to create and execute a treatment plan, and resolve or manage whatever's going on, is to see a doctor. Most people who post here with multiple problems like yours complain they've been to a number of doctors and haven't been able to find out what's wrong or want more information than the doctors have provided. You don't mention having had any medical workups for this. You're suffering, and very likely needlessly. My first and strongest suggestion is to have yourself worked up for all the potential causes of this. An abdominal ultrasound, comprehensive blood work, and a gynacological exam, together, may well expose the primary problem quickly. It's had time to develop, so is probably not hard to visualise at this point. That being said, I have to repeat that cancer of any serious type (I know -- isn't all cancer \"serious\"?) would have caused far worse problems by now, most likely.   I hope this is helpful, and that you'll take these thoughts and have this checked soon if you haven't already. Even the worst case, which would be some sort of slow-growing cancer, would be less \"serious\" than what you probably have imagined for yourself. Things tend to not get better on their own, and when they don't, we need to have them medically handled. I hope you'll do this Asap, and please  follow up with us here. Good luck to you.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Tue Mar 03, 2009 8:43 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=71148&sid=7842654a5d38efc23337d8137afd525e#p71148"
  },
  {
    "author": "valchrisjust  Guest Posts: 2 Joined: Tue Jan 27, 2009 4:34 pm Gender: Female",
    "title": "Re: Pain on lower left side of stomach, ovarian cancer?",
    "content": "Thank you for your reply. Since I have posted, I did go to the hospital for pain in my lower left back twice back in mar.09. They did a wet prep. which came out normal, Urinalysis had 1 flag which detected many squamos epi cells.Ct scan which came out normal.Blood tests came back normal. Vaginal ultrasound came out normal but they did find small amount of fluid in my endometrial cavity. don't remember if I had mentioned back in 03 after the birth of my second child I had a abnormal pap. had a colposcopy done and found cervicitis. I did get that treated.Did a follow up and everything was normal.Now for the past 3 weeks Ive had very watery discharge. Most of the time it is white other times it has streaks of blood in it. I do have a little bit of bleeding after intercourse now. I do plan to get insurance really soon. I have done a little bit of research on endometriosis not to much though.(from what ive heard is never pay to much to what the internet shows you when it comes to your medical issues cause it will just worry you to bits.) Just want to know before heading to the doctor is there any difference in symptoms between endometriosis and edometriol cancer? Or do my symptoms now seem to be pointing somewhere else?\n\n",
    "posted_time": "Post  by valchrisjust » Fri Oct 02, 2009 11:49 am",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=83377&sid=7842654a5d38efc23337d8137afd525e#p83377"
  },
  {
    "author": "indrasis  Guest Posts: 10 Joined: Mon Sep 15, 2008 3:40 am Gender: Male",
    "title": "Intermittent cyclic fever after Stenting for more than 3 wks",
    "content": "As I have already mentioned about the recurrence of my mother's OVCA in one lymph node in september 08 when CA 125 was 537 and came down to 85 after 3 cycles of Carbo and GEM. But after 4th cycle CA 125 became 228 in June 4th,09 and Now it is 1081 July 14th.  But USG showed no other growth but Cell(Enlarged lymph node) with Necrosis Compressing Bile duct. She developed jaundice and ERCP followed by Stenting was done just 2 days after.  Since then after 18 days Jaundice is almost cured but She is having intermittent cylcic fever everyday.Mostly in the Evening. She has been given CIFRAN (oRal) for first 7 days followed by Piperacillin and Tazobactum (IV) for 5 days but no remission of fever.   Could you please help me about the possible causes of the fever and treatment? I went through some sites in the net telling that this may happen due to Tumor necrosis in the Body.   The Enlarged Lymph node is situated in left coilliac fossa near Aorta. It has now become two dimensional and fallen on the bile duct caused lower 1/3rd stricture. Please help..\n\n",
    "posted_time": "Post  by indrasis » Fri Jul 31, 2009 7:38 am",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=81042&sid=7842654a5d38efc23337d8137afd525e#p81042"
  },
  {
    "author": "indrasis  Guest Posts: 10 Joined: Mon Sep 15, 2008 3:40 am Gender: Male",
    "title": "Re: Intermittent cyclic fever after Stenting for more than 3 wks",
    "content": "After prolonged treatment of antibiotic she is more or less afebrile now but rigor and jaundice has again come up due to plastic stent blockage.  Recent USG study showed a large epigastrium/retropancreatic mass with dimension 7cm x 6cm and no other growths.  My mom is suffering from extreme fatigue now and loosing appetite and tastes. Is this due to prolonged Antibiotic therapy?  Now what is the best possible treatment of reducing the solitary epigastrium mass Present for more than a year?  Surgery? Chemotherapy or Radiation? Please advise.\n\n",
    "posted_time": "Post  by indrasis » Tue Sep 01, 2009 11:08 am",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=81730&sid=7842654a5d38efc23337d8137afd525e#p81730"
  },
  {
    "author": "indrasis  Guest Posts: 10 Joined: Mon Sep 15, 2008 3:40 am Gender: Male",
    "title": "further CA125 drop.CT scan-Lymph node became necrotic and",
    "content": "My mother was diagonised clear cell OVCA in march 06 (Total Hysterectomy + 6 cycles of cisplatin +Taxol) had suffered recurrences in Dec 2007 in Omentum (Dissected and chemotherapy with liposmal dixrubicin + Cyclophosphamide) and September 08 ( One 3cmx2.5 cm lymph node at paraaortic region) Her CA went up to 537 and this is the first time her CA crossed 150 during 3 years.   After so many options like opn,alternative teatment for just one Lymph node we emphasized another round of chemo and She received 3 cyles of Carbo+Gemzar so far and Her CA 125 was 138 after 2nd cycle and It is 85 after 25 days of 3rd cycle.  Latest CT scan report shows one necrotic lymph node with a reduced size 3.1cmx2cmx2cm compared to 3.44cmx4cmx2.77cm in dec,08.   Doctros are happy to see the progress and now would not like to go for surgery but further 1/2 cycles of chemo. My question is What Does Necrotic node indicate (Is it good or bad)? And what should be the treatment mode from now on? Heard that isolated lymphnodes have better prognosis factor. can it be applicable for the above scenario? Please Advise. P.S :She is taking admission on 10th of april for 4th cycle.\n\n",
    "posted_time": "Post  by indrasis » Wed Apr 08, 2009 3:48 am",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=73539&sid=7842654a5d38efc23337d8137afd525e#p73539"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "Re: further CA125 drop.CT scan-Lymph node became necrotic and",
    "content": "Hello,  I'm sorry to hear about your mother's condition. Clear cell ovarian cancer is associated with a less favorable outcome, which would explain why your mother has had to go through several lines of chemotherapy. Clear cell carcinomas also tend to be more resistant to platinum and taxanes. This may explain the excellent response she is having with Gemzar.  A necrotic lymph node is a good thing. What necrosis means is dead tissue. This is due to cells (mostly cancer cells) dying due to the effect of therapy.   One really cannot determine the course of therapy from now on. Since it depends on many things including how well she will respond to her current rounds of chemotherapy and how long this duration will last. If for some reason she does develop a recurrence, the location and presentation of the recurrence is also very important.  CA 125 is very sensitive for follow up of therapy in advanced ovarian cancer and actually may predate clinical progression by approximately 6 months.  Best wishes for a complete recovery.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Thu Apr 09, 2009 10:45 am",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=73670&sid=7842654a5d38efc23337d8137afd525e#p73670"
  },
  {
    "author": "indrasis  Guest Posts: 10 Joined: Mon Sep 15, 2008 3:40 am Gender: Male",
    "title": "Carboplatin and Gemzar produced Good result so far",
    "content": "My mother was diagonised clear cell OVCA in march 06 (Total Hysterectomy + 6 cycles of cisplatin +Taxol) had suffered recurrences in Dec 2007 in Omentum (Dissected and chemotherapy with liposmal dixrubicin + Cyclophosphamide) and September 08 ( One 3cmx2.5 cm lymph node at paraaortic region) Her CA went up to 537 and this is the first time her CA crossed 150 during 3 years.   After so many options like opn,alternative teatment for just one Lymph node we emphasized another round of chemo and She received 2 cyles of Carbo+Gemzar and Her CA 125 is 138 now just after 10 days of last dose of 2nd cycle.   We are planning to go for another cycle but my mom is reluctant to go for another. Though another can be managed...  Do you have any idea what whouold be our next step?  Should we go for another surgery though she is not liking to take the suffering again of surgery. Otherwise she is energetic,agile and have no problems at all. Please advise.\n\n",
    "posted_time": "Post  by indrasis » Wed Mar 04, 2009 7:39 am",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=71160&sid=7842654a5d38efc23337d8137afd525e#p71160"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "Re: Carboplatin and Gemzar produced Good result so far",
    "content": "Hello,  I am not really in a position to advise you at all. What I can do is explain a few points regarding the management of ovarian cancer. Platinum regimens (especially carboplatin-taxol) is the 1st line regimen for ovarian cancer whether in the adjuvant setting or after after the disease has recurred if there is at least a 6 months platinum free period as well as in the metastatic setting.   Carboplatin-gemcitabin has also been associated with similar outcome to carboplatin taxol but the comparision is indirect as these regimens have not been compared to each other in the same clinical trial. One of the main reasons to use carbplatin gemcitabin is in patients with residual neurotoxicity due to previous taxol.  That said, the mainstay of treatment in ovarian cancer is surgery but only when surgery can achieve what is known as optimal cytoreduction (ie, size of the tumor left behind after surgery is <1cm). If optimal cytoreduction is not achievable the role of surgery becomes doubtful.  So its really up to her surgeon to decide whether optimal cytoreduction is achievable depending on the disease present in her recent scans. Again, the results of surgery in the setting of recurrence (2ry cytoreduction) is not acceptable by all and most surgeons require that patients receive chemotherapy first as a sort of invivo test for chemosensitivity.  She seems to be doing really well with gemcitabin-carboplatin and it is a relatively less toxic regimen. Why does she wish to avoid receiving additional cycles? I would have thought the results of her markers would be reassuring.  Best regards,\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Thu Mar 05, 2009 3:15 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=71199&sid=7842654a5d38efc23337d8137afd525e#p71199"
  },
  {
    "author": "jillryremom  Guest Posts: 1 Joined: Thu Jan 01, 2009 2:31 pm Gender: Female",
    "title": "Post hysterectomy? 8cm adenexal mass ovarian origin",
    "content": "Hello I am 37 years of age, I had a abdominal hysterectomy 9/07, everything removed due to size of fibroid except L ovary.  6months ago I experienced some L sided pain followed by Lower back discomfort, hormonal changes night sweats, indigestion, increased abdominal girth and weight gain around mid section 20+ pounds. I new something was wrong and thought that I was going into early menopause.  Followed up with a new GYN and was sent for an ultrasound for a possible cyst.  I now have been told that I have a large complex adenexal cyst/mass?? stated to be 8cm and probable need for surgey.  My sister had breast cancer at age 24.  Is there an increased risk that this could be cancer? What questions should I ask, and is ovarian cancer something that grows quickly.  I just had the hysterectomy a little over a year and would have thought they would have noticed something on the ovary that was left behind.  Thank you for your help I am just a little scared.  Going to the GYN next week.\n\n",
    "posted_time": "Post  by jillryremom » Thu Jan 01, 2009 2:54 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=66567&sid=7842654a5d38efc23337d8137afd525e#p66567"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "Re: Post hysterectomy? 8cm adenexal mass ovarian origin",
    "content": "Hello,  I hope you are doing well and that your visit to the gynecologist went well.   Obviously, there are several reasons for concern. The fact that the mass is complex (solid/cystic) as well as the fact that it grew so quickly.   To answer your question about your risk, yes, unfortunately a personal / family history of ovarian / breast cancer is a strong risk factor (2-6x at risk).  That said it should be noted that the incidence of ovarian cancer is lowest in premenopausal women.   Please keep this thread updated! Good luck!\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Tue Jan 20, 2009 9:08 am",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=69117&sid=7842654a5d38efc23337d8137afd525e#p69117"
  },
  {
    "author": "afoster2  Guest Posts: 1 Joined: Sat Dec 27, 2008 1:08 am Gender: Female",
    "title": "Ovarian cancer or menopause",
    "content": "i am 49 years old and have pain in my left ovary. i have had a period every 2 weeks for 2 months, is this ovarian cancer or menopause?\n\n",
    "posted_time": "Post  by afoster2 » Sat Dec 27, 2008 1:20 am",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=65998&sid=7842654a5d38efc23337d8137afd525e#p65998"
  },
  {
    "author": "Debbie Miller, RN  Nurse Posts: 4746 Joined: Mon Apr 16, 2007 2:41 pm Gender: Female Location: USA",
    "title": "Re: ovarian cancer and menopause",
    "content": "Hello, One of the problems with ovarian cancer is that it is considered a \"silent\" disease because it does not usually give you warning with pain, etc.  So, my thought is that it is not likely to be this.  However, you should be having annual exams with your gynecologist because that is the best way to screen for disease.  There are many possible causes for pain, including ovarian cysts.  Also, there are many organs in the pelvic cavity aside from the sex-related organs.  Pain can be coming from any number of areas from urinary tract system to bowel disorders and digestion.    The period of peri-menopause can also bring a variety of symptoms so seeing your doctor about this is a good idea.  Many people have so many symptoms during this period that they actually feel great once actual menopause occurs.    You need the general pelvic exam and any recommended labs such as thyroid, hormone levels, etc. to be sure you are not missing something that might give you relief through treatment.    Best wishes.\n\n",
    "posted_time": "Post  by Debbie Miller, RN » Sat Dec 27, 2008 10:36 am",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=66025&sid=7842654a5d38efc23337d8137afd525e#p66025"
  },
  {
    "author": "catzeyes  Guest Posts: 1 Joined: Tue Aug 26, 2008 3:46 pm Gender: Female",
    "title": "SYMPTOMS OF OVARIAN CANCER?",
    "content": "I have recently developed a multitude of symptoms that are very worrisome and looks like I may possibly have something wrong with my ovaries. I developed my first symptom of urinary frequency and urgency 8 months ago that lasted for two months.  I have a history of UTI's so initially I took antibiotics that usually work.  After seeing several doctors, and trying 3-4 different antibiotics, the urgency got better on its own, but did not totally go away.  Three months ago, I added a second symptom of pain in my left kidney area, which over the next few months has relocated to the abdominal area, including sensitivity when I press on my ovaries.  I also have lower back pain when I bend over or exercise.  I have water retention in my lower and upper abdomen, and my clothes are fitting tighter.  And last night I found a large thickened area or mass over my left ribcage.  I am also dealing with an edema on my upper left leg, dry mouth, and loss of appetite. I plan to see my doctor in the near future, but do these symptoms indicate ovarian cancer, or is something else going on in my body?\n\n",
    "posted_time": "Post  by catzeyes » Tue Aug 26, 2008 4:28 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=59328&sid=7842654a5d38efc23337d8137afd525e#p59328"
  },
  {
    "author": "Debbie Miller, RN  Nurse Posts: 4746 Joined: Mon Apr 16, 2007 2:41 pm Gender: Female Location: USA",
    "title": "Re: SYMPTOMS OF OVARIAN CANCER?",
    "content": "Hello, I am glad to hear you are seeing a doctor about this because it is very hard to guess what might be going on.  I can probably ease your mind somewhat in telling you that ovarian cancer rarely has symptoms so this would not be a suspicion.  On the negative side is that it is hard to diagnose early due to lack of symptoms so seeing your doctor regularly is always a good idea and if you have a family history of cancer - especially ovarian - you should discuss this risk factor with the doctor.    Any number of things can cause the symptoms you describe.  A complete physical exam is your best idea.  Best wishes\n\n",
    "posted_time": "Post  by Debbie Miller, RN » Thu Sep 18, 2008 3:57 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=60920&sid=7842654a5d38efc23337d8137afd525e#p60920"
  },
  {
    "author": "Dr. Ramy M. El-Helw  Medical Doctor Posts: 6 Joined: Wed Nov 19, 2008 3:15 pm Gender: Male",
    "title": "Re: SYMPTOMS OF OVARIAN CANCER?",
    "content": "Debbie, & to anyone whos situation is similiar, First and foremost, it is important to note that seeing your primary physician is very important when you start to observe sighns that things are out of place. Symptoms of ovarian cancer are more or less nonspecific. This means that their symptoms may or may not mimic symptoms of other conditions.  Non specific symptopms of ovarian cancer include numerous bladder and digestive disorders.  Infact, a woman who has ovarian cancer most of the time is misdiagnosd at first with another condition before learning that she actually has ovarian cancer.  Patients who do have Ovarian cancer will persistently see that their symptooms are becoming more of a hinderance as the days go by.  As ovarian cancer progresses, patients will experience urininary urgency, pelvic discomfort or pain, abdominal pressure, fullness, and severe swelling or bloating. Additionaly, ovarian cancer symptoms extend with other syptoms such as gas, nausea,  lower back pain, altered menstration cycles, increased abdominal girth (cloth fit alot tighter), constipation, and  dyspareunia.which is severe pain during intercourse. You also have a history of  Urinary Tract Infections. UTI's have similiar symptoms.  It is clear that your body is retaining alot of water and at the very least you may need to be put on a water pill regimen such as Lasix or Hydrochlorothiazide to regulate this matter. An important rule of thumb ladies and gentleman is that when a loved one is experiencing symptoms that they be taken to the doctor right away. Intervention and early detection have saved lives and could save more lives the more proactive we are. For females reading my post, See your doctor if you have any type of swelling, pressure or pain in your abdominal area, any sort of bloating, and any strange pelvic pains. Furthermore, if you hav recieved a diagnoses and still feel uneasy about the diagnoses go get a second opinion. Remember, Ovarian cancer is not always thought to be the intitial diagnoses and many people live withthe cancer thinking it is somethign else until its too late. Be proactive! Dr.Ramy M. El-Helw\n\n",
    "posted_time": "Post  by Dr. Ramy M. El-Helw » Wed Dec 24, 2008 6:51 am",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=65821&sid=7842654a5d38efc23337d8137afd525e#p65821"
  },
  {
    "author": "indrasis  Guest Posts: 10 Joined: Mon Sep 15, 2008 3:40 am Gender: Male",
    "title": "2nd recurrence of clear cell Ovarian Carcinoma need help.",
    "content": "My mom under went total hysterectomy with partial omentectomy in March 2006. When her CA 125 was 46.8.  Biopsy 1 Biopsy report revelaed 'CLEAR CELL' carcinoma of left ovary along with cervex. Chemo: Received 6 cycles of Cisplatin(300)+Taxol (60) upto September 2006.  CA 125 showed gradual decrease and remained stable from September 06 to in April 2007.CA 125 in April 2007=11.4. In Dec 07 she was diagonised with an Omental cake of 3.17x2.7cm. Infracolic omentectomy done in January 08.  Biopsy 2: Peretoneal washing showed no malignancies.but omental cake showed infiltrating malignant cells. CA 125 came down to 22.4 in February 08. Chemo 2:  She received 4 cycles of lipodox(doxrubicin) and cyclophosphamide and 2 cycles of 5FU(Oral).  Again in September 08 her CA 125 showed increase to 128. And CT scan revealed only One 3.17x2.44Cm Retroperetonial coeliac node.   My mom is totally asymtomatic and living with full energy and activities. Her Onco surgeon is suggesting wait and watch for 6 months for another CT and CA 125.But medicine Doctor for 1 month for another CA 125 and FNAC if possible as they both say it's an unususal kind isolated recurrence for Clear cell.   My questions are  1) Can we ensure that this is a recurrence? 2) What is the progress rate of the disease as it is always recurring in an isolated and single place and is one enlarged lymph node a better recureence than leisons or soft tissue mass?  3)If it is recurrence Should we go for surgery followed by chemotherapy or only chemothrapy?  4)Now what is the best chemo regimen for her?  Pls help me as I am waiting for a better treatment option for her.\n\n",
    "posted_time": "Post  by indrasis » Mon Sep 15, 2008 4:03 am",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=60538&sid=7842654a5d38efc23337d8137afd525e#p60538"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "Re: 2nd recurrence of clear cell Ovarian Carcinoma need help.",
    "content": "Hello, Ovarian cancer is the fifth common cancer in females in the United States. Epithelial tumors are the most common pathological subtypes of ovarian cancer that include clear cell histology.  The primary treatment is appropriate surgical staging and optimum debulking (a residual of <1cm). Comprehensive staging laparotomy, total abdominal hysterectomy (TAH) and bilateral salpingo-oopherectomy (BSO) compose the standard surgical approach. A biopsy or resection any suspicious area or LN should be done accordingly. The omentum should be resected from the transverse colon (an infracolic omentectomy).  Most cases are given chemotherapy after adequate surgical staging and optimal debulking except for stage Ia-b grade 1(tumor confined to one or two ovaries without ascites or positive peritoneal wash). Standard chemotherapy regimen is composed of  Paclitaxel, 135 to 175 mg/m2 (given before carboplatin or cisplatin, or Docetaxel 60-75 mg/m2) and Carboplatin, AUC 5 to 7.5 (or, cisplatin, 75 mg/m2).  According to the information you provided, your mother was staged II (at least) for which optimal debulking then adjuvant chemotherapy is recommended.   Patients who relapse after 6 month interval from treatment can be offered platinum containing therapy including: Carboplatin+Gemcitabine Carboplatin+Paclitaxel Oxaliplatin+Docetaxel Other active agents include etoposide, cyclophosphamide, ifosfamide, vinblastine, vincristine and liposomal.   5FU (and leucovorin)  mainly in combination with oxaliplatin has been tested only in phase II studies and was proved to be active in platinum sensitive epithelial ovarian cancer patients, however it is not yet part of the standard of care in recurrent ovarian cancer.  Patients who have relatively long disease free interval (>6mo) and develop a localized resectable recurrence can go a second optimal debulking and chemotherapy. Watchful waiting is an acceptable approach for those who have a rising CA125 as a sole evidence of disease relapse.  Regarding your question of how to ensure that this is a recurrence, a rising CA125 and development of new lesion by CT scan are strong evidences of disease recurrence on which many oncologist take treatment decisions.   Pelvic and para-aortic lymph node metastases are not uncommon in ovarian cancer. Although an isolated celiac node metastases is unusual presentation exclusion is not possible especially with rising CA125. Pathological evaluation of this node is the only way to confirm its nature.   Although your mother was progressing on chemotherapy, she has a relatively low tumor burden and a good general condition that makes her chances with salvage approaches very encouraging. There are different chemotherapy regimens that can be utilized in her condition as mentioned above. Going for surgery before second line chemotherapy is a decision taken by both medical and surgical oncologists.  Follow up with her doctor is essential and you can discuss with him all your questions. If you would like to go for a second opinion it is also a valid option.  Please keep us updated. Best regards.\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Wed Oct 08, 2008 1:22 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=61964&sid=7842654a5d38efc23337d8137afd525e#p61964"
  },
  {
    "author": "indrasis  Guest Posts: 10 Joined: Mon Sep 15, 2008 3:40 am Gender: Male",
    "title": "Re: 2nd recurrence of clear cell Ovarian Carcinoma need help.",
    "content": "Thank you doctor for your exellent reply. To update you more on my mother's report I would like to let you know her present report what was done a week back.   Recent USG after 4 months from last test which revealed a paraaortic coeliac node with dimension 3.17x2.44Cm report shows the old node has increased in size to 4cmx3cm and another 2 more nodes with smaller dimension of 2x2.5 cm.   Most of the doctors are suggesting Gemicitabine with Carboplatin for 2 cycles followed by Retroperetoneal Lymph node dissection. And probably from st week of January,09 she will be under treatment.  My questions are  1) As I came to know that Isolated recurrence of lymh nodes have exellent progonostic outcome than recurrence in other organs.  2) From the history of the disease can we say that Disease is slow progressing or A less aggressive disease? 3) Would Chemo be the only solution for her (I mean do nodes response to chemo? and is Surgery must? )and if Surgery is done what is the statistics of long term remission considering her history of disease.   I am sorry to load  a  lot but you can understand the way we depend on doctors an specially when we get chance to ask something to an expert like you.  Thanks a lot again Indrasis\n\n",
    "posted_time": "Post  by indrasis » Sun Dec 21, 2008 1:14 am",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=65534&sid=7842654a5d38efc23337d8137afd525e#p65534"
  },
  {
    "author": "indrasis  Guest Posts: 10 Joined: Mon Sep 15, 2008 3:40 am Gender: Male",
    "title": "Re: 2nd recurrence of clear cell Ovarian Carcinoma need help.",
    "content": "Forgot to tell you that her CA125 raised to 536 from 128 in this 4 monts.\n\n",
    "posted_time": "Post  by indrasis » Sun Dec 21, 2008 1:17 am",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=65535&sid=7842654a5d38efc23337d8137afd525e#p65535"
  },
  {
    "author": "CHANGE1400  Guest Posts: 1 Joined: Mon Nov 10, 2008 2:43 am Gender: Female",
    "title": "small pinch feeling in vagina tissue???",
    "content": "I just started feeling a small pinch feeling down in my vagina tissue. i thought it was from my pants rubbing but when i felt my vagina tissue(between my vagina canal and the lip), i felt a small, round bump. it is the size of a pencil eraser... what could this be?\n\n",
    "posted_time": "Post  by CHANGE1400 » Mon Nov 10, 2008 2:52 am",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=63721&sid=7842654a5d38efc23337d8137afd525e#p63721"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "Re: small pinch feeling in vagina tissue???",
    "content": "Hello,  This is more likely to Bartholin's glands problem like cyst or abscess. There are two Bartholin’s glands at the inside of the vulva near the entrance to the vagina posteriorly. They secret mucus-like fluid.   When their ducts are blocked they form cystic swelling filled with fluids. Bartholin’s duct cysts are usually unilateral and non tender, and palpable which may cause minor discomfort during intercourse.  If they became infected they form small abscess. Both conditions are mild and antibiotics may be needed for infection treatment.  Other causes to be excluded are dermatitis due to friction or infections like Candida. STDs should be excluded too.  Direct clinical examination is essential. So I would advise you to follow up with your doctor.  Please keep us updated. Best regards.\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Tue Nov 11, 2008 1:18 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=63887&sid=7842654a5d38efc23337d8137afd525e#p63887"
  },
  {
    "author": "HashiPatient2  Guest Posts: 4 Joined: Mon Sep 15, 2008 8:43 am Gender: Female",
    "title": "Persistant Septated Cyst (1yr) + Hemorraghic Cyst",
    "content": "28 y/o Hashimoto's Thryoiditis Patient with Multiple Lab Abnormalities and Persistant Septated Cyst-- Background:   --TPOab 3001  --TSH 12.688  --% Bioavailable Testosterone = 26.5%  --WBC = 11 (3+ years)  --Swollen lymph nodes in armpits, base of skull and neck (3+ years)  --Neutrophils (7.9)  --Hemoglobin (15.6)  --Hematocrit (46.0)  --Absolute CD3 (2326)  --%CD 4 Pos. Lymphs (61.5%)  --HCG <2.  Never pregnant.   Visited gyn last year for extreme pelvic pain, back pain, distended abdomen, urinary, and mentrual irregularities (losing period, worsening cystic acne).  When the sonagram came back, doctor wanted me to go for immediate laparoscopy to \"see what it was.\"  I declined laparoscopy b/c I felt rushed, doctor did not explain what his suspicions were or why laparoscopy was indicated over MRI.  I was uncomfortable with the facility with which he was affiliated-- hospital lost my chart on both previous visits, and I was left for HOURS in the ER meanwhile nobody knew I was there waiting for treatment.   One year later, went for annual exam and presented old sonagram report to new gyn.  Did a follow-up sonagram, and doctor seemed very concerned about what he saw.  Sent me for an in-house blood test immediately after consultation. Images looked bad, doppler evaluation shows poor vascularity.  Sent me for an MRI.     Follow up MRI:  --3.2 x 1.9 x 1.7 cm septated cyst in the left ovary, similar to that seen on ultrasound from a year ago.  --1cm Hemorraghic cyst in left ovary.  --Both ovaries demonstrate small follicles.  --No septal enhancement; no osseous abnormality evident.  --Free fluid in pelvis, likely physiologic.   Sounds like they were attempting to rule out ectopic pregnancy, dermoid cyst, and teratoma. Sounds like it also rules out standard functional cyst given septations and persistence of 1 year.  Thickness of septations was not noted; but clearly does not contain the type of enhancing calcifications expected of ectop or benign tumor.  This sounds really bad considering that all my blood work just came back elevated and my endo wants me to see a hemotologist.   My understanding is that MRI can't make the distinction between benign and malignant septated cysts.  Is that correct or a misunderstanding?   Would an MRI report ever directly list the dx / impression as \"ovarian cancer\"?  What language would you expect to find in a report for a patient who has not been previously diagnosed with cancer via biopsy?   Given the history of symptoms, lab abnormalities, urgency of an immediate blood test, and attempts to rule out a variety of normally benign conditions, I'm very scared that this MRI points to ovarian cancer.  Can you offer an opinion as to the degree of my risk at this point?   What do I do next?  Where do I go?\n\n",
    "posted_time": "Post  by HashiPatient2 » Mon Sep 15, 2008 8:48 am",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=60543&sid=7842654a5d38efc23337d8137afd525e#p60543"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "Re: Persistant Septated Cyst (1yr) + Hemorraghic Cyst",
    "content": "Hello,  An ovarian cyst is a collection of fluid surrounded by a thin wall within the ovary. They affect women of all ages but mainly during their childbearing periods. Small cysts causing no symptoms are usually kept under follow up and some types are expected to disappear in few months.  The majority are benign not harmful  (95%). Hemorrhagic cysts occur when a blood vessel rapture into the cyst. Hemorrhagic cysts like other types of ovarian cysts if lasts longer than two or three menstrual cycles, surgical intervention is considered. Some ovarian cysts may rupture and bleed causing pain. In these cases surgery is also of consideration.  MR imaging is very helpful in the differentiation between benign from certain malignant types of ovarian cancer (93% accuracy). However, it can not be used to diagnose or exclude malignancy. These MRI findings are very suggestive of malignancy: necrosis in a solid lesion and vegetations in a cystic lesion. In addition, supplementary findings include ascites and hemorrhage. Laparoscopy and biopsy are the investigations of choice.  Most cysts can be removed with laparoscopic surgery. Laparoscopy provide faster recovery and less scarring than traditional surgery.  Thyroid peroxidase (TPO) antibody  is used to detect antibodies agaisnt the thyroid gland conidtions similar to Hashimoto's Thryoiditis. Most people with chronic thyroiditis (70%-90%) are positive for TPOAB test.  Thyroid-stimulating hormone TSH Normal range is 0.4–4.5mIU/L. High TSH levels may be caused by hypothyroidism. Cuases include: -Hashimoto's thyroiditis is the most common cause of primary hypothyroidism. -A pituitary gland tumor is uncommon while inadequate thyroid hormone replacement medicine for a hypothyroid gland is very common.  To me your blood count is not that alarming and during infection or inflammations a similar mild elevation in the WBCs occurs. Lymphocytes constitute 16-45% of white blood cells. Of those lymphocytes, about 50% are T cells, and B cells, and natural killer cells each constitute 25% . Helper T-cells, or absolute CD4+ or T4 count is 500 to 1500 per cubic millimetre of blood (32-68% of lymphocytes).   It is not clear for me from the history given why your physician ordered the test and how he interpreted the results but under any circumstances hematologic consultation is beneficial.  I advise you to follow up with your doctor and to seek endocrinologist consultation.  Hope you find this information useful. Please keep us updated. Best regards.\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Wed Oct 15, 2008 7:01 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=62231&sid=7842654a5d38efc23337d8137afd525e#p62231"
  },
  {
    "author": "HashiPatient2  Guest Posts: 4 Joined: Mon Sep 15, 2008 8:43 am Gender: Female",
    "title": "Re: Persistant Septated Cyst (1yr) + Hemorraghic Cyst",
    "content": "Thank you so much for your time and energy doctor.  Truly, not everyone is willing to devote that kind of effort to help a complete stranger.  People like you bring renewed faith.  Thank you.    I have had extensive testing because my Hashi's has not responded appropriately to any of my medications over the course of several years.  Additionally, I was exposed for some time to very high levels of Aspergillus mold, so I plan to ask the surgeon to check for indications of systemic infection, though I know how slim that possibility is...  I am scheduled for laparoscopy in early December.  I will certainly let you know how everything goes.\n\n",
    "posted_time": "Post  by HashiPatient2 » Fri Nov 07, 2008 10:19 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=63532&sid=7842654a5d38efc23337d8137afd525e#p63532"
  },
  {
    "author": "AllyT  Guest Posts: 1 Joined: Tue Sep 16, 2008 5:17 am Gender: Female",
    "title": "Fertility after ovarian cystectomy",
    "content": "I have recently undergone laparoscopy to treat large ovarian cysts on both ovaries. I had a very large cyst drained on my right ovary and a cystectomy to remove two large cysts off left ovary. One of which was a dermoid cyst. Both ovaries have been left in tact. I am on birth control for a couple of months to rest my ovaries. I am worried whether my ovaries will work again after all they have been through. I am planning to start a family but am so scared they will not work. Do ovaries tend to work after undergoing such procedures? Thanks\n\n",
    "posted_time": "Post  by AllyT » Tue Sep 16, 2008 5:33 am",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=60627&sid=7842654a5d38efc23337d8137afd525e#p60627"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "Re: Fertility after ovarian cystectomy",
    "content": "Hello,  Any collection of fluid, surrounded by a very thin wall, within an ovary is known as ovarian cyst. Most ovarian cysts are functional and not harmful. They affect women of all ages but mainly during their childbearing periods. Small cysts causing no symptoms are usually kept under follow up and some types are expected to disappear in few months.  Larger (>5cm), complicated cysts and commonly dermoid cysts (benign cysts that usually develop at young age) are treated surgically and most cysts can be removed with laparoscopic surgery. Cysts are decompressed laparoscopically, so that the cyst wall is removed and the normal ovarian tissue is saved to preserve normal function and conserve fertility.   Removing cysts (cystectomy) without removing the ovary or removing one ovary completely (oophorectomy) by skilled surgeon allow preserving fertility. Following surgical removal of ovarian cysts, it is recommended to suppress ovarian function for a short period of time as you mentioned allowing them to rest.  I advise you to follow up with your doctor; he will also recommend some investigations during the follow up period to ensure that everything is within expectations. I advise you also to remind him with your positive family history of cancer (type was not specified) so he can recommend the best follow up plan.  Hope you find this information useful. Please keep us updated. Best regards.\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Mon Oct 13, 2008 5:26 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=62143&sid=7842654a5d38efc23337d8137afd525e#p62143"
  },
  {
    "author": "lindzyb  Guest Posts: 25 Joined: Tue Jul 24, 2007 9:50 am",
    "title": "I have been on my period for approximately 75 days straight",
    "content": "I have been on my period for approximately 75 days straight.  I have had a Pap. done which came back normal, and they put me on birth control (loestrin) to 'regulate' my period.  Well, I stopped for about 3 days and then started again, for about 5 days, then suddenly was overcome with pain in my lower abdomen.  I had VERY severe pain in the center of my lower abdomen (I'm assuming my uterus) and pain in both sides (Ovaries?).  The pain was so bad, and the bleeding was so profuse I was rushed to the ER where they did absolutely nothing except take blood to see if I was Anemic from all the bleeding, then sent me home.  The following monday, I went back to my OBGYN to have a vaginal ultrasound done.  The Doctor told me that my Uterine Wall was very thick, which is highly unusual for somebody who is on their period, and especially unusual for somebody who has been on their period for (at the time) 65 days.  He gave me no answers, just switched my  birth control to Femcon and put me on Provera for 10 days at a very high dosage.  (So high that my Pharmacist called him back to make sure it was correct).  My doctor told me to call him the first day of my next period so he could do another Ultrasound.  So after explaining all that, my question is does this sound like it could be an Ovarian Cyst or SOMETHING like this.  It's really irritating me that he's given me no answers.\n\n",
    "posted_time": "Post  by lindzyb » Mon Sep 17, 2007 7:26 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=47929&sid=7842654a5d38efc23337d8137afd525e#p47929"
  },
  {
    "author": "Debbie Miller, RN  Nurse Posts: 4746 Joined: Mon Apr 16, 2007 2:41 pm Gender: Female Location: USA",
    "title": "[no title]",
    "content": "You did not state your age but many women do experience Menorrhagia (excessive menstrual flow) and it is often treated just as you have been.  It is possible you have more than one problem going on at once and it will take a little while to figure it out and treat it.    In treating the excessive bleeding the doctors usually start with hormones and iron supplementation if that is indicated for blood loss, as your doctor is doing.  If your stomach can handle it, many women also benefit from the maximum dosage of a non-steroidal anti-inflammatory drug such as Ibuprofen (this is not just for the pain associated - it can actually help reduce the blood loss).  After trying non-invasive treatments like this, sometimes surgery is necessary, usually beginning with a D & C and/or hysteroscopy.  If you are past your childbearing years or have decided your family is complete, they sometimes do an endometrial (or uterine) ablation or resection where the entire lining of the uterus is destroyed.  In some cases a hysterectomy is required to control the bleeding.    As for the pain, yes, you could have ovarian cysts but I would expect your doctor will see this with ultrasound if that is the case.  So the most important thing for you is to keep in touch with your doctor and be patient as he/she tries to find the root cause.  Good luck.\n\n",
    "posted_time": "Post  by Debbie Miller, RN » Tue Sep 18, 2007 2:16 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=47954&sid=7842654a5d38efc23337d8137afd525e#p47954"
  },
  {
    "author": "fluffy1969  Guest Posts: 1 Joined: Thu Mar 27, 2008 11:09 am Gender: Female",
    "title": "I have been on my period for approximately 13 days straight",
    "content": "I am 38 years old and have been on my period for 13 days straight with the bleeding getting heavier and heavier, I am filling a super-plus sanitary towel in less than an hour!!  Up till now my periods have been regular once a month only lasting 4-6 days, so I am a little worried as I am loosing a lot of blood.  I do not have a partner so I am not on the pill and have been in the past either.  I am also very bloated and have sharp pains every now and then at the base of my uterus.  Is this just a normal period just lasting  longer than usual or should I get this checked out by my doctor!?\n\n",
    "posted_time": "Post  by fluffy1969 » Thu Mar 27, 2008 11:40 am",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=57022&sid=7842654a5d38efc23337d8137afd525e#p57022"
  },
  {
    "author": "babygurl121184  Guest Posts: 1 Joined: Mon Feb 25, 2008 7:02 am Gender: Female",
    "title": "no period for 2months",
    "content": "I am not preagant, so what could it be\n\n",
    "posted_time": "Post  by babygurl121184 » Mon Feb 25, 2008 7:29 am",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=54326&sid=7842654a5d38efc23337d8137afd525e#p54326"
  },
  {
    "author": "Debbie Miller, RN  Nurse Posts: 4746 Joined: Mon Apr 16, 2007 2:41 pm Gender: Female Location: USA",
    "title": "Re: no period for 2months",
    "content": "Normal hormonal fluctuation.  Most women have times of a missed period.  Irregular periods are considered normal.\n\n",
    "posted_time": "Post  by Debbie Miller, RN » Wed Feb 27, 2008 5:44 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=54536&sid=7842654a5d38efc23337d8137afd525e#p54536"
  },
  {
    "author": "capricekid  Guest Posts: 22 Joined: Mon Dec 25, 2006 8:27 pm Location: New york",
    "title": "COMPLEX Ovrain cyst",
    "content": "Hello i am  age 45. I went to the ER Two weeks ago with lower back pain and pelvic area pain. Kinda dull but pretty constant. It felt like pressure in my pelvic area. They found a   large 4cm  septated complex cyst in right ovary with mildly complex free fluid in pelvic area. I got a CT scan of my abdoman and pelvic. It showed a 2.5CM Cyst  right adenxal a small amount of free fluid is identified. no pelvic or inguinal lymphadenopathy was seen.  All organs were normal with no obstructions thickening or inflamations seen. Lung base was unremarkable as well.  I had a US also a transvaginal US. It said the cyst was 4CM not 2,5 like on the CAT SCAN?  It showed a Complex cyst with septation and mildy complex fluid in my pelvic area that may be of hemorrhage or debris. I had two CBCS done all were perfect.  My question I am still having back pain and bloating. I do not have the pain in my pevlic area any longer but the back pain and the bloating continues with a bit of heaviness in my belly. I went to the GYN and he wants to wait 4 weeks to see if the cyst resolves on its own. My question is why wait that long? I am afraid of ovarian cancer but was told that due to my age and the fact i am still getting my period that it is highly unlikly that it would be canerous. It does not run in my family at all.  The doctor also said the fact that my CT SCAN AND US showed all else to be normal except the cyst that if it were anything it has not spread. He said that the fluid was just due to the Cyst Rupturing. I am still very worried and am tired of feeling uncomfortable like this.  Does the fact that the CBC came back perfect point to this cyst not being cancerous?  Doc said my blood test would come back with abnormal levels if indeed there were cancer in my body. Is this true? Am i a worrying for nothing?  I just thought that maybe it should be taken out. I am just very worried. Besides the lower back pain and the heaviness i feel fine. I do have a lot of gas however i have also been on the gasy side.  I have energy but the pain is getting to me.   Thanks so much for your help.\n\n",
    "posted_time": "Post  by capricekid » Sat Dec 01, 2007 12:07 am",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=51000&sid=7842654a5d38efc23337d8137afd525e#p51000"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Lizzy,  Your description is consistent with a non-cancerous ovarian cyst but I cannot be 100% sure.  Often, when cysts are found like this it is recommended that the patient use oral contraceptives to \"take over\" hormone control for 6 months or so.  Often during this time the cyst will shrink or completely go away.    In your case, if there is concern the ultrasound can be repeated in 4-6 weeks to see if the cyst is getting bigger or smaller.  If it is getting bigger a biopsy can be done to find out for sure what is going on.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sat Dec 01, 2007 8:40 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=51057&sid=7842654a5d38efc23337d8137afd525e#p51057"
  },
  {
    "author": "capricekid  Guest Posts: 22 Joined: Mon Dec 25, 2006 8:27 pm Location: New york",
    "title": "Re: COMPLEX Ovrain cyst",
    "content": "Hello i had an MRI of the pelvic area as well as a follow up ultra sound. All cam out fine. The cyst was gone so that was a big releif. The lesson i learnt from all of this was NEVER think the worst. Stay on top of your own health issues but remain calm. This message board gave me so much support. Thank You\n\n",
    "posted_time": "Post  by capricekid » Fri Jan 25, 2008 12:21 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=53384&sid=7842654a5d38efc23337d8137afd525e#p53384"
  },
  {
    "author": "mritul  Guest Posts: 1 Joined: Sun Oct 14, 2007 5:40 pm",
    "title": "Ovarian Cyst on Right Ovary observed during pregnancy",
    "content": "Hi, I am 30 years old and 19 weeks pregnant. During my regular ultrasound (8th week os pregnancy), a cyst was observed on my right ovary. It was 8cm then. Now it has grown upto 10.4cm. The doctors describes it as \"large cystic mass in right aadnexa which is sepated and continues to solid area\". It has two solid masses of 2cm and 1.5cm in dia. I have been to a gynecological oncologist who suggests to remove it as soon as possible and is unable to say whether it is malign or not. He plans to perform a laparotomy during my 22nd week under general anesthesia. I and still not sure whether to go on with the surgery or wait until the term of my pregnancy. I fear harm to the baby I want so much. Please advice. I do not have any history of cancer in my family and never had any surgery before and have never been under and kind of medication. Thanks\n\n",
    "posted_time": "Post  by mritul » Sun Oct 14, 2007 6:01 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=48971&sid=7842654a5d38efc23337d8137afd525e#p48971"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Mritul,  This is a difficult situation.  There is a good chance that the mass is a simple ovarian cyst that is getting larger.  However, there is also a chance that it may be a cancerous mass.  It is important that you discuss with your gyn. oncologist  all of the risks and benefits of doing the surgery now and of doing it after the baby is born.  You will also want to discuss all the risks of anesthesia so that you are fully aware of all the issues of both doing the surgery now and waiting.  This way you can make an informed decision.  Sorry I can't really give you much advise on this one.  It is a personal decision.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sun Oct 14, 2007 6:53 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=48976&sid=7842654a5d38efc23337d8137afd525e#p48976"
  },
  {
    "author": "mcbc  Guest Posts: 1 Joined: Tue Aug 07, 2007 12:57 pm",
    "title": "Ovarian Cancer Metastis Symptomology",
    "content": "I am a 48 year-old female. I was diagnosed with ovarian cancer April, 2006.  I had complete hysterectomy done (inclusive of ovaries, cervix and appendix).  I experienced deep vein thrombosis and pulmonary embolism.  Heparin treatment initially failed and had internal bleed in abdomen resulting in severe anemia and blood loss.  Vena cava filter was placed.  Three weeks later unable to remove filter as it was still capturing clots.  It is now permanently placed.  Heparin therapy finally worked and was put on Coumadin upon discharge. Within one month spleen enlarged and suffered pleural effusion.  In following month, huge gallstone found and feared would go into duct so gallbladder removed.  Once off Coumadin for this procedure, I stayed off with pulmonologist running all blood tests to ensure blood factors not an issue, although he was not pleased I did this. I was fatigued all the time, had malaise feeling and was losing hair.  No chemotherapy or raditation therapy was recommended as cancer caught at stage 1B.  Since gallbladder removal, have developed odd things--pulmonary nodule in lung (continuing to monitor), cherry angiomas, redness in palms, itching on right cheek and under chinline and right side of abdomen, severe right pelvic pain that last 30-60 minutes two to three times per week, pain under right side of rib cage and into back, finding of suspected hemangioma on liver, lightheadness and appetite decrease.  In addition, within two-three months gained 30 pounds with no change in diet or exercise.  General CBC done and no problems found.  Thryoid blood work still out.  Seeing a gastro-enterlogist later this week and hematologist next week.  Could these things be connected to the ovarian cancer?  Could it be metastising and is there a timeframe on how long before a conclusive diagnosis could be made regarding that?  Are there other tests I should ask for?  I am scared.  Any help would be so appreciated.\n\n",
    "posted_time": "Post  by mcbc » Tue Aug 07, 2007 1:26 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=45905&sid=7842654a5d38efc23337d8137afd525e#p45905"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Mcbc,  My knowledge of ovarian cancer is a bit limited so please take what I say with caution.  Some of your symptoms could be due to cancer recurrence, especially the spot on the lungs.  I'm not sure all your symptoms can be explained by a cancer recurrence, though.  There are plenty of other possible causes of your symptoms as well so my best advise to you would be to follow up with your oncologist for an evaluation.  You may need some further imaging and testing to help determine if a recurrence has occurred.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Thu Aug 23, 2007 9:44 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=46775&sid=7842654a5d38efc23337d8137afd525e#p46775"
  },
  {
    "author": "plantaintree0my  Guest Posts: 1 Joined: Tue Aug 07, 2007 8:34 pm",
    "title": "no period w/out birth control for a year and four months",
    "content": "I stopped having my period in april of 2006. There was nothing out of the ordinary happening in my life, although I was nearing the end of my senior year in high school.  Through out the summer  my appetite changed and geared me towards eating lots of unhealthy carbs and sugars. I felt depressed. I went to the Gyno. She told me my estrogen levels were very low and put me on birth control. I was on it for about five months, although I did skip a few months after I started taking it, because I wanted to see if I would get it on my own. I am starting to feel hoplessly hormonal again, and I really would prefer to find a way besides birth control to get my cycle back to normal. I have also been experiencing annoying itchiness and most recently after having sex, I started bleeding the next day, it lasted about four days. I don't know if the bleeding was my period or not. I would really appreciate some wise words. Thank you\n\n",
    "posted_time": "Post  by plantaintree0my » Tue Aug 07, 2007 9:30 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=45938&sid=7842654a5d38efc23337d8137afd525e#p45938"
  },
  {
    "author": "Debbie Miller, RN  Nurse Posts: 4746 Joined: Mon Apr 16, 2007 2:41 pm Gender: Female Location: USA",
    "title": "[no title]",
    "content": "I'm sure it is frustrating for you.  Hormones can certainly fluctuate and amenorrhea (absence of periods) can have a number of causes.  Using hormones, as with birth control pills, are about the only way you will be able to regulate your periods.  Sometimes it takes a year or more on the oral contraceptives, so I would advise giving it time to help.  It may eventually stabilize, however.  I would guess that the bleeding was, in fact, your period.  It certainly sounds like it to me.    You may have other underlying problems as well - even possibly depression, so you should stay in contact with your doctor about your symptoms.  There is also the possibility that another gland is causing your symptoms so you want to be evaluated thoroughly.    Best wishes.  Good luck with this.\n\n",
    "posted_time": "Post  by Debbie Miller, RN » Wed Aug 08, 2007 12:01 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=45957&sid=7842654a5d38efc23337d8137afd525e#p45957"
  },
  {
    "author": "munguss  Guest Posts: 1 Joined: Tue Jul 24, 2007 8:14 pm",
    "title": "Cystic mass with solid nodule in L ovary",
    "content": "I am 29 years old, was dianosed with cervical cancer last april and had a radical hysterectomy Dec '06.  Since then, I have had continuous pelvic pain and a TV ultrasound shows a cystic mass in R ovary and predominantly cystic mass with solid nodule in L ovary. About every 4 weeks or so I spike a fever around 102 in the evening, ache everywhere and am fine when I wake the next AM. The lymph nodes at the base of my skull have become enlarged in the past week and the CBC that was done a month ago showed a wbc count of 3.5 and decreased platelet count. I am tired all the time and have body aches and abdominal pain to go with the pelvic pain.  My oncology surgeon said to wait 3 months and redo TV ultrasound, if solid nodule is still there he will remove ovaries.  I have had multiple pelvic ultrasounds done in the last 3 years and have never had cysts before.  Should I be at all worried, my primary care physician seems to be, but my surgeon doesn't.\n\n",
    "posted_time": "Post  by munguss » Tue Jul 24, 2007 8:36 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=45207&sid=7842654a5d38efc23337d8137afd525e#p45207"
  },
  {
    "author": "Debbie Miller, RN  Nurse Posts: 4746 Joined: Mon Apr 16, 2007 2:41 pm Gender: Female Location: USA",
    "title": "[no title]",
    "content": "I think you can feel confident in your surgeon's advice, but you can always seek a 2nd opinion if you are not comfortable with that.      You might want to consult with a gynecologist.\n\n",
    "posted_time": "Post  by Debbie Miller, RN » Sun Jul 29, 2007 9:44 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=45486&sid=7842654a5d38efc23337d8137afd525e#p45486"
  },
  {
    "author": "linguist  Guest Posts: 1 Joined: Sun Jul 08, 2007 2:58 pm",
    "title": "Multilocular ovarian cyst",
    "content": "Hi , I need some help. When I went for my first pregancy scan 2 weeks ago the sonographer discovered a 16cm septated multilocular cyst on my right ovary. There was also no heartbeat from the babies (identical twins). I took pills to clear the miscarriage and the bleeding has almost stopped now.  I have to get a laparotomy on 18th July to remove the cyst. I am so worried -as my consultant is saying little to me can any doctor answer some of  these questions? By the way I'm in Scotland.  1. Could I have cancer? My CA 125 test results were 30 which they said is slightly higher than normal.  2. Can these type of cysts be benign or are they more likely to be malignant 3. What exactly are the septations and why do they occur? 4. Will the laparotomy be really painful? 5. I have no children , I'm 35 and still want to conceive but he says he 'll probably need to remove one ovary. Can I manage with the other one? 6. Could the miscarriage and cyst be linked?  Many thanks!\n\n",
    "posted_time": "Post  by linguist » Sun Jul 08, 2007 3:12 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=44331&sid=7842654a5d38efc23337d8137afd525e#p44331"
  },
  {
    "author": "Debbie Miller, RN  Nurse Posts: 4746 Joined: Mon Apr 16, 2007 2:41 pm Gender: Female Location: USA",
    "title": "[no title]",
    "content": "I'm sorry for your loss.  Miscarriage is a frequent complication of pregnancy, occurring in as many as 25% of all pregnancies.  It is a little hard to measure because many occur before the woman even knows she is pregnant.  Most miscarriages are unexplained - we don't know what causes them and therefore can do little to prevent them in most cases.  It is believed that most of the time it is nature's way of ending a pregnancy in which the baby (or babies) would not have been able to survive because things were not growing as they should.  Yours sounds like one of those.   Many women have ovarian cysts which do not interfere with pregnancies.  This has not even been identified as even a risk factor in miscarriage.   \"Septated\" simply means it is divided by a membrane rather than being totally open as a bubble. It is my understanding that malignancy rate for this type of tumor is low.  Removing it will answer the question since lab analysis will be part of the treatment.  So nobody can tell you today if it is cancer but I don't see major red flags here either.  You can achieve a pregnancy with only one ovary.  Many women do.    Your laparotomy will likely be performed under general anesthesia so you will not feel it at all.  Recovery will be as with other surgical procedures - there will be some pain/tenderness but it should be well controlled with pain relieving medications.  You should expect to be on activity restriction for a couple of weeks after the surgery.    I hope this helps.  Take care and let us know how things progress.\n\n",
    "posted_time": "Post  by Debbie Miller, RN » Wed Jul 18, 2007 12:32 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=44790&sid=7842654a5d38efc23337d8137afd525e#p44790"
  },
  {
    "author": "khenn1986  Guest Posts: 1 Joined: Thu Jan 25, 2007 2:32 pm  Contact:   Contact khenn1986       Yahoo Messenger",
    "title": "Procedure and i cant remember what it was for!",
    "content": "Hello, my name is Katy I'm 20 years old. I was diagnosed with Stage four ovarian cancer about a year ago. I have always had problems with my ovaries, resulting in one being removed when I was 9 due to an abnormally large cyst. Then, being cut open again at 13, and 16 for the same large cysts. Cancer runs like water all through my father's side, so its no surprise that things have ended up the way they have. This year has been crazy, and very challenging. At first I was in denial telling myself it would just go away, but it doesnt work like that and now I'm reaping that thought everyday. I started chemo in early september and it has been hell. I've come to avoid overnight hospital stays although I'm sure that quite a few times they were needed ( I cannot rest in a hospital bed! ). Recently they have stopped chemo because I fell very very ill with something (for the last month or so), that something ended up being mono! But now I am feeling better, well as good as I can feel. So I'll get to the point. I had blood work today to check my counts out and what not before we set up chemo again, and  they also sent me to what looked like an xray room, where they gave me a shot(s) into my spine! I feel like such a goober because my question is what the heck were they!? I was so out of it, I don't even remember what my doctor was talking about :( I've had it done a couple times before, but I won't be able to find out until he gets back from vacation next week! and my brother is gonna ask me a million questions on what they were/what they do and I have no clue!\n\n",
    "posted_time": "Post  by khenn1986 » Thu Jan 25, 2007 2:55 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=38018&sid=7842654a5d38efc23337d8137afd525e#p38018"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Perhaps some of my Oncology colleagues can give you more help, but I'll give you my two cents worth.  In pediatrics with leukemias and lymphomas it is very common to give a dose of chemotherapy into the spinal fluid to help prevent the cancer from spreading into the brain.  It is quite possible that this is what they were doing.    Again, I am much less familiar with ovarian cancer and its protocols; however, this is my best guess from your description of the shot in the spine.  Hope this helps and I hope you feel better soon.  Cancer is a difficult thing to deal with so your initial denial is understandable and quite common.  I wish you all the best as you fight on.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Thu Jan 25, 2007 5:27 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=38030&sid=7842654a5d38efc23337d8137afd525e#p38030"
  },
  {
    "author": "Dr. Leigh Anderson  Medical Doctor Posts: 71 Joined: Sat Jan 20, 2007 5:04 am Location: United States",
    "title": "[no title]",
    "content": "Hi Katy  It sounds like you had a CT/SCAN WITH CONTRAST  CT (computed tomography), sometimes called CAT scan, uses special x-ray equipment to obtain image data from different angles around the body and then uses computer processing of the information to show a cross-section of body tissues and organs. CT imaging is particularly useful because it can show several types of tissue—lung, bone, soft tissue and blood vessels—with great clarity. Using specialized equipment and expertise to create and interpret CT scans of the body, radiologists can more easily diagnose problems such as cancers  A CT examination often requires the use of different contrast materials to enhance the visibility of certain tissues or blood vessels. The contrast material may be swallowed, injected through an IV directly into the blood stream .  I wish you strength in this fight.  Good Luck and Please keep in touch  Dr. Anderson\n\n",
    "posted_time": "Post  by Dr. Leigh Anderson » Thu Jan 25, 2007 5:59 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=38033&sid=7842654a5d38efc23337d8137afd525e#p38033"
  },
  {
    "author": "zoeout  Guest Posts: 2 Joined: Sat Jan 13, 2007 11:53 pm",
    "title": "Early stages of ovarian cancer?",
    "content": "I am 19 years old and I recently had my ovary removed because of a cyst on it. I was informed by my doctor a few days ago that the pathology tests they did on the ovary suggested that there may be cancerous cells within the ovary. I had no symptoms leading up to the ovary removal. The only way we knew it was there was because I had a kidney stone several months ago and they dectected a mass on my ovary.   Right now we are waiting for more information from my doctor as to what will happen to me. He made it very clear that I needed to meet with more doctors in the very near future. In the mean time I'm scared and would like some information as to what I'm in for.   What sorts of tests will I be subjected to? What sorts of treatments might I have to undergo? Will I be able to continue with my normal activies while all this craziness is going on? (I'm a sophmore in college majoring in engineering) Has anyone heard of such a case before in regards to my age and situation?   Any information would  be helpful and much appreciated, I need some... peace of mind I guess.   Thank you.\n\n",
    "posted_time": "Post  by zoeout » Sun Jan 14, 2007 12:12 am",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=37640&sid=7842654a5d38efc23337d8137afd525e#p37640"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Hello,  It all depends on what the pathology report says. Generally speaking ovarian cancer does appear more frequently with age. It may appear without symptoms, discovered as in your case on routine investigation.  The most important next step will be doing investigations that can help determine the stage of your cancer. Depending on the presence or absence of several prognostic factors (bad signs) and your stage, the doctor will determine the best treatment approach for your disease.  Here's a link to the cancer.gov website which can help you understand more about your condition.  Click here!  Please keep us updated.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Mon Jan 15, 2007 7:31 am",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=37666&sid=7842654a5d38efc23337d8137afd525e#p37666"
  },
  {
    "author": "zoeout  Guest Posts: 2 Joined: Sat Jan 13, 2007 11:53 pm",
    "title": "[no title]",
    "content": "Thank you for your reply Dr. Fouad.   Here is the update on my situation so far:  I spoke with a gyno-oncologist today. He said during my surgury (he was not present but spoke to the doctor who had preformed it) the cyst had ruptured while being removed. He is concerned that the cancer cells could have migrated to other parts of my body. He also mentioned that the surgury was not \"staged\". I'm still not sure what this staging had to do with what is going on. If anyone can offer some clairification on that matter I would be very thankful. The total pathology report hasn't been finalized but my doctor wished to be fairly agressive inorder to stop the spread quickly if anything did migrate.    This week I'm scheduled for a CT scan of my abdomen and pelvis area in order for them to see if anything else looks suspicious. I'm also scheduled for my first chemotherapy treatment next week. I'm extremely nervous about the chemo. I'm going to attempt to continue my school work while all this is taking place.  Can any one, professionals or paitents, give me a detailed description of how I'm going to feel during and after the chemo? The doctor mentioned that it is different for different people, so if anyone would care to share their experiences I would be glad to read them. Also, how fast will I be losing my hair? Never did I think I would be bald at the age of 19... This more than anything makes me nervous because all my classmates will know what is going on and I don't know how to handle them knowing that.   Any information would be much appreciated. Thank you.\n\n",
    "posted_time": "Post  by zoeout » Mon Jan 22, 2007 9:15 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=37868&sid=7842654a5d38efc23337d8137afd525e#p37868"
  },
  {
    "author": "bindy  Guest Posts: 10 Joined: Sun Dec 31, 2006 5:44 am",
    "title": "Upper Abdominal Pain-> ongoing-> increases with moveme",
    "content": "Hi, For the past year now i've been dealing with abdominal pain. It's not like a dull pain, shapr or anything like that it's in a way more of a discomfort. At times it's like a pressure/bloating feeling which depending on wether i've done activity or been active for a while will only include my upper abdomen, or else my abdomen as a whole.  Initially i belived my abdominal problem to be borught on by a horse riding accident which happenned about the same time. With that i came off my horse and landed (from what i can gather) onto my shoulders at the base of my neck.  In any case. Up till now i've belived that my ongoing abdominal pain/discomfort was a muscular related thing, as the pain/discomfort increases after i've done activity. After numerous doctors and finally one who would send me for proper tests, i had a CT scan the other day. I don't know what to look for in the films but i looked at my report, as i go back to current specialist on the 15th of FEB.  It bascially said that everything was fine except that i had small mesenteric nodes (which i'm still trying to find information about) and that i had Bilateral small ovarian cysts. I'm just wonderign now wether my symptoms could be related to this and not the horse riding accident at all. When i think about it after reading symtpoms on the net i have had maybe a few of the symptoms of ovarian cysts. Also a few years back i had similar problems, at least i gather so but they went away after a while. Wether that could have been the same problem then i don't know. But if anyone has any info or advice i would really like to know.  My symptoms are: >Upper abdominal discomfort which is tender to touch, and also this is the same for the middle of my abdomen vertically.  >After activity my abdominal pain/discomfort increases sometimes dramatically and i feel as though i'm going to vomit and some times i've come close but as yet i haven't vomited. > the abdominal pain is there all the time, i find when i do the least activity, moving aroudn etc i feel a considerabel amount better but it's still there. >temperature seems to aggrivate it more as well... if i'm in aircon and become too cold i will begin to feel neasious. > my periods have been more painful and they tend to make me feel really neaseuos and i really can't do anything. > my bowle movements also haven't been liek they were before. frequently i'll either be constipated or have diarhea. When i have diarhhea right befor ehand i'll feel as though i'm going to be sick but i haven't been sick.  I'm certian it's not food related, as i've tried different diets excluing weat, lactose etc. I'm 15 years old and weigh 58kg (last time i was weighed which was 2 weeks ago (roughly).  Thanking you Bindy\n\n",
    "posted_time": "Post  by bindy » Sun Dec 31, 2006 6:10 am",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=37014&sid=7842654a5d38efc23337d8137afd525e#p37014"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Abdominal pain can be quite ellusive in discovering its cause.  I have a few questions for you regarding your pain.    1) Where in the upper abdomen is your pain?  Left, right, middle, etc. 2) Does eating help or worsen your pain? 3) Do you get the pain in correlation with your periods, are your periods regular, and is there any possibility of STD's? 4) Are you on any medications? 5) Have you had any blood work done and if so, what were the results?  Ovarian cysts can cause some of your symptoms, although they do not typically cause upper quadrant pain alone.  More commonly they cause lower quadrant pain.  Also, cysts can be an incidental finding.  Typically they are given 3-6 cycles to resolve and often do without treatment.    A few other possibilities for your pain include gallbladder disease, pancreatitis, gastritis and early inflammatory bowel disease.    I would suggest continuing to follow up with your doctor.  Hope this helps.  Keep us updated.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Mon Jan 01, 2007 6:58 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=37056&sid=7842654a5d38efc23337d8137afd525e#p37056"
  },
  {
    "author": "bindy  Guest Posts: 10 Joined: Sun Dec 31, 2006 5:44 am",
    "title": "[no title]",
    "content": "Thank you for your quick reply. I have been told by the numerous doctors that abdominal pain can be hard to diagnose because there are quite a few things that could be the cause of it. Unfortunately it's been a trial-and-error process over the past year.  In answer to your questions:  1)> It's in the middle, of my upper abdomen. It doesn;t move around or anything like that and is always there. Increased by activity. It's about the size of my hand when placed, and reaches down to just above my belly button.  (i hope that makes sense)  2)> Some times that depends... I've foudn travelling in the car a big problem and seems to aggrivate my abdomen quite a bit. And at times when i'm going for a car trip i take a sandwhich or somethign with me to nibble on and often this helps. Although if i've done enough activity which leads me to feel as though i've overdone it ( i originally believed my abdominal pain/discomfort to be muscular because activity worsens it) eating food doesn't really help.  Generally as i don't; do anythign now because i end up feeling worse off, eating isn't too bad... Although if i eat a large meal i find that my abdominal discomfort (same upper, middle abdomen) can increase but shortly passes if i sit and do nothing. For this reason i do tend to eat smaller frequent meals during the day.   3)> The abdominal pain/discomfort is always with me. I did take asperin- panadol etc at one stage but when they wore off i foudn it wasn;t worth being introduced to the abdominal pain/discomfort again as i will feel as though i've done activity and 'over done' it. (which still confuses me because ot me thats muscle in a way... When i have my periods I've had severe period pain and my abdominal pain/discomfort is decidedly of a more neaseus mature. (i find it hard to distinguish between wether it's pressure, blooating etc and neasea at times.. No possibility of STD's because I haven't had sex.  4)> No medications   5)> I've had about three blood tests during 2006r and have to get another one before i go back to my current muscle and bone specialist. All have come back telling me that i have a low iron level. For which i was given some iron tablets to take, that was early in 06. Other than that samples were testsed for celiac disease (not sure on the spelling), has to do with gluten intolerancy. I would have to find my results for the other blood results.   All throughout 2006 i belived my abdominal discomfort/pain to be msucle related because my discomfort increases dramatically after i've been active. previously i was a very active person. i ride horses and now when i ride horses well, i don't' because afterwards i feel as though i'm going to vomit but i haven't in the time i've experienced this. I also belived it to be muscular because the cold woudl affect me like my muscles were cramping up and causing problems and when i have done activity and have the feelign that i've 'over done' it applying a hot water bottle the warmth has helped.  Any information you can give me woudld be great. I think what i've typed is a bit mumble jumble but i'm forever thinking simple things could help in a diagnosis and it's hard to know wether anything is realted or not.\n\n",
    "posted_time": "Post  by bindy » Tue Jan 02, 2007 12:01 am",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=37065&sid=7842654a5d38efc23337d8137afd525e#p37065"
  },
  {
    "author": "bindy  Guest Posts: 10 Joined: Sun Dec 31, 2006 5:44 am",
    "title": "[no title]",
    "content": "sorry, just a bit i forgot. You mention:  [[ A few other possibilities for your pain include gallbladder disease, pancreatitis, gastritis and early inflammatory bowel disease. ]]  Would these show up on my CT scan i had recently?\n\n",
    "posted_time": "Post  by bindy » Tue Jan 02, 2007 12:03 am",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=37066&sid=7842654a5d38efc23337d8137afd525e#p37066"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Your answers are quite helpful.  Given your description of the location of your pain (in the epigastric area), the most likely origins of your pain are the stomach and pancreas.  Recurrent pancreatitis can be quite painful.  It is checked for by a blood test for amylase and lipase levels.  I think this is less likely but should probably be checked for if it hasn't been already.  The more likely thing base on your description of symptoms is a gastritis.  There are several things that can cause gastritis.  I would recommend you get a test for H. Pylori, a bacteria that can cause gastritis and ulcers.  Additionally, we are learning more about a set of conditions called eosinophilic esophagitis and esoninophilic gastroenteropathy.  They are thought to be a food allergy-but not allergy in the classic sense with hives, etc.  There are a few different treatments if this is causing the problems.  These are diagnosed by doing endoscopy and biopsying the lining of the esophagus and stomach (under anesthesia so you won't remember it).  A GI specialist is needed for this.    There are several foods that are the common culprits for food allergies: dairy, eggs, tree nuts, peanuts, wheat, and shellfish are among the top.  One could try a total elimination diet of these foods for 2-4 weeks.  If the pain goes away, add them back one at a time to see which was causing the symptoms.  Gallbladder disease is less likely with this location of pain (although not impossible).  A CT scan would likely have showed some thickening of the gallbladder if this was present.    Menstrual pains may be adding to your symptoms but I do not think that is the originating cause.  I was considering endometriosis; however, this pain tends to be cyclic with your periods.    I would suggest you see a pediatric gastroenterologist to help you work this up.  If you are able to do this, I would suggest not trying the food elimination before going, so that you don't \"partially treat\" the problem and make it harder to figure out.    One other random thought.  If you are having low iron levels chronically, you may consider checking a lead level.  High lead levels can suppress iron and cause abdominal pain.  (Much less likely than other problems, but an easy test to do.)  Also, you may try some antacids with the pain to see if it helps.  If it does, gastritis is very likely.  As to your question about CT scans, they would show gall stones, may show gallbladder thickening, and would show any cysts, etc. that may be associated with the pancreas or other organ.  They are unlikely to show evidence of gastritis or functional pain problems as they are static pictures.  Hope this helps, keep us updated.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Tue Jan 02, 2007 1:34 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=37105&sid=7842654a5d38efc23337d8137afd525e#p37105"
  },
  {
    "author": "bindy  Guest Posts: 10 Joined: Sun Dec 31, 2006 5:44 am",
    "title": "[no title]",
    "content": "Thankyou for all the information you've provided.  I had an endoscopy a while back and wasa told that i was 'normal' biopsy was taken and was tested for Helicobacter Pylori. Tests came back saying that it wasn't present. The GI asked if anything else helped and i explained how i'd been having chiropractic and bowen (massage) treatments and they give me some relief but doen't cure/fix it completely. he aid that if it doesn't go away in a few months that we can go back and more tests will be done. At the moment it looks like i might have to go back...   I'm just confused with in the event that it is a gastro type issue causing me my problems can activity increase discomfort/pain? Because that seems to be whats dumbfounding the doctors i've gone to for this problem.  [[[One other random thought. If you are having low iron levels chronically, you may consider checking a lead level. High lead levels can suppress iron and cause abdominal pain. (Much less likely than other problems, but an easy test to do.) ]]]  Woul your mention (above) about my lead levels suppressing my iron level and causing abdominal pain be worsened by activity?   Thank you again BIndy\n\n",
    "posted_time": "Post  by bindy » Tue Jan 02, 2007 4:31 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=37119&sid=7842654a5d38efc23337d8137afd525e#p37119"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "High lead levels would not have increased abdominal pain with activity, as far as I'm aware.  However, if there is some inflammatory condition going on, it is certainly possible that exercise could irritate it-regardless of the cause.  If, for example, you had some inflamed lymph nodes in the mesenteric covering of your intestines, activity would bounce them around irritating the already inflamed area.    With the intermittent diarrhea, you may also have a component of irritable bowel syndrome.  Unfortunately, we really don't have a good understanding of this syndrome but we are learning more all the time.  There are some new treatments for this.  I would recommend seeing your gastroenterologist again.  You may need some of the tests repeated.  Also, you may consider a trial of an acid blocking medicine to see if this helps.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Tue Jan 02, 2007 5:19 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=37122&sid=7842654a5d38efc23337d8137afd525e#p37122"
  },
  {
    "author": "bindy  Guest Posts: 10 Joined: Sun Dec 31, 2006 5:44 am",
    "title": "[no title]",
    "content": "---However, if there is some inflammatory condition going on, it is certainly possible that exercise could irritate it-regardless of the cause. If, for example, you had some inflamed lymph nodes in the mesenteric covering of your intestines, activity would bounce them around irritating the already inflamed area.---  The report i got back from my CT scan the other week mentions mescenteric nodes on my large bowel  as well but i can't find much about these nodes on the internet that is human or else the kind i'm wanting info on. I'm guessing the lymph nodes you refer to are the same thing ??\n\n",
    "posted_time": "Post  by bindy » Sun Jan 07, 2007 2:29 am",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=37405&sid=7842654a5d38efc23337d8137afd525e#p37405"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "These nodes are, indeed, the nodes to which I was referring.  Inflamed mesenteric lymph nodes can cause a significant amount of pain.  Occasionally, this can be so painful that a work up for appendicitis is done.  Interestingly, acute mesenteric adenitis would typically not continue for a year's time.  I would be suspicious of some ongoing inflammatory state or reaction that is causing the nodes to be inflamed, such as a food allergy or other inflammatory bowel condition.  Again, I would recommend re-evaluation by your gastroenterologist.  Hopefully, you can find an answer soon for your symptoms.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sun Jan 07, 2007 6:19 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=37440&sid=7842654a5d38efc23337d8137afd525e#p37440"
  },
  {
    "author": "bindy  Guest Posts: 10 Joined: Sun Dec 31, 2006 5:44 am",
    "title": "[no title]",
    "content": "Thankyou for all your supportive information\n\n",
    "posted_time": "Post  by bindy » Sun Jan 07, 2007 6:39 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=37441&sid=7842654a5d38efc23337d8137afd525e#p37441"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Always a pleasure.  I hope you feel better soon.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sun Jan 07, 2007 8:55 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=37446&sid=7842654a5d38efc23337d8137afd525e#p37446"
  },
  {
    "author": "Kathy0824  Guest Posts: 7 Joined: Fri Nov 19, 2004 4:41 pm Location: Sussex, New Jersey",
    "title": "Ovarian Cancer",
    "content": "]Hi, I am hoping someone might be able to help me.  I am 5' 4 and weigh 160 lbs.  I started gaining weight about 3 years ago for an unexplainable reason, other than age, I am 35.  I weighed 115 pounds when my weight gain started.  I have kept track of my dietary intake and I am only consuming 1600 - 1850 calories per day and I eat pretty healthy.  I have hair growth on my face and the classic buffalo hump on my back.  I have terrible night sweats where I have to change my clothes and I also have to urinate in the middle of the night at least once.  I have a lot of bloating and gas and my bowel movements change frequently to urgent diharea.  I am extremely fatigued all the time no matter how much I sleep and I have left arm tremor and I have a very hard time remembering things now.  I have spotting and my periods have changed drastically to extremely heavy, I go through a pad and super plus tampon in an hour or less.  2 years ago I had pneumonia with pleurisy and had ct scans several times and each time they found more nodules.  A bronchoscopy was (mostly normal according to the doctor), but he didn't elaborate.  I have pain during intercourse and bleeding after.  My pap smear was normal.  I had bloodwork for cushings syndrome and 24 hour urine all normal.  I don't have insurance and the doctors I have seen told me that because I don't have insurance they are swayed in how to treat me, so they don't.  I had one ovary removed when I was 19 with a \"precancerous mass\" and breast lumps removed twice that were precancerous.  Ironically the breast I had the lumps removed from is now leaking a black discharge that started about 6 months ago.  Mammo was normal.  I am really starting to feel like an idiot and I don't know what to do about this.  I exercise 5 days a week for 1 hour a day, I walk at 4 mph for 45 minutes and use weight machines for 15.  I have not lost one pound and I have been doing this since January.  My family history is not good, lung cancer, ovarian cancer, and uterine cancer in almost every female on my mothers side before the age of 30.  My mother had uterine cancer at 25 and I have 2 aunts that died before 50 and my grandmother was 62 and had many bouts with cancer prior to 50.  If anyone has any ideas or suggestions, I would greatly appreciate it.  Thanks so much.\n\n",
    "posted_time": "Post  by Kathy0824 » Fri Jun 16, 2006 11:22 am",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=33035&sid=7842654a5d38efc23337d8137afd525e#p33035"
  },
  {
    "author": "Kathy0824  Guest Posts: 7 Joined: Fri Nov 19, 2004 4:41 pm Location: Sussex, New Jersey",
    "title": "[no title]",
    "content": "I forgot to mention that in having one of my ct scans for the lungs, the radiologist noted a possible mass of the pancreatic tail.  The doctor said they didn't think it was anything and followup was not done, again this was because I have no insurance.  I have intermittent back pain on the right side and a dull achey pain on the right flank that comes and goes. Thanks.\n\n",
    "posted_time": "Post  by Kathy0824 » Fri Jun 16, 2006 11:40 am",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=33036&sid=7842654a5d38efc23337d8137afd525e#p33036"
  },
  {
    "author": "Kathy0824  Guest Posts: 7 Joined: Fri Nov 19, 2004 4:41 pm Location: Sussex, New Jersey",
    "title": "[no title]",
    "content": "Does anyone have any suggestions at all, I am at a loss and don't know what to do.\n\n",
    "posted_time": "Post  by Kathy0824 » Thu Jul 13, 2006 1:42 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=33386&sid=7842654a5d38efc23337d8137afd525e#p33386"
  },
  {
    "author": "Shana Johnson, CNA  Nurse Assistant Posts: 356 Joined: Sat Sep 03, 2005 5:13 am Location: Las Vegas, NV",
    "title": "[no title]",
    "content": "Hello, Kathy Have you been tested for Polycystic Ovarian Syndrome? If you ahev not, I suggest you mention this to your doctor, as a lot of your symptoms match PCOS.   These are some of the symptoms of PCOS:   infrequent menstrual periods, no menstrual periods, and/or irregular bleeding  infertility or inability to get pregnant because of not ovulating  increased growth of hair on the face, chest, stomach, back, thumbs, or toes  acne, oily skin, or dandruff  pelvic pain  weight gain or obesity, usually carrying extra weight around the waist  type 2 diabetes  high cholesterol  high blood pressure  male-pattern baldness or thinning hair  patches of thickened and dark brown or black skin on the neck, arms, breasts, or thighs  skin tags, or tiny excess flaps of skin in the armpits or neck area  sleep apnea―excessive snoring and breathing stops at times while asleep   Keep us updated, and good luck.\n\n",
    "posted_time": "Post  by Shana Johnson, CNA » Thu Jul 13, 2006 2:02 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=33387&sid=7842654a5d38efc23337d8137afd525e#p33387"
  },
  {
    "author": "Kay4  Guest Posts: 4 Joined: Mon Sep 26, 2005 12:41 pm Location: Colorado",
    "title": "Ovarian symptoms?",
    "content": "About a little over a month ago my belly suddenly started getting bloated and i felt menstrual like cramping, and dull ach in pelvic area, especially on right side, sometimes dull ach is felt down my right leg as well. I also started having to urinate all the time. And became very tired. Last week after my symptoms didnt go away after my period, and my belly kept growing I went to my regular Dr. She did pap smear and exam, she said she couldn't find my ovaries? And she thought maybe I have IBS, but she said it shouldnt make my belly keep growing, and make me have to urinate a lot. She told me to measure my belly once a week for a month and if it grew 5cmm in a month i need ultrasound. But its now grown one inch in one week- so seems like alot. I'm a small perosn and always had no stomach at all- until this sudden bloating started a month ago. Over last 8 months I also occasionally have bouts of diarehha, and gas pains. But that hasnt happened in several months- I look 5 months pregnant, and its happened so suddenly. should I be concerened with Ovarian cancer? Could an ovarian cyst cause these symptoms as well? And I'm wondering why she wasn't able to feel my ovaries? THANK YOU!!\n\n",
    "posted_time": "Post  by Kay4 » Sun Apr 02, 2006 3:47 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=32265&sid=7842654a5d38efc23337d8137afd525e#p32265"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi Kay4, Your age? Risks of certain types of cancer tend to increase with age. Some of the signs and symptoms of ovarian cancer may mimic other digestive disorders. The key to remember is digestive disorder symptoms tend to come and go while underlying disorders such as symptoms associated with ovarian cancer tend to persist and worsen. Abdominal bloating, fullness, etc. which persists or worsens, increased abdominal size, frequent or urgent urination, pelvic discomfort or pain, changes in bowel habits, persistent indigestion or gas, unexplained weight loss or gain, fatigue, etc. would all be considered warning signs. I would suggest that you call your physician back, explain that you have had an increase as you have stated, so that some diagnostic studies can be completed especially considering these may take a little time to become scheduled. Sincerely, Theresa Jones, RN\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Mon Apr 03, 2006 6:34 am",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=32272&sid=7842654a5d38efc23337d8137afd525e#p32272"
  },
  {
    "author": "Kay4  Guest Posts: 4 Joined: Mon Sep 26, 2005 12:41 pm Location: Colorado",
    "title": "[no title]",
    "content": "Thanks Theresa for your quick reply!  I'm 32, so fairly young. I will call my Dr today- my belly has grown another 1/2 inch since I last posted. And I have to urinate 5 to 6 times in one hour! All day long! I also have been getting shooting pains in pelvis area, down real low. Dr checked for bladder infection last week and said no. I also feel full all the time, and when I do eat I can only eat small amounts becausse I get full so fast. So something is definitly going on, I hope she will order ultrasound after I tell her these things! Especially since my belly is growing so quickly.   Thank you again!\n\n",
    "posted_time": "Post  by Kay4 » Mon Apr 03, 2006 2:49 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=32275&sid=7842654a5d38efc23337d8137afd525e#p32275"
  },
  {
    "author": "dixiechik0917  Guest Posts: 1 Joined: Sun Feb 05, 2006 10:48 pm",
    "title": "ovarian cancer",
    "content": "I am a 39 year old female with 2 children.  January '05, I was diagnosed with cervical cancer and in March'05, I was taken to the hospital because of a ruptured ovarian cyst, where I was told I had more cysts.  Since then, everytime I ovulate, I have pelvic pain and bloating.  The pain is almost as bad as when my cyst ruptured and it lasts for about a week.  I don't have any other symptoms than those.  I had 2 c-sections and a tubaligation.  There isn't any ovarian cancer in my family, but my paternal grandmother died from breast cancer.  Could this be ovarian cancer or is the pain caused from ovarian cysts?\n\n",
    "posted_time": "Post  by dixiechik0917 » Sun Feb 05, 2006 11:13 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=30032&sid=7842654a5d38efc23337d8137afd525e#p30032"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi dixiechik0917, Generally speaking, signs and symptoms of ovarian cancer may include: persistent indigestion, gas, nausea, unexplained weight loss or gain, changes in bowel or bladder habits, fatigue, pelvic, low back pain, abdominal heaviness, bloating, etc. Typically symptoms are relatively constant or persistent and gradually worsen. One of the most imortant risk factors for ovarian cancer is a family history of a first-degree relative (for example, mother, daughter, or sister) with the disease. Ovarian cysts most commonly appear in premenopausal women (women in their child bearing years). Ovarian cysts may cause no symptoms at all and be found incidentally by a routine exam, or for example, by ultrasound. When symptoms arise they typically cause pelvic pain, abdominal heaviness, menstrual abnormalities, etc. etc. Regular examinations are done to evaluate the presence and or type of cyst, follicular, corpus luteum, etc. to assure no further treatment is warranted. If you are not having regular evaluations, taking into consideration that you already have a history of a gynecological cancer I would strongly suggest that you inquire about this with your physician. Sincerely, Theresa Jones, RN\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Mon Feb 20, 2006 6:55 am",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=31016&sid=7842654a5d38efc23337d8137afd525e#p31016"
  },
  {
    "author": "AngeliqueS  Guest Posts: 1 Joined: Sat Jan 21, 2006 5:41 am Location: PA",
    "title": "Ovarian cancer symptoms?",
    "content": "My mom just passed away from ovarian cancer on October 18th, that's why I think I'm just overreacting, because of the fear in that, plus even though there has been many cases of ovarian cancer at a younger age, its very unlikely.   For the past 4 years or so I started having slight to moderate pain during sex. It's not everytime I have sex but the maternal clinic told me I have a tilted uterus, and the pain seems to happen when my cervix is hit. The only thing I find strange about this is, is this something that can develop? Because prior to this I did not experience any discomfort during sex at all.  The other thing that has been happening is that no matter how clean I make my kitchen, and no matter how well I cook my food, sometimes I get sudden symptoms that are just unexplainable. Especially when my husband is eating the same thing and hes fine. Sometimes I'll eat dinner, and about 2 hrs later feel hungry again like there is nothing in my stomach at all. Soon after that I get terrible cramping in my stomach as if I took a stimulant and then horribly painful diarrhea. This happens on a fairly regular basis, probably once a week at least, sometimes more. It happens even when I eat something with no meat in it too. And I cook everything to overdone at this point because I try to avoid this at all costs because it is incredibly painful. These digestive issues have also been going on for approximately 3-4 yrs. I mean as a teenager, I would eat things you're never supposed to eat like raw cookie dough while making cookies, and never got sick like this.   At some point about 4 yrs ago I did have what the GYN called a \"sebaceous\" cyst after he looked at my ultrasound. And it did not need any type of surgery because he said it would go away on it's own. And even did another ultrasound later to make sure it was shrinking.   Do you think I have reason to worry? If so, I am going to come up with the money somehow and go see a GYN Oncologist not just a GYN.  I unfortunately don't have insurance so I'd like some advice on whether that is my best move, or if I should go see a family doctor first?  Age: 23 Family history: Mother - passed away age 47 from Ovarian Cancer  Maternal grandmother - passed away age 54? colon cancer, breast cancer about 5 years prior to that, mom also told me she had a full hysterectomy, but was not sure why\n\n",
    "posted_time": "Post  by AngeliqueS » Sat Jan 21, 2006 5:53 am",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=28863&sid=7842654a5d38efc23337d8137afd525e#p28863"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Hello,  Researchers investigating the symptoms of early ovarian cancer in the 3 months proir to the diagnosis found that 50% were asymptomatic; 30% had abdominal pain or discomfort; 16% had abdominal swelling and 8% had nonspecific gastrointestinal symptoms such as increased gas, indigestion, lack of appetite, nausea and vomiting, inability to ingest usual volumes of food and bloating. 5% of patients were found to have pelvic pain or heaviness.[1]  The most important risk factor for ovarian cancer is a family history of a first-degree relative (e.g., mother, daughter, or sister) with the disease. The highest risk appears in women with 2 or more first-degree relatives with ovarian cancer. [2] The risk is somewhat less for women with one first-degree and one second-degree relative (grandmother or aunt) with ovarian cancer.  Approximately 5% to 10% of ovarian cancers are familial and 3 distinct hereditary patterns have been identified: ovarian cancer alone, ovarian and breast cancers, or ovarian and colon cancers. [3]  A strong family history of uterine, colon, or other gastrointestinal cancers may indicate the presence of a syndrome known as hereditary non-polyposis colon cancer (HNPCC), which confers a higher risk for developing ovarian cancer.  I think you should seek the help of a family doctor for now. I do not think your symptoms are due to ovarian cancer. On the other hand due to your relatively higher risk I would advise you to seek the attention of an oncologist for proper risk assessment and advice on preventive measures.  Best regards.  References: ========== 1. Lloyd H. Smith, Cyllene R. Morris, Shagufta Yasmeen, Arti Parikh-Patel, Rosemary D. Cress, Patrick S. Romano. Ovarian cancer: Can we make the clinical diagnosis earlier? Cancer. 104.7: 1398-1407. 2005. 2. Piver MS, Goldberg JM, Tsukada Y, et al.: Characteristics of familial ovarian cancer: a report of the first 1,000 families in the Gilda Radner Familial Ovarian Cancer Registry. Eur J Gynaecol Oncol 17 (3): 169-76, 1996. 3. Lynch HT, Watson P, Lynch JF, et al.: Hereditary ovarian cancer. Heterogeneity in age at onset. Cancer 71 (2 Suppl): 573-81, 1993.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Sat Jan 21, 2006 10:06 am",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=28868&sid=7842654a5d38efc23337d8137afd525e#p28868"
  },
  {
    "author": "runningchick  Guest Posts: 1 Joined: Thu Nov 17, 2005 10:17 am Location: London",
    "title": "Ovarian Cancer with Diaphragm C or Endometriosis of both?",
    "content": "I  have had severe problems for the last two months. I am an international marathon runner, and on September 11th, i ran a race in which I got the worst stitch of my life in my right side. I gripped my side and ran through it, and after the race it eased off. 3 days later, I ran for the 4th time since the race, and the pain was very clear from the beginning of a 90 minute run. It was so bad at one point, I was nearly sick. Prior to physio that afternoon, I had seen the doctor, as I also felt a little uncomfortable through my abdomen generally, and my Physio told me to get checked out by the doctor, as he didn't think the onset was typical of a stitch. The doctor said it was muscoskeletal.   Over the next 3 weeks, things got much worse - 7 medics, a trip to a&e, unable to breathe in fully, sneeze, yawn, the most profuse night sweat, and complete agony at times when moving position, either from sitting to standing, after a visit to the toilet, moving from one room to the next. My physio was prepared to put his name to paper in saying that this was not muscoskeletal, having worked on psoas, rectus abdominus, checked for hernias, whilst the pain gradually spread from my upper right quadrant to one inch right of my belly button, then down to one inch below that and inside the top of my right hip by one inch. I had a period that lasted 12 days, and appeared to pass a clot with connective tissue after 9 days of bleeding.   Finally, on 11th October, I was given a US, and 3 days later saw a gyny/obs who said there was a fist size lump that he could feel. The US came back with a left and right cyst, 5cm on the right and 3.5 on the left, plus an area that looked endometriotic in appearance, about 2.8x2.5 cm. The MRI confirmed this on 1st November. Also recognised on the MRI was that I have a small amount of serous fluid on my abdomen which could go some way to explaining why the whole of my abdomen has been excrutiatingly painful, at times bloated, and retrospectively, it's possible I had a cyst that ruptured, providing many of the symptoms experienced in the 6 weeks from 11th September   My CA125 was measured at 186 on 17th October, nowhere near menstruating. My last period was late, and this one is 10 days early.   I have pain in my breasts, particularly my left, which followed a period of pain and warmth in my neck. I have cloudy discharge from this breast. Now, 8.5 weeks later, the dominant pain is the pain around my diaphragm, where the pain originated from. I know there is a close link between Ovarian Cancer and the Diaphragm, and also between Endometriosis of the uterus and diaphragm. Beyond investigative surgery, which I would like to avoid, is there any way to determine which I have? Laprascopic surgery is planned for 28th December.   Thank you in anticipation of your help.   Is the only way to determine this by laprascopic surgery and investigation?\n\n",
    "posted_time": "Post  by runningchick » Sat Nov 19, 2005 2:48 am",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=25389&sid=7842654a5d38efc23337d8137afd525e#p25389"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi runningchick, Laprascopic surgery will identify if cancer is present, as well as the type and stage. I hope your surgery went well and my apologies for the delayed response. Sincerely, Theresa Jones, RN\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Tue Jan 03, 2006 6:58 am",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=27618&sid=7842654a5d38efc23337d8137afd525e#p27618"
  },
  {
    "author": "Gypsy  Guest Posts: 1 Joined: Mon Nov 14, 2005 8:58 pm Location: Texas",
    "title": "Tumor in my sister's stomach - am I at risk?",
    "content": "My sister had a tumor in her stomach removed. The doctor told me that I would be the next one in line to have a tumor. They stated that the next girl born after the one that had the tumor & that would be me! Do you know any symptoms that I would possibly have if I did have a tumor in my stomach are?  Thak you!  Gypsy\n\n",
    "posted_time": "Post  by Gypsy » Mon Nov 14, 2005 9:14 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=25160&sid=7842654a5d38efc23337d8137afd525e#p25160"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi Gypsy, Did you sister have Ovarian Cancer? There is a higher risk in some forms of cancer including Ovarian Cancer that suggests a heredity factor. Some of symptoms that may be associated with Ovarian Cancer are abdominal pressure, fullness, swelling or bloating, urinary urgency, pelvic discomfort or pain, persistent indigestion, gas or nausea, unexplained changes in bowel habits, including diarrhea or constipation, loss of appetite, unexplained weight loss or gain, increased abdominal girth or clothes fitting tighter around your waist, pain during intercourse, fatigue, back pain, menstrual irregularities, etc. etc. It would be almost impossible to say that a person is definitely going to be or not going to be ever diagnosed with cancer based only on the fact that one family member has cancer. It is possible to say that due to the heredity factor of certain types of cancer that risks are raised in other family members.   Sincerely, Theresa Jones, RN\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Tue Jan 03, 2006 6:48 am",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=27617&sid=7842654a5d38efc23337d8137afd525e#p27617"
  },
  {
    "author": "gregdrac  Guest Posts: 1 Joined: Wed Dec 14, 2005 8:18 am Location: pennsylvania",
    "title": "Ovarian Cancer Reoccurrence?",
    "content": "Here are the facts:  My wife first had ovarian cancer in 1989 and underwent a complete hysterectomy at that time.  It came back in 1991.  Since then, her CA-125 tests have been fine.  For the past year, she has had health issues, including a bleeding ulcer.  Now, she has lumps on both legs between the knee and the ankle.  On one leg, the lumps feel that like they are on the bone.  On the other leg, they feel more like in the tissue.  She is experiencing leg pain that is often severe in nature, as well as daily excruciating headaches (since she has had for the past 30+ years).  She has not had a CA-125 for about 18 months but she complains of no energy and general pain everywhere.  She was checked for lupus, which was negative.  However, her sed rate was quite elevated - near 100.  She is going to have a biopsy for temporal arteritis.  Although she is somewhat in denial, her mother had an increased sed rate and was treated for temporal arteritis .... until it was discovered that it was actually a reoccurrence of lung cancer and she died a few months after the cancer diagnosis.  My question/concern......could these symptoms, along with the sed rate issue, all be related to a reoccurrence of her ovarian cancer?  Should we explore that issue before temporal arteritis?  Thanks for thoughts/suggetions/help.\n\n",
    "posted_time": "Post  by gregdrac » Wed Dec 14, 2005 8:32 am",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=26711&sid=7842654a5d38efc23337d8137afd525e#p26711"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi gregdrac, An elevated sed rate is not specific to any one condition but of course may indicate an underlying problem. Conditions that may cause elevations are rheumatoid arthritis, lupus (which in her case has already been ruled out), blood malignancies, cancers that have metastasized to other areas of the body such as the lung, kidneys, breast, colon, etc. Has she experienced any signs and symptoms associated with Ovarian Cancer such as bloating, a feeling of fullness, gas, frequent or urgent urination, nausea, indigestion, constipation, diarrhea, fatigue, backaches, etc.? The CA 125 should certainly be repeated. Temporal Arteritis typically causes headaches but also there are other symptoms present. Visual disturbances, pain and stiffness, jaw pain, etc. etc. It would not be that difficult for both conditions to be explored simultaneously. I would strongly suggest that inquiry at the very least about a repeat CA 125. (18 months is a significant amount of time for this to not be completed).  Sincerely, Theresa Jones, RN\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Tue Jan 03, 2006 6:28 am",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=27616&sid=7842654a5d38efc23337d8137afd525e#p27616"
  },
  {
    "author": "druv  Guest Posts: 5 Joined: Thu Oct 06, 2005 12:33 am Location: india",
    "title": "ovarian cancer",
    "content": "just for information sake I wanted to know how is caelyx important for the cure for ovarian cancer.\n\n",
    "posted_time": "Post  by druv » Thu Oct 06, 2005 12:36 am",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=22616&sid=7842654a5d38efc23337d8137afd525e#p22616"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Check this link on our website: click here!\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Thu Oct 06, 2005 1:27 am",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=22622&sid=7842654a5d38efc23337d8137afd525e#p22622"
  },
  {
    "author": "cbarrett  Guest Posts: 7 Joined: Sun Oct 03, 2004 11:59 am Location: georgia",
    "title": "Simple ovarian cyst - will it progress to cancer?",
    "content": "I am 44 with a 15 yr hx of endometriosis.My drs have told me it is the worse they have ever seen and do not know how I tolerate the pain,they suggest hysterectomy but I am not able to do it.I do not have the luxury of \"down time\" to recuperate,take care of elderly dad,etc. My last lap was 2 yrs ago,it showed endo \"everywhere\" and the dr aspirated a simple cyst on lt ovary.I have been told left ovary was practicaly gone because of endo.I have constant excruciating pain on left side,sharp-shooting-stabbing in nature.Last gyno exam was March,dr said everything \"felt\" fine,ovaries appeared to feel normal.two weeks ago my best friend,47 yrs old,died of metastatic ovarian cancer,only knew she had it for 4 weeks.Now,my mind is playing tricks on me,I am convinced I have it and will die soon.I refuse to go to the dr.My question,do cysts and endo cause same symptoms of ovarian ca? I have pain,no abnormal cycles.\n\n",
    "posted_time": "Post  by cbarrett » Thu Jun 30, 2005 1:54 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=16085&sid=7842654a5d38efc23337d8137afd525e#p16085"
  },
  {
    "author": "Shannon Morgan, CMA  Medical Assistant Posts: 530 Joined: Fri May 06, 2005 6:28 pm Location: Dallas, Texas. USA.",
    "title": "[no title]",
    "content": "Do not worry; your pain is from the endometriosis.  When your doctor does the exam manually to feel the ovaries, he is feeling for any lumps.  If you had ovarian cancer advanced to the point of excruciating pain, he would know by now.    Your ovary is eaten up with endometriosis according to your doctor. Doctors don't take ovary pain lightly, believe me.    Of course, we don't have any recent imaging or CA-125 tests to see; call your doctor, you'll feel better.\n\n",
    "posted_time": "Post  by Shannon Morgan, CMA » Thu Jun 30, 2005 5:04 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=16092&sid=7842654a5d38efc23337d8137afd525e#p16092"
  },
  {
    "author": "cbarrett  Guest Posts: 7 Joined: Sun Oct 03, 2004 11:59 am Location: georgia",
    "title": "[no title]",
    "content": "Thank you Shannon for being so kind to reply to me.You really helped put my mind at ease. I have not had a Ca125 test due to the fear of the results-if that makes any sense!I know several things such as stress,endometriosis,etc can elevate them besides ovarian cancer.With my anxiety I don't need to add to it. MY physician has never felt it was necessary-he was so sure on u.s. that the cyst was benign 2 yrs ago-it was less than 2.5 cm and it was functional once he went in with the lap..I have not had another u.s. or lap since then,that was almost 2 yrs ago.I am pretty sure my constant-chronic-debilitating pian is endo.Thanks again for your kindness to reply.\n\n",
    "posted_time": "Post  by cbarrett » Fri Jul 01, 2005 10:55 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=16158&sid=7842654a5d38efc23337d8137afd525e#p16158"
  },
  {
    "author": "sick  Guest Posts: 1 Joined: Mon Jun 27, 2005 3:24 am Location: kenya",
    "title": "Painful abdomen and no periods",
    "content": "hi,i have been experiencing abdominal pain especially when relieving myself.sometimes its painful to touch my lower abdomen.also my stomach feels bloated most of the time.i have not had my periods for the last four months.what could my problem be?\n\n",
    "posted_time": "Post  by sick » Mon Jun 27, 2005 3:50 am",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=15898&sid=7842654a5d38efc23337d8137afd525e#p15898"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi sick, Aside from ovarian cancer another disorder that may cause bloating and abdominal pain are ovarian cysts. Hormone imbalances may also cause absence of menstrual cycles. However, I would very strongly suggest taking into consideration your complaints (these are considered warning signs) that you contact your physician for an evaluation to rule out the above mentioned disorders. Sincerely, Rntdj\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Mon Jun 27, 2005 5:11 am",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=15900&sid=7842654a5d38efc23337d8137afd525e#p15900"
  },
  {
    "author": "MarciaCue  Guest Posts: 2 Joined: Wed Mar 23, 2005 9:55 pm Location: Florida",
    "title": "Family History of ovarian cancer",
    "content": "My Grandmother passed in 1982 from a short fight against Ovarian Cancer, this was on my Mother's side of my family.  My mother was already in endstage renal failure from Diabetes type 1 and an assortment of other medical aliments when she was diagnosed with Ovarian cancer.  She only survived one month after diagnosis and died from complications of Diabetes.  My Father passed this past year from Brain Cancer.  My Mother was only 47, my Grandmother 57, my Father 56 at the time of their deaths.  I never really worried about my genetics until recently.  I have began to have pelvic pains, my menstral cycle has ceased, and I am unusally fatigued.  I went to my primary with these symptoms and was told it was probably gas, low thyroid, and over stress.  I feel as though I need further testing but I need to know if I'm just being paranoid.  I have a one year old son and hope to be around to dance at his wedding.  Please respond with imput or suggestions.\n\n",
    "posted_time": "Post  by MarciaCue » Wed Mar 23, 2005 10:05 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=11272&sid=7842654a5d38efc23337d8137afd525e#p11272"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi MarciaCue, Has your thyroid function been re-tested to evaluate for further adjustments in medication? Taking into consideration your family history, talk to your primary care provider and express your concerns. Just the fact that you are 31 and your menstrual cycles have ceased should be reason enough for further testing. It certainly may be thyroid related, or due to changes in stress levels but an evaluation none the less is indicated. Ovarian cancer is sometimes overlooked and symptoms are often attributed to other causes. If it is diagnosed early, treatment is qiute successful. In my opinion, you are not being paranoid just careful, (there's a difference). Again, talk to your primary care provider!  Sincerely, Rntdj\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Fri Mar 25, 2005 4:16 am",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=11335&sid=7842654a5d38efc23337d8137afd525e#p11335"
  },
  {
    "author": "Abby  Guest Posts: 3 Joined: Tue Nov 30, 2004 3:27 pm Location: Massachusetts",
    "title": "Complex ovarian cyst",
    "content": ":(  Feeling generally poorly- fatique, misc aches & pain, for at leat 1 year. 4/04 saw gen. MD,  complained of varying  dull to sharp pain on r ovary for 5 days. Dr. Dismissed as adhesions, constipations, back weakness, all reasonable.  Phys. Therapy for back in may, some improvement but still malaised. .  Aug-Sept began having periods every 14 days instead of usually regular but painful 28 day cycle.  U/S 11/10 pos for complex ovarian cyst 1.9 cm leaking unidentified fluid.  Blood drawn 11/23/04 CBCw/ diff & CA125. Still waitng for these results and ref. to OB/GYN. I am extemely anxious as I questioned a cyst 7 mos ago. My research and signs indicate to me either  endometrioma or neoplasia. Any thought? Also, anxiety or true symptoms increased recently: dyspnea, abd. distention and increased bloating when not in  menstration.Thankyou. Abby\n\n",
    "posted_time": "Post  by Abby » Tue Nov 30, 2004 3:43 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6784&sid=7842654a5d38efc23337d8137afd525e#p6784"
  },
  {
    "author": "Abby  Guest Posts: 3 Joined: Tue Nov 30, 2004 3:27 pm Location: Massachusetts",
    "title": "[no title]",
    "content": "Also..sorry..  to date since april :  2 sedement. rate- normal, CBC's - normal except borderline anemia, U/A & cult.- trace rbc, aen, T4& fT4-normal.\n\n",
    "posted_time": "Post  by Abby » Tue Nov 30, 2004 3:51 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6785&sid=7842654a5d38efc23337d8137afd525e#p6785"
  },
  {
    "author": "Abby  Guest Posts: 3 Joined: Tue Nov 30, 2004 3:27 pm Location: Massachusetts",
    "title": "Sorry again, Also..",
    "content": "developed indigestion/reflux 8/02-never a prob. before. mental state like that of depression but without the emotional lowsThank you\n\n",
    "posted_time": "Post  by Abby » Tue Nov 30, 2004 5:08 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6787&sid=7842654a5d38efc23337d8137afd525e#p6787"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "Abdominal pain/rt ovarian cyst/mass",
    "content": "I have abdominal discomfort/pain. The discomfort, ruq has been off and on for at least the past year. More recently however it has become daily, not related to eating. At times at least 3-4 times a week it has become almost intolerable. I also have daily belching episodes, which are uncontrollable and seems to worsen with stress, along with frequent nausea. I have some moderate lower abdominal bloating, mild discomfort, discomfort sometimes with intercourse. I have what feels like palpable ?masses/lymph nodes? (approx 1 1/2 - 2inches in size) on the rt and left sides of my lower abd. I have what appears to be ridges in the groin area, firm with what also feels like small lymph nodes down the upper part of my legs. I have had no real weight loss.I had my recent appt with my PCP. Upon her examination she palpated a cyst/mass on my rt ovary approx 2cm or so, which was exceptionally painful with palpation, along with some enlarged lymph nodes. When she proceeded with the internal exam and palpated the same area I have to say it was terrible again. She began asking about indigestion, bloating, constipation, and pain with intercourse etc. She seemed to be more focused on this rather than on the ruq pain. I have an ultrasound scheduled in a couple of weeks. My question is should I be concerned about ovarian cancer with all the above symptoms? Or is this an over-reaction on my part? Thank you.\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Tue Sep 28, 2004 10:53 am",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5656&sid=7842654a5d38efc23337d8137afd525e#p5656"
  },
  {
    "author": "Carolyn Merritt, LPN  Nurse Posts: 141 Joined: Sun Sep 19, 2004 12:36 am Location: Northern California USA",
    "title": "[no title]",
    "content": "Hello:  As a fellow nurse you probably realize that 95% of all tumors are benign.  Therefore it is much too early to be contemplating the possibility of cancer.  Wait to see what the scan shows and please ask your doctor any questions that come to mind.  There are no silly questions when it comes to ones health. Regards, Carolyn\n\n",
    "posted_time": "Post  by Carolyn Merritt, LPN » Thu Oct 21, 2004 8:32 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6005&sid=7842654a5d38efc23337d8137afd525e#p6005"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Rntdj, As Carolyn said most of the cysts presenting in premenstrual women are of benign nature. I understand your concern about ovarian cancer, especially you say you have palpable lymph nodes. We should not rush to any conclusions however. The ultrasound should clarify everything. Has it been done yet?  Have a look at our ovarian cysts page for more info on the topic.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Fri Oct 22, 2004 2:01 am",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6013&sid=7842654a5d38efc23337d8137afd525e#p6013"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Thank you both for your reply. I think the main concern of my PCP and myself was that since there were histories of other types of cancer in my family and the given symptoms that it was suspicious even though in most cases masses are benign in nature. The ultrasound has been done, abdominal, pelvic, and transvaginal. No gallstones or inflammation of the common bile duct (pain attributed in that area (RUQ) to gastritis) transvaginal ultrasound showed a ruputed cyst with fluid in the cul-de-sac without debris, which is what apparently caused the severe lower abdominal pain. A few small cysts remain without any dominant follicle so it seems that all is well, for now at least, and the lower abdominal pain will eventually subside. The lymph nodes even though they are palpable are small so probably of little concern. Actually a significant improvement of the previous symptoms have already occured. At this point we are going to watch and wait unless symptoms arise again, and since cysts are common in premenopausal women, I'm praying for menopause    Thanks again, Theresa\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Fri Oct 22, 2004 8:00 am",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6017&sid=7842654a5d38efc23337d8137afd525e#p6017"
  },
  {
    "author": "dogwisp  Guest Posts: 3 Joined: Tue Sep 07, 2004 6:42 pm Location: newcastle",
    "title": "Will vitamins help my ovarian cyst?",
    "content": "went to hosp. today, Ive got a cyst. Ive been clear of periods for 3 years till I had a period last month. Lasted 5 days. Had a smear taken (no results yet thou). Hosp say they gona phone with results of conversation with my consultant 2moro. Seems a bit quick. They said they couldnt feel it it but could see it on scan. They say if he wants to leave it for a while  I have to go back in 3 month to check it. Is there anything I can do naturally to help it? Ive had so much bother over last few years (18 years of infertility) then long periods (4-5 weeks) hormone treatment over 9 years. inc. a month of hrt. But I put on 3 stone so had to stop all that. Still cant lose an ounce! after 6 yrs. I eat all natural produce as I also have allergy to yeast. don't like sugary stuff, or fast foods!\n\n",
    "posted_time": "Post  by dogwisp » Tue Sep 07, 2004 6:56 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5185&sid=7842654a5d38efc23337d8137afd525e#p5185"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "The vast preponderance of ovarian cysts in women of pre-menopausal age are benign; those occurring in post-menopausal women may indicate more serious disease and should be investigated through ultrasonography, especially in cases where other family members have had ovarian cancer. Such cysts may require surgical biopsy.  Did your doctor tell why your periods stopped so early?   Concerning the weight gain have you tried any of the popular diet regimens? Besides eating healthy food have you been watching your calories?\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Tue Sep 07, 2004 7:15 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5187&sid=7842654a5d38efc23337d8137afd525e#p5187"
  },
  {
    "author": "dogwisp  Guest Posts: 3 Joined: Tue Sep 07, 2004 6:42 pm Location: newcastle",
    "title": "[no title]",
    "content": "My mother went through early menapause and doctors say i may be following her. I was actually going through last cycle of ivf at the time, thats how they fouind out (blood test). ive tried every type of healthy diet, weight watchers, weight management, blood type, you name it but honestly I really don't eat a lot, don't like greasy chips or anything like that and I really love my veg. As far as im aware nobody in my family has suffererd from any cancer at all. must admit Im a bit worried, but if they take my ovaries they beter take the rest. Im sick of opperations over the years. Do you think any vitamins and minerals might work as Ive been seaching all night and a few people reckon they do?  thanks for your help.           ps. also had joined a gym, went 3 mornings a week 7am before work for 4 months and guess what... never lost an ounce. and I had a trainer with me with it being early.  Read something earlier about insullin resistence ?\n\n",
    "posted_time": "Post  by dogwisp » Tue Sep 07, 2004 7:30 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5188&sid=7842654a5d38efc23337d8137afd525e#p5188"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "No dogwisp, I am afraid vitamins wont help your ovarian cysts. We have to wait for the outcome of your doctors conversation. He will be in a position to assess whether a biopsy is necessary or not.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Tue Sep 07, 2004 8:46 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5189&sid=7842654a5d38efc23337d8137afd525e#p5189"
  },
  {
    "author": "dogwisp  Guest Posts: 3 Joined: Tue Sep 07, 2004 6:42 pm Location: newcastle",
    "title": "[no title]",
    "content": "just to let you know, the blood test came back fine better than they thought it would. Cant say how relaxed I feel.... They still want to monitor the grow (if any) in dec. Fingers crossed.\n\n",
    "posted_time": "Post  by dogwisp » Wed Sep 08, 2004 6:45 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5214&sid=7842654a5d38efc23337d8137afd525e#p5214"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Congratulations dogwisp! It looks like everything will turn out just fine.  Best regards.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Wed Sep 08, 2004 7:07 pm",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5215&sid=7842654a5d38efc23337d8137afd525e#p5215"
  },
  {
    "author": "guest",
    "title": "Is carboplatin, taxotere aggressive for ovarian cancer?",
    "content": "I am 48 years old with recurrent advanced ovarian cancer.  I want the most aggressive treatment possible.  I am on the following regiment every 3 weeks: 396mg Carboplatin 98 mg Taxotere  Is this aggressive enough?\n\n",
    "posted_time": "Post  by guest » Fri May 09, 2003 7:50 am",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=709&sid=7842654a5d38efc23337d8137afd525e#p709"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "Taxotere carboplatin ovary",
    "content": "It is in itself a very effective regimen. Its not really an issue of how aggressive the therapy is but how effective it is in providing a cure. In your case, whether this therapy is effective or not depends on many factors, some of which are: the type of therapy previously received; the time elapsed between previous therapy and the recurrence, the site of the recurrence (where it is) and the stage of your disease. Again when given appropriately it is an effective combination. I personally had a patient go into long term remission on Taxotere alone (>6 years now) and her cancer had spread very far away from the ovary.  Have hope.. because ovarian cancer can be cured. I would like to hear Dr. Gordon's opinion. Thank you.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Fri May 09, 2003 8:07 am",
    "category": "Oncology",
    "sub_category": "Ovarian Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=710&sid=7842654a5d38efc23337d8137afd525e#p710"
  }
]