[
  {
    "author": "shaverr  Guest Posts: 1 Joined: Sat Jun 12, 2010 8:31 am Gender: Female",
    "title": "Pancreas removal",
    "content": "When someone has pancreatic cancer stage 4, is it an option to remove then pancreas and then just put the patient on insulin?\n\n",
    "posted_time": "Post  by shaverr » Sat Jun 12, 2010 8:36 am",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=93911&sid=29a6f20657b1de8e002f1f391bbcc28c#p93911"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: Pancreas removal",
    "content": "Hi, In stage 4 pancreatic cancer,the cancer has already spread to distant sites such as the liver & lungs or adjacent organs including the stomach, spleen and or the bowel. This is advanced cancer with systemic metastasis. In TNM staging, this is equivalent to Any T; Any N; M1(T=tumor,N=nodes,M=metastasis).  Treatment may comprise of surgery, radiation, chemotherapy, biological therapy, or a combination of these.  Multi modality treatment,, is increasingly favoured. Pancreatectomy is no more a curtive option for stage 4 pancretic cancer.Palliative surgery however,may be indicated in certain situations. Best wishes!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Thu Jun 17, 2010 1:10 am",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=94348&sid=29a6f20657b1de8e002f1f391bbcc28c#p94348"
  },
  {
    "author": "jandj  Guest Posts: 1 Joined: Wed Dec 09, 2009 6:27 pm Gender: Female",
    "title": "Pancreas tumor will cause knee pain",
    "content": "i have a 6cm tumor in the head of my pancreas. i have refused surgery which is the only option. Lately my left knee is giving me alot of pain. I am 79 years young and have not done anything new. Is it related to pancreas?\n\n",
    "posted_time": "Post  by jandj » Wed Dec 09, 2009 6:43 pm",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=88604&sid=29a6f20657b1de8e002f1f391bbcc28c#p88604"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: Pancreas tumor will cause knee pain",
    "content": "Hi, At the time of diagnosis of pancreatic cancer , about 50% of all patients have distant disease and about 25% have regional spread (The usual sites of metastases in pancreatic cancer are the liver and peritoneal cavity). Skeletal metastases represent an underappreciated sites of metastasis in this condition.  The true incidence of skeletal metastases in patients with pancreatic cancer is not known, it could well be 5 - 20 %. Micrometastases associated with pancreatic adenocarcinoma have been found in the bone marrows of some of these patients. It is unclear if they represent pre-clinical bone metastases.  With the use of newer therapies,there has been a modest increase in survival in patients with advanced pancreatic cancer. Thus, it may be anticipated that previously uncommon occurrences such as skeletal metastases will be seen more frequently.  Pathological fractures, bone pain, and hypercalcemia are possible sequelae of skeletal metastases.  Your knee pain could be due to a benign process such as osteo-arthritis, but secondaries need to be ruled out.   Therefore,i suggest that you should consult your doctor and get investigated to exclude this possibility as neglecting this may affect you very adversely. Best wishes!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Sun Dec 13, 2009 10:49 pm",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=88949&sid=29a6f20657b1de8e002f1f391bbcc28c#p88949"
  },
  {
    "author": "rightbauer  Guest Posts: 2 Joined: Fri Oct 23, 2009 11:40 am Gender: Female",
    "title": "can the new tumors be radiation related?",
    "content": "My Father-in-law has been diagnosed with bile duct/pancreatic cancer he just went to his follow up and now he has spots on his liver and lungs after the chemo/ radiation.  Can these be there because of the treatment or is the cancer that aggressive? how do you tell the difference?\n\n",
    "posted_time": "Post  by rightbauer » Fri Oct 23, 2009 11:54 am",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=84496&sid=29a6f20657b1de8e002f1f391bbcc28c#p84496"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: can the new tumors be radiation related?",
    "content": "Hi, It  would  be very helpful if you could give me a few more details...  -  When was your Father-in-law diagnosed as having pancreatic cancer?..or was it carcinoma of the peri-ampullary region?  - what do you exactly mean by spots on his liver? Were these spots  seen at operation or by way of imaging?  - Did he undergo any surgery as primary therapy (? whipple's)  - how long since chemo-radiation? Please give these details and then i can try to offer a better response. Thank you for the post.\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Thu Nov 05, 2009 6:37 am",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=85972&sid=29a6f20657b1de8e002f1f391bbcc28c#p85972"
  },
  {
    "author": "rightbauer  Guest Posts: 2 Joined: Fri Oct 23, 2009 11:40 am Gender: Female",
    "title": "Re: can the new tumors be radiation related?",
    "content": "It is a tumor on his bile duct that is close to his pancreas they are calling it pancreatic cancer.  The spots were numbered as several by my mother in law and they were seen by imaging.  He did not undergo any surgery. These were spotted after the first round of chemo/radiation (One week after last dose).\n\n",
    "posted_time": "Post  by rightbauer » Sun Nov 08, 2009 10:41 am",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=86239&sid=29a6f20657b1de8e002f1f391bbcc28c#p86239"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: can the new tumors be radiation related?",
    "content": "Hi, Thanks for the info.These lesions noted on the CT scan which are fairly recent would be assumed to be secondary deposits unless proved otherwise. Good day!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Mon Nov 09, 2009 2:26 am",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=86303&sid=29a6f20657b1de8e002f1f391bbcc28c#p86303"
  },
  {
    "author": "leongyk  Guest Posts: 2 Joined: Mon Dec 22, 2008 10:01 am Gender: Male",
    "title": "Pancreas Tumor Markers",
    "content": "Hi,  This question is actually about my Mom.  In July, she went for a blood test, and her tumor marker was at 36.8, just below the warning level. (she also is a carrier of Hep, A/B/C i cant recall)  Recently, she went for another blood test, and the marker has increased to 44.  The doctor said that nothing can be confirmed now, a scan or screening will probably show up nothing now.  He said to come back in another 3 months for another blood test to see if it rises again.  My question is if there is any urgency at the moment to go for a screening?  How long does it usually take for pancreatic cancer / tumor to develop?  Also, is there any diet she should be taking now, that'll take a load off her pancreas and/or help decrease the marker levels?  (eg. low fat, more antioxidants )  Thank you so much for your time..\n\n",
    "posted_time": "Post  by leongyk » Mon Dec 22, 2008 10:18 am",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=65636&sid=29a6f20657b1de8e002f1f391bbcc28c#p65636"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "Re: Pancreas Tumor Markers",
    "content": "Hi,  Thanks for your question. Why did your Mom need to take this test? What is she complaining of?   The tumor marker (CA 19.9) alone is not significant and is not recommended for screening, diagnosis or follow up. Does she have a past history of cancer?  Best regards,\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Sat Dec 27, 2008 10:16 am",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=66019&sid=29a6f20657b1de8e002f1f391bbcc28c#p66019"
  },
  {
    "author": "leongyk  Guest Posts: 2 Joined: Mon Dec 22, 2008 10:01 am Gender: Male",
    "title": "Re: Pancreas Tumor Markers",
    "content": "Hi, she had no complaints and no history of cancer.  just a normal check-up.  Previous blood test showed that it was kind of high, so the doctor asked her to monitor it.  And a recent blood test just showed that the marker had increased.\n\n",
    "posted_time": "Post  by leongyk » Sat Jan 03, 2009 6:43 am",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=66757&sid=29a6f20657b1de8e002f1f391bbcc28c#p66757"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "Re: Pancreas Tumor Markers",
    "content": "Hello,  This is not a test that's done routinely in a normal check, which is why I asked. Nonetheless, pancreatic tumor markers are not specific and are not recommended for making a diagnosis or for screening. This may be why your doctor doesn't trust the results.  Best regards,\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Sat Jan 03, 2009 7:07 am",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=66759&sid=29a6f20657b1de8e002f1f391bbcc28c#p66759"
  },
  {
    "author": "katemjohnson  Guest Posts: 1 Joined: Fri Jan 04, 2008 3:41 am",
    "title": "polyps in the pancreas",
    "content": "Hi I have just had an ultrasound which showed polyps in my pancreas. I have not been able to find any information on pancreatic polyps. Should I be worried??\n\n",
    "posted_time": "Post  by katemjohnson » Fri Jan 04, 2008 4:40 am",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=52648&sid=29a6f20657b1de8e002f1f391bbcc28c#p52648"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "Re: polyps in the pancreas",
    "content": "Hello, This could be a form of pseudopancreatic cyst.   Pseudocysts are known to develop few weeks after an attack of acute pancreatitis, following trauma or in chronic pancreatitis due to many causes like post-infection or in alcoholics.  US and CT scans are of choice in diagnosis of such conditions. Complete history and investigations are needed to exclude pancreatic tumors.  Please follow up with your doctor and keep us updated. Best regards.\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Wed Oct 08, 2008 7:38 pm",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=61990&sid=29a6f20657b1de8e002f1f391bbcc28c#p61990"
  },
  {
    "author": "thankyoudoc  Guest Posts: 1 Joined: Thu Jan 03, 2008 2:24 pm",
    "title": "Pancreas Pain or Pulled Muscle?",
    "content": "Hi Doctor-  I recently noticed I have some pain near the left upper side of my abdomen. Over a two week period it hurt only I would say moderate pain for a half a day until I took some aleve. I recently got the same sensation about six days later and noticed the pain was there and still bothering me. I was hoping it is a pulled muscle, but on this same snowboard trip I drank rather heavily. I saw alcohol abuse as an underlying cause to acute pancreatitis. I just turned 23 and wouldn't call myself an alcoholic, but I drink quite heavily on the weekends. I have consumed around 5+ alcoholic drinks on around 4 seperate occasions since I noticed the pain and nothing uncomfortable has come about. I have been sick for around ten days now, but my parents had this same flu before I went snowboarding with symptoms of sinus congestion/cough and just feeling very out of it. Should I be concerned with this pain that is still silghtly bothering me today, (very minor) or should I brush it off as a pulled muscle?  Is this condition common or extremely rare?  Thanks\n\n",
    "posted_time": "Post  by thankyoudoc » Thu Jan 03, 2008 2:42 pm",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=52597&sid=29a6f20657b1de8e002f1f391bbcc28c#p52597"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "Re: Pancreas Pain or Pulled Muscle?",
    "content": "Hello,  I hope by now you are feeling better. It's impossible to assess symptoms and come up with anything close to a diagnosis over the internet. However, here are some insights as your question does raise some interesting issues.  Alcohol abuse refers to chronic consumption of over 80 grams of alcohol a day. This should give you a rough idea of what is meant by alcohol abuse in relation to the alcohol content of the beverage you are consuming.   Alcohol abuse has definitely been associated with chronic pancreatitis. It has also been associated with 15% of cases presenting with acute pancreatitis. However, many acute cases are associated with underlying chronic changes on pathological examination. This means, that many so called acute cases actually develop on top of a pancreas that has been silently and chronically damaged over years.  Regarding your description of pain, it doesn't sound like the typical description of pain for acute pancreatitis.  In these cases, pain is very severe, in some cases associated with coma and shock. It is usually located in the epigastrium (above the umbilicus) and is characteristically associated with band-like referral to the back and the patient feels a lot better by leaning forward. Pain from acute pancreatitis lasts days and is associated with tenderness in the epigastrium as well as nausea and vomiting.  In any case I would urge you or anyone else reading this post to seek direct evaluation by a doctor should your symptoms continue or progress to mimic the picture described in the preceding paragraph.  Best regards,\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Fri Feb 08, 2008 10:55 am",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=53616&sid=29a6f20657b1de8e002f1f391bbcc28c#p53616"
  },
  {
    "author": "CollegeKid  Guest Posts: 2 Joined: Mon Dec 10, 2007 12:41 pm",
    "title": "Doctors not helpful, could it be pancreatic cancer?",
    "content": "I am a 20 year old male, and have had several bouts with left side pain in the past 3 years.  I had a cat scan done when I was 18 because of side pain, and nothing showed up.  The pain has come and gone 3 or 4 times since then, it's never very painful.  However, before Thanksgiving break, it came back and really scared me.  I had a CBC blood test done and all the levels were normal, doctors said they really couldn't do anything since the pain was so minor and somewhat inexplicable.    Right now, i have slight pain under my left rib cage.  It is not a constant pain at all, when i'm sitting or laying, i do not even feel it.  However, i get sharp jabbing pains every once in a while that seem to be brought on by nothing at all.  My urine and bowel movements are basically regular, and my complection has not changed.  I am weak and have lost my appetite, but that is only because i'm worried sick of having cancer and no health insurance.  It has come to the point that I cannot even study for finals.  Could the pain be simply an anxiety problem, coupled with some minor GI or otherwise non-life threatening problem?\n\n",
    "posted_time": "Post  by CollegeKid » Mon Dec 10, 2007 12:51 pm",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=51495&sid=29a6f20657b1de8e002f1f391bbcc28c#p51495"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Hello,  Pancreatic pain is characteristically more central and is referred to the back. It also tends to appear at a much older age. This is usually not something that carries on unnoticed for 2 years.  Chronic abdominal pain could be functional (due to anxiety) but this is a diagnosis that can only be made after an examination is performed to rule out all other possible causes.  If your pain is increasing or changing in character or if your pain is associated with other symptoms then you should consult your physician.  Best regards,\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Wed Dec 12, 2007 5:57 pm",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=51614&sid=29a6f20657b1de8e002f1f391bbcc28c#p51614"
  },
  {
    "author": "dacubster  Guest Posts: 19 Joined: Sat Jan 13, 2007 9:56 pm",
    "title": "How much of a familial link is related to this cancer?",
    "content": "Hi there,  I have a pretty basic question.  My mom's father (my grandfather) has been afflicted for many years with pancreatic cancer, which began in his 70s.  3 of his brothers, a sister and his mother all died of this illness.  Currently none of his children or grandchildren have the disease.  My question is though is how likely is this disease to be passed on to family members?  Are there tests us grandchildren or our parents should have and is there an age range when this type of cancer particularly hits?  Thank you.\n\n",
    "posted_time": "Post  by dacubster » Mon Dec 10, 2007 10:58 pm",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=51551&sid=29a6f20657b1de8e002f1f391bbcc28c#p51551"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Actually this isn't a basic question. Much of our knowledge about 'familial' pancreatic is lacking. It's known that 10% of patients have the inherited form.   Although the genes contributing to pancreatic cancer have been studied well, the degree of contribution of each one is not well known and as such we cannot use them as screening or diagnostic tools. You should consult your grandfather's oncologist who would have a precise history of the possible contributing factors and whether indeed it was the inherited form that he was diagnosed with. Alcohol and tobacco are among the most important risk factors and these common habits can contribute.  Finally, I would refer you to a paper published in the medical journal Gastroenterology: click here\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Wed Dec 12, 2007 5:39 pm",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=51612&sid=29a6f20657b1de8e002f1f391bbcc28c#p51612"
  },
  {
    "author": "darkestdays30  Guest Posts: 77 Joined: Wed May 02, 2007 9:43 am",
    "title": "Pancreas problems, is there a solution?",
    "content": "Are there any treatment for pancreas disease/insufficency other than taking enzymes? They normally help but it doesn't cure the problem. If I don't take them, my problems are still there.   I had surgery yesterday and my epigastric area is killing me from the narcotics. I know it's my pancreas causing the pain. I heard WV doesn't even have doctors for this. I don't know what to do but I can't take this. It's making me so sick. I puked after 1 Lortab this morning but I ate some toast with it to try to keep it from makin me sick. Didn't work.   I was taking a natural suppliment for the enzymes which caused extreme hunger so my doctor put me on Creon 20. They help but not half as good. Sometimes it improves the fatigue but I'm still exhausted alot of the time. The natural suppliment felt like it cured the fatigue, pain, nausea and really helped the reflux. I can eat okay with the Creon but it doesn't help the reflux as well.   I heard there's nothing that can really be done for pancreas disease. Please tell me that's not so. I'm so tired of feeling like this.\n\n",
    "posted_time": "Post  by darkestdays30 » Tue Jul 31, 2007 7:04 am",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=45530&sid=29a6f20657b1de8e002f1f391bbcc28c#p45530"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Darkestdays30,  I seem to remember that you got a significant amount of relief with the supplements.  You may want to compare the enzymes in the supplement with the enzymes in the Creon.  Creon is a commonly used pancreatic enzyme replacement.  Perhaps it isn't sufficient for you.    Other things that can help with pancreatic insufficiency are eating a low fat diet and taking a multivitamin for those with pancreatic insufficiency.  (With pancreatic insufficiency there is less fat absorbed so the fat soluble vitamins may become deficient-these are vitamins A, D, E, and K.)  If you are able to see a GI specialist this will be helpful for you.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sat Aug 04, 2007 11:32 pm",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=45677&sid=29a6f20657b1de8e002f1f391bbcc28c#p45677"
  },
  {
    "author": "darkestdays30  Guest Posts: 77 Joined: Wed May 02, 2007 9:43 am",
    "title": "[no title]",
    "content": "Creon about half helped. The multi-enzyme works way better. I already switched back. I tried a liquid vitamin and it helped too but it tastes so bad, it started making me vomit. What bothers me is if I forget to take my medication, my problems are still sitting right there waiting on me. I had bladder repair about a week ago and the anesthesia hurt my stomach worse than the surgery hurt my bladder. I couldn't even take pain medication because it made me that much worse. I want a permanent fix, not a temporary one, though I'd almost bet there isn't one. What if down the road these enzymes get to the point that they don't work anymore. As with any medication, once you take it awhile, your body gets used to it, and it's not worth a quarter after that. Or at least that's how it goes with me.\n\n",
    "posted_time": "Post  by darkestdays30 » Sun Aug 05, 2007 2:14 pm",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=45688&sid=29a6f20657b1de8e002f1f391bbcc28c#p45688"
  },
  {
    "author": "darkestdays30  Guest Posts: 77 Joined: Wed May 02, 2007 9:43 am",
    "title": "Bowel Problems",
    "content": "Are there any solutions for gallbladder stones other than having to give up your organ? Doctor told me no but isn't there medications that can shrink stones? I had what appeared to be a gallbladder attack the other day after eating and they are doing an ultrasound next week.  The reason I'm here anyways is because I feel like I need to have a bowel movement and can't. It feels like my insides are trying to come out of me when I sit down on a toilet and hurts really bad. I took a stool softener but it isn't helping. That just made me really nauseas and sick to my stomach. Is there any other type of medications that might help?\n\n",
    "posted_time": "Post  by darkestdays30 » Fri Aug 24, 2007 11:08 am",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=46795&sid=29a6f20657b1de8e002f1f391bbcc28c#p46795"
  },
  {
    "author": "darkestdays30  Guest Posts: 77 Joined: Wed May 02, 2007 9:43 am",
    "title": "impacted stool",
    "content": "I took another stool softener and even used an enema. Still didn't work. My stool is too sticky and it will not pass (this is so embarrasing) but I don't know what to do. The enema caused me to get gassy and I had a little bit of watery bowel movement but where it feels like my insides are coming down every time I sit on the toilet, it's killing me in pain. When I have the urge to have a bowel movement, it goes so far as to feel like I'm going to, but instead, nothing comes out, and it feels like my insides drop down, and causes severe pain and burning. I have to push it back up before I can get up from the toilet. I've been hesitant with trying fiber cause of this. I don't want to take something that might cause me to get diarrhea. I wanted to call 911 last night but my son was out and didn't have a key to get in the house so I took a few sleeping pills so I'd pass out and not lay there and suffer. At that point, it was hurting even when I wasn't on the toilet. I cannot go to the hospital today because he got a nasty blow to his head, out drinking, and 3 adults beat him up, but I have to keep an eye on him and hopefully talk him into going to the hospital. My bowels are loose & greesy 99% of the time (malabsorption of fats) and I haven't had a problem like this since my bladder was repaired from a prolapse a mth ago. For some reason, this is also hurting my bladder, and everytime I pea now, it causes my bladder to hurt really bad. Any idea why it would inflict pain to my bladder? Too much pressure maybe ???? Is there anything I could get over the counter at the drug store that might resolve this problem that wouldn't build up alot of pressure on my insides like the enema did?\n\n",
    "posted_time": "Post  by darkestdays30 » Sat Aug 25, 2007 5:13 am",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=46821&sid=29a6f20657b1de8e002f1f391bbcc28c#p46821"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Darkestdays30,  Gallstones may actually be the common link to all your problems.  If you are having gallstones they can block the bile duct making it harder to absorb fats.  They can also block the pancreatic duct that connects to the bile duct and stop pancreatic enzymes from getting to the GI tract.  I would recommend you strongly consider having your gallbladder removed.  If gallstones are your problem there really is not another good solution.  There are not any good medicines to help gallstones that I am aware of.  You may also want to talk with a GI doctor about measuring the pressures of your pancreatic duct via a procedure called an ERCP.  Some centers can also measure pancreatic enzymes during this procedure to see if the pancreas is producing enough enzymes or not.  If your pain becomes severe I would recommend you see your doctor for an evaluation.  Bowel obstructions can occur with pancreatic problems.  Gallstones can also lead to bowel obstructions.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sat Aug 25, 2007 2:24 pm",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=46842&sid=29a6f20657b1de8e002f1f391bbcc28c#p46842"
  },
  {
    "author": "darkestdays30  Guest Posts: 77 Joined: Wed May 02, 2007 9:43 am",
    "title": "[no title]",
    "content": "My doctor isn't going to do that test. They don't see a problem with my pancreas. Though the enzymes help the malabsorption, it doesn't mean my pancreas is causing the malabsorption, is more or less what I'm being told. The only reason they quit working right was because I wasn't absorbing the medication properly. If I mix it in my food and use it in powder form, it works fine.   One of my doctors made an interesting point. That he has never known me to have acute pancreatitis. However my pancreas function was never checked more than a few times at most in the past 10 years I've felt ill. If you have acute pancreatitis, is it something that is going to about kill you and put you in the hospital?? Can chronic pancreas disease be ruled out over this simple little thing?\n\n",
    "posted_time": "Post  by darkestdays30 » Wed Sep 05, 2007 11:45 am",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=47378&sid=29a6f20657b1de8e002f1f391bbcc28c#p47378"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Typically, acute pancreatitis will not necessarily cause you to need to be admitted to the hospital but it certainly typically will cause tremendous pain, classically described as being above the belly button and feeling like it is going all the way through to the back.  Chronic pancreatitis is a bit harder to diagnose.  It is often diagnosed more by imaging studies, such as an X-ray or CT/MRI that shows some signs of calcification or inflammation of the pancreas.  An ERCP can allow testing of the pancreatic fluid to look for pancreatic insufficiency.  It can also allow measuring of the duct pressures and assessment for any strictures of the duct.    An alternative to this that is less invasive is an MRCP.    This is an MRI with a special technique to look at the biliary/pancreatic tree.  It can give good analysis of the structure of the duct and can also allow for analysis of any of the anatomical abnormalities of the pancreas such as pancreatic divisum that can predispose a person to pancreatitis.  It does not allow measurement of pressures or pancreatic enzymes.  It also does not allow a problem to be fixed at the same time it is found since it is a noninvasive procedure.  Seeing a GI specialist, or perhaps seeking a second opinion may be appropriate for you so you can get a fresh perspective on things to see if there are any new ideas.  Sometimes a second opinion can give new ideas that the first examiner hasn't thought of simply because of the fresh look.  Best wishes.  Keep at it.  Eventually you'll find the cause of your symptoms.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Thu Sep 06, 2007 2:37 pm",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=47429&sid=29a6f20657b1de8e002f1f391bbcc28c#p47429"
  },
  {
    "author": "darkestdays30  Guest Posts: 77 Joined: Wed May 02, 2007 9:43 am",
    "title": "[no title]",
    "content": "I've had pain so bad in the upper part of my abdomen, that I'd be crying, screeming, and vomitting, and took a handful of sleeping pills so I wouldn't have to end up in the ER. The pain I have right now is in my upper middle and left side, I feel it going into my back too, it even feels numb sometimes. About 2 weeks ago, I drank a bottle of wine to calm my nerves down and my left side hasn't stopped hurting since. The more I eat, the worse it gets. I did get my dr to do the 72 hour test to check for malabsorption which is part of the reason the pain is so bad right now, because I'm eating meals now instead of just snacking on small amounts of food. And eating food high in fat for this test is killing me. I feel like I could puke my insides out everytime I eat that crap. She's also doing an endoscopy this week and checking my small bowels. Which I guess she must be suspecting to be the cause of malabsorption. If you have the 72 hour stool fat test, can it confirm the cause of the malaborption? She had told me in order to see if I had pancreas disease, she'd have to do this test, but now I'm getting a biopsy on my small bowels, so I don't understand. I don't understand either why pancreas enzymes helps my indigestion and reflux pills don't phase me anymore. They told me I'd end up with esphageal cancer if I didn't take them but I don't see the point if it doesn't work. I did get the understanding that it helps fat malabsorption which would explain why they work so well if it wasn't pancreas disease but I can't help but think there's more to it. Especially with my past history with alcohol use. I think this whole thing is over the fact that they have never seen me have acute pancreatitis.. I am not one to just give up so I will find out one way or the other. lol... Maybe it's the malabsorption causing all this pain but there has to be a reason for that doesn't there? I was reading through a forum last night about people who have malabsorption and pancreas disease and my problems were exactly like theirs. Sometimes I wish I could just quit worrying about it but when your sick 24-7, it's hard to do that.\n\n",
    "posted_time": "Post  by darkestdays30 » Tue Sep 11, 2007 10:58 am",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=47708&sid=29a6f20657b1de8e002f1f391bbcc28c#p47708"
  },
  {
    "author": "darkestdays30  Guest Posts: 77 Joined: Wed May 02, 2007 9:43 am",
    "title": "[no title]",
    "content": "I got the results of my 72 hr fat test: fecal weight 642.60g, fecal fat qnt 2.1g so it was normal. I don't understand this at all. Why would the 24 test be abnormal but the 72 hour test be normal? And when I eat (when I am not taking pancreas enzymes), my food goes out of me within minutes. When I was doing this test, I saw the pieces of food I ate in my stool. And I had just ate the food. So how is it properly digesting????? Is it normal to digest food that quickly? I guess the enzymes help because they slow down my bowel movements. But I don't get at all how I don't have malabsorption. I saw the test results with my own two eyes and I still can't hardly believe it.\n\n",
    "posted_time": "Post  by darkestdays30 » Tue Sep 18, 2007 11:52 am",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=47951&sid=29a6f20657b1de8e002f1f391bbcc28c#p47951"
  },
  {
    "author": "darkestdays30  Guest Posts: 77 Joined: Wed May 02, 2007 9:43 am",
    "title": "[no title]",
    "content": "I got my biopsy report. My stomach was fine and my barrett's went away even though I still have esophagitis. I think that goes to show the enzymes are helping my reflux. I never had a test before that didn't show gastritis. So I guess I'm doing something right. I read online that indigestion is caused by improper digestion of food. Maybe that's why the medication helps cause it slows my bowels down. I feel like if I could find the cause of these problems, that it would help. I just don't understand how you can digest food so fast and it not be malabsorption but I am okay with it now. Was really upset when I first got the news. Hopefully things will work out in time but just wanted to say thanks for helping me through this.\n\n",
    "posted_time": "Post  by darkestdays30 » Wed Sep 19, 2007 5:48 pm",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=47989&sid=29a6f20657b1de8e002f1f391bbcc28c#p47989"
  },
  {
    "author": "dvk  Guest Posts: 2 Joined: Thu Jul 05, 2007 9:41 pm",
    "title": "Lesion on Pancreas",
    "content": "Can you tell me what you think of this, Could it be an old injury, my lipase has been up and down since 2002. However I had a ct scan in November due to nasuea however i ended up being diagnosed a month later with celiac disease. I have followed my lipase periodical and my follow up ct said this.   I have had elevated Lipase never more than half of the upper limit on and off for 5 years, if the upper limit is 59 mine has never been more than 99. I have had ct scans twice and the last one came back as this. I am 33, male , no pain, I have Celiac Disease  On the images of the pancreas there is a questionable poorly defined 1cm lesion in the inferior aspect of the head of the pancreas best seen on image 28. On the thin section images the margins are somewhat indistinct and not as well defined. The remainder of the pancreas is unremarkable and with no pancreatic ductal dilation and the adjacent fat planes are preserved. No pancreatic calcifications, the splenic vein,portal vein, and smv are patent, no free or loculated fluid collections the bowel is not dilated. From old exam dated 11/2006 and in retrospect the area of the poorly defined low attenuation seen in the head of the pancreas was seen on that exam and is unchanged.  Impressions, There is a very subtle focal area of low attenuation in the inferior head of the pancreas which is poorly defined and marginated and measure slightly less than 1cm. No retrospect this has a similar appearance on the prior Ct exam of eight months ago and it without significant change. It is nonspecific and does not have the typical appearance of a mass though I could not exclude a small mass. It could also represent an area of focal Pancreatitis. I would recommend continued follow up since this has been stable over eight months I would recommend another follow up in approximately one year.\n\n",
    "posted_time": "Post  by dvk » Thu Jul 05, 2007 9:48 pm",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=44066&sid=29a6f20657b1de8e002f1f391bbcc28c#p44066"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "A focal area of pancreatitis is possible given your repeated boughts of elevated lipase.  (Although your lipase is not particularly high.  With pancreatitis, the lipase can often reach into the thousand range.)  Given that it hasn't changed in 8 months it is less likely to be a cancer such as pancreatic cancer.  It may simply be a normal variation that is being detected by the CT scan.  It is a good idea to follow it and I would agree with the recommendation for a repeat CT scan in a year based on the information provided.  As a note, lipase can be elevated due to reasons other than the pancreas as well.  If your amylase is normal I would be more suspicious of the lipase being due to something other than your pancreas.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Thu Jul 05, 2007 11:34 pm",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=44077&sid=29a6f20657b1de8e002f1f391bbcc28c#p44077"
  },
  {
    "author": "dvk  Guest Posts: 2 Joined: Thu Jul 05, 2007 9:41 pm",
    "title": "Follow up pancreas",
    "content": "First of all I want to thank you for what you do here, there are so many people looking for answers when sometimes us Patients feel so alone and left in the dark.   I also had a question about what you said with it being possible that the ct scan is a normal variation being detected, Is it possible 2 have it 2 times? they had the radiologist actually 2 of them read this last one done and the CT from 8 months ago and both concurred that they saw it on the scan done 8 months ago Therefore it was there 8 months ago? And is it possible to have focal pancreatitis in that area for so long? Like I said before I have had elevated Lipase off and on for 5 years, the first test being on November 2002 which again all tests were normal back in 2002 including amylase however the lipase was 454 of a normal high of 300.  I had my lipase done the same day as the recent ct on July 3rd 2007 and it came back in normal range all my blood tests did, it was taken with amylase, all normal, bili, bun, magnesium, you name it.   Lipase I know can go up and down with having celiac disease which i do have, I also wonder about intestinal permeability. Or what else can do it since everything else is normal  I am so LOST AND WORRIED, im male 33 with 4 children and this scares the heck out of me.  Something tells me that I should go on with my life and not worry about it again, and live gluten free as I have and just be well, cause I do feel well other than the Food poisoning I had 3 weeks ago that set me back or should I have an MRI and does this have a better look than CT, I don’t want to mess with the Pancreas if I don’t need to. My GI seemed a little irrated that I even got another CT from my Primary DR and said lets do the MRI, and then we can do a biopsy,,he said to me \"I know you are not worried about the cost so lets do it and resolve this once and for all for you\" Meaning that I am pushing the issue and nothing is wrong but if its going to resolve it for me then Fine.   @ other questions besides above  1. I do have a small renal cyst and one small cyst on the liver they say is normal and has been there forever, they commented nothing other than its there on both CTs  2. what else causes Lipase increase? Celiac does I know that.  Thank you for everything and the rambling, but my GI is short with me like Im crazy!\n\n",
    "posted_time": "Post  by dvk » Sat Jul 07, 2007 9:03 pm",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=44292&sid=29a6f20657b1de8e002f1f391bbcc28c#p44292"
  },
  {
    "author": "etnama1  Guest Posts: 3 Joined: Sat Jun 02, 2007 2:50 pm",
    "title": "pancreatic cancer which has metastasized to liver",
    "content": "I was wondering if Chemo is an appropriate treatment to prolong life... and I was also wondering how long one can live with this disorder. My uncle has recently been diagnosed however metastasized to his liver and I am very concerned. Thank You\n\n",
    "posted_time": "Post  by etnama1 » Sat Jun 02, 2007 3:02 pm",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=43277&sid=29a6f20657b1de8e002f1f391bbcc28c#p43277"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Hello,  Treatment of pancreatic cancer depends on many factors. First, the type of pathology has a lot to do with how these patients are treated and how long they live. Some endocrine malignancies of the pancreas tend to be very slow to progress, even after they have metastasized to the liver.   However, pancreatic duct adenocarcinoma, is the most common type of pathology being present in up to 90% of cases. Unfortunately, this type of cancer is very aggressive and is only cured when it is discovered at an early (localized) stage. The treatment at this stage is surgery.  Chemotherapy has not been very successful in treating advanced pancreatic cancer and may not be appropriate for everyone. The two most common types used are gemcitabine and 5-FU (5-fluorouracil). In a randomized phase III trial gemcitabine produced a better 1-year survival than did 5-FU (18% of patients lived at the end of 1 year when given gemcitabine compared to 2% for those taking 5-FU).  There is a lot that can be offered to advanced pancreatic cancer patients, in terms of symptom control and improving the quality of life.  Some patients may be candidates for clinical trials using novel therapeutic agents, aiming at improving survival.  Best of luck to you and your uncle and please let us know if you have any other questions.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Fri Jun 08, 2007 10:59 am",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=43473&sid=29a6f20657b1de8e002f1f391bbcc28c#p43473"
  },
  {
    "author": "etnama1  Guest Posts: 3 Joined: Sat Jun 02, 2007 2:50 pm",
    "title": "[no title]",
    "content": "Thank you for your response I really appreciate it :)\n\n",
    "posted_time": "Post  by etnama1 » Sun Jul 01, 2007 1:12 am",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=43866&sid=29a6f20657b1de8e002f1f391bbcc28c#p43866"
  },
  {
    "author": "JayJee04  Guest Posts: 5 Joined: Mon May 09, 2005 3:26 pm Location: Illinois",
    "title": "stomach irritation.. is it serious??",
    "content": "Hi.   I am a 23 yr old male.. i have recently (the last 3 days) been having this discomfort in my abdoman.  it is kind of on the right side under the rib cage.  it is not pain.  it is just a preassury and gassy feeling.  Also, I have been kind of bloated and gassy the last few days and have been having alternations between constipation and dierea.    some people have told me that I might have Irritable bowel syndrome... does this sound like it might be what I have, or could it be something more serious??  should I be seeing a doctor immediatly, or should I wait to see how the symptoms progress??    Any advice or insight would be helpful!\n\n",
    "posted_time": "Post  by JayJee04 » Thu Jan 26, 2006 1:52 pm",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=29255&sid=29a6f20657b1de8e002f1f391bbcc28c#p29255"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Dear JayJee04,   IBS is one of the most common disorders that is seen in the clinic.   The disease is not due to inflammation in the wall of the GI and is believed to be due to autonomic dysfunction or hormonal imbalance, that can be easily controlled by simple changes in the lifestyle, diet.   Commonly people who have IBS complain off: A bloated abdomen  Gaseous distension  Abdominal pain or colic  Mucous in stools  Either Diarrhea or Constipation or an alternating between both of them.   Certain types of foods contain, chocolate, milk and alcohol might cause Constipation or Diarrhea  Stress increases the frequency and the severity of symptoms in almost all cases.  Super added infectious GI attack will worsen also the symptoms.   Although the diagnosis of IBIS is primarily made on complete history and physical examination, some tests may be recommended by some doctors to confirm the diagnosis and to differentiate them from other Inflammatory bowel diseases like Crohn's disease and Ulcerative colitis that give similar picture.   These tests include Colonoscopy and Computerized tomography (CT) scan of the abdomen help to rule out other causes.   The initial clinical features of pancreatic carcinoma include anorexia, weight loss, abdominal discomfort or pain, and new-onset diabetes mellitus or thrombophlebiti. Pain is  severe, gnawing, and radiating to the middle of the back relieved by leaning forwards and usually progressive in severity.  I hope these informations are helpful.   Best regards,\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Sun Jul 16, 2006 8:17 pm",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=33467&sid=29a6f20657b1de8e002f1f391bbcc28c#p33467"
  },
  {
    "author": "airmazzi  Guest Posts: 1 Joined: Wed Mar 01, 2006 1:04 am",
    "title": "Upper Abdominal discomfort and Bad back pain",
    "content": "I'm a 35 year old hard drinking male who recently gave up chewing Tobacco 20 hours a day after 14 years.I have had a weird abdominal discomfort for about 8 months but has gotten worse in the last 3.It started at my belly button and has went to my upper left abdomin.I have stomach spasms like a hiccup about 10 times a day and my stomach makes weird noises.My Gas is more frequent and smells really bad.My back pain is centered right in the middle of my back and goes into my shoulder blades and it has been killing me.Have a hard time standing straight up.I went from 199 to 185 pounds in 1 month and have been holding at 185 for the last 2 (bed at 190 wake up at 185?????).I eat normally but don't gain anything.The Dr has done a Upper Endoscopy with biopsies which were normal.An Abdominal CT Scan normall and compared with one 11 years ago looked the same the Dr told me.Small Bowell series where I drank some liquid and they took various XRays Normall.CBC,Liver Function,and Pancreatic Blood Test Amylases and Lipase all were normal.The Gastro Dr I last went told me they have done everything they can do and if I go to the Mayo Clinic they'll tell me the same.I asked about Pancreatic Cancer Due to my upper left abdominal pain,upper back pain and weight loss.He told me no I don't have that, gave me Nexium and sent me on my way.My Father is a Pediatric Dr and tells me it's in my head.So I asked the refering Dr for a second opinion and I have an appointment in a month hopefully sooner with other Gastro Dr.What can I do to get somebody to listen?I want to rule out Pancreatic cancer because that means death in under a year.I've allways been paranoid about my health but I'm in pain here.I just want to know what to say to the Dr to get them to find out what's wrong.Thanks for any suggestions                                   Mazzi\n\n",
    "posted_time": "Post  by airmazzi » Wed Mar 01, 2006 1:55 am",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=31569&sid=29a6f20657b1de8e002f1f391bbcc28c#p31569"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi airmazzi, Pancreatic cancer, generally speaking, not only causes abdominal and back pain but also causes significant weight loss, nausea, vomiting, jaundice etc. Abnormalities would be identified with physical evaluation, along with lab studies and imaging. In my opinion, based on symptoms that you have described, my impression would be that pancreatic cancer is unlikely the causative factor.  Here is a link for you to view.  Click here! Sincerely, Theresa Jones, RN\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Thu Mar 23, 2006 9:43 am",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=32134&sid=29a6f20657b1de8e002f1f391bbcc28c#p32134"
  },
  {
    "author": "Lura27  Guest Posts: 3 Joined: Sat Jun 18, 2005 7:48 pm Location: New Hampshire",
    "title": "Weight loss",
    "content": "Hello,  My father is in his 60's and was about 215 -230... and in four months lost 50 lbs....he has high blood pressure and is a dibetic he is taking advantia  or avantia.Is that normal or even heathy?  thank you.  Lura\n\n",
    "posted_time": "Post  by Lura27 » Sat Jun 18, 2005 8:06 pm",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=15375&sid=29a6f20657b1de8e002f1f391bbcc28c#p15375"
  },
  {
    "author": "Najah  Medical Doctor Posts: 26 Joined: Mon May 30, 2005 11:49 pm Location: Iraq",
    "title": "weigt loss in a diabetic",
    "content": "There are many causes of weight loss in diabeteswhich should be fully investigated, the most important of these is bad control of blood sugar and this can be checked by measurement of blood sugar and Hb A1c and glycosilated Hb and if these are high consult you doctor and he may increase the dose of the drug or shift to insulin.The following investigations are also  needed   ;renal function tests,tests for malabsorption syndrome ,and,u/s of the abdomen , Echocardiogram and chest x-ray  Dr.Najah\n\n",
    "posted_time": "Post  by Najah » Sun Jun 19, 2005 12:16 am",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=15384&sid=29a6f20657b1de8e002f1f391bbcc28c#p15384"
  },
  {
    "author": "flynndt  Guest Posts: 2 Joined: Thu Apr 07, 2005 11:27 pm Location: New York",
    "title": "Spreading pancreatic cancer through blood",
    "content": "My brother-in-law has had pancreatic cancer for about 2 1/2 yrs, which they first found in his liver and eventually spread to some bone.  He actually has the cancer under control with the help of a special radiation he gets in Rochester NY and chemo, and his liver is fine now, and their treating the bone tumors.  His pancreas curiously has been functioning well and doesn't seem a problem.   He is currently on chemo however and his platelet count is very low (26).  Blood has recently appeared in his semen, but his doctor doesn't appear to be too concerned and told him to stop taking the anti clotting drug for his port..  My sister has had a hysterectomy and her uterus and cervix were removed.  She is unsure whether having sex could transmit this cancer to her, as it is obviously in his blood (his tumor markers are still high).  We know he can't donate blood, but can a woman absorb these cells?  Thanks for any advice or help.  Deb\n\n",
    "posted_time": "Post  by flynndt » Thu May 12, 2005 1:04 pm",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=13657&sid=29a6f20657b1de8e002f1f391bbcc28c#p13657"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi flynndt, Although when a person is afflicted by cancer, cells may migrate from the origin site to other areas of the body (other organs, bone) It is not sexually transmitted. You can't \"catch\" pancreatic cancer from being intimate. Probably the reason he has blood in his semen is because the platelets are responsible for blood clotting and the combination of the blood thinner as well as the very low platelet count the normal functioning has become deficient. Sincerely, Rntdj\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Mon May 16, 2005 7:50 am",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=13811&sid=29a6f20657b1de8e002f1f391bbcc28c#p13811"
  },
  {
    "author": "Laaaa",
    "title": "[no title]",
    "content": "hi  i am embarassed a bit.  and so naive.  many people have told me i am a hypocondriack (sp), ...  but i have  this pain in my intestine/liver area.   middle of my upper quadrant area.  near the belly button, except a lil above it and a lil to the right of it.  i want to see the doctor, but i don't want my mom to know.  i may have hep c     .   i am dealing with it though, it is because of my doings, and i am making sure to protect everyone around me. (cleaning up and disposing of razors and such).  i want to be tested, just so busy with school!    my mom said the place i am pointing to is my intestines, (she is an RN).   it feels like a bruise when i push on the place.    do you have any advice as to what it is??    it has been about 3-4 months since i *may* have been infected.... .   i am so depressed about it, yet i cant be. i am not going to let it hold me back, or my goals.  thank you so much.    i am forever grateful for any answer.\n\n",
    "posted_time": "Post  by Laaaa » Thu Mar 13, 2003 4:48 am",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=525&sid=29a6f20657b1de8e002f1f391bbcc28c#p525"
  },
  {
    "author": "Guest",
    "title": "[no title]",
    "content": "it is gonna be hard to say what it is it can be anything its best to consult a doctor, about this and tell him not to inform ur parents. whatever goes on between u and the doc is priveleged info and ur mom will have no access to it take care it would benefit if i had the complete history\n\n",
    "posted_time": "Post  by Guest » Thu Mar 13, 2003 12:13 pm",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=526&sid=29a6f20657b1de8e002f1f391bbcc28c#p526"
  },
  {
    "author": "lemstar  Guest Posts: 1 Joined: Wed Mar 16, 2005 10:17 am",
    "title": "re: pain in your abdomen",
    "content": "please talk to your mom.  start out by saying i have something i have to tell you and its hard for me because i don't want you to be mad at me, but i think you would rather i tell you, so please take that into account.  i was a difficult teen myself, and i have raised one teen, and am working on another.  i have always told my kids to please tell me stuff, even if its hard. if they are afraid they will get in trouble, start out by saying so, and i will take that into account--a lot.  take it from me. you should tell your mom.  do it. she loves you, and wants whats best for you. do it!\n\n",
    "posted_time": "Post  by lemstar » Wed Mar 16, 2005 10:21 am",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=10895&sid=29a6f20657b1de8e002f1f391bbcc28c#p10895"
  },
  {
    "author": "chattmary  Guest Posts: 3 Joined: Mon Jan 24, 2005 7:37 am Location: chattanooga",
    "title": "CA 19-9 way way down but numerous new tumors found?",
    "content": "First CA 19-9 reading after 6 rounds of gemzar show significant reduction from 7900 to 3300. Primary tumor in tail of pancreas shrunk from 6.1 x 4.7 to 5.5 x 3.7. Two tumors in liver slightly shrunk. Patient, (my mom) feeling well, eating better and in no pain. HOWEVER CT scan showed \"numerous smaller lessions on liver\". How can CT go down that much and new things appear on liver? Is gemzar working or not? First CT was in early december without IV contrast - this CT was with CT contrast. Perhaps they were always there. Perhaps they are iron deposits or something else. Is CA 19-9 more reliable than CT scans in monitorin spread of pancreatic cancer? HOw can CA 19-9 drop that much but new lesions appear on liver! Thanks   Dave\n\n",
    "posted_time": "Post  by chattmary » Sat Feb 19, 2005 7:51 am",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=9676&sid=29a6f20657b1de8e002f1f391bbcc28c#p9676"
  },
  {
    "author": "chattmary  Guest Posts: 3 Joined: Mon Jan 24, 2005 7:37 am Location: chattanooga",
    "title": "clarification",
    "content": "Update- Saw oncologist yesterday- he said there were only 3 additional very small spots showing on liver and wasn't convinced it was cancer. Basically was convinced all is good news and the CA 19-9 is most important. So CA 19-9 way down and primary tumor shrunk. This is good. I still think this all could be cystadenocarinoma and not adenocarcinoma- but what do I know!\n\n",
    "posted_time": "Post  by chattmary » Tue Feb 22, 2005 7:47 pm",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=9829&sid=29a6f20657b1de8e002f1f391bbcc28c#p9829"
  },
  {
    "author": "Dr. Jeffrey Gordon  Medical Doctor Posts: 127 Joined: Sun Jan 05, 2003 5:22 pm",
    "title": "Pancreas cancer",
    "content": "I have read through your prior posts.  Thanks for using The Lounge.  I hope that your Mother is doing well with the chemotherapy without much side effects.  CA 19-9 in pancreas cancer or other blood tumor markers in other diseases, are not always a reliable way to monitor the effectiveness of a cancer treatment.  For the most part, one tends to see a decline in CA 19-9 levels if the pancreas cancer is responding to the chemotherapy.  However, some of the cancer may be so poorly differentiated that it lacks the ability to make CA 19-9.  Sometimes the cancer may not shrink back from the chemotherapy, but is quieted down by the treatment and thus the CA 19-9 level can fall.  Sometimes in pancreas cancer the tumor may not look like any shrinkage has occurred, but in fact such has happened.  Pancreas cancer can cause a desmoplastic reaction to occur around it and it can be tough to discern the difference between it and the desmoplastic reaction on CAT scans.  Regarding one of your posts abou the pathology of the tumor, it sounds like what you describe that the tumor is a pancreatic adenocarcinoma, which is the most common type.  Jeffrey A. Gordon, M.D.\n\n",
    "posted_time": "Post  by Dr. Jeffrey Gordon » Sun Mar 06, 2005 6:41 pm",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=10468&sid=29a6f20657b1de8e002f1f391bbcc28c#p10468"
  },
  {
    "author": "chattmary  Guest Posts: 3 Joined: Mon Jan 24, 2005 7:37 am Location: chattanooga",
    "title": "Cystic neoplasm vs. ademocarcinoma",
    "content": "First I had stomach pain. Lab test show somthing going on in the liver. CT MRI and ultrasound done that find 6cm mass in tail of pancreas. I am female 57 years old. Suspicous for \"cystic neoplasm\" says all three reports (that should be resected). Also 2 masses in liver (5cm, 4cm in same lobe). (Can cystic neoplasm metastasize?) However, pathologist biopsy said adenocarcinoma. What is the key thing to look for in distinguishing cystic neoplasm from a tumor that is adenocarcinoma? CA-18-9 was 7900. Were CT, MRI and ultrasound all wrong in saying it was cystic neoplasm? I have more info if you want it. We were hoping for cystic neoplasm. Is it obvious for a pathologist the difference between cystic neoplasm and adenocarcinoma? If it is adenocarcinoma, do partially cystic masses fare any better that fully solid. She is on chemo now since we assumed the pathologist was correct. Any info appreciated.   Mary\n\n",
    "posted_time": "Post  by chattmary » Mon Jan 24, 2005 7:46 am",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8490&sid=29a6f20657b1de8e002f1f391bbcc28c#p8490"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Hello Mary, Is this post about yourself or is it about someone that you know? Either way, I am sorry to tell you that the definitive diagnosis comes from the pathologist. CT, ultrasound etc... can only suggest a possible diagnosis. In your case it is pretty much established: Large pancreatic mass, High tumor markers (Ca19-9), and liver mets plus a pathology reading with the diagnosis of adenocarcinoma. There is little room for doubt I am afraid.  Chemotherapy would be the main palliative option.  Best regards,\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Tue Jan 25, 2005 2:58 am",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8537&sid=29a6f20657b1de8e002f1f391bbcc28c#p8537"
  },
  {
    "author": "uniname  Guest Posts: 1 Joined: Thu Jun 03, 2004 2:09 am Location: USA",
    "title": "Recent questionable pancreatic cancer?",
    "content": "I would enormously appreciate some information and direction.  My dad is an 84 year old white male who has been pointing to his abdominal area to complain of nausea, discomfort, gripping sensation, and on/off pain since about December of the year 2003.  He was treated with Prevacid and Nexium, but with no noted improvement to his condition.  On May 13 & 25 of the year 2004, he presented for one CT scan each.  No lab work or other testing was ever ordered.  The CT reports are listed verbatim here below.  My dad's physician now believes that the 2 CT reports reflect the presence of cancer in the tail of the pancreas and in the liver and spleen as well.  He says that my dad is terminally ill, and estimates him to live \"months\" more.  The physician advised against aggressive treatment/intervention suggesting that such measures, under similar circumstances, have proven to be futile in the past due to the widely known irreversible status of tumors located in the pancreatic tail.  The physician explains that the natural location of the pancreas in itself is of such great difficulty to reach for any possible treatment considerations.  He advised against informing my dad of the serious findings.  He suggested that I do not subject dad to the rigors of medical management for his knowledge that dad will not tolerate pertinent treatments.  The physician directed that I merely provide dad with comfort and support.  I am currently in a state of shock with denial, but  eager for information and help.  If at all possible, I would be profoundly grateful helping me: \tA)\tTo learn if the 2 CT reports, listed below, show enough information for a physician to \t\tdetermine the finding of cancer without the need for other medical work-ups. \tB)\tTo learn the meaning of the word \"primary\" as in \"primary pancreatic neoplasm\" \tC)\tTo learn if the word \"metastasis\" always implies the presence of cancer. \tD)\tTo learn if there are such conditions as metastatic tumors that are classified as benign. \tE)\tTo learn if pancreatic tail cancers are reputed to be fast-growing; fast-spreading, and do \t\tultimately cause definite death with or without medical intervention. \tF)\tTo learn, in general, if cancers of the spleen and liver have been clinically defeated by \t\thistory, and if humans can survive without a spleen and/or liver. \tG)\tTo learn if any studies show hereditary connection or other causes associated with \t\tcancers of the pancreas, spleen, liver. \tH)\tTo learn of available medical options for treating my dad's condition. \tI)\tTo learn if my dad stands to benefit/recover from any available course of treatment based \t\ton the findings of the 2 CT reports. \tJ)\tTo learn if the 2 CT reports, listed below, carry enough information for a physician to \t\testablish a prognosis -- predicting death.  \tK)\tTo learn if dad's symptoms are merely normal manifestations of old age. \tL)\tlearn of  your impression, opinion, prognosis and suggestions please. ##################  CT REPORT (1) \"Exam date:\tMay 13/2004 Proc:\t\tR-CT abdomen w/100 ml. cont  INDICATION:\tabdominal distention & abdominal bloating/change in bowel habits/right lower quadrant.  Pain today.  FULL RESULT:\tContrast-enhanced images were obtained following 100 cc of optiray 320 contrast from the level of the diaphragms through the level of the kidneys.  Visualized lung bases demonstrate bilateral pleural effusions, worse on the right than on the left.  Associated basilar density is identified.  There is ascites.  There are multiple punctate masses within the liver & spleen consistent with metastatic disease.  There is right porta hepatis mass.  It is irregular in appearance with mixed contrast enhancement.  It measures approximately 4 x 3 cm.  This is consistent with metastatic lymphadenopathy to this region.  The pancreas is abnormal.  There is a hypodense mass in the tail of the pancreas measuring up to 4.8 x 3.6 cm consistent with primary pancreatic neoplasm.  There is minimal pancreatic ductal dilatation on this examination.  There is no intrahepatic ductal dilatation.  There is no pancreatic head mass.  There is thickening of the stomach wall.  This may represent contracted stomach.  The adrenal glands are unremarkable bilaterally.  A right superior pole renal cyst is noted measuring 3.3 x 2.6 cm.  No other right kidney abnormality is identified.  The left kidney is unremarkable.  There is no hydronephrosis or nephrolithiasis.  There is no retroperitoneal adenopathy.  There is no bowel obstruction.  Gallbladder is contracted.  There are no gallstones or significant fluid collection.  CONCLUSION: 1.\tBilateral pleural effusions, worse on the right than on the left with associated basilar consolidator. 2.\tMultiple variably sized liver masses consistent with metastatic disease. 3.\tPancreatic tail mass consistent with a pancreatic neoplasm.  Follow-up CT-guided pancreas biopsy would be helpful to identify the histology make up of this mass.   4.\tAscites. 5.\tRight renal cyst. 6.\tNo bowel obstruction.\" ~~~~~~~~~~~~~~~~~~~  CT REPORT (2) \"Exam date:\tMay 25/2004 Proc:\tR-CT abdomen  INDICATION:\tAbdominal pain. COMPARISON:\tMay 13/2004 FULL RESULT:\tAxial sections were obtained from lung bases to iliac crest after oral contrast administration.  No intravenous contrast administered which limits the evaluation.  There are bilateral pleural effusions.  There is evidence of ascites which has increased in comparison with the prior study.  There are metastatic lesions of both liver and spleen, more conspicuous on the contrast-enhanced examination.  There is a large mass in the region of the porta hepatis.  Additional mass identified in the region of the tail of the pancreas.  There are vascular calcifications.  There is no evidence of hydronephrosis.  There is atelectasis at lung bases.  Cyst within the superior pole of the right kidney.  IMPRESSION: 1.\tLimited evaluation due to lack of intravenous contrast. 2.\tHepatic & splenic metastasis. 3.\tMass in region of the porta hepatis. 4.\tMass within the pancreatic tail. 5.\tInterval increase in ascites in comparison with the May 13/2004 study. 6.\tBibasal effusions, right greater than left, as well as atelectasis at lung bases.\" ~~~~~~~~~~~~~~~~~~~  Thank you beyond limits for any applicable information you do contribute to enable me to cope and form educated decisions in my difficult time.\n\n",
    "posted_time": "Post  by uniname » Thu Jun 03, 2004 2:23 am",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3559&sid=29a6f20657b1de8e002f1f391bbcc28c#p3559"
  },
  {
    "author": "Dr. Brim M.  Medical Doctor Posts: 16 Joined: Thu Dec 23, 2004 2:32 am Location: Birmingham, AL",
    "title": "[no title]",
    "content": "Hi there.  I noticed that your post is from several months ago, and I'm not sure if you have had your questions answered already somewhere else, but I thought I'd reply anyway since it may be of use to you or somebody else.  You asked a lot of really good (and really tricky) questions.  A) To learn if the 2 CT reports, listed below, show enough information for a physician to  determine the finding of cancer without the need for other medical work-ups.   Cancer can only be diagnosed by a biopsy.  There are a lot of tumors that look and smell like cancer but turn out to be something benign.  Similarly, there are a number of cancers diagnosed that were originally felt to be benign.  The only way to know for sure is to get a biopsy.  Most good cancer doctors will not offer treatment unless there is absolute proof that it's truly a cancer.  There are a few exceptions for a few types of cancer where a biopsy is not performed because either it's too dangerous to biopsy (such as in the brainstem) or because the look on CT scan is so diagnostic that it is highly unlikely to be anything else.  But the general rule is that a CT scan cannot diagnose cancer; only a biopsy can.  With that being said, however, there are some appearances on CT scan, particularly when there are metastases all over, that there can't really be any other diagnosis other than cancer.  In your dad's case, I feel that is so.  With the caveat that you can't be absolutely sure, you can be \"almost\" absolutely sure that it's cancer.  The CT scan can't tell you what type of cancer, however.  There's a possibility that it's not pancreatic cancer, but it could be another type of cancer that spread to the pancreas and beyond.  The highest likelihood is for pancreatic cancer, but this should be biopsied to be sure.  B) To learn the meaning of the word \"primary\" as in \"primary pancreatic neoplasm\"   Primary means that it started out there.  A primary pancreatic neoplasm is a cancer that started out in the pancreas, as opposed to a cancer that started in the colon and then spread to the pancreas.  C) To learn if the word \"metastasis\" always implies the presence of cancer.   Yes.  D) To learn if there are such conditions as metastatic tumors that are classified as benign.   No.    E) To learn if pancreatic tail cancers are reputed to be fast-growing; fast-spreading, and do  ultimately cause definite death with or without medical intervention.   Cancers can be of different grades -- low grade, intermediate grade, and high grade -- with the grade meaning how different from normal cells the cancer looks under the microscope, and with the implication that high grade cancers are faster growing and more aggressive.  Pancreatic cancers, in general, behave very aggressively.  Pancreatic cancer is the cancer that unfortunately has the lowest survival rate of any cancer.  Without treatment, it usually causes death within 3-4 months.  F) To learn, in general, if cancers of the spleen and liver have been clinically defeated by history, and if humans can survive without a spleen and/or liver.   The spleen is not a vital organ.  Many people who suffer trauma to the abdomen (like in a car accident) have to have their spleens removed, and they can live without a spleen.  You cannot live without a liver though.  G) To learn if any studies show hereditary connection or other causes associated with  cancers of the pancreas, spleen, liver.   A few (about 5%) of pancreas cancers are hereditary.  Most are sporadic, and we don't know what causes them, but they're more common in the elderly (very rare before age 40), more common in men than women, and more common in blacks than whites.  They seem to be associated with the American diet -- associated with obesity and eating high fat foods and animal meats.  There is some association with smoking.  H) To learn of available medical options for treating my dad's condition.   For widespread metastatic disease, the main treatment option is palliative chemotherapy.  If he has intractible pain, radiotherapy may give him some relief.  If he develops jaundice or has an obstruction in his gut, he can have biliary bypass or gastric bypass surgery.  I) To learn if my dad stands to benefit/recover from any available course of treatment based on the findings of the 2 CT reports.   The prognosis of metastatic pancreatic cancer is very poor, and it sounds like your dad has extensive disease.  Chemotherapy is an option, but the benefit is very modest.  Chemotherapy won't be curative in Stage IV disease.  J) To learn if the 2 CT reports, listed below, carry enough information for a physician to  establish a prognosis -- predicting death.   Yes, the CT scans are enough to give a very poor prognosis.  K) To learn if dad's symptoms are merely normal manifestations of old age.   His symptoms are non-specific and could be caused by anything.  However, the CT scans paint the picture of a metastatic cancer.  Those CT scans aren't just showing old age.  L) learn of your impression, opinion, prognosis and suggestions please.  If he's not gravely ill, I would recommend that he see an oncologist for a trial of chemotherapy.  If he's very very ill, then I think comfort care (hospice) would be the best thing for him.  The doctor would need to have a very frank discussion with your dad about how extensive his disease is, and that the outcome doesn't look good.  And then they need to decide together how aggressive they want to be.  He can be one of the lucky ones who lives longer than expected, so if he wants to be aggressive, then it's worth a shot.  At the same time, he shouldn't be given a false sense of hope.  A realistic picture should be painted.  It's a very personal decision to decide to go ahead with cancer treatment or to undergo the dying process with dignity.  I wish the best for you and your dad.\n\n",
    "posted_time": "Post  by Dr. Brim M. » Thu Dec 23, 2004 3:11 am",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=7285&sid=29a6f20657b1de8e002f1f391bbcc28c#p7285"
  },
  {
    "author": "Margaret Adams  Guest Posts: 2 Joined: Wed Oct 27, 2004 8:52 pm Location: Washington DC",
    "title": "Need Information On Follow Up",
    "content": "What type follow up do you need two years post diagnosis and whipple surgery for pancreatic cancer?  We moved this year 500 miles from my oncologist who has seen me every three months with CT scans every six months.  He does not specialize in pancreatic cancer.  I have been returning there for these visits, but would like to find someone in my new area (Washington DC).  So far, my health has been good and I suffer only from occasional bloatedness, which I can generally pinpoint to food I have eaten.  This has only seldom developed into nausea, which never lasts beyond the first day (probably 5 times in the two years).  Should I look for an oncologist here?  Should I have a complete workup at Johns Hopkins, which is now convenient?  Should I be seeing an internal medicine specialist?  Thank you for your help.  Margaret\n\n",
    "posted_time": "Post  by Margaret Adams » Sat Oct 30, 2004 11:32 pm",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6190&sid=29a6f20657b1de8e002f1f391bbcc28c#p6190"
  },
  {
    "author": "Dr. Brim M.  Medical Doctor Posts: 16 Joined: Thu Dec 23, 2004 2:32 am Location: Birmingham, AL",
    "title": "[no title]",
    "content": "Hi Margaret,  I am glad to hear that you got through a rough surgery without having any major problems, and I am especially glad to hear that you've been cancer free!  As for follow-up recommendations, there are no \"standard\" procedures for follow-up of pancreatic pancer.  However, the National Comprehensive Cancer Network (NCCN) publishes their treatment recommendations annually for each major type of cancer.  The NCCN recommends a physical exam by a physician every 3-6 months.  They also recommend a blood test for the tumor marker CA 19-9, drawn every 3-6 months.  They don't make any specific recommendations about CT scans and leave that determination up to the physician.  I think you should find an Oncologist who can continue to follow you.  It isn't necessary to have a major work-up at Johns Hopkins, since there is really no need for extensive testing.   However, you should try to get a copy of all your pertinent medical records to bring to your new doctor.    Best wishes,[/quote]\n\n",
    "posted_time": "Post  by Dr. Brim M. » Thu Dec 23, 2004 2:43 am",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=7284&sid=29a6f20657b1de8e002f1f391bbcc28c#p7284"
  },
  {
    "author": "steveseek  Guest Posts: 4 Joined: Wed Aug 04, 2004 12:11 pm Location: United States",
    "title": "Differentiating between PC and Chronic Functional Dyspepsia",
    "content": "Hi, I was recently diagnosed along with Barretts and Gastritis, with Chronic Functional Dyspepsia. For the past 3 weeks, I have been having constant epigastric upper abdominal nausea (no pain/no vomiting) which seems to be worse in the morning ,and gets worse after eating.  Are there ways to tell the difference in the epigastric disturbances of Chronic Functional Dyspepsia from PC?\n\n",
    "posted_time": "Post  by steveseek » Wed Dec 01, 2004 11:11 am",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6798&sid=29a6f20657b1de8e002f1f391bbcc28c#p6798"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi steveseek, The way of distinguishing between chronic functional dyspepsia and pancreatic cancer is by testing. It would be next to impossible to tell from symptoms alone. The testing for pancreatic cancer may include blood tests, ultrasound, ct scan, ercp, and biopsy. I hope this is helpful. Sincerely, Rntdj\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Tue Dec 14, 2004 5:47 am",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=7060&sid=29a6f20657b1de8e002f1f391bbcc28c#p7060"
  },
  {
    "author": "steveseek  Guest Posts: 4 Joined: Wed Aug 04, 2004 12:11 pm Location: United States",
    "title": "Unexpected weight loss..and PC",
    "content": "Hi...I had a baseline weight of 192# in May, which held with my normal exercise routine, and then in 6 weeks lost about 12 pounds down to 181. I seemed to stay at 181, and thought I had PC. So I had blood work done and CT and US, and Thyroid scan, and everything was negative. I still cant gain weight back permanently though. If I stop exercising and eat a lot more, I gain back weight, about 5-6 pounds in about 2 weeks. However, if I stop eating and exercise again, I lose the pounds back to 181. I cant gain the weight back, if I go back to my normal routine, and exercise. I really feel I have PC because of this, and am going to ask for a ERCP. I cant figure out why the weight does not come back on, and is this type of weight loss indicative of PC in its early stages..The weight loss of 10 pounds is per the American Cancer Society saying that it could be the first sight of PC. Any help would be appreciated! --Thanks!\n\n",
    "posted_time": "Post  by steveseek » Wed Aug 04, 2004 12:20 pm",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=4367&sid=29a6f20657b1de8e002f1f391bbcc28c#p4367"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "I don't think that you have pancreatic cancer. Weight loss due to pancreatic cancer is progressive and will not be easily reversed in the manner you described. If you say that your weight loss problem starte in May, then by now other rather major symptoms would have appeared. Your condition does not warrant an ERCP. Other investigations used in the diagnosis of pancreatic cancer include the tumor marker CA19.9. Although I wouldn't recommend this test because the symptom description does not warrant it. Consult your doctor and get a regular physical check up, he would be in a better situation to follow your condition up. Regards,\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Fri Aug 06, 2004 3:59 am",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=4407&sid=29a6f20657b1de8e002f1f391bbcc28c#p4407"
  },
  {
    "author": "archi  Guest Posts: 3 Joined: Thu Jan 15, 2004 3:10 pm Location: lebanon  Contact:   Contact archi       ICQ   Yahoo Messenger   AOL",
    "title": "Information about gemzar",
    "content": "i had an operation in 18 june 2003, pancreatectomie elargie, so i have a cancer in pancreas, my doctor gave me a chemioterapie 5 fu, and a radiotherapie about 25 times... i finished the treatment now and i am fine but i love to know more about the gemsar his efficacity and the different between gemsar and 5 cfu. i know that time to survive in this kind of cancer is very low so please if you can help with any information you find usufull to me to help. thank you a lot\n\n",
    "posted_time": "Post  by archi » Thu Jan 15, 2004 3:19 pm",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2193&sid=29a6f20657b1de8e002f1f391bbcc28c#p2193"
  },
  {
    "author": "Dr. Jeffrey Gordon  Medical Doctor Posts: 127 Joined: Sun Jan 05, 2003 5:22 pm",
    "title": "Pancreas cancer",
    "content": "Archi,  Thanks for your post here at The Doctor's Lounge.  I hope that you are doping well after your treatment.  Gemcitabine has been studied in comparison to 5-fluorouracil (5-FU) and in combination.  As single drugs in treating pancreas cancer, there is no particulr observed difference in efficacy or tolerability.  However, there appears to be some advantage with combining gemcitabine  with other drugs, such as cisplatin.  This advantage is modest and there is the potential for increased toxicity.  There are interesting clinical research studies being done looking into different ways of giving the gemcitabine.  One way is the standard short infusion by vein.  The other is to prolong the infusion over hours.  Only further research will give us more information.  My best to you.  Jeffrey A. Gordon, M.D.\n\n",
    "posted_time": "Post  by Dr. Jeffrey Gordon » Mon Jan 19, 2004 10:18 am",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2209&sid=29a6f20657b1de8e002f1f391bbcc28c#p2209"
  },
  {
    "author": "Guest",
    "title": "Symptoms of pancreatic cancer?",
    "content": "Can You tell me please what are some of the first signs and symptoms of Pancreatic Cancer?\n\n",
    "posted_time": "Post  by Guest » Wed Oct 15, 2003 10:28 am",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1446&sid=29a6f20657b1de8e002f1f391bbcc28c#p1446"
  },
  {
    "author": "Dr. Jeffrey Gordon  Medical Doctor Posts: 127 Joined: Sun Jan 05, 2003 5:22 pm",
    "title": "Pancreas cancer",
    "content": "There may not be any initial signs or symptoms of pancreas cancer until it is in advanced stages.  Common problems seen include diabetes as the pancreas malfunctions, blood clots at different sites of the body,  abdominal or back pain, abdominal swelling, loss of appetite, loss of weight, worsening general fatigue of an unexplained nature,  jaundice if the bile duct becaomes compressed.  There is no one particular sign or symptom that is the hallmark of pancreas cancer.\n\n",
    "posted_time": "Post  by Dr. Jeffrey Gordon » Fri Oct 24, 2003 9:01 pm",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1481&sid=29a6f20657b1de8e002f1f391bbcc28c#p1481"
  },
  {
    "author": "Daniel-",
    "title": "Acinar cell carcinoma of the pancreas",
    "content": "Via CT scan my heterogenesous mass is 6.0cmx4.7cm with complete encasement of the adjacent portal vein and SMA axis, and 50%of the celiac axis  Mass is not resectable. Biopsy was postive.  PET on my adrenal gland was negative.   I am going Mayo for a 2nd opinion on 7/10/03 and they are going to do further testing. I am taking about 10-12 viokase pills a day to slow down my pancreas, a nutritional drink to help stablize my weight, and a multi-vitimin minerial supplement . The viokase has helped my indigestion problems.   As time is of essence, is there any other over-the-counter drugs and/or food that I should taking to slow the spreading to other organs until a complete evaluation is finished? I first went to the Dr. on 5/21/03 with my indigestion symptoms. I was also diagnosed with diabetes in 10/1/01with a 20%  dietary loss in weight since.(normal now)  I started have digestive symptoms around 1/1/03, I haven't had any of the other symptoms such as jaundice, pain in my back, am in good health, 57 years old white male. diggernjayne@hot.com\n\n",
    "posted_time": "Post  by Daniel- » Mon Jun 30, 2003 10:26 am",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1049&sid=29a6f20657b1de8e002f1f391bbcc28c#p1049"
  },
  {
    "author": "Dr. Jeffrey Gordon  Medical Doctor Posts: 127 Joined: Sun Jan 05, 2003 5:22 pm",
    "title": "Pancreas cancer",
    "content": "I am not aware of any over-the-counter substances being of proven benefit in the treatment of pancreas cancer.  The viokase is probably not slowing down the cancer, although from what you post, it appears to be helping your digestive problems.  Unfortunately, there are many health supplements sold with claims of medical benefit in treating or preventing cancer.  Most have been debunked and theothers have not been tested.  I would beware of such claims as being simply a way for someone to sell a product and make money.  The only way to treat a cancer of the pancreas that cannot be removed with surgery is chemotherapy.  Sometimes radiation treatment is used if there is a specific problem.  But, chemotherapy is the standard.  There are several standard drugs used and several combinations of drugs that hold promise.  There are also experimental drugs being investigated as part of clinical research studies.  Your docotr and the specialists at Mayo will go over all of these issues with you individualized to your case.  I wish you the best.\n\n",
    "posted_time": "Post  by Dr. Jeffrey Gordon » Sat Jul 26, 2003 7:50 pm",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1165&sid=29a6f20657b1de8e002f1f391bbcc28c#p1165"
  },
  {
    "author": "Jane P.",
    "title": "Acinar cell carcinoma of the pancreas",
    "content": "Can you suggest a chemotherapy regimen / protocol for acinar cell carcinoma of the pancreas?\n\n",
    "posted_time": "Post  by Jane P. » Wed Feb 12, 2003 11:02 am",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=340&sid=29a6f20657b1de8e002f1f391bbcc28c#p340"
  },
  {
    "author": "Dr. Jeffrey Gordon  Medical Doctor Posts: 127 Joined: Sun Jan 05, 2003 5:22 pm",
    "title": "Acinar cell pancreatic cancer",
    "content": "Jane,  Thanks for posting a question here at The Doctor's Lounge.  Acinar cell pancreatic cancer is not a common type of cancer of the pancreas.  Although acinar cells comprise a significant majority of the exocrine porton of the pancreas, they only account for a small portion (probably around 1%) of cancers that arise from the exocrine pancreas.  They can be large when found and can have already metastasized (i.e.- spread beyond the pancreas) when diagnosed.  The question of what chemotherapy to use to treat pancreas cancer depends in part on the stage of the tumor.  Could you provide more information about this?  Is it widespread and thus no surgery or radiotherapy are planned?  Is surgery a potential treatment option?  Are there plans to give chemotherapy along with radiotherapy?  If chemotherapy alone is to be used in the setting of advanced, metastatic disease, then there are several choices.  Chemotherapy in general has limitations in how often the cancer responds, how well it responds, and how long it remains under response.  There is a difference between shrinking the cancer and just decreasing its activity.  Both are important.  Shrinking of a cancer is termed a Partial Response.  Keeping the cancer stable, yet decreasing its activity and improving any symptoms the cancer may be causing is termed Clinical Benefit.  Sometimes cancers of the pancreas do shrink, but on CAT scan images, do not appear to have done so and may appear larger than they were before chemotherapy was begun.  This is due to the development of fibrosis or a so called desmoplastic reaction.  CAT scan will show such a response and the remaining cancer as looking the same, hence some confusion in interpreting CAT scans looking at pancreas cancers.  Also, the pancreas may be difficult at times to image on routine CAT scans.  In the care of my patients with pancreas cancer, I have used various single agent chemotherapy drugs.  Gemcitabine is a commonly used agent, as is 5-Fluyorouracil.  Various combinations of drugs have been used.  Although it may appear in small studies from single cancer insttitutions that the reponse rates are higher by combining 2 or more drugs instead of just using 1 drug, it is not known if this improved overall survival.  Nevertheless, in my practice, if a patient of mine is in good health and has good kidney function, then I use a combination of low-dose Cisplatin and Irinotecan given each week.  Usually this is given for 2-3 weeks in a row, with a 1-week break from chemotherapy.  I keep on repeating it.  I have also used single agent gemcitabine, usually given 2-3 weeks in a row, with a 1-week break.  Some pancreatic cancers produce certain proteins that can be measured in the blood (e.g.- CA 19-9 or CEA).  If these levels are high before treatment, then I do follow them during and even after chemotherapy.\n\n",
    "posted_time": "Post  by Dr. Jeffrey Gordon » Sat Feb 15, 2003 9:51 am",
    "category": "Oncology",
    "sub_category": "Pancreatic Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=354&sid=29a6f20657b1de8e002f1f391bbcc28c#p354"
  }
]