[
  {
    "author": "mufahad  Guest Posts: 1 Joined: Mon Jun 07, 2010 4:21 pm Gender: Male",
    "title": "viral Pericarditis",
    "content": "My age is 25 years. i was diagnosed as having viral pericarditis 25 days ago. i was feeling consistent mild pain(at rest and during walking) in my chest(left side). My doctor prescribed me IBrophen 600 three times a day initially. i tried it for 15 days but it had no effect. Then he prescribed me Diclofenic sodium 50 mg three times a day. i am taking it from last ten days and now i do not feel any pain while i am at rest. but i feel even more pain than before while i walk. i feel pain in my chest left side and in veins of my left arm near my hand. and also in the vein behind my left ankle. now my both hands have lines of blue color(especially at palm). this color becomes more prominent during walking. I feel pain when i walk and it settle down when i have rest. if i walk for few yard then this pain settle down with few minutes(15) of rest. but if i walk for more than 5 minutes i feel pain for whole day even at rest. please tell me what i do?? how long it will take to cure completely ?\n\n",
    "posted_time": "Post  by mufahad » Mon Jun 07, 2010 4:45 pm",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=93468&sid=9ad766158ebe49a41b99a104ed1a31f0#p93468"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: viral Pericarditis",
    "content": "Hi, From your history, it is evident that you were diagnosed with acute viral pericarditis fairly recently. By definition, an acute viral or idiopathic pericarditis  should last <6 weeks.  Pain is the predominant symptom of pericarditis and usually responds well to NSAIDs, especially, Ibuprofen.Intense pain, not responding to NSAIDs may need an opioid, such as morphine  or a corticosteroid, such as prednisone. Prednisone does not have an analgesic action per-se but, reduces pain by its anti-inflammatory action.  Failure to respond to NSAIDs within one week (as indicated by persistence of fever, worsening of the general condition, continuing chest pain,or new pericardial effusion) should alert to the possibility of a cause other than viral or idiopathic may be causing the pericarditis.  Pain persisting beyond one week(on NSAIDs) is considered to a risk factor for severe pericarditis.  The bluish discolorations that you allude to are suspicious of acute thrombophlebitis.This has to be urgently excluded as there have been case reports of severe purulent pericarditis occurring due to spread of organisms from these foci of acute thrombophlebitis(at times, even fatal). ( Coeur Med Interne. 1964 Jul;64:355-8 ).  Therefore, i urge you to consult your physician without delay and get yourself evaluated. Best wishes!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Sun Jun 27, 2010 11:31 am",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=95348&sid=9ad766158ebe49a41b99a104ed1a31f0#p95348"
  },
  {
    "author": "al17th1985  Guest Posts: 2 Joined: Sat Dec 19, 2009 3:57 pm Gender: Male",
    "title": "bad effects after swine flu vaccine",
    "content": "I had the swine flu vaccine on monday morning, at the time i asked the sister administering the vaccine, if there was anything i need to know, symptoms how it would effect my work etc, all the usual concerning questions, the answer i got was \"which arm do you write with\", replied Left, and got a jab in the right arm, then told \"try not to lift anything with that arm\"  since monday morning, i have started by having several moments of being delirious, and loosing track of what is going on, (in the first couple of days)  to, little or no appetite, head pains, neck pains, lower lumber pains.   to, (on wednesday evening), feeling quite off, and on making my way to the toilet, having the whole room spinning, and collapsing and passing out for a few minutes, managing to pick my self up and suffering with projectile vomiting, and burning diarrhea (the burning diarrhea has been the same since day one, but is now (saturday) not burning, but is the same state.  since then, i have been suffering with leg pains, like a lactic a build up from the hips down to the instep of my feet, finding it difficult to walk up stairs and extremely discomforting sometimes very painful, i still suffer with the delirious part and need to close my eyes and rest in the hope of it settling.\n\n",
    "posted_time": "Post  by al17th1985 » Sat Dec 19, 2009 4:21 pm",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=89447&sid=9ad766158ebe49a41b99a104ed1a31f0#p89447"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: bad effects after swine flu vaccine",
    "content": "Hello -- While none of what you describe sound like any of the syndromes associated with the H1N1 vaccination -- such as Guillain-Barre syndrome -- there is certainly something happening that warrants medical evaluation. I doubt it is related to the flu shot, but it certainly does deserve the attention of an MD urgently. I hope you'll do this and then please follow up with us here and update us as to how things are and what, if anything, is discovered.  Good luck to you.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Tue Dec 22, 2009 11:07 pm",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=89712&sid=9ad766158ebe49a41b99a104ed1a31f0#p89712"
  },
  {
    "author": "al17th1985  Guest Posts: 2 Joined: Sat Dec 19, 2009 3:57 pm Gender: Male",
    "title": "Re: bad effects after swine flu vaccine",
    "content": "8 days later and all symptoms have gone, for the last few days of the symptoms, the only thing i was suffering from was much tiredness, sleeping 12-13 hours most nights and of course the aching legs, (which became a bad back - which has now gone - all 8 days later)  the bad back i would say may have been a slight injury or wrongly twisting but the fact that i had bad (hard to walk) pains in my legs may have been from a lack of engery from the vaccination.  the deleriousness i sort of solved by keeping meals small but regular - in some cases snacking.  which would say to me that i was loosing engery quickly, i can only assume the vaccine, as i can normally sustain a meal for a very long time.   all though im ok now, i am interested in any opinions/evaluations or if anyone else has similar effects.\n\n",
    "posted_time": "Post  by al17th1985 » Wed Dec 23, 2009 8:15 am",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=89743&sid=9ad766158ebe49a41b99a104ed1a31f0#p89743"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: bad effects after swine flu vaccine",
    "content": "I'm very glad to hear things are starting to finally sort out for you. If this was a systemic reaction to the vaccine it needs to be recognized, because it was quite severe. Hopefully other readers here will share any similar experiences. I'm just glad to hear you're feeling better now. Good luck to you.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Fri Jan 01, 2010 9:32 pm",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=90482&sid=9ad766158ebe49a41b99a104ed1a31f0#p90482"
  },
  {
    "author": "heatherjoy77  Guest Posts: 1 Joined: Fri Nov 13, 2009 10:46 am Gender: Female",
    "title": "Pericarditis and Sepsis",
    "content": "Hello,  My just turned 55 year old father presented with pericarditis at his family doctor last month. It was detected with an EKG. He was admitted to the hospital. They ran some additional heart tests, said he would be fine, it wasn't life threatening. The next afternoon he went downhill very quickly (urine was rusty with lower output, blood/oxygen levels begane to drop, blood pressure began to drop) and was admitted to the ICU, he died a few hours later of sepsis. He was only in the hospital about 36 hours total.   Can pericarditis get into your bloodstream and cause sepsis? I was told it was viral pericarditis but he died of bacteria in his blood. How did the bacteria get there? Everything I've read online says pericarditis tends to clear up in a few weeks. Are the two even related?   How did he catch the pericarditis? Is it a virus you catch just in the air, like a cold or flu virus?   Having trouble understanding what happened. The hospital/ICU doctors were of little help as they said they were still waiting for the blood cultures to get back so they knew what they fighting. He died before the cultures came back.  Any input would be appreciated.\n\n",
    "posted_time": "Post  by heatherjoy77 » Fri Nov 13, 2009 11:22 am",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=86837&sid=9ad766158ebe49a41b99a104ed1a31f0#p86837"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: Pericarditis and Sepsis",
    "content": "Hi, The causes of acute pericarditis are many;  for example... - viral(cytomegalo virus,HIV,Herpes virus) etc, - bacterial (notably pneumococcal), - fungal (aspergillus, histaplasmosis,candida albicans etc, & - myocardial infarctions.  Risk factors for pneumoccocal pericardtis are advancing age (older than 55-65 years ), children younger than 6 months and immunocompromised states.  Primary (Invasive) Pneumoccocal pericardtis can be very fulminant and may result in death very rapidly.Certain communities (Apache & Navajo Indians, native Alaskans,and African Americans) have been found to be at a higher risk.  Usually there is a focus of infection which may remain occult.  From your description, one strong possibility is an invasive pneumococcal sepsis perhaps leading to pericarditis and acute cardiac tamponade leading to the tragic demise of your father.\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Mon Nov 30, 2009 9:45 am",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=87797&sid=9ad766158ebe49a41b99a104ed1a31f0#p87797"
  },
  {
    "author": "cheer_girl  Guest Posts: 2 Joined: Sun Aug 02, 2009 9:04 pm Gender: Female",
    "title": "pericarditis and congenital heart defect-PFO",
    "content": "I am a sixteen year old girl and I have a PFO. Two days ago I had an echocardiogram to check for pericarditis after severe chest pains. I get the results tommorow, if I have this condition, will it interfere with my process of getting my PFO closed? Will I need to put off cath lab procedure, will it affect my PFO, ect.,\n\n",
    "posted_time": "Post  by cheer_girl » Sun Aug 02, 2009 9:15 pm",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=81220&sid=9ad766158ebe49a41b99a104ed1a31f0#p81220"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: pericarditis and congenital heart defect-PFO",
    "content": "Hi there --  If you do actually have pericarditis it can range from mild to fairly complex but in almost all cases responds to fairly simple medication and usually doesn't last too long once it's been treated. Most cases of pericarditis would not interfere with a PFO repair except to the extent that it would probably need to be cured before the repair is done, which, again, shouldn't take very long in most cases to resolve. Pericarditis is a fairly common problem, is usually easily treated, rarely causes lasting problems unless it is related to an underlying condition. It would only interfere with your cath procedure/repair insofar as it would need to be declared cured beforehand, so if you're scheduled to have the procedure in the next week or so it might have to be postponed for a week or so, which really shouldn't be a big problem.  I hope this is helpful. Good luck to you and please follow up with us here as needed.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Wed Aug 05, 2009 11:25 pm",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=81336&sid=9ad766158ebe49a41b99a104ed1a31f0#p81336"
  },
  {
    "author": "wafaa  Guest Posts: 4 Joined: Sun Dec 28, 2008 1:06 pm Gender: Female",
    "title": "rapidly progressive pericardial effusion",
    "content": "my aunt is 41 years old, with no past history or family history of cardiac disease, she had severe right hypocondrial pain, dry cough, and dyspnea, orthopnea and sweating with no fever. she went to the doctor who gave her voltarin ampule and buscopan ampule and oral antispasmotics. 2 days later the pain became diffuse upper abdominal, with severe pain attacks up to vasovagal shock that are not related to meals or ceartain posture and realived without medications within 5minutes. she had an  abdominal u/s showing mild liver enlargement, and mild ascitis, and liver function tests were normal. she was not realived by the medication so, she went to a hospital were her blood preseaure was 80/50, so she became an inpatient, after medical examination in out clinic,  for more investigations. they gave her 500ml saline IV, a surgical consultant transfered her to the CCU, where they gave her adrenaline inffusion, sodium bicarbonate and saline through a central venous line. during that, she developed severe dyspnea, echo diagnosed cardiac tamponade. pericardiocentesis was done revealing 1200ml hemarrhagic effusion,and she improved, but 6 hours later she developed cardiac tamponade again but nothing came by the drain. investigations revealed: brolonged prothrombin time, low albumin, elevated liver enzymes, and heamoglobin 9, ceriatinin 2.4 they gave her 1.5 liters blood, and plasma. then she had pericardial window and biopsy and introduced pleural tube for drainage next day. then she developed severe dyspnea within hours after the operation, she was put on ventilator, CT chest showed bilateral consolidation of the lungs with areas of injury and fibrosis, diagnosed as postoperative pneumonia and ARDS. biopsy and citology showed non specific mesothelial hyperplasia. would you kindly give me your openion about diagnosis and treatment.                                                         thank you\n\n",
    "posted_time": "Post  by wafaa » Sun Dec 28, 2008 2:08 pm",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=66155&sid=9ad766158ebe49a41b99a104ed1a31f0#p66155"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: rapidly progressive pericardial effusion",
    "content": "Hello -  FIrst, the early workup of your aunt should have at least been suggestive of pericardial tamponade. The liver enlargement with mild ascetes yet normal liver function tests should have caused suspicion of tamponade early on. Later elevated liver enzymes were to be expected. A good opportunity to discover the suspect tamponade would have been to perform an echocardiogram earlier in the process, but since the problem apparently wasn't suspected, this opportunity to avoid a critical situation was missed.   The most common causes of pericardial tamponade are kidney failure, cardiac trauma (via chest injury or medical catheter mishap, neither of which would appear to be a factor here), connective tissue disease and some cancers. There's no obvious link to any of these, but because of that the suspicion would fall  to the most insidious probable cause which, in your aunt's case would be an undiscovered malignancy or connective tissue/autoimmune disease (lupus, for example).   It's impossible to determine here what the underlying cause of the primary problem is, but one would hope all the requisite explorations are being pursued now by your aunt's doctors.  I hope your aunt receives appropriate care and begins to improve. Please keep us updated as to her progress. I hope this response is helpful to you.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Mon Dec 29, 2008 10:59 pm",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=66334&sid=9ad766158ebe49a41b99a104ed1a31f0#p66334"
  },
  {
    "author": "wafaa  Guest Posts: 4 Joined: Sun Dec 28, 2008 1:06 pm Gender: Female",
    "title": "Re: rapidly progressive pericardial effusion",
    "content": "thank you very much for caring and the reply dr.Kenyon   as regard her chest condition, after 3 days on ventilator, she got better and there is no dyspnea now and no recollection of effusion hapened in pleura or pericardium since the operation.  but due to her low coagulation profile, the ICU doctors gave her packed RBCs and platelets despite the refuse of her cardiologist. 3days she started to complain from pain in her both lower limbs, after a dopler, they discovered thrombi formation in both iliac veins, so they started to give her medications for that, but then next day they discovered thrombi in her left axillary vein and later that day they found another 2 in her brain, she is now suffering from right hemiplegia and affection of her left side of her face and she is having a mood disturbance, but she is conscious and speaking but some times she says some unrelevant words just for seconds then she is fine. she had a lot of immunological and rheumatological investigations daily, all turned negative. citology and pathological analysis of the sample were unconclosive(non specific mesenchymal cells) , but they are reexamining again. dopler was made again with CT, showing no mare thrombi were formed and no bleeding wold you please tell me what conclusive investigations should be done to exclude malignancy? and can it be a viral infection or idiopathic cause? and when can she leave the ICU she has been there now for 2 weeks and she wants to get out?       thanks for your kind reply and we realy apreciate your concern                                                     thanks\n\n",
    "posted_time": "Post  by wafaa » Thu Jan 01, 2009 4:05 pm",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=66573&sid=9ad766158ebe49a41b99a104ed1a31f0#p66573"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: rapidly progressive pericardial effusion",
    "content": "I'm happy to hear the positive news, but distressed about the unfortunate ensuing events. It would seem she has a clotting disorder, and while this may be secondary to an occult malignancy it is more likely, now that this has happened, that it is probably a heritable genetic defect. She hopefully has been tested for such things as Factor V Leiden, etc. As for conclusive investigations to exclude malignancy, that's a subject out of the scope of my knowlege and training, but I can certainly pass this question along to our oncology team and see if anyone has any suggestions toward that end. There are some blood tests that can at least suggest the presence of tumors such as CA 19.9, a tumor marker test, which can at least, hopefully, disclose the presence of any tumors.   I hope this is helpful and also hope your sister will recover from the stray thrombi as quickly as she recovered from the pericardial effusion. She seems to be intrinsically strong, so that's a positive for her. My best to you both, and please keep us updated.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Fri Jan 02, 2009 10:50 am",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=66661&sid=9ad766158ebe49a41b99a104ed1a31f0#p66661"
  },
  {
    "author": "wafaa  Guest Posts: 4 Joined: Sun Dec 28, 2008 1:06 pm Gender: Female",
    "title": "Re: rapidly progressive pericardial effusion",
    "content": "thank you dr.Kenyon for your quick response. those investigations you mentioned and the rest of rheumatological and tumor markers were done to her and they all turned negative that's why her doctor is sugesting a viral infection or ediopathic cause as there is also no sugestive family history of such case. about the thrombosis, could it happen because she is bed ridden and they gave her extra packed RBCs, platelets, and albumin? can her pericardial effusion return at any time? or can she have any kind of cardiac complications as constrictive pericarditis or something? and how can we follow up her case, like certain symptoms that could suggest a relapse so we can save her with least complications?                              thank you for your helpful advice happy new year\n\n",
    "posted_time": "Post  by wafaa » Tue Jan 06, 2009 3:52 pm",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=67159&sid=9ad766158ebe49a41b99a104ed1a31f0#p67159"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: rapidly progressive pericardial effusion",
    "content": "Hello again -  Since all the heritable disorders and mutations seem to have been ruled out, which is a good thing actually, the burden of likelihood shifts to a reaction to the packed RBCs (not necessarily the albumin) due to some odd and unpredictable factor. This is fairly unusual, but it can and does happen. A viral cause is also possible, but less likely. \"Idiopathic\" simply means \"no known cause can be determined.\" This may wind up being the diagnosis of record, but hopefully someone will retrace the history of the packed cells if possible, just to be sure there wasn't some incompatability that wasn't caught on first screening.   If there should  be a relapse it won't have been the packed RBCs, so the detective work would have to start over, and let's hope that doesn't happen, but in the meantime the things to look for would be signs of anemia (weakness, fatigue, pallor) first and foremost, and if the source of bleeding inside the pericardium remains patent, then also of course signs of a return of pericardial tamponade should be noted and reported at once. That would include frank chest pain (usually of a sharp nature and often affected by position), difficulty breathing, and pleuritic pain upon breathing. If any of these things are noted someone should contact the doctor at once.   I hope this is helpful and that she continues to improve and experiences no further problem of this sort. Best of luck to all there, and please keep us updated.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Wed Jan 07, 2009 11:24 am",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=67295&sid=9ad766158ebe49a41b99a104ed1a31f0#p67295"
  },
  {
    "author": "wafaa  Guest Posts: 4 Joined: Sun Dec 28, 2008 1:06 pm Gender: Female",
    "title": "Re: rapidly progressive pericardial effusion",
    "content": "thanks dr.Kenyon  she finally left the hospital, the final CT brain and dopler showed that the clots have disolved and the only thing found in brain(parietotemporal) is an inflamation in the area of thrombus and they say that it is regressive and it is getting better, but clinically we can not see any improvement. can  you kindly tell me the prognosis of her hemiplegia and the posibility of her regaining her motor action of her affected limbs? (sensations are normal) sorry for bothering you again, but is it advisable to give 16 fresh frozen plasma, 8 fresh blood paks, and 2 paks of platelets and 24 ampules of vitamin k, to her for 5 days and she was bed riddin, and her heamoglobin was 7.2 gm/dl and prothrombin time 21.6 and improving to heamoglobin 12.8 and prothrombin time 16.5 (in the day they discovered the thrombosis) and there was no bleeding? and does the tube of the central venous line reach the heart? thank you very much for your help and consultation and caring\n\n",
    "posted_time": "Post  by wafaa » Thu Jan 15, 2009 10:23 am",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=68406&sid=9ad766158ebe49a41b99a104ed1a31f0#p68406"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: rapidly progressive pericardial effusion",
    "content": "Hello -  There is a lot of good news here. I'm so glad she's out of the hospital and that the inflammation in the area where the thrombus had lodged is regressing. It seems likely she'll be making a full recovery if there are no further events.   The question regarding the infusions of plasma, platelets, vitamin K, etc., is a difficult one to answer without having been in attendance, but since she is doing well I would trust this was intended to offset effects of the prior bleeding and to help avoid any future bleeding events. We must assume this was the prudent approach.   Regarding the central line, depending upon the type and the insertion site, as well as the intended purpose, yes, sometimes a central line may reach into the right atrium of the heart. At other times it rests in the superior vena cava. In either case complications involving the heart are extremely rare. When the line is placed in the right atrium this is usually for purposes of measuring closely capillary wedge pressures with extreme accuracy. If there is a central line still in place, I doubt it would be left in that location, but probably would be backed out or changed to the vena cava. Of course it may have been removed prior to discharge.   I continue to hold good thoughts for her recovery and am sure she will be appreciative of having had such great support and advocacy from you and the rest during this ordeal. My best to you all.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Thu Jan 15, 2009 11:28 am",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=68417&sid=9ad766158ebe49a41b99a104ed1a31f0#p68417"
  },
  {
    "author": "deecheen  Guest Posts: 1 Joined: Mon Sep 08, 2008 1:30 am Gender: Male",
    "title": "chest discomfort and no enegry",
    "content": "i am a 25y old male. i am not overweight. i do not smoke but i am only a social drinker. i am having discomfort in the left chest for all day. i don't have any energy and feeling weakness always. i feel shortness of breath when in exertion, my left lung seems not enough oxygen. sometimes i get palpitation for seconds and fades away. i also have lightheadedness and sometimes nausea. my weakness and discomfort has been a year now. the ECG and ECHO seems fine. doctor prescribed me 10mg inderal daily one for 1month but no better.  before i had stress when i was sick and due to my career.at that time i had depression but now i don't have any. when i exercise hard i don't feel any pain. i can sleep well. but i am really without energy and having discomfort all the time.\n\n",
    "posted_time": "Post  by deecheen » Mon Sep 08, 2008 2:21 am",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=60087&sid=9ad766158ebe49a41b99a104ed1a31f0#p60087"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: chest discomfort and no enegry",
    "content": "Hello -  It sounds as though you pursue a healthy lifestyle, and are young and generally healthy, yet you've had these symptoms for more than a year.  Your EKG and echocardiogram have been normal, but you are low on energy and have a non-specific discomfort in your left chest.  While none of this sounds like it is heart-related, it could be caused by a mood disorder (anxiety, depression) or it could be something physical but not related to the heart. I'm wondering why your doctor prescribed the beta blocker. I'm also wondering about the character of the chest discomfort. Perhaps you could describe this in a little more detail, as well as the rationale for the beta blocker,  and this might help me get an idea of what's going on so I could  help point you in the right direction.   Please follow up with  us here.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Wed Sep 10, 2008 10:36 pm",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=60287&sid=9ad766158ebe49a41b99a104ed1a31f0#p60287"
  },
  {
    "author": "mgeli02  Guest Posts: 2 Joined: Thu Aug 28, 2008 3:09 pm Gender: Female",
    "title": "Heart beat only on left side of body.",
    "content": "Hello,   My name is Michelle. I'm a healthy 26 year old female. I have never smoked and I occasionally I drink 1 or 2 glasses of red wine socially.   Earlier this year (January 2008) I was diagnosed with very mild pericarditis due to a viral infection.  Cardiologist put me on steroids. After course of treatment echo showed no more fluid. (he mentioned 2 murmurs and a leaky valve. I have no idea what it means)  It is now August 2008 and my symptoms, pain have not dissapeared. I have been in and out of the hospitals since then with horrible pains with no diagnosis:  1) I feel my heart beat on my left hand and my left foot. It is extremely uncomfortable as I'm feeling this constantly. the sensation is as if I had a bruise and it was beating very hard due to the pain.  2) I have a \"pressure\" on the left side of my chest. Right above my breast and under as well.   3) Pain comes and goes on my left side as well. Feels like a needle is being inserted in me and after about 15 mins it dissapears.  this happens various times during the day.  4) I have developed anxiety due to this ongoing condition. I have palpitations every single day and i'm often very light headed.   5) I have had ekg's, brain scans, x-rays done you name it. everything negative and apparently healthy. I'm very active. I work out every day. After all this started I have slowed down the intensity of my workouts but continue to do them.   I am terrified. Pain is everpresent. I can barely sleep. I feel as if i'm dying every single second. Pain on my left side leaves me so exhausted. I'm constantly tired. All I want to do is sleep. I saw a neurologist and I have a buldging on my neck and a herniated disk on my lower back. I do not know if this has anything to do with any of my symptoms.   Any help whatsoever will be extremely appreciated as dr's now think that i'm nuts.   Thank you and many blessings.   Michelle.\n\n",
    "posted_time": "Post  by mgeli02 » Thu Aug 28, 2008 4:21 pm",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=59468&sid=9ad766158ebe49a41b99a104ed1a31f0#p59468"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Heart beat only on left side of body.",
    "content": "Hello -  What you describe (with the exception of the forceful pulsing in your left extremities) does sound very much like chronic pericarditis. If this has been ruled out -- if it is certain that there has not been a recurrence of the inflammation with fluid -- then you may have developed a pericardial friction  rub or even an adhesion, wherein a small part of the formerly inflamed pericardial sac becomes \"stuck\" to the heart muscle, causing symptoms without any fluid showing up on x-ray. The adhesion may not even be visible on echocardiogram, so is sometimes difficult to pinpoint. The symptoms would  suggest this,  however.   I have no idea why the pulsing in your left extremities in this case, but it is sometimes caused by a congenital narrowing of the aorta. This would almost certainly have been picked up during your prior care for pericarditis, however, so I'm at a loss to guess what may be causing that. If it's not coarctation of the aorta then it's probably not really significant, but the pain and palpitations suggest there is still  some problem with the pericardium. It is rarely truly dangerous, but can be very uncomfortable, and that at least should be treated.  It's encouraging that you're able (and want to) continue your exercise regimen, and this should also help ease your mind as to your ability to tolerate exercise, as it means your heart is functioning well.   Again, the symptoms suggest possibly a recurrence of pericarditis or perhaps a pericardial adhesion. It's unusual  but not impossible.   I hope this is helpful. Best of luck to you.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Wed Sep 03, 2008 12:05 am",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=59745&sid=9ad766158ebe49a41b99a104ed1a31f0#p59745"
  },
  {
    "author": "mgeli02  Guest Posts: 2 Joined: Thu Aug 28, 2008 3:09 pm Gender: Female",
    "title": "Re: Heart beat only on left side of body.",
    "content": "Thank you Dr. Kenyon for your prompt reply.   I am seeing a cardiologist in the next few weeks and I have printed your response so that I can discuss this posibility with the Dr.   Thank you once more as you have put my mind at ease. I will keep you updated as soon as I have any information from the Dr.  Best regards,   Michelle Geli\n\n",
    "posted_time": "Post  by mgeli02 » Wed Sep 03, 2008 8:43 am",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=59758&sid=9ad766158ebe49a41b99a104ed1a31f0#p59758"
  },
  {
    "author": "swon888  Guest Posts: 2 Joined: Mon Aug 25, 2008 7:29 pm Gender: Male",
    "title": "Re: Heart beat only on left side of body.",
    "content": "Michelle, if you do not mind, please post your updates with the doctor you have visited.  I have the same issue and it is very scary to know that no one really knows why and undetectable. Thank you.  sam\n\n",
    "posted_time": "Post  by swon888 » Mon Sep 08, 2008 5:10 am",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=60090&sid=9ad766158ebe49a41b99a104ed1a31f0#p60090"
  },
  {
    "author": "30yrsUnDxd  Guest Posts: 8 Joined: Sat Aug 11, 2007 5:59 pm",
    "title": "Recovery time for perimyocarditis?",
    "content": "I wondering what the recovery time is for perimyocarditis. I have atrial fib and am anemic. And also I've read that Hashimoto's or hypothyroidism can cause perimyocarditis. My doctors haven't heard of this. What do you know about it?  Age 54, F, with long term, severe, under treated, Hashimoto's.  Current medications: Colchicine Ibuprofen Digoxin Flecainide Maxzide Synthroid Nexium FeSO4 and supplements\n\n",
    "posted_time": "Post  by 30yrsUnDxd » Thu Oct 25, 2007 3:42 am",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=49498&sid=9ad766158ebe49a41b99a104ed1a31f0#p49498"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi 30yrsUndDxd,  The recovery time for pericarditis depends on what is causing the inflammation and if the underlying issue has resolved.  Recover can be weeks to months in more severe cases.  I'm not directly aware of Hashimoto's or hypothyroidism causing pericarditis although it may in rare cases.  You may also what to discuss with your doctor the possibility of Systemic Lupus Erythematosus.  This can cause pericarditis and is associated with other autoimmune diseases such as Hashimoto's.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Tue Nov 06, 2007 6:07 pm",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=49957&sid=9ad766158ebe49a41b99a104ed1a31f0#p49957"
  },
  {
    "author": "30yrsUnDxd  Guest Posts: 8 Joined: Sat Aug 11, 2007 5:59 pm",
    "title": "[no title]",
    "content": "Thank you for your reply Dr. Lowe.  I've read that hypothyroidism can cause pericardial effusion. I had long term, under treated hypothyroidism. It took me nearly four years to find a doctor who knew how to treat it and place me on the correct dose of Levothyroxine.  I don't have the symptoms of SLE. I've been thoroughly tested for autoimmune diseases because they run in my family. I don't, at this time, have anything else besides Hashimoto's. Nor do I have any symptoms of other autoimmune diseases.\n\n",
    "posted_time": "Post  by 30yrsUnDxd » Thu Nov 22, 2007 10:50 am",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50697&sid=9ad766158ebe49a41b99a104ed1a31f0#p50697"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Recovery time for perimyocarditis?",
    "content": "Hello -  I'd just like to chime in here because I have some experience with a limited number of patients over the course of a good many years who have suffered pericarditis secondary to hypthyroidism due to Hashimoto's thyroiditis. I don't know the mechanism which accounts for it, but it definitely occurs in the literature and in the real world. Treatment,  so far as I know, involves anti-inflammatory medications.   I would concur with Dr. Lowe regarding the Lupus rule-in/out as well, to cover all the bases.   Hope this is helpful.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Wed Sep 03, 2008 12:09 am",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=59746&sid=9ad766158ebe49a41b99a104ed1a31f0#p59746"
  },
  {
    "author": "GKovacs1982  Guest Posts: 2 Joined: Wed Jan 02, 2008 3:45 pm",
    "title": "Slight pressure on my left side and around my heart",
    "content": "About two and a half months ago, I was diagnosed with pericarditis. I’ve got a steroid shot and antibiotics because my doctor suspected that it was because of an infection. I took my medication and the symptoms stopped in about four to five weeks.   I thought I’ll be fine, but about two weeks ago I started to feel pressure around my heart again. Although, this time it is slightly different. Sometimes I feel the exact same pressure-like pain around my heart when I had the pericarditis. Other times my armpit hurts (that’s the most common), or my left side, or my back (also left side). It’s like if the zone-of-pain was moving around my left side randomly (although it is not really a pain, more like a feeling of slight pressure).   Very seldom I also experience urge to cough and a slight pressure around my lunges, like if I had a cold, but I don’t have a fever or anything else that would indicate a cold or influenza.   Oh, I also have GERD Reflux disease. I‘ve got diagnosed with it this past summer.  I’m terrified that it’s something serious…\n\n",
    "posted_time": "Post  by GKovacs1982 » Sat Jan 05, 2008 11:21 pm",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=52793&sid=9ad766158ebe49a41b99a104ed1a31f0#p52793"
  },
  {
    "author": "Dr. A. Madia  Medical Doctor Posts: 207 Joined: Fri Jan 06, 2006 6:50 am Gender: Male Location: India",
    "title": "Re: Slight pressure on my left side and around my heart",
    "content": "Hi,  The most common reason for a pericarditis is viral infection. Since pericardium is a crucial membrane, fibrosis of which will lead to difficulty in heart pumping-a serious disease- your doctor rightly gave you steroids to prevent this dire consequence.  Now you have a migratory nature of pain which is not a characteris tic of pericadial pain at all.  On the other hand, GERD can cause chest pain referred to several different areas of the chest.  Even then I would request you to get in touch with your cardiologist again and undergo whatever tests she advises. But do not get anxious.    Apurva\n\n",
    "posted_time": "Post  by Dr. A. Madia » Thu Mar 13, 2008 8:39 am",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=55841&sid=9ad766158ebe49a41b99a104ed1a31f0#p55841"
  },
  {
    "author": "doclem  Guest Posts: 4 Joined: Sat Apr 21, 2007 9:49 am",
    "title": "myocarditis/pericarditis",
    "content": "I'm a 28 y/o F ED physician. No previous medical hx or surgery. Nonsmoker, nondrinker.  Fhx of A fib. CMeds:Lopressor 25 bid, Naprosyn 220 bid.    Admitted for 5 days with positional dyspnea/ CP/ tachycardia.  Onset about 4 days after a fever, sore throat and myalgias.  I went up a set of steps and my HR was in 160's, and I was SOB for about 30 mins, went to ED about 3 hrs later.       Initial EKG-sinus tach with diffuse ST elevation and PR depression, my sed rate was 85.  Isos, CBC, BMP, and CXR  negative. D Dimer elevated-  CT angio was negative-although much exacerbated my dyspnea- ED attg was worried he would have to intubate me.   Admitted to my hospital with pericarditis-started on Toradol and decadron, echo ordered.  Had  rigors and extreme dyspnea on exertion with 5 steps to rest room, tachycardic into 170's when walked about 10 feet, no desat.  echo negative. Pulm, Cards, ID consulted.  Told I had myocarditis-stay in bed, no NSAIDS.  Now 5 weeks later-was still having DOE/CP/sinus tachy into 150's with minimal exertion, and my ESR was back up to 40 (negative autoimmune w/u and TSH ok)- so had a right and left heart cath last week which were negative, ef 65%, and actually was admitted overnight for anesthesia complications. started on Lopressor and Naprosyn.      Exhausted and still not back to work- I'm getting frustrated because I actually LOVE my job.    Cardiology thinks this may be Inappropriate Sinus Tachycardia, and has referred me to see EP.    My questions- 1) do you think the initial diagnosis was correct                        2) Should I be resting or trying to exercise- I can only stand for a few minutes at a time.                       3) Is this actually IST or am I still recovering from this illness. (No previous problems with tachycardia. Working out a few days before this all happened)                     4) Is the Beta blocker a good choice with the fatigue, or should I simply let the tachycardia go for now as a physiologic problem?                      4) Is there anything else I could/should be doing to improve more rapidly?  Thanks so much for your expertise.\n\n",
    "posted_time": "Post  by doclem » Sat Apr 21, 2007 10:25 am",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=41127&sid=9ad766158ebe49a41b99a104ed1a31f0#p41127"
  },
  {
    "author": "Marceline F, RN  Nurse Posts: 229 Joined: Wed Feb 28, 2007 1:54 am",
    "title": "[no title]",
    "content": "Dear Doclem, It is good you have the training to consider all kinds of contributive factors to your tachycardia.  I will always hesitate to second guess a first diagnosis - simply because of not being there and having the luxury of seeing the test results for myself, or have the privilege of discussing the clinical picture with your treating physicians. I understand you have already investigated thyroid values, have you also tested for pheochromocytoma? If all the other metabolic conditions that can mimic a cardiologic problem have been ruled out, it does seem possible that your cardiologist may be on track to suggest you may have IST (inappropirate sinus tachycardia).  You fit the profile for age and gender, and describe the symptoms to a T.      At the same time - you mention a family history of AF (atrial fibrillation), and it may be of value to consider a couple other possibilities. I would be interested in knowing if you have a sinus generated tachycardia or a PSVT/PAT. (Paroxysmal supraventricular tachycardia/ paroxysmal atrial tachycardia.)  Has your cardio suggested a Holter monitor?  This way you can record the time of day for different levels of activity, and match it with the corresponding heart rhythm and heart rate.   I do believe EPS studies would also be helpful in determining the true rhythm, since the treatment for similar dysrhythmias such as AVNRT (A-V nodal reentry tachycardia - also a possibility for your gender and age) or WPW (probably less likely for you) is dependent on the cause. If the problem turns out to be IST, then ablation may or may not be the best treatment - since documentation exists that there is the possibility of the IST returning later even if initially apparently resolved by ablation. Some of the other SVTs may be best treated by ablation.  I believe EPS studies would be an appropriate diagnostic tool to help distinguish the root of the tachycardia so that you and your cardiologist can plan a treatment plan.       Beta Blocker therapy is an acceptable drug for IST.  If we consider IST one of the dysautonomias, there are other medical treatment options that may help.  And some studies indicate that sometimes, the problem self resolves.     Unfortunately, since IST sufferers are uniquely sensitive to adrenaline, it would probably be in your best interest to curtail adrenaline producing activities, which in your case includes your work, at least until you have a better idea what is indeed the cause for your tachycardia.  You may wish to research also through your colleagues into the current treatment options in the top cardiac centers of the nation, prior to having any interventional/non reversable treatments done, unless it becomes emergent.\n\n",
    "posted_time": "Post  by Marceline F, RN » Mon Apr 23, 2007 1:55 am",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=41240&sid=9ad766158ebe49a41b99a104ed1a31f0#p41240"
  },
  {
    "author": "doclem  Guest Posts: 4 Joined: Sat Apr 21, 2007 9:49 am",
    "title": "Myocarditis/pericarditis",
    "content": "Thanks for the reply.  I had a holter which showed a sinus tachycardia up to 170's with walking in the halls, and not my normal activity.  At that time I was still having CP/SOB which are now gone after starting naprosyn.  From my research, I cannot find a connection between an apparent viral pericarditis/myocarditis and resultant long-term tachycardia.  It seems unusual to me to have this onset after an acute event.  Most of the IST literature seems to point to a chronic problem without an acute onset.  Would EPS still be appropriate in this setting? Obviously, I'm not interested in any ablation at this time.  I'm also getting off the metoprolol as it has been increasing my fatigue, and also caused hypotension.  Thanks so much and have a great day.\n\n",
    "posted_time": "Post  by doclem » Mon Apr 23, 2007 8:52 am",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=41248&sid=9ad766158ebe49a41b99a104ed1a31f0#p41248"
  },
  {
    "author": "Marceline F, RN  Nurse Posts: 229 Joined: Wed Feb 28, 2007 1:54 am",
    "title": "[no title]",
    "content": "Dear Doclem, I agree that it is not typical for IST to be an acute onset. However, the literature identifies an \"average\" patient, aluding to the possiblity of a non-average onset, as well. Therefore, it is theoretically possible for an dysautonomia to fall outside an \"average\" profile.  I still think it best to identify the nature and source of the SVT, especially since you also mentioned P wave abnormalities.  EP studies without intervention planned may still be the best way to identify the \"mis-firing\" culprit, and determine the source of the dysrhythmia. Absolutely! on the Lopressor - if you are experiencing an untoward reaction to the meds, such as hypotension, then stopping it is in your better interest.  I also agree with your choice to weigh other especially non-invasive options before choosing ablation.  Again, you may wish to pick the brains of some of the leading cardiologists in the major teaching hospitals for the latest in diagnostics and treatments. I respect you and your efforts to provide quality medical care for our needful people. I wish you the best in your research,. and trust for an excellent outcome.\n\n",
    "posted_time": "Post  by Marceline F, RN » Mon Apr 23, 2007 11:53 pm",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=41303&sid=9ad766158ebe49a41b99a104ed1a31f0#p41303"
  },
  {
    "author": "doclem  Guest Posts: 4 Joined: Sat Apr 21, 2007 9:49 am",
    "title": "myocarditis/pericarditis",
    "content": "Thanks so much for the help.     I saw EP today- he believes this is all related to the viral myo/pericarditis.  He thinks this is a temporary dyautonomia similar to POTS.  He started me on florinef, and if not better in a week will try midodrine as well.  No EPS at this point. He seemed very confident in the diagnosis.  Thinks I may be feeling well enough to work next week.  Thanks so much for the help. God bless.  doclem\n\n",
    "posted_time": "Post  by doclem » Wed Apr 25, 2007 1:26 pm",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=41415&sid=9ad766158ebe49a41b99a104ed1a31f0#p41415"
  },
  {
    "author": "Marceline F, RN  Nurse Posts: 229 Joined: Wed Feb 28, 2007 1:54 am",
    "title": "[no title]",
    "content": "Dear Doclem, Glad to hear of the encouraging feedback from EP.    Please remember that one of the expected side effects of those particular meds is to raise blood pressure - so please don't be alarmed at the occurrence.  Wonderful that this will be temporary!  God's blessings to you as well.\n\n",
    "posted_time": "Post  by Marceline F, RN » Wed Apr 25, 2007 2:07 pm",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=41421&sid=9ad766158ebe49a41b99a104ed1a31f0#p41421"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "[no title]",
    "content": "Hello doclem - While I think Marceline has covered most of your concerns remarkably thoroughly and well, I just wanted to append one little thought (coming from the critical care end of my experience), which is this: there is a phenomenon which sometimes occurs as a feature of recovery from AMI, myocarditis, etc., which could be considered \"temporary dysautonomia\": reflex tachycardia. This is compensatory action run amok, and while it usually resolves on its own over time it can be accompanied by (or perhaps even cause) significant fatiguability and an annoying awareness of one's heart beating. It also has, because of the triggering event, an acute onset, then simply doesn't correct as one would expect. This is especially notable in cases of myocarditis, which somewhat mimics the \"stunned myocardium\" phenomenon sometimes seen in AMI and cardiac trauma. Usually treated with beta blockers, although this seems to have worked against the cause in your case (by increasing your feelings of fatigue). I've also seen it treated with digitalis, although that seems to have fallen out of favor because of the potential for more serious side effects.   Hopefully you are soon feeling like yourself again. Do keep us updated.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Thu Apr 26, 2007 11:43 am",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=41473&sid=9ad766158ebe49a41b99a104ed1a31f0#p41473"
  },
  {
    "author": "doclem  Guest Posts: 4 Joined: Sat Apr 21, 2007 9:49 am",
    "title": "myo/pericarditis",
    "content": "Thanks so much for the input, it has been incredibly useful.   I hope to be back at work soon, and will update if any new developments.  Thanks again for the words of wisdom. doclem\n\n",
    "posted_time": "Post  by doclem » Thu Apr 26, 2007 6:59 pm",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=41498&sid=9ad766158ebe49a41b99a104ed1a31f0#p41498"
  },
  {
    "author": "Miphuno  Guest Posts: 1 Joined: Sun Jan 14, 2007 10:52 am Location: New York  Contact:   Contact Miphuno       AOL",
    "title": "chest pain on left side - 4th day in a row!",
    "content": "Hi, I am a 28 year old female. I haven't previously had any problems similar to this: On Wednesday evening I suddenly got a pretty sharp pain in my chest, around the heart area. It stays in the front mostly, though sometimes I can feel it a bit lower toward the bottom of the ribcage, and around the side as well.  I was outside at the time, and it was cold, it seemed to hurt more when I was breathing the cold air, and ease when I went inside. Also, it felt worse when I had to walk. The pain has gotten a lot less sharp since then ( it's also been warmer out) - but it is still definitely there. I seem to be able to feel my heart beating more too.  Don't know if this is relevant, but I recently had bronchitis.  Other than this, I don't have any other symptoms.   What are the possibilities and should I seek urgent med. help???  Thank you!\n\n",
    "posted_time": "Post  by Miphuno » Sun Jan 14, 2007 11:04 am",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=37645&sid=9ad766158ebe49a41b99a104ed1a31f0#p37645"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi Miphuno, The description of your symptoms most indicates a likely correlation to your recent episode of bronchitis. A condition for example, pleurisy (inflammation of the tissue of the lungs) may cause varying degrees of chest pain which usually worsen during inspiration. NSAID's typically reduces pain. Providing there are no contraindications to taking this type of medication it should also only be taken with food. .A physician's evaluation would be recommended to identify the causative factor of your symptoms. Best wishes! Sincerely, Theresa Jones, RN\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Tue Jan 16, 2007 5:45 am",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=37681&sid=9ad766158ebe49a41b99a104ed1a31f0#p37681"
  },
  {
    "author": "Hackettsue  Guest Posts: 4 Joined: Thu May 20, 2004 9:38 am Location: Alexandria, VA",
    "title": "Is Pericardial Tamponade a Possibility?",
    "content": "I posted a question back in May 2004 regarding my 79 year old mother's sudden death from pericarditis.  I have since obtained some additional information that I would like to ask a question about.   The pericardial effusion detected in the autopsy was 100cc (which I thought was not enough to cause tamponade).  However, it has been pointed out to me that:   (1) since the autopsy was done 3 days after her death, all of the pericardial effusion that was there at the time of death may not have been visible by the time the autopsy was actually done, and (2) that since my mother had a markedly enlarged heart as evidenced on the chest x-ray she had taken the day before her death,  then a 100cc pericardial effusion could have caused tamponade in her case whereas in a person with a normal size heart,  100cc would not be enough to cause it.   Is it possible in her particular case that she did indeed develop pericardial tamponade?\n\n",
    "posted_time": "Post  by Hackettsue » Tue Mar 28, 2006 12:02 pm",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=32222&sid=9ad766158ebe49a41b99a104ed1a31f0#p32222"
  },
  {
    "author": "Dr. A. De la Guerra  Medical Doctor Posts: 70 Joined: Fri Aug 26, 2005 8:00 pm Gender: Male Location: Lima, Peru  Contact:   Contact Dr. A. De la Guerra       Yahoo Messenger",
    "title": "[no title]",
    "content": "Hi Hackettsue,  I read your previous posts and agree with Dr. Fouad. All heart diseases can lead to sudden cardiac death. Basically, the heart abruptly stops beating due to arrhythmia. The most common causes are coronary heart disease (80-90%) and cardiomyopathies. Unfortunately, sudden death is often the first sign of cardiomyopathy. Current studies demonstrate that sudden cardiac death due to hypertrophic cardiomyopathy is more frequent in older patients than supposed. Such patients may have previously diagnosed heart conditions or not; a common associated disease is hypertension.  Concerning your doubts about the necropsy report, on your first question, the pericardium normally contains 15 to 50cc of fluid. Upon death, enzymes initiate cell decomposition, and 48 hrs later tissues begin to turn into liquids. Also, when the heart stops pumping, fluid builds up in other parts of the body. Although it might be possible that all the effusion may not have been visible (depends on preservation, death cause, etc.), it’s more likely to find extra fluid inside body compartments than fewer with the course of time.  On your second question, the quantity of pericardial fluid needed to cause a   cardiac tamponade depends on how fast fluid builds up and on the pericardium compliancy. When accumulation is fast, 150cc could be enough, but it should raise pressure quickly. Non-traumatic situations in which fatal cardiac tamponed might occur by this means is uncommon, and usually are preceded by severe symptoms. Also, when ventricular hypertrophy is present, ventricle is harder to be shrunken by pericardial fluid. In sum, a cardiac tamponade is possible, but rare. Once more I have to agree with Dr. Fouad, I think that the effusion occurred after the heart stopped.  Hope you find this information useful.  Sincerely,  Dr. Alberto de la Guerra.\n\n",
    "posted_time": "Post  by Dr. A. De la Guerra » Fri May 05, 2006 11:29 pm",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=32575&sid=9ad766158ebe49a41b99a104ed1a31f0#p32575"
  },
  {
    "author": "DLo  Guest Posts: 3 Joined: Tue Jun 21, 2005 10:00 pm Location: Washington",
    "title": "It's my Dad- and I am worried",
    "content": "I am not sure what to expect here.  He told me he has peri... and know is getting a per...my... Anyhow.. He is getting it done at the VA here, and am not sure what to expect.  Some said his chances were only 50/50 of making it, that can't be right... Right? any info would be great.\n\n",
    "posted_time": "Post  by DLo » Tue Jun 21, 2005 10:05 pm",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=15571&sid=9ad766158ebe49a41b99a104ed1a31f0#p15571"
  },
  {
    "author": "Kim C, RN  Nurse Posts: 39 Joined: Fri Jun 17, 2005 7:36 pm Location: New Orleans, Louisiana",
    "title": "[no title]",
    "content": "Are you referring to a pericardial window? If you could find out the name of the procedure/surgery, that would be helpful. I can't give you any info without knowing what is being done!  I'll look for your response.\n\n",
    "posted_time": "Post  by Kim C, RN » Thu Jun 23, 2005 5:14 pm",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=15699&sid=9ad766158ebe49a41b99a104ed1a31f0#p15699"
  },
  {
    "author": "DLo  Guest Posts: 3 Joined: Tue Jun 21, 2005 10:00 pm Location: Washington",
    "title": "[no title]",
    "content": "he has constrictive pericardium- where the pericardium fills with fluid (water?) then hardens... they are going to open him up and cut it out- One doctor said he had a 50/50 chance of making it, but the surgeon said it was more like 70% chance. I still am not sure what the procedure is called, but that is it in a nut shell.\n\n",
    "posted_time": "Post  by DLo » Fri Jun 24, 2005 10:13 am",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=15755&sid=9ad766158ebe49a41b99a104ed1a31f0#p15755"
  },
  {
    "author": "Kim C, RN  Nurse Posts: 39 Joined: Fri Jun 17, 2005 7:36 pm Location: New Orleans, Louisiana",
    "title": "[no title]",
    "content": "The term you're looking for is \"pericardiectomy.\" Basically, the sac that is around your father's heart has constricted for some reason, and this means that the heart has less room to beat in. This can cause blood to back up behind the heart, and thus can cause heart failure. The term refers to the partial, or full, removal of that sac.  The procedure is done in one of two ways. An opening will be made either through the sternum (breastbone), which is called a sternotomy, or made through the ribs on the left side, which is called a thoracotomy. The surgeon decides which appraoch is required based on anatomy and the area that he needs to access to operate. Sometimes a heart-lung bypass machine is needed during the open-sternum procedure. This is on a case by case basis, and is dependent on different factors.  After surgery, the surgeon will have a few minutes to speak to you about how things went, and this will be an opportunity to ask questions. Your father will more than likely be in an ICU immediately following surgery. The nurses will be a major source of information for you as well.  I want to mention that, while you won't be able to stop yourself from worrying, your father is going to need your assistance in the days and weeks following surgery, and it does no good if you're exhausted and run down from eating poorly and not resting. So take care of yourself!   Good luck, and if you have any further questions, please feel free to post again.\n\n",
    "posted_time": "Post  by Kim C, RN » Fri Jun 24, 2005 10:21 pm",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=15781&sid=9ad766158ebe49a41b99a104ed1a31f0#p15781"
  },
  {
    "author": "DLo  Guest Posts: 3 Joined: Tue Jun 21, 2005 10:00 pm Location: Washington",
    "title": "Thank you!",
    "content": "Thank you so much for the answers.  He is getting the procedure done at the local VA here, and I can't seem to get anything out of them, although they are all so friendly,it's hard to get upset at them.   I do appreciate the answers.   From what I understand they will be doing the sternotomy.  Again, a little freaked out about that, but I am sure they know what they are doing, and I have confidence in them, but we are still talking about my dad here.... So, again, thank you!\n\n",
    "posted_time": "Post  by DLo » Sat Jun 25, 2005 10:45 am",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=15813&sid=9ad766158ebe49a41b99a104ed1a31f0#p15813"
  },
  {
    "author": "Barbara  Guest Posts: 1 Joined: Fri Dec 31, 2004 2:05 pm Location: Tennessee",
    "title": "Pericardial window and pericardial effusion",
    "content": "I have had a very large effusion. I first had to have it drained, almost a liter of fluid removed.  It came back just as bad within a month, so next they put in a window.  They ran tests on the fluid and the piece they removed for the window, but could not determine a cause of the fluid except for inflamation.  The window closed in about six weeks, and the fluid built back up quickly.  I was weak and out of breath.  I had read about a small study done in Isr.  using colchicine and I begged my doctor to try it before he removed the bottom of the sack around my heart.  He did not want to \"bother\" with it, but the doctor that was to do the surgery agreed to try it and said he had read about it too.  Within a week I felt better.  I changed heart doctors and my new doctor agreed to keep me on colchicine even though he  had not treated any effusions with it.  I have not had any bad side effects and I feel like I've been given my life back!  Over the last 7 or 8 months the effusion has gone from large to med. to small!  I am a single parent with a child with health problems, and I was terrified of loosing more work, and even my job.  Colchicine has been a true blessing for me.  Even if I eventually have to have the major surgery, and have the bottom of the sack removed, this has given me time to start catching up on bills, and take care of my daughter.\n\n",
    "posted_time": "Post  by Barbara » Fri Dec 31, 2004 2:21 pm",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=7562&sid=9ad766158ebe49a41b99a104ed1a31f0#p7562"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Pericardial effusion",
    "content": "Dear Barbara,  Thank you very much for sharing your experience.  Colchicine has a strong anti-inflammatory effect. Its exact mechanism is unknown but it inhibits the inflammatory response tremendously. It has been used for quite a while in treatment of an uncommon disease called familial mediterranean fever which is inflammation of the membranes surroundings the organs in the abdomen, the lungs and the heart and it has been used for a long time in the treatment of chronic gout as well.  It was investigated by the Danes as early as 1992 in the treatment of chronic pericardial effusion.  Medical professionsals do not always try to find new medications but try to find new indications for old drugs as well.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.  Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Sat Jan 01, 2005 10:51 am",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=7593&sid=9ad766158ebe49a41b99a104ed1a31f0#p7593"
  },
  {
    "author": "DickP  Guest Posts: 2 Joined: Fri Sep 17, 2004 3:29 pm Location: Ohio",
    "title": "Pericardial effusion",
    "content": "i was diagnosed with pericardial effusion on 8-19-2004. my cardiologist has me on diuretics, a low sodium diet and gave me a week's worth of medrol. the followup is serial echocardiogram. my most recent echo shows that the effusion is still present a month later. my question is are there any other treatments and if i have to have pericardiocentesis, what length of recovery time is associated with it? also, is there anything i can do to help my situation? in conclusion, any other information you could provide would be appreciated, thank you, DickP[/b]\n\n",
    "posted_time": "Post  by DickP » Fri Sep 17, 2004 3:37 pm",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5401&sid=9ad766158ebe49a41b99a104ed1a31f0#p5401"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Pericardial effusion",
    "content": "Dear Dick,  What did your cardiologist think the effusion was due to? How big was the effusion on the echo? What investigations, if any, were done to search for the cause of the effusion? What initiated the work-up that lead to the diagnosis of the effusion?  Pericardiocentesis is a considered a minor procedure, you can be out of the hospital the same day or the next day at the most if every thing goes well.  The main serious complication of pericardial effusion is cardiac tamponade which is related to the rate of accumulation of the fluid rather that its amount. In cardiac tamponade, the heart is squeezed by the fluid and it can not function as a pump anymore. It can avoided and/or treated by a procedure called pericardial window where the pericardium (the sac surrounding the heart and that contains the fluid that can compress the heart is opened and connected to either the sac surrounding the lung or to the abdominal cavity.  The cause behind the effusion should be found if not already found.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Mon Sep 27, 2004 12:17 am",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5624&sid=9ad766158ebe49a41b99a104ed1a31f0#p5624"
  },
  {
    "author": "DickP  Guest Posts: 2 Joined: Fri Sep 17, 2004 3:29 pm Location: Ohio",
    "title": "[no title]",
    "content": "Thank you so much for your reply and i am sorry it took me so long in getting back to you. Finally last week my cardiologist performed the pericardiocentesis and drew off 900 cc of fluid. I stayed in the hospital overnight and an echocardiogram the next day confirmed that no more liquid had built up overnight.   I am hoping at my next appointment that he will have sent the fluid for testing so we can find out what caused the effusion. My only question now is how likely is it that this might happen again? I am still currently taking DiovanHCT 160 mg twice a day, lopressor 50mg.once a day and lasix 80 mg. once a day. Thank you for your help.\n\n",
    "posted_time": "Post  by DickP » Tue Oct 12, 2004 5:39 pm",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5843&sid=9ad766158ebe49a41b99a104ed1a31f0#p5843"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Pericardial effusion",
    "content": "Dear Dick,   The probability that this might happen again depends on its cause. Sending the fluid to be tested is a routine procedure. The results should not take that long.   i think that your doctor will do a follow up echocardiography in a period of time to make sure that there is no recurrence. On recurrence, i think that a pericaridial biopsy could be done.  If this happens once more, treatment then will be in the form of a procedure called a pericardial window where a connection between the pericardium and the sac surrounding the lung called pleura or somtimes with the abdominal cavity is created so that the fluid collects in the bigger sac whether around the lung or in the abdomen and does not compress the heart as previously discussed.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Wed Oct 13, 2004 9:11 pm",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5870&sid=9ad766158ebe49a41b99a104ed1a31f0#p5870"
  },
  {
    "author": "Hackettsue  Guest Posts: 4 Joined: Thu May 20, 2004 9:38 am Location: Alexandria, VA",
    "title": "Pericarditis and Sudden Cardiac Death",
    "content": "My mother was diagnosed with bronchitis without pneumonia (per chest x-ray) by her primary care physician.  She died 24 hours later at home from sudden cardiac death.  In her autopsy it was pointed out that she had a very severe pericarditis  (Pericardial effusion - 100 cc) with myocardial fibrosis and moderate hypertrophic cardiomyopathy (Bilateral pleural effusions - 200 cc each).  She had never been diagnosed with any of this.  How did the bronchitis turn into pericarditis and result in sudden cardiac death?  Also, would the pericardial effusion and bilateral pleural effusions not be visible on the chest x-ray?  Is it possible that a \"Rub\" would not have been detectable upon the primary care physician listening to her heart?  I am trying to figure out how the pericarditis got missed and how she wound up with a sudden cardiac death.  Any information would be much appreciated; I am at a complete loss for answers. Thank-You.  Susan Hackett\n\n",
    "posted_time": "Post  by Hackettsue » Thu May 20, 2004 2:25 pm",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3345&sid=9ad766158ebe49a41b99a104ed1a31f0#p3345"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Susan, Please accept my deapest condolences. Sudden death is always a medical dilemma. However, it appears that in your mother's case a possible theory is that she had a longstanding case of cardiomyopathy that lead to her sudden death. Please check our page on cardiomyopathy for more info:  Click here!  Hypertrophic cardiomyopathy in particular has been associated with arrhythmias leading to sudden death. A hypertrophic cardiomyopathy may have been missed by the x-ray. Again pleural effusions of more than 150-200 mL usually are apparent as blunting of the costophrenic angle on upright posteroanterior (PA) chest radiographs. So there is a chance that both the pericardial and pleural effusion get missed by the x-rays. Again the effusion may have happened only after the heart stopped due to congestive heart failure.  The main thing for you to do now, is to get back to your doctor and make sure you do not have hypertrophic cardiomyopathy yourself (If you read the article above you will find that 50% of cases are inherited via autosomal dominant trait).  This can easily be diagnosed in your case by echocardiogram.  Best regards.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Fri May 21, 2004 4:21 am",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3348&sid=9ad766158ebe49a41b99a104ed1a31f0#p3348"
  },
  {
    "author": "Hackettsue  Guest Posts: 4 Joined: Thu May 20, 2004 9:38 am Location: Alexandria, VA",
    "title": "[no title]",
    "content": "Dr. Fouad, Thank-you very much for your reply and your concern.  I did get an echocardiogram recently and thankfully, it did not show any signs of hypertrophic cardiomyopathy.   Regarding my mother, it appears that you are saying that the arrhythmia she had which caused her death came more from her longstanding cardiomyopathy rather than the pericarditis.  From all that I have read, this is very likely the case.  I wonder though, why it happened exactly when she was sick with bronchitis/pericarditis?  Is there a connection there? Also, I'm still confused as to how the bronchitis became pericarditis?   Again, thanks much for any answers you may have.   Susan Hackett\n\n",
    "posted_time": "Post  by Hackettsue » Fri May 21, 2004 9:23 am",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3349&sid=9ad766158ebe49a41b99a104ed1a31f0#p3349"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Susan, The bronchitis probably has nothing to do with it. It was concidental. The main reason for her death was probably a fatal arrhythmia. Whether her fever, cough, or nutritional status during the bronchitis attack contributed to the arrhythmia would only be speculation. In theory they all could but alone none of them would lead to much without her cardiomyopathy. Her pericarditis was either present for a very long time and missed by the x-ray or it was the result of her sudden death. I don't think it was related to her bronchitis attack.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Mon May 24, 2004 12:27 am",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3369&sid=9ad766158ebe49a41b99a104ed1a31f0#p3369"
  },
  {
    "author": "amsmith911  Guest Posts: 1 Joined: Wed Mar 31, 2004 3:26 am Location: usa",
    "title": "Alcohol and pericarditis?",
    "content": "my husband is 47y old with no medical problems.he went to the er with cheast pain in the begining of feburary  and was initally treated for mi.he was transfered to a heart hospital and after numerous,ekg,electro cardiagrams and angio cath he was diagnosed with pericarditis.he stayed in the hospital for 4 day for pain management and to watch him for effusion due to all the thronbolitics he recieved in er.he never had effusion.he came home on nasaids and 7 days later the pain came back badly.they then put him on prednisone.he has been off prednisone for three days.  he is an alcoholic.he drank very hevaily this weekend.he went to work monday and then tuesday morning he started having cheast pain again and inability to sleep.he took the nasaids and percocet for pain.he took quite a bit of the pain meds and he drank about 10 beers.if he isn't feeling better in the morning i am taking him back to the doctor one way or another.drunk or not.  what i want to know is if his alcoholism is contributing to the pericarditis recurring?he has not been honest with the doctor about how much he drinks.he doesn't want to stop drinking.but i need to know how this is efecting his condition.he drinks 3 beers monday through friday and 18-35 on the weekend!  sorry for the bad spelling.\n\n",
    "posted_time": "Post  by amsmith911 » Wed Mar 31, 2004 3:39 am",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2976&sid=9ad766158ebe49a41b99a104ed1a31f0#p2976"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Alcohol and pericarditis?",
    "content": "Dear amsmith,  It is sometimes difficult to differentiate between how the electrocardiograms of pericarditis and myocardial infarction look like.  At any rate, alcohol is very well known to cause heart muscle damage and heart failure, but, to my knowledge, i never heard of any relationship between alcohol and pericarditis.  It is a good thing of course to try and convince your husband to quit drinking because alcohol has its very well known health risks affecting the liver, stomach, nerves, brain, heart and many other organs.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Wed Mar 31, 2004 3:49 pm",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2979&sid=9ad766158ebe49a41b99a104ed1a31f0#p2979"
  },
  {
    "author": "ben530  Guest Posts: 1 Joined: Tue Feb 11, 2003 3:22 pm",
    "title": "Pneumopericardium",
    "content": "When my baby was born 5-02 he was not breathing from cord around the neck twice and tight.  He was put on a vent. They discovered that night that he had air around his heart.  After watching him in NICU for a week we took him home.  After about a month he seen a caridologist who did ultrasound and whatever else they call it.  She said everything looked normal now.  My question is can this ever come back, should he be restricted from anything.  No one ever said anything other than he looked fine now.  He is almost 9 months old now and seems fine.  I just scared for him.  Can you give me any information. Pam, Charleston, WV\n\n",
    "posted_time": "Post  by ben530 » Tue Feb 11, 2003 3:28 pm",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=334&sid=9ad766158ebe49a41b99a104ed1a31f0#p334"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Pneumopericardium",
    "content": "Dear Pam,  Pneumopericardium is a rare condition and it is usually caused by leakage of air from lung and this air collects around the heart. It could be caused by very high pressures in the lung caused by ventilator leading to rupture of some of his tiny air sacs in the lungs.  Since pneumopericardium occured in the context of such a clinical situation i would assume that this was the cause and since your son has never had any problems afterwards, recurrence sounds very rare to me.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped and if you still have any concerns or questions, do not hesitate to post them.  Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Thu Feb 13, 2003 8:48 pm",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=349&sid=9ad766158ebe49a41b99a104ed1a31f0#p349"
  },
  {
    "author": "John",
    "title": "Pericarditis as a teenager - recurrent later in life?",
    "content": "Is it possible that having pericarditis as a teenager can lead to recurring symptoms later on in life?\n\n",
    "posted_time": "Post  by John » Sat Dec 28, 2002 6:27 am",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=68&sid=9ad766158ebe49a41b99a104ed1a31f0#p68"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Pericarditis",
    "content": "Dear John,   Thank you very much for using our website.   Yes, you can have recurring pericarditis.   And this could be actually complicated sometimes so that you will complain of other symptoms of pericarditis complications.   However these are not really so common.   Once more thank you very much for using our website http://doctorslounge.com   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Sun Feb 09, 2003 9:35 pm",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=298&sid=9ad766158ebe49a41b99a104ed1a31f0#p298"
  },
  {
    "author": "John",
    "title": "Pericarditis",
    "content": "Thanks.   I'm 27 now.  I had Pericarditis when I was about 17 or 18. The doctor told me that I had a rather severe case (as pericarditis goes) and that apparently there was some scarring.  It is whenever I get deep aches around my chest and down my left arm (rare - about two or three times a year on average) that I tend to think that it might be reccuring affects from pericarditis.  I do sometimes worry though, but it is good to know now that pericarditis is a possibility.  I wouldn't like to think that it could be something more serious for a guy of my age.\n\n",
    "posted_time": "Post  by John » Sun Feb 09, 2003 9:36 pm",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=299&sid=9ad766158ebe49a41b99a104ed1a31f0#p299"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Recurring pericarditis",
    "content": "Dear John,   Thank you very much for the update.   Was a cause for your pericarditis ever found? Or was it of the idiopathic type?   And are you being treated for any other diseases?   About the pain that you have in your chest referred to the left arm it can be from pericarditis but does it occur on exertion? how long does it last? any thing you do to make go away? do you smoke? any body in the family have coronary disease? Have you ever told your doctor about this chest pain and if yes was this pain ever evaluated?   Waiting for your reply.   Thank you very much for using our website http://doctorslounge.com   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Sun Feb 09, 2003 9:37 pm",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=300&sid=9ad766158ebe49a41b99a104ed1a31f0#p300"
  },
  {
    "author": "John",
    "title": "Pericarditis",
    "content": "I was never given a full explanation of why I got pericarditis, but was told that it could have been an elergic reaction to something, cat fur perhaps (I have cats) or even from stress or worry.  The aches I get don't seem to be triggered by excersise of any kind as I often visit the gym. I never drink or smoke - never have - and none of my family have had problems before.  The aches last for about a day, but aren't bad enough to disturb my daily routine, and as I said before, the aches aren't frequent.\n\n",
    "posted_time": "Post  by John » Sun Feb 09, 2003 9:38 pm",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=301&sid=9ad766158ebe49a41b99a104ed1a31f0#p301"
  },
  {
    "author": "John",
    "title": "Pericarditis",
    "content": "....Oh, I don't attempt to tread the aches as they do go away and I haven't mentioned them to a doctor.  I do have treatment for asthma - Inhalers - and am also prone to eczema and allergies (hay-fever, animal fur).   Thanks, John.\n\n",
    "posted_time": "Post  by John » Sun Feb 09, 2003 9:39 pm",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=302&sid=9ad766158ebe49a41b99a104ed1a31f0#p302"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Pericarditis",
    "content": "Dear John,   Thanks for your reply.   It looks from what you said that this chest pain is not because of coronary disease.   Good luck with your health and thank you very much for using our website http://doctorslounge.com   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Sun Feb 09, 2003 9:40 pm",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=303&sid=9ad766158ebe49a41b99a104ed1a31f0#p303"
  },
  {
    "author": "John",
    "title": "Thanks",
    "content": "Thank You\n\n",
    "posted_time": "Post  by John » Sun Feb 09, 2003 9:41 pm",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=304&sid=9ad766158ebe49a41b99a104ed1a31f0#p304"
  },
  {
    "author": "dr.agic  Guest Posts: 1 Joined: Fri Jan 31, 2003 7:33 pm",
    "title": "Post pericardiectomy syndrome - fever, hydrothorax",
    "content": "I am specialist for pulmonary diseases in Bosnia Herzegovina. Five weeks ago I have had heart operation with three bypass with no previous MI. I felt very well after the operation. Four days after I got high temperature (max.37.8) and felt bad in general. Doctors thought that I got postpericardiectomy syndrome and gave me indomethacine (3 times 25mg per day). X-ray showed smaller hydrothorax on my lungs and bigger cardiac shadow.  Ten days after hydropericardium 300 ccm was seen. The doctors increased indomethacin doses on 4 times 50 mg per day, but higher temperature (37.2) kept going.  One week after this I started to take prednisolone 40mg daily and stopped to take indomethacin. Concerning that the temperature did not decrease I took prednizolon 60mg for one week and felt much better. That doses changed to 55mg in the following seven days. On the fifth day of this therapy I got tachycardia 150 which is atrium tachicardia with block 2:1. Due to this problem I was given medicine amiodaron and beta-blocker. Cardiologist thought that tachicardia was caused by prednizolon and interrupted to give me prednizolon in two days. Instead indomethacin was given to me again (3 times 25mg). Three days after my temperature increased to 37.9.  Could you please suggest on what the best treatment for my disease would be?\n\n",
    "posted_time": "Post  by dr.agic » Fri Jan 31, 2003 7:35 pm",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=192&sid=9ad766158ebe49a41b99a104ed1a31f0#p192"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Pericardiectomy",
    "content": "Dear Dr. Agic,   Sorry for being late and thank you very much for choosing our web site.   What you are suffering from might be known as postpericardiotomy syndrome.   This is a syndrome of chest pain, fever, pleurisy, pericardial rub, evidence of pleural effusion or pericardial effusion, leukocytosis and high ESR.   It is thought to be auto-immune in nature as anti-heart antibodies are found in some patients.   Mangement of this syndrome is mostly conservative by giving aspirin or NSAIDs, this must be continued for ten days. Steroids are reserved to patients whom their symptoms do not respond to treatment. In addition to this, large pericardial or pleural effusions should be drained if not responsive to treatment with steroids. Unfortunately, this disease can recur. Complications of this disease include adhesions and may be constriction.   Regarding your case and the tachycardia that occured to you, I would favour that this caused by pericarditis itself and it is very common after surgery.  How to treat it ? The drug regimen that you received is reasonable. I do not know whether you have hypertension or not but a beta blocker or a calcium channel blocker in case of hypertension and arrhythmia are very good choices. Amiodarone is a broad spectrum antiarrhythmic that can be used in many types of arrhythmia. How long would you stay on the medications is a debatable issue between physicians and some favour for life and some favour temporarily.   I hope that i answered your questions and please feel free to post any further concerns.   Once more thank you very much for your vote of confidence and good luck.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Thu Feb 06, 2003 8:14 am",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=245&sid=9ad766158ebe49a41b99a104ed1a31f0#p245"
  },
  {
    "author": "sue  Guest Posts: 2 Joined: Fri Jan 31, 2003 7:41 pm",
    "title": "Pericardiectomy specialists",
    "content": "My husband has been diagnosed with constrictive Pericarditis and needs to have a Pericardiectomy. Everything I read is stating that this is a highly dangerous procedure. I'd like to know where I can get a list of Doctors who perform this procedure on a regular basis, or the best place to go.   Thank you\n\n",
    "posted_time": "Post  by sue » Fri Jan 31, 2003 7:43 pm",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=195&sid=9ad766158ebe49a41b99a104ed1a31f0#p195"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Pericardiectomy specialits",
    "content": "Dear Sue,  This is a web link that mentions the top hospitals in the united states (if you are living in the states) in the speciality of cardiology and heart surgery  Click here!  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Wed Feb 05, 2003 10:13 pm",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=232&sid=9ad766158ebe49a41b99a104ed1a31f0#p232"
  },
  {
    "author": "ron  Guest Posts: 1 Joined: Fri Jan 31, 2003 7:49 pm",
    "title": "Pericardial effusion - anyone else have this - contact me!",
    "content": "Has any one evry had Pericardial Effusion? That's a sack of water that forms around the heart. I have read that mostly cancer patients get Pericardial Effusion. Is there any one that has ever had this and if so what was the cause? Please email to: ron99@postnet.com   Thanks for your time.  Thanks Again, Ron\n\n",
    "posted_time": "Post  by ron » Fri Jan 31, 2003 7:50 pm",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=196&sid=9ad766158ebe49a41b99a104ed1a31f0#p196"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Pericardial effusion",
    "content": "Dear Ron,   i did not fully understand your question about pericardial effusion.   Pericardial effusion is a common condition and it occurs to lots of people for several reasons. i have seen in quite a few patients.   Thank you very much for using our website http://doctorslounge.com and if you still have any questions, please, do not hesitate to post them.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Wed Feb 05, 2003 9:52 pm",
    "category": "Cardiology",
    "sub_category": "Pericardial Diseases",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=231&sid=9ad766158ebe49a41b99a104ed1a31f0#p231"
  }
]