[
  {
    "author": "rnaryn  Guest Posts: 2 Joined: Fri Jul 23, 2010 12:18 pm Gender: Female",
    "title": "rain increase chances of pneumonia?",
    "content": "I know that rain doesn't cause pneumonia. I'm merely wondering if spending hours out in the cold rain will lower your immune system and increases your chances of developing pneumonia?\n\n",
    "posted_time": "Post  by rnaryn » Sat Jul 24, 2010 2:37 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=98460&sid=7525041e432efc9bb18e1f5a6344449f#p98460"
  },
  {
    "author": "Dr.M.jagesh kamath  Medical Doctor Posts: 1303 Joined: Mon Aug 03, 2009 7:24 am Gender: Male",
    "title": "Re: rain increase chances of pneumonia?",
    "content": "Hello,There seems to be a correlation between meteorological features and pneumonia.The lesser the temperature more common is the incidence of pneumonia.Relative humidity and precipitation are the other factors.Age,air pollution,immune status are the other factors.Relating to legionella pneumonia rainfall acutely increases the microbial contamination.Also changes in temperature if it is favorable to the vectors of a disease transmission becomes more. The increase humidity meaning more dusts and continuous heavy rain had led to sickness such as influenza and pneumonia. Best wishes.\n\n",
    "posted_time": "Post  by Dr.M.jagesh kamath » Sun Sep 12, 2010 3:00 am",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=102193&sid=7525041e432efc9bb18e1f5a6344449f#p102193"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: rain increase chances of pneumonia?",
    "content": "Hi, In many tropical countries, incidence of common cold and infuenza increases during the rainy seasons.  Weber MW, Mulholland KE, Greenwood BM. Respiratory syncytial virus infection in tropical and developing countries. Trop Med Int Health 1998; 3: 268-80 doi: 10.1046/j.1365-3156.1998.  The Northeastern, Southern, Midwestern, and Western regions of the US show large summer-to-winter increases in the incidence of influenza and viral pneumonia.The incidence of pneumonia during cold months in the Philippines (January-February) has been seen to increase. Incidence of malaria shows increases during periods of high temperature and heavy rainfall.  In some developing countries, the average body weight of the population shows a decrease during the rainy seasons. Marti J. Van Liere, Eric-Alain D. Ategbo, Jan Hoorweg, Adel P. Den Hartog, and Joseph G. A. J. Hautvast. The significance of socio-economic characteristics for adult seasonal body-weight fluctuations: a study in north-western Benin. British Journal of Nutrition: Cambridge University Press, 1994.  Whether this may decrease the immunity in the affected population is open to speculation.  Coccidioidis immitis pneumonia may develop following exposure to rain storms in southwestern united states.The incidence of legionellosis appears to increase during wet weather, suggesting that clinicians and public health officials need to be on the lookout for signs of the infection and possible methods for reducing environmental exposures during the rainy season.  \"don't get wet, or you may catch a cold (or, a pneumonia)\" has been a common saying in many cultures. It is beyond doubt that certain infections (including pneumonias) increase during rainy seasons in the tropics but, there is as yet no evidence (as far as i am aware of) that getting wet increases the risk of acquiring a pneumonia. Good luck!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Sun Sep 12, 2010 3:19 am",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=102194&sid=7525041e432efc9bb18e1f5a6344449f#p102194"
  },
  {
    "author": "lime  Guest Posts: 1 Joined: Tue Aug 17, 2010 12:25 pm Gender: Female",
    "title": "diagnosed with pneumonia, has persistent chest pain and coug",
    "content": "Hello! goo day to all! i'm 22 years old and complains of persistent chest pain right on the center behind the breastbone which radiates to my back. i feel that i have chest congestion which i can also feel up to my neck. the chest pain was more than a week. when i cough, there is sudden stoppage of my breath to the point that i can't talk which may last for 30-40 seconds. i can feel and hear the crackling sound inside my chest. i have plegm that i can't expel out which i think turns into a bolus inside. my cough is around three weeks now. i had consulted a doctor and diagnosed me with pneumonia. she prescribed me with antibiotics, clarithmycin, prednisone, antitussive and salbutamol. she also prescribed mobic for pain. can this be a tuberculosis? i'm afraid that it is. i hope i can get a response. thank you.\n\n",
    "posted_time": "Post  by lime » Tue Aug 17, 2010 12:44 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=101126&sid=7525041e432efc9bb18e1f5a6344449f#p101126"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: diagnosed with pneumonia, has persistent chest pain and coug",
    "content": "Hi, Your symptoms are not specific for pulmonary tuberculosis. It is not clear how long you have had this problem. You need to see your doctor and get investigated. Basic labs including blood counts, ESR, a sputum smear for gram's stain and a routine sputum culture are indicated. A repeat chest X-ray may also be needed. Based on the clinical findings, your doctor may decide on requesting sputum smears for acid fast bacilli. Best wishes!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Mon Aug 30, 2010 1:24 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=102010&sid=7525041e432efc9bb18e1f5a6344449f#p102010"
  },
  {
    "author": "elizebeth grace  Guest Posts: 1 Joined: Wed Aug 11, 2010 12:22 am Gender: Female",
    "title": "Shortness of breath after pnuemonia is gone",
    "content": "Hello Im 13 and thought i would see if i could get an answer here because my doctor says im fine now, but a couple months ago I got pnuemonia and even though its gone i still have shortness of breath.  i first started feeling different in the spring, my entire personallity changed and i couldn't figure out why, i was always tired (i would sleep for more than 17 hours a day) i didn't care about anything that was going on around me and i coundn't figure out why. this went on for another two months but the only symptoms i had were drowsiness, high heart rate, yellow nails and green mucus. none of these sympons made me think i had pnuemonia because i didn't have a fever or a cold or a flu.  After 3 months of this i finally went to the hospital  i got my blood tested urine teast and a chest x-ray iwas diagnosed with pnuemonia in my left lung. my left lung was very scard. I took clarithromycin 250mg and cerfuroxime axetil 500mg.  Its gone now but i still have shortness of breath especially when i play sports i even had to quit track breath i cant breath normally now i play tons of sports and its becoming a problem for me.  is there anything i can do to help my shortness of breath?\n\n",
    "posted_time": "Post  by elizebeth grace » Tue Aug 17, 2010 11:40 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=101167&sid=7525041e432efc9bb18e1f5a6344449f#p101167"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: Shortness of breath after pnuemonia is gone",
    "content": "Hi,  In the adolescent age group, pneumonias are frequently due to certain organisms such as, - chlamydophila pneumoniae (C. pneumoniae), - mycoplasma pneumoniae (M. pneumoniae), - adenoviral infection,and - Mycobacterial infection.  C. pneumoniae occur mostly in children. Humans are the only known host for C. pneumoniae. Infections cause respiratory diseases such as sinusitis, bronchitis, and pneumonia. C. pneumoniae is typically acquired by otherwise healthy people in the community situation (community-acquired pneumonia). C. pneumoniae pneumonia is categorized as an \"atypical pneumonia\" because, diagnosis and treatment differ from that of the well known causes such as Streptococcus pneumoniae pneumonia.  Acute  C. pneumoniae infections seem often to precede episodes of asthma and is also involved in some exacerbations of chronic bronchitis. Moreover,it seems to be strongly associated with chronic obstructive pulmonary disease.  M. pneumoniae is a frequent causative agent of pneumonia among older children and adolescents. Mycoplasma accounts for 14-35% of pneumonia hospitalizations in this age group.  Some forms of viral pneumonia, particularly adenoviral infections, may cause necrotizing bronchiolitis or bronchiolitis obliterans.  Mycobacterial pneumonia has recently been noted with increasing frequency in socially deprived sections in urban settings.Children in shelters for the homeless, group homes and those with household contacts are particularly at risk. The diagnosis must be entertained in immunocompromised children as well.  For the sake of completion, i would mention Bronchiolitis obliterans organizing pneumonia (BOOP) or cryptogenic organizing pneumonia (COP), which is a rather vague entity. This usually begins between the ages of 40 and 60. May be triggered by bacterial/viral infections, parasitic infections, drugs, or toxic fumes. Some degree of hypoxemia may be demonstrable in affected individuals.  In conclusion, children who recover from an episode of pneumonia, but have recurrent or chronic symptoms, further testing is warranted. Further testing may include skin testing to identify fungal pathogens, tests for tuberculosis, sweat testing to identify cystic fibrosis, titers against rare pathogens, and bronchoscopy.  I hope this information is useful to you. Best wishes!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Mon Aug 30, 2010 1:24 am",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=101997&sid=7525041e432efc9bb18e1f5a6344449f#p101997"
  },
  {
    "author": "Shazinoz  Guest Posts: 8 Joined: Sun Jul 18, 2010 7:31 am Gender: Female",
    "title": "?? Complications following pneumonia/ bronchitis/ URTI ??",
    "content": "I am a 39yr old female as you can see from my profile has a complicated Medical and family history.  In May I woke with a sore throat one morning and the next day I woke with a VERY HEAVY Chest and the beginning of more than 2 months of he!!   I was diagnosed with Pneumonia by my Dr after a clinical examination (listening to my chest, tapping on my chest etc) and history (shortness of breath, heavy lung feeling, infection taste when breathing, night sweats, fatigue, lack of appetite, low grade fever (37-38C), headaches, sore throat at beginning etc I didn't have a cough although I felt I needed to cough and this was put down to a side effect of medication (MsContin in HIGH dose) I take to help combat my Chronic pain condition (RSD) and did get one later for a short time.  I was put on Amoxicillin for 2 boxes worth, after 3 days I ended up in the ER with shortness of breath (my O2 saturations were said to be normal) and an x-ray was take and said to be mostly clear with \"something\" in the middle, I was subsequently diagnosed with Bronchitis or possibly Mycoplasma pneumonia, and given Doxycycline just in case as well as the other Antibiotic I was taking (I am allergic to Cephalosporin and Roxithromycin antibiotics as you can see in my profile).  10 days or so later back at my GP I was no better (in fact I was worse) and she was getting concerned, she sent me for another chest x-ray and an ECG to rule out heart problems (I have pre-existing trivial mitral and tricuspid valve regurgitation) and to the ER with a letter and the hopes that I would be admitted.  I was admitted (by this time I had been sick for more than 3 weeks) to hospital (and spend three weeks (21 days) in there), and put on IV amoxicillin every 4 hours, for 4 days and back on the Doxycycline as well. I also had/ have the occasional fast/funny heartbeat but this was not picked up on any of the ECG's I have had about 5 in the last 2 months. After 4 days I was transferred under a different Dr and continued on the Doxy for another 2 weeks or so. I was coughing up green gunk by this stage (Dr had me taking a (Bisolvin Chesty Forte) Bromhexine hydrochloride cough mixture (8mg/5ml) to help) and the hospital took sputum samples, and blood tests too (not sure of results, except the ones taken in the ER showed increased inflammation and white blood count).  While in-patient I was seen by a pulmonary specialist as I was having severe chest pains (eventually diagnosed as Costochondritis and possible pleurisy as well), I was changed from Doxycyline to Moxifloxin for about 7-10 days and had NSAIDS (firstly Voltaren and then Indomethacin) added to the mix to treat the supposed Costo/ Pleurisy. Got results of one of my blood tests that said I had Mycoplasma (or had had it) and was kept in an extra week after this.  I was sent home after 21 days in patient as they said everything that was being done for me could be done at home.  It is now 3 weeks since i was discharged and I still have shortness of breath (although all the time in hospital they said my O2 levels (by pulse oxymeter) were fine - about 95% or above), chest pains (especially if I lean forward, move about too much, and riding in the car hurts too), slight heaviness in my lungs, fatigue, I get cold too, normal temp to low grade fever (36-38C), night sweats (mostly on my lower half (not sure what that is about)), wheezing, and other odd breathing noises. I spend most of my days in/on bed sitting at a 45 degree angle (I sleep at this angle as well).  I am seeing my GP again in a week (she is away at present and has been since I got discharged), but until then am concerned about what is going on with my body, why after more than 10 weeks I am still not better/ well (I thought Mycoplasma was supposed to be a mild illness).   I am also seeing a Cardiologist on 28th August for a check up as I have not had my 2 yearly Echo to check my heart murmurs and also because one of the Dr's said she heard an Aortic valve murmur as well (and this is new). Although none of the above stuff is/was thought to be cardiac, I had multiple ECG's and blood tests including checking my heart stuff.  I am worried it was/ is more than Pneumonia/ Bronchitis/ Upper Respiratory Tract infection (All things I have been told it is). I am wondering if I should ask my GP to refer me for a Chest CT scan to see if this shows more? or what else could be going on or if this is simply normal???  Sorry for the length of this and congratulations if you made it all the way to the end  ANY help would be greatly appreciated.\n\n",
    "posted_time": "Post  by Shazinoz » Sun Jul 18, 2010 7:39 am",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=97627&sid=7525041e432efc9bb18e1f5a6344449f#p97627"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: ?? Complications following pneumonia/ bronchitis/ URTI ??",
    "content": "Hi, Thank you for the very detailed post. Seems you had overlooked mentioning a few conditions which i feel certain your doctors must have been very concerned about (given the history of trivial mitral/tricuspid valve regurgitation, the appearance of a new aortic murmur, occasional fast/funny heartbeats, chest pain on leaning forward)- and they are,   - an infective endocarditis(IE): very rarely caused by mycoplasma spp., - myocarditis, and - pericarditis due to mycoplasma spp.  Mycoplasmal infecions are one of the causes of culture-negative IE.  The vast majority of organisms that cause infective endocarditis are readily isolated from blood cultures. However, in a small minority of patients with infective endocarditis, no organism is isolated. This may occurdue to certain factors, such as, - either because previous antimicrobial therapy has partially cured the infection, -  or because the infection is due to an unusually fastidious microbe,  - or due to a slow-growing organism.   Broad-range eubacterial polymerase chain reaction (PCR) amplification is a method available for detection of mycoplasma spp.  PCR-based method has both advantages and disadvantages. The advantages lie in its high sensitivity and quick turnaround time. A notable limitation is that it cannot provide antibiotic susceptibility data or minimal inhibitory concentrations, as is possible with conventional culture methods.  I guess these possibilities were entertained during your recent hospitalization apart from the possible mycoplasma pneumonia.  I feel that you should consult a chest physician or a cardiologist at the earliest. Good luck!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Tue Jul 20, 2010 12:55 am",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=97806&sid=7525041e432efc9bb18e1f5a6344449f#p97806"
  },
  {
    "author": "Shazinoz  Guest Posts: 8 Joined: Sun Jul 18, 2010 7:31 am Gender: Female",
    "title": "Re: ?? Complications following pneumonia/ bronchitis/ URTI ??",
    "content": "Thank you Dr.M.Aroon kamath,  As far as I know none of these conditions were looked into.  I had some ECG's to check my heart rhythms etc but they were all normal.  I had multiple blood tests but I think they were testing for normal things like FBC etc.  I think they checked cardiac enzymes at one stage after a bad episode that scared both myself and many of the nurses etc who came running (they thought I might have had a small collapse in my lung but the x-ray was clear).  I am seeing my GP on Thursday and am thinking of asking her if I should have  CT Scan for a better check of my chest etc, as my X-rays have been pretty clear all the way through this.  What exactly should I ask her to test for regarding these heart issues ( infectious endocarditis, myocarditis and pericarditis) you mentioned? Should I be having specific blood tests, x-rays, scans etc to rule these conditions in or out?  I am also seeing a Cardiologist at the end of August but that is more than a month away yet (and the earliest I can get in).  I have been feeling a bit heavy chested again lately and coughing up small amounts of white/ clearish stuff when I can cough but again am having a lot of trouble coughing properly (thought to be caused by the high doses of morphine I take for my RSD). I also have the night sweats again/ still and my temp last night got up to 37.9C (100F)  I was seeing a pulminologist while in-patient but no one ever mentioned my heart except to say it wasn't cardiac because my ECG's were clear. and to mention the possibility of the new aortic murmur.  I have had all of my Pathology results (blood tests and sputum tests) sent to my GP so she will have these when I get there, I also have all of the Chest X-rays that were done as well.  I don't know what method was used to diagnose the Mycoplasma except that it took about 4 days to get the results of the blood test.  Again THANK YOU for your answer and I will bring this up with my GP when I see her on Thursday.  Shazinoz  (Australia)\n\n",
    "posted_time": "Post  by Shazinoz » Tue Jul 20, 2010 1:32 am",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=97807&sid=7525041e432efc9bb18e1f5a6344449f#p97807"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: ?? Complications following pneumonia/ bronchitis/ URTI ??",
    "content": "Hi Shazinoz, Thank you for your update.My reply to your question was based purely on the basis of the information you had supplied(without the opportunity of a first-hand clinical examination!).  It is quite possible that your treating doctor might have 'entertained' the possibility of an infective endocarditis, but might not have divulged it under those circumstances, - possibly because the evidence for it was not compelling or - for concern regarding precipitating unnecessary anxiety.  The comforting aspect is that you were on the necessary antibiotic therapy at that time.  The chest pain apparently developed AFTER you were discharged home. Mycoplasmal infections are not always mild illnesses. They can cause serious complications in some individuals.It is good that you responded fairly well.  I suggest that you may voice your concerns with your doctor and get investigated. A repeat ECG and chest X-ray may be useful. An echocardiographic examination also may help to exclude any vegetations on the heart valves. Hope this information is helpful to you. Good luck!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Wed Jul 21, 2010 7:24 am",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=97995&sid=7525041e432efc9bb18e1f5a6344449f#p97995"
  },
  {
    "author": "Shazinoz  Guest Posts: 8 Joined: Sun Jul 18, 2010 7:31 am Gender: Female",
    "title": "Re: ?? Complications following pneumonia/ bronchitis/ URTI ??",
    "content": "Thanx again Dr. M. Aroon Kamath  I am back from my GP and have an appointment to see the pulminologist (I was seeing while I was inpatient) Next Thursday (a near miracle to get in this early).  We also got a full copy of one of my blood tests from my hospital stay and it turns out I am only Mycoplasma Pneumoniae positive (Total Ab Titre 1: 160), but also Chlamydia Pneumoniae positive as well (IgA - Detected, AU/ml: 51; IgG - Detected, AU/ml: 195).  So hopefully we will get to the bottom of things when I see the Pulmonologist again next week and the cardiologist is still on for the 12 August.  Thanks so much for all your help and I will continue to update this as news comes to hand in the hopes of helping others who read this as well...\n\n",
    "posted_time": "Post  by Shazinoz » Thu Jul 22, 2010 1:57 am",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=98170&sid=7525041e432efc9bb18e1f5a6344449f#p98170"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: ?? Complications following pneumonia/ bronchitis/ URTI ??",
    "content": "Hi Shazinoz,  Than you keeping me posted. Hope that you get well and i am also as concerned as you are and by the way, how's your cough?- and the chest pain. Hope these have subsided by now. Best wishes!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Mon Jul 26, 2010 1:57 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=98708&sid=7525041e432efc9bb18e1f5a6344449f#p98708"
  },
  {
    "author": "Shazinoz  Guest Posts: 8 Joined: Sun Jul 18, 2010 7:31 am Gender: Female",
    "title": "Re: ?? Complications following pneumonia/ bronchitis/ URTI ??",
    "content": "I still can't cough properly (have had this issue the whole time - they think it is due to the large doses of Morphine sulphate I take for my chronic pain), but still feel the need to cough.  The chest pain is still there but comes and goes. It is not as bad as when I was inpatient, but it is still there.   My GP says costochronditis and pleurisy can take more than 6 weeks to get better. It is no where near as bad as it was and isn't constant any more but is now intermittent, but the pain is still very severe when it is there.  I am seeing the lung specialist in 2 more days and hopefully he will have some more answers as to what is going on with this body of mine.  Thank you very very much for all of your help. It has given me other avenues to check/ get checked to make sure this is gotten to the bottom of.\n\n",
    "posted_time": "Post  by Shazinoz » Mon Jul 26, 2010 9:01 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=98768&sid=7525041e432efc9bb18e1f5a6344449f#p98768"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: ?? Complications following pneumonia/ bronchitis/ URTI ??",
    "content": "Hi Shazinoz, As i indicated earlier, my reply to your post was solely based on the information provided and i had to analyze and come forward with all the possible diagnoses that i could muster.  However, in practice, \"common\" things always occur \"commonly\"! Going by this dictum, i sincerely hope that the chest pain turns out to be due to costochondritis rather than something else. Hope you will get better soon. Good luck!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Sat Aug 07, 2010 2:38 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=100017&sid=7525041e432efc9bb18e1f5a6344449f#p100017"
  },
  {
    "author": "Taurean  Guest Posts: 1 Joined: Wed Jul 28, 2010 7:28 pm Gender: Female",
    "title": "Pneumonia/Pleurisy won't go away",
    "content": "I'm a 43 yr old woman; light smoker, non-drinker, lead an active life.  In April, I was diagnosed with double pneumonia.  In May, with Pleurisy in my right lung. In June, with Pleurisy in my left lung, also. (Pneumonia was gone) In July (yesterday), with pneumonia again, and pleurisy still in both lungs.  I'm now on my 4th round of antibiotics in 4 months, and my 3rd round of steroid treatments in 4 months. I've been unable to work at my job all this time.  My symptoms are: (w/o the pneumonia) shortness of breath with ANY activity, but also sitting down; rapid heartbeat, pain/burning at the bottom of both my lungs with & w/o movement, fevers, dizziness, sweating, wheezing. I have NO coughing, unless the pneumonia is full force, but even then, nothing ever comes up.  My biggest complaint to my Dr has been the pain in my lungs. My lower right lung is the worst. Sharp pains/stabbing; burning pain whether I exert myself or not. When I walk even a short distance, or even to take a shower, I'm completely out of breath and lightheaded.  In June, I did the breathing tests and was told I failed; So, my Dr diagnosed me with COPD. I disagree with him. I've never had any of these problems before in my life. When I asked him if it could be something else, he cut me off and rudely said NO. My oxygen levels are perfect (98%). My blood pressure is perfect (115/64 I think).  If it were COPD, would I have this constant lung pain? Even with no cough? And if it's Pleurisy, how do I get rid of it? Nothing seems to work. I have cut back on my smoking and am trying to quit, so I know that will improve my health a lot. A nurse friend of mine suggested I ask my DR about Pulmonary Embolus(?), but my Dr dismissed that instantly, too.  I'm at a loss as to what to do. I HAVE to get better, so that I can return to work and go back to living a normal life again. Thank you!\n\n",
    "posted_time": "Post  by Taurean » Wed Jul 28, 2010 8:19 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=99012&sid=7525041e432efc9bb18e1f5a6344449f#p99012"
  },
  {
    "author": "AniflaCS  Guest Posts: 1 Joined: Wed Jul 28, 2010 8:51 am Gender: Female",
    "title": "Pneumonia, bronchitis or Primary complex?",
    "content": "Greetings,  Let me first thank you for giving us a chance to ask questions and chat with you guys. My son is suffering from cough and on and off fever. He had a Bronchitis before. We went to the hospital for an chest x-ray examination and here's the result.  Chest AP/L Streaky infiltrates are seen in both peripheral and both lower lungs. Enlarged tracheobronchial lymphnodes are seen Heart is not enlarged Diaphragm and costophrenic sulci are intact  Impression: Bilateral Pneumonitis with lymphadenopathies Suggest follow up to exclude primary pulmonary tuberculosis.  Please help me, his pedia is not yet available and I'm so bothered here in the office. :(  Thank you!\n\n",
    "posted_time": "Post  by AniflaCS » Wed Jul 28, 2010 9:02 am",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=98950&sid=7525041e432efc9bb18e1f5a6344449f#p98950"
  },
  {
    "author": "rnaryn  Guest Posts: 2 Joined: Fri Jul 23, 2010 12:18 pm Gender: Female",
    "title": "heavy chest and coughing...could this be pneumonia?",
    "content": "I recently had surgery [over a week ago] and went under general anesthesia. Afterwards I was told to do breathing exercises so I wouldn't develop pneumonia. For some reason I completely forget to do them. Now I have this strange heavy feeling in my chest with slight coughing. The coughing is very sporadic. Sometimes I can't stop coughing and other times I'm perfectly okay. I'm not producing any colored mucus. From time to time I produce a little bit of clear mucus and that's about it. I'll run a fever about 99.5 but then it'll go away and then it goes back up throughout the day. My chest feels very tight. Sometimes I can hear myself wheeze when I breathe other time it's clear. The symptoms aren't very consistent. I'll feel fine and then I feel bad. I also have a tight feeling in my throat sometimes.  Could this possibly be pneumonia or something completely unrelated?\n\n",
    "posted_time": "Post  by rnaryn » Fri Jul 23, 2010 12:28 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=98333&sid=7525041e432efc9bb18e1f5a6344449f#p98333"
  },
  {
    "author": "dhunton  Guest Posts: 1 Joined: Tue Jul 20, 2010 3:14 pm Gender: Female",
    "title": "Family With Recurring Pneumonia-79 y.o. fem now in hospital",
    "content": "Last night, my mother-in-law was hospitalized for the second time in a month with difficulty breathing. The biggest fear factor I have is that this matches far too closely with what happened to her husband before he passed away.  I will attempt to give as much history of her current complaints and medical history, and I will reference his as it relates.  She is a 79 year old woman who up until a few years ago was very physically active. She is still fairly active, as she has farm animals (chickens, goats, etc) that she feeds every day. Her husband passed away in November of 2008, and she has slowly been becoming less active since that time, and her eating habits have degenerated somewhat.   Her house is older (she will be moving to a new one in the next few months) with previously leaky roof in a humid climate (possibilities of fungal growth and/or other problems).  She has had high blood pressure and high cholesterol (not dangerously so) that was controlled by medications. She was on a very, very low dose water pill in addition to those two medicines.  Starting a few months ago, she started becoming short of breath (her husband had printer's lung and had been a smoker, so in him, this was not a new symptom). It kept getting worse. Her primary care doctor made one change in her medication (which one, I'm not sure of) thinking that her difficulties breathing were a side effect.  In mid- to late-June, she called 911 due to difficulty breathing and chest pain she worried might be a heart attack. After testing, it was determined she had fluid build up in her lungs. This was immediately diagnosed as CHF and treated as such. They also stated that she had an infection in her lungs (he was only diagnosed with the lung infection and/or pneumonia on his first admittance, not with CHF). She was given antibiotics when she was in the hospital - less than a week - but was not sent home with any (he was given antibiotics to continue at home). She was given a steroid series to take after her release.  Her breathing was comfortable (i.e. not difficult) for only a few days before it began deteriorating again. She was scheduled for a follow up with her GP physician next week, but last night called 911 again. When they arrived, she was not thinking clearly and barely remembers how they got her out of the house (we believed her husband had the beginnings of alzheimers as he was often out of touch with the world - both in not understanding what was said to him and in not being able to communicate clearly).  When the chest x-ray showed fluid in her lungs at the ER, she was diagnosed with pneumonia and admitted (he was also re-admitted less than a month later with a more severe case of pneumonia).  In both cases, there was little coughing, little sputeum for them to test. Neither of them ran a high fever. He was tested for MRSA and was found to have been exposed, but we were never told if he was a carrier or had an active infection. She, to the best of my knowledge, has never been tested.  I've done some research on pneumonia and know it can have many causes. What I'm wondering is if it might be caused by some environmental factor (mold/fungus, bacteria in the house, insect waste or dust being inhalled, etc) or some contagion (particularly MRSA), but that her immune system was strong enough to hold it off until a recent injury and her depression weakened her immunity until the problem manifested in her.  What tests can/should be done to make sure that she doesn't follow the same course that he did? How can we find out what's REALLY causing the pneumonia (i.e. is it really CHF, is it fungal, is it bacterial-and if so is the bacteria resistant, etc)?  Any information or suggestions would be very much appreciated. If you need more information, please do not hesitate to send a question here, and I will answer with as much detail as I can (I have full medical history on her, including childhood illnesses and all injuries).   DHunton\n\n",
    "posted_time": "Post  by dhunton » Tue Jul 20, 2010 4:30 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=97891&sid=7525041e432efc9bb18e1f5a6344449f#p97891"
  },
  {
    "author": "chronicsickness  Guest Posts: 1 Joined: Thu Jun 24, 2010 9:26 am Gender: Female",
    "title": "Walking Pneumonia?",
    "content": "I had a Chest XRay done about 3 days ago because I was having some pretty severe breathing issues.  I felt like I was suffocating almost constantly and my left lung towards the bottom of my ribcage (on the side, front AND back) was becoming painful and sore.  I was also feeling dizzy and somewhat sick to my stomach and having random bouts of extreme fatigue.  I went to the ER lastnight, and my doctor told me I have POSSIBLE Pneumonia only because the XRay didn't really come out all that great, but it did look like I had some fluid in there and it could be inflamed.    My only problem with the diagnosis is I am not coughing at all, nor do I have any feeling that I need to.  I am not weezing or having anything come up from my lungs at all.  I just continuously feel like I can't breath (shortness of breath) and feel like I am suffocating especially when I lay down.  It almost feels as if my throat is tightened up also and constricted.  Is there a possibility that I have something else going on with my respritory system that they could be overlooking?  I don't want to just be treating myself for something that could possibly be worse than pneumonia.  I honestly am afraid that I am going to just stop breathing all together.  Thank you.\n\n",
    "posted_time": "Post  by chronicsickness » Thu Jun 24, 2010 9:33 am",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=95064&sid=7525041e432efc9bb18e1f5a6344449f#p95064"
  },
  {
    "author": "happyducklet  Guest Posts: 1 Joined: Sat Jun 19, 2010 10:52 pm Gender: Female",
    "title": "Does pneumonia cause bronchial obstructions?",
    "content": "My mother (77 yrs. old) has had pneumonia and the GP treating her says that she may have a bronchial obstruction because her right lung is not draining the way he would like.  Nothing really showed up on the chest x-ray.  Can the bronchial obstruction be a cause of the pneumonia or can pneumonia be the cause of the bronchial obstruction?  I know there are other, more serious causes of a bronchial obstruction.  She has not had a bronchoscopy or CT scan yet, but will be evaluated by a pulmonary doctor later this coming week.  Thank you in advance.\n\n",
    "posted_time": "Post  by happyducklet » Sat Jun 19, 2010 11:04 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=94631&sid=7525041e432efc9bb18e1f5a6344449f#p94631"
  },
  {
    "author": "Life_is_beautiful04  Guest Posts: 1 Joined: Fri Jun 11, 2010 10:22 pm Gender: Female",
    "title": "pneumonia caused from leaking heart valve",
    "content": "My question is, how does blood from the heart get into the lungs in the first place and cause pneumonia?\n\n",
    "posted_time": "Post  by Life_is_beautiful04 » Fri Jun 11, 2010 10:50 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=93887&sid=7525041e432efc9bb18e1f5a6344449f#p93887"
  },
  {
    "author": "momof2girls  Guest Posts: 1 Joined: Fri Dec 04, 2009 4:44 pm Gender: Female",
    "title": "pneumonia in children",
    "content": "my 4 year old has had a low grade fever off and on for about 3 weeks...she was first diagnosed with a bladder infection and when her fever would spike to 102 we went back in and was told she never had a bladder infection..they ran blood work and a chest x-ra and called today to tell us she has pneumonia in both lungs..her fever tays at approx. 99.8 and she is slightly irritable, no real appetite but is not coughing anything up or having problems breathing..she was put on two antibiotics and they want to follow-up with another x-ray in a week..does this sound right? should I be doing anything more?\n\n",
    "posted_time": "Post  by momof2girls » Fri Dec 04, 2009 5:16 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=88116&sid=7525041e432efc9bb18e1f5a6344449f#p88116"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: pneumonia in children",
    "content": "The information you've received certainly doesn't sound wrong. Assuming no mistakes have been made (and there's no reason to assume there have been, but this is the only qualifier to your question) this certainly is consistent with a common scenario in people of many ages, especially small children who cannot readily describe how they're feeling. The treatment also sounds appropriate. The condition is quite common, and generally runs a benign and self-limiting course. If she continues to improve and looks good at followup your daughter should be fine. If she develops any new symptoms or difficulty with breathing or extreme fatigue (or, of course, a higher fever) you'll need to notify the physician at once. Otherwise this normally will resolve fairly rapidly. Just keep her inside and away from sick people, and make sure she doesn't overdo -- she should be able to do pretty much as she feels up to doing, but shouldn't be doing a lot of zooming around til she's been declared clear, as even simple pneumonias can cause sudden energy drains and sometimes this can worsen the infection. On the other hand, absent any severe symptoms, while inside she should be able to play fairly normally.   Hope this is helpful. Please follow up with us here as needed and give us an update also. Good luck to you.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Mon Dec 28, 2009 11:46 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=90130&sid=7525041e432efc9bb18e1f5a6344449f#p90130"
  },
  {
    "author": "shimipl  Guest Posts: 1 Joined: Sat Jul 07, 2007 12:59 pm",
    "title": "reoccuring pneumonia + igG for aspargillus",
    "content": "Hi im a woman 60 years old and have been suffering from reoccuring pneumonia for many years. I have had a lung biopsy in order to find out the cause but the didn't find anything.  I have been treated with steroids which seemed halpfull but i don't want to keep taking it due to the side effects. Recently i have sent a blood sample to labs , which showed a bit high dose of igG antibodies for aspargillus (98 mg/L).   could it be that aspargillus causes all my problems (or it got me just because of the steroids)?  and is there a different treatment from steroids?\n\n",
    "posted_time": "Post  by shimipl » Mon Nov 30, 2009 12:47 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=87802&sid=7525041e432efc9bb18e1f5a6344449f#p87802"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: reoccuring pneumonia + igG for aspargillus",
    "content": "Hello -- There are four different types of aspergillus-related pneumonia and each requires different medical treatment. The allergic type responds well to steroids, sometimes in combination with an antifungal. I'm assuming this is the type you have and is the reason for the steroid therapy. If this is correct, then the only alternative would be to add an antifungal, but if it hasn't been determined which sort of aspergillus-related pneumonia you have (and it's not for sure that's what you have, but it seems awfully likely) this needs to be sorted out so the most effective treatment is initiated.  Hope this helps. Good luck to you and please follow up with us here as needed.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Mon Dec 28, 2009 11:39 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=90129&sid=7525041e432efc9bb18e1f5a6344449f#p90129"
  },
  {
    "author": "wskychk61  Guest Posts: 1 Joined: Wed Nov 18, 2009 4:43 am Gender: Female",
    "title": "secondary conditions of pneumonia",
    "content": "We are concerned about a coworker. She says she has pneumonia that has gone into her throat, is going into her internal self and causing internal bleeding. How is this possible and how would it be treated?\n\n",
    "posted_time": "Post  by wskychk61 » Wed Nov 18, 2009 4:52 am",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=87239&sid=7525041e432efc9bb18e1f5a6344449f#p87239"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: secondary conditions of pneumonia",
    "content": "Hello -- While there's no way of knowing what is actually going on with your coworker, and given pneumonia wouldn't travel backward (retrograde) to the throat nor cause internal bleeding (and how does she know she is bleeding internally?) there is no doubt something wrong and this warrants her being seen by a medical provider, examined, and be diagnosed with whatever it is actually going on with her. Whatever it is it does sound as though it has the potential to be serious. It's really impossible to know what it is, or if it may be a factitious illness, but there's just no reason to take any chances.  Hope this helps. Good luck and please follow up with us here.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Thu Dec 10, 2009 8:20 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=88726&sid=7525041e432efc9bb18e1f5a6344449f#p88726"
  },
  {
    "author": "walrivps  Guest Posts: 3 Joined: Fri Nov 06, 2009 8:34 am Gender: Female",
    "title": "CXR + CT reveal mass + pneumonia",
    "content": "My 38 year old diabetic brother was informed 2 days ago of having contracted the H1N1 flu virus, at which time a CXR revealed a large mass within the upper right portion of his left lung. Following a CT scan, he was informed that a mass, believed to be a tumor of 3.5 - 4.5 cm, was engulfed within pneumonia infection. Could it be possible that the mass is tuberculosis, rather than a tumor since he tested positive for inactive TB as a young child?\n\n",
    "posted_time": "Post  by walrivps » Fri Nov 06, 2009 9:25 am",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=86083&sid=7525041e432efc9bb18e1f5a6344449f#p86083"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: CXR + CT reveal mass + pneumonia",
    "content": "Hello -- Yes, it seems entirely possible the mass could be a calcified TB lesion as easily as a tumor, especially since it appears in the midst of a pneumonia infiltration (this is more common). Once the infection is cleared up with antibiotics the mass will be easier to visualize. If it's still unclear what it is, it can be biopsied to determine its nature. It could well be just an old tubercular cyst that's been there for quite a while. It also could be a benign tumor. FIrst order of business is to resolve the pneumonia, after which a more clear picture of what's going on will be possible.   Hope this helps. Good luck to you and to your brother. Please follow up with us here as needed.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Thu Nov 19, 2009 11:30 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=87405&sid=7525041e432efc9bb18e1f5a6344449f#p87405"
  },
  {
    "author": "walrivps  Guest Posts: 3 Joined: Fri Nov 06, 2009 8:34 am Gender: Female",
    "title": "Re: CXR + CT reveal mass + pneumonia",
    "content": "Thank you ever so much, Dr. Kenyon; first for taking time out to answer my question, and secondly, for giving me an idea of the possibilities.  My brother's doctor placed him on Augmentin in an attempt to rid him of the pneumonia. Last Friday, another CT scan was performed and he is to receive the results this week. I will keep you posted.   Thanks again, and I hope you have a wonderful and happy Thanksgiving.  Warm regards, Pamela Walriven\n\n",
    "posted_time": "Post  by walrivps » Mon Nov 23, 2009 7:52 am",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=87535&sid=7525041e432efc9bb18e1f5a6344449f#p87535"
  },
  {
    "author": "walrivps  Guest Posts: 3 Joined: Fri Nov 06, 2009 8:34 am Gender: Female",
    "title": "Re: CXR + CT reveal mass + pneumonia",
    "content": "Dear Mr. Kenyon,  I apologize for the mistake in identity as I announced you as a doctor, rather than an EMT, CNA. I am a former CNA of 8 years who attended college for nursing a few years back, but switched degrees prior to finishing the nursing course. I am now a substitute teacher after spending much time in college, and am considering attending college again to become a licensed Intervention Specialist and to complete my Master's degree in Special Education (only another 2 years in college).   Nevertheless, you have really done your research! Have you considered becoming a doctor? You probably should since it appears that you pay close attention to detail, which is so important when it comes to the health and lives of people. My own mother lost her life in 2007 due to the staff of a hospital overlooking important details, so I cannot stress enough the importance of every little detail.  Once again, thank you for replying to my post; and, Happy Holidays!  Sincerely, Pamela Walriven\n\n",
    "posted_time": "Post  by walrivps » Mon Nov 23, 2009 8:16 am",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=87537&sid=7525041e432efc9bb18e1f5a6344449f#p87537"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: CXR + CT reveal mass + pneumonia",
    "content": "Hello Pamela,  You are very welcome, is why I'm here! I'm glad to learn your brother is on appropriate antibiotic therapy and hope that will help clarify things a lot.   As for that \"doctor\" thing, no problem, it happens all the time. I do thank you, though, for your kind words. I've been an EMT, paramedic, have been trained in critical care nursing (but am not an RN), and am certified in non-invasive diagnostic cardiology, so my scope has been limited to emergency care, which requires the most knowlege in cardiology, neurolog and mechanisms of trauma. It is a rather narrow field, although I also hold certification in critical incident stress management. I once thought I'd like to be a doctor, but after having worked with some extremely fine ones, decided at one point I'd rather be the extra eyes and ears than try to compete in that field. It's been very gratifying. The CNA license is required in my home state for many of the jobs I've held, and I have a lot of respect for what dedicated CNAs do on a daily basis, so good on you for that as well as for having chosen an equally challenging and important career path. I have done my research and continue to, as I want always to be learning and to be as useful as possible. That requires good teachers! I don't know that I'd be up to the rigors of internship at my age anyway. :)  It is a huge compliment you've paid me and I want you to know how much it's appreciated. Thank you very much. I hope your Thanksgiving is a wonderful one as well.  My best, John Kenyon\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Wed Nov 25, 2009 12:05 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=87637&sid=7525041e432efc9bb18e1f5a6344449f#p87637"
  },
  {
    "author": "Renata43  Guest Posts: 1 Joined: Fri Oct 16, 2009 7:40 pm Gender: Female",
    "title": "POS-ARDS survivor complications",
    "content": "Dear Dr: I had severe, hemorrhaging ARDS/MODS, empyema, no pulse on arrival by ambulance in 1980, age 18 years.  Was on PEEP ventilator, albumen, saline, various antibiotics, etc.  Hospitalized 2 mths. Result:  Restrictive Lung Disease, deviated trachea, attacks of bronchitis \"everytime\" I get someone's cold. Problem:  I obviously can't climb more than 2-flights of stairs, as lungs don't stretch, and I can't job more than a couple blocks with my dog.  (Though I can speed walk, with some exercise induced asthma, at 3.0 max. on my treadmill, flat surface). I just read a four yr. old child developed swine flu and received same ventilator and damage to lungs from fibrosis.  They apparently can now \"strip\" this tissue off of lungs to restore normal lung function.  Question:  Could I be a candidate for this procedure, after almost three decades since I got ARDS?  It would be great; as I have always missed out on vertical hiking with my friends - I am always left behind huffing/puffing, frequently stopping until I get rid of the carbon dioxide trapped in my tight lungs.  I'd love to exercise more, and just thought there would be a way for me to do this. Thanks for your assistance.  PS....any studies on post-ARDS Restrictive Lung Disease survivors?  I always see COPD mentioned on every lung association website, and only Restrictive Lung Disease mentioned when caused by Kyphoscoliosis, or progressive type fibrosis.  So, I don't know if my condition is progressive (if I have to worry about pulmonary hypertension as I age) or what.  Annoying! Thanks, again. Renata\n\n",
    "posted_time": "Post  by Renata43 » Fri Oct 16, 2009 7:56 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=84066&sid=7525041e432efc9bb18e1f5a6344449f#p84066"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: POS-ARDS survivor complications",
    "content": "Hi there -- Considering the profound extremity of your condition upon arrival during the acute illness, you certainly have made a remarkable recovery, and you do really well in terms of exercise tolerance considering all this. However, you're still quite young and obviously have more energy than you can readily expend, so this has to be frustrating. The \"stripping\" procedure is fairly new and I'm honestly not up on this, nor have I seen any studies on post-ARDS patients, have only heard anecdotal information that is largely very positive. There is, of course, in situations such as yours the need to avoid upper respiratory infections (and lower ones as well, needless to say), but you are doing really well. I would recommend checking with a pulmonologist at one of the major medical centers (Mayo, Hopkins, Georgetown, to name a few where this field is explored often and in depth, and depending upon your location). You may be or may become a candidate for the procedure or something similar, but it's difficult to say, especially after this much time has passed. The fact is the scarring becomes more \"concrete\" over time, although the question remains as to whether or not this can be removed from a healthy substrate. And that's where they lost me in the discussion -- the question of healthy substrate and how to reach it. By now it may be possible and is certainly worth a few telephone calls at least. I wish I could tell you more, but this is a pretty rarified area and there are a few pulmonologists around who may be more up to date on the latest on this.   I hope this is helpful, good luck to you, and keep up the great work. You're actually doing awfully well, but the frustration and desire to do more is felt here and very much understood. Please follow up with us here as needed.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Tue Nov 03, 2009 9:59 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=85824&sid=7525041e432efc9bb18e1f5a6344449f#p85824"
  },
  {
    "author": "luvher4u14  Guest Posts: 2 Joined: Sun Aug 02, 2009 1:42 pm Gender: Female",
    "title": "Surgery complications for patients with Pneumonia",
    "content": "My grandmother broke her pelvic bone Friday evening and was scheduled for a surgery this coming Monday.  However during the first couple days of being admitted to the hospital, she had developed pneumonia, and the anesthesiologist at the hospital refuses to proceed with surgery on Monday.  What are the risks and possible complications for patients who have pneumonia and require surgery?\n\n",
    "posted_time": "Post  by luvher4u14 » Sun Aug 02, 2009 1:51 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=81187&sid=7525041e432efc9bb18e1f5a6344449f#p81187"
  },
  {
    "author": "Dr. A. De la Guerra  Medical Doctor Posts: 70 Joined: Fri Aug 26, 2005 8:00 pm Gender: Male Location: Lima, Peru  Contact:   Contact Dr. A. De la Guerra       Yahoo Messenger",
    "title": "Re: Surgery complications for patients with Pneumonia",
    "content": "Hi luvher4u14,  Pneumonia is a frequent complication of hip fractures (joint between the pelvic bone and the head of the femur; the femur suffers the crack). Prolonged bed rest allows mucus to collect in the lungs with subsequent proliferation of germs, which originates lung infection (known as pneumonia).  Pneumonia is a major contraindication for surgery. Moreover, pneumonia after surgery is a severe complication because approximately 30% of patients die within 30 days following surgery. Also, the cause of death following a hip fracture is often due to blood clots, pneumonia, or infection.  For most patients with hip fractures the best treatment is early surgery (within 24 to 48 hours) followed by early mobilization, but for some patients precipitous surgery could increase the risk of complications.  To answer your question, the anesthesiologist is right; several studies found that postoperative deaths of patients with hip fractures were not related to the timing of surgery but to a poor physical condition. It is recommended to avoid early operation in patients with a severe disease who are not optimally prepared for surgery.\n\n",
    "posted_time": "Post  by Dr. A. De la Guerra » Fri Aug 14, 2009 9:39 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=81553&sid=7525041e432efc9bb18e1f5a6344449f#p81553"
  },
  {
    "author": "intern4cc  Guest Posts: 1 Joined: Fri Jun 26, 2009 12:04 pm Gender: Female",
    "title": "Fractured rib while having Pneumonia",
    "content": "I was diagnosed with two spots of pneumonia in my right lung almost two weeks ago. I was on Amoxicillin-clavulanate for 10 days, I went back in for more x-rays and was told it is getting better but is still there (was put on Azithromycin, due to allergic reaction to first one). The day I went in for the second round of x-rays I discovered a mild to medium pain in my lower left rib area. The pain is much worse when coughing occurs and movement in the area can be felt when coughing. Today, 2 days after the pain first occurred, the pain is much worse and very sharp. I am not aware of any injury to the area other than coughing. Could I have fractured a rib(s)? And/or what should I do now?\n\n",
    "posted_time": "Post  by intern4cc » Fri Jun 26, 2009 12:19 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=80759&sid=7525041e432efc9bb18e1f5a6344449f#p80759"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Fractured rib while having Pneumonia",
    "content": "Hi there --  While coughing due to pneumonia and other cough-producing pulmonary problems often can cause a cracked rib, more often the pain and discomfort is due to either muscle strain or costochondritis (inflammation of the connective tissue between the ribs) and in either case the cause, significance, symptoms and treatment are pretty much the same: first choice therapy is non-steroidal anti-inflammatory pain medication (NSAIDs) which are generally available over the counter (Advil, Aleve). There's not much to be done for any of the possible causes of rib, cartilege or muscle irritation besides this and sometimes application of moist heat locally.   In no case is this something to be overly concerned about, but it should be evaluated to make certain the pain is, in fact, from ortho-muscular stress and not directly attributable to pneumonitis percolating in the lung (although the latter is usually a rather dull, achey pain rather than what you describe). Assuming the pneumonia has been managed, the pain is almost certainly due to irritation and will resolve with time, but more quickly with help from NSAIDs.   I hope this is helpful to you. Good luck and please follow up here as necessary.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Wed Jul 29, 2009 1:33 am",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=81020&sid=7525041e432efc9bb18e1f5a6344449f#p81020"
  },
  {
    "author": "DebCat287  Guest Posts: 2 Joined: Mon Mar 30, 2009 5:23 pm Gender: Female",
    "title": "Cystic fibrosis and exposure to ^ concentration of animal e",
    "content": "My 14 month old Granddaughter was diagnosed from mother's cord blood with CF. She is getting the best care available at our local Children's hospital. She has had two different antibiotic inhalation treatments, twice per day, each lasting 30 days. 1st infection was pseudomonas aeruginosa, second infection was staph.  Throat swab was used to collect sample. She is normal height, weight, appetite, and learning landmarks.  My question is this:  They have 2 bunny rabbits in cages inside one of their two bedrooms. The room smells awful. The concentrated odor is stifling when one opens the door and walks into the room.They keep this door closed to the rest of the apartment. They sometimes open the bunny room windows to exhaust the odor. I have tried telling my son (age 33) that there is fecal bacteria and urine ammonia in the odor, as well as pet dander and most likely dust mites, and that he (they) should get rid of the bunnies. The bunnies kick up dust in their cages, which covers every surface in that room. I am of the opinion that this dust can migrate into other rooms of the apartment, and into the central air and heat system. I think that this environment is not healthy for a special needs toddler who has been diagnosed with CF. By the way, my fifteen year old Grandson sleeps in this room for tow nights about once a month when he comes to visit his Dad. Do you agree or disagree? Thank you very much for your time. A concerned Grandma.\n\n",
    "posted_time": "Post  by DebCat287 » Mon Mar 30, 2009 6:11 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=72480&sid=7525041e432efc9bb18e1f5a6344449f#p72480"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Cystic fibrosis and exposure to ^ concentration of animal e",
    "content": "Hello --  You're absolutely correct in your observations, as all the detritus from the bunnies can potentially cause problems in healthy people, and the risk is multiplied in those with CF, especially very small ones.  Now then: fastidious maintainance of the bunny room could very well minimize the risk to everyone involved, but this is the problem, at least according to what I infer from your post. And knowing that people who do not tend to domestic animals properly usually are more willing to give them up than get with the clean program and stay with it day in and day out, this is probably the best approach, if followed up with a very thorough cleaning of the room. It is actually possible, in many cases, to keep animals in situations, but not if they're being kept this way. It's also not goof for the rabbits, who, while not immediately endangered nor human, do also deserve some consideration. All in all, this is a real mess, and especially a problem with the small one with CF being exposed to this. Your conclusions about various bunny detritus and its spread throughout the dwelling is correct, although, again, this could be minimized with proper animal care, which seemingly is not being given. This is a serious concern, and may well need to be brought to the attention of child protection services, who could assess this objectively. However, this would no doubt cause a painful rift. It might be brought up as a veiled threat, and might get the attention of the parents, but it's still likely to cause family strain at least. It's difficult enough just being a grandparent and trying to pass along helpful insights without this very complex additional situation.   I hope this is helpful to you. Good luck with this, and please follow up with us here as needed.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Sat Apr 18, 2009 8:44 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=74762&sid=7525041e432efc9bb18e1f5a6344449f#p74762"
  },
  {
    "author": "DebCat287  Guest Posts: 2 Joined: Mon Mar 30, 2009 5:23 pm Gender: Female",
    "title": "Re: Cystic fibrosis and exposure to ^ concentration of animal e",
    "content": "Thank you, John, for your response. Fortunately, the bunnies were \"discovered\" during a routine apartment inspection by the Manager  of the complex where they live.  So, the bunnies and their odor are gone, the carpet and room got cleaned,  and my grandchildren will be breathing cleaner air. I appreciate your suggestion regarding Child Protective Services. Unfortunately,  they are not much help as their caseloads are staggering and they only have time for \"serious\" abuse. Also, as you stated, if Grandma called them (CPS) in for child endangerment, it might  have caused a long term or even permanent break in the family relationship. I babysit my grand- daughter every Thursday on my day off. She has been diagnosed twice with active infection of pseudomonas aeurginosa (sp?) and  the info the parents downloaded from the Internet on this resistant bacterial infection was scary.  Again, thank you for your reply! Best wishes to you!\n\n",
    "posted_time": "Post  by DebCat287 » Mon May 18, 2009 1:25 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=78686&sid=7525041e432efc9bb18e1f5a6344449f#p78686"
  },
  {
    "author": "wylde2bme  Guest Posts: 2 Joined: Mon May 04, 2009 12:36 pm Gender: Female",
    "title": "Mass found in lung during xray",
    "content": "My girlfriend is 45yrs old. She was a light smoker in the past but has been a non smoker for about 10yrs. She became ill with flu like symptoms (cough, fever, vomiting, diarreha, fluid in ears) last week and after 3 days I finally convinced her to see a doctor. The doctor said he thought she had pneumonia and sent her for xray. The xray showed a small \"spot\" on her left lung and the blood work showed elevated white and red blood cell counts. I know that and infection causes white blood cells to become elevated but what about red blood cells. I need to add that before she became ill she showed no symptoms. I am worried sick about this as my first thought was cancer but she has no family history of it. What are some alternative diagnosis that this could possibly be? All we have for right now is a \"I'll call you\" from the doctor. He didn't even tell us if it was in fact pneumonia but she is on antibiotics.\n\n",
    "posted_time": "Post  by wylde2bme » Mon May 04, 2009 1:06 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=76900&sid=7525041e432efc9bb18e1f5a6344449f#p76900"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Mass found in lung during xray",
    "content": "Hi there --  Sounds like your girlfriend may have had a bad viral infection that may have allowed an opporunistic secondary bacterial infection. Pneumonia can be a very black and white finding or sometimes just a borderline thing, a very fine line. The spot on her lung could well be a pneumoccal pus pocket or cyst, could be an old scar from the smoking days, could be a calcified lesion. Cancer isn't the first thing that comes to mind, although it's natural to wonder and your concern is appreciated. The elevated red cell count is most likely due to dehydration from diarrhea, fever and being off food part of the time during an acute illness. We don't know how elevated it was, but just being out of range could be due to a confluence of those factors above, and is the most likely reason, or the doctor would have ordered addtional tests.   If GF is on antibiotics and actually had developed a secondary pneumonia it should start to improve very soon. I certainly hope it does. Doctor should do a followup chest x-ray after the respiratory infection is thoroughly cleared up -- maybe the spot will be gone too then. Again, your concern is admirable, just don't want you to be overly worried right now, because all the findings are consistent with a really nasty enterovirus/pneumonitis and should start to resolve shortly. If this was pneumonia GF may feel a little run down for a week or two after the acute symptoms are past, but this is normal -- for that.   I hope this is helpful. Good luck to you both and please follow up here as needed.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Thu May 14, 2009 9:15 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=78235&sid=7525041e432efc9bb18e1f5a6344449f#p78235"
  },
  {
    "author": "wylde2bme  Guest Posts: 2 Joined: Mon May 04, 2009 12:36 pm Gender: Female",
    "title": "Re: Mass found in lung during xray",
    "content": "Thank you so much for your reply. She is very precious to me and I tend to over react sometimes. I am happy to say that she is now feeling a lot better. It was very tough on her and she is as hard headed as they come and refused hospitalization. We watched my mother pass away from pneumonia in the hospital but she had an underlying illness (BOOP) and my girlfriend is freaked out about hospitals now. After a few days and a few trips to the ER late at night, they ordered her on oxygen at home and changed some of her meds. The oxygen helped tremendously with her recovery. They did a CAT SCAN and the spot was exactly what you said it could be. It was a little bit of scar tissue and some infection, which I guess was possibly the pus pocket you refered to.  What a relief to have her laughing and smiling again. She is still weak but that gets better everyday.   Thank you so much again for your reply. I think this site is great and the fact that professionals such as yourself take the time to come in and answer questions of freaked out family members like myself is just wonderful.\n\n",
    "posted_time": "Post  by wylde2bme » Thu May 14, 2009 10:17 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=78253&sid=7525041e432efc9bb18e1f5a6344449f#p78253"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Mass found in lung during xray",
    "content": "You're very welcome and thank you for your kind words about the site. We really do try to provide something useful. I'm glad to hear such wonderful news and am so happy for both  of you that it all turned out just as it seemed it should. Having gone through an experience such as that with your mother is not only difficult in general, but given the situation, traumatic for everyone involved. BOOP really does make it an entirely different situation, though. I'm terribly sorry to learn of your loss, even if it is no longer recent. It's not something one forgets.   Again, thanks so much for the kind words and especially for sharing the good news here. Your girlfriend should being to improve exponentially now. I'm so glad to know she's more herself already. Good for you both!\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Fri May 15, 2009 4:43 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=78364&sid=7525041e432efc9bb18e1f5a6344449f#p78364"
  },
  {
    "author": "bassfisherman1981  Guest Posts: 1 Joined: Fri May 01, 2009 8:49 pm Gender: Male",
    "title": "pneumonia duration",
    "content": "Hello,  In late March I developed the worst case of influenza I have ever had -- aches, high temperature, chills, etc.  The flu ended up turning into pneumonia.  On April 5th, being extremely sick, and extremely week (difficulty walking), I gave in and saw a doctor.  He put me on Levaquin (750 mg per day), on a five day treatment plan.  The Leviquin had some not so nice side effects, but I stayed with it the entire course.  Now, three weeks after being on this medication, I am feeling much better, but not quite one hundred percent yet.  The dark yellow mucus has now turned thin and clear.  I no longer have any signs of a fever.  I have been able to start working out again, etc.  However, there are a few lingering signs of the illness I had.  Particularly, an occasional wheeze (maybe a few times a day).  I have asthma, but it is so under control, until pneumonia, I rarely wheezed.  Another issue, the cough is 99 percent gone, but I can occasionaly feel stuff inside my lungs.  When that happens, I purposely cough to get it up -- it's now always clear.  Finally, perhaps once every few days or so, Ill notice trace amounts of blood when I spit out some of the clear mucus -- it's very minimal, but I'm still slightly concerned.  Like I said, I'm feeling almost back to normal, but is it normal for the symptoms of pneumonia to linger?  One final thing, Monday I had a follow up chest x ray, and was told everything looks normal.  Thanks  bassfisherman1981\n\n",
    "posted_time": "Post  by bassfisherman1981 » Fri May 01, 2009 9:06 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=76593&sid=7525041e432efc9bb18e1f5a6344449f#p76593"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: pneumonia duration",
    "content": "Hi there --  You are having a classic slow recovery from a severe pneumonia. The aftereffects can linger for weeks or longer, so you're about where I'd expect after such a severe bout. Pneumonia will often aggravate latent or remiss asthma, so treat that as you normally would, and with time, as the lingering irritation (mainly from coughing) resolves the asthma should stabilize again. There may be extended fatigue, but it also will resolve eventually, especially with adequate rest and good nutrition. The blood flecking is fairly normal too, because there has been significant irritation and inflamation down in there, so some  tiny capilaries will occasionally break, but this, too, should get better with time.   Hope this is helpful. Good luck to you, and please follow up with  us as needed.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Wed May 13, 2009 11:23 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=78084&sid=7525041e432efc9bb18e1f5a6344449f#p78084"
  },
  {
    "author": "RebsKas  Guest Posts: 1 Joined: Thu Apr 23, 2009 9:14 am Gender: Female",
    "title": "genetic disposition to pnemonia",
    "content": "Hello,  I had pneumonia 6-7 times while younger- often severe enough to reequire hospitalization w/ oxygen. Eventually, the DRs started me on Gamma Globulin Therapy for about 2 yrs. Afterwards, only got pneumonia twice more from about 10 yrs old to present.  My question: My 7 yr old cannot seem to get rid of what has been diagnosed \"atypical pneumonia\" and she has been in the hospital for 3 days. She was originally diagnosed end of March and is still having issues. She had been given the \"Z-Pack\" at the initial diagnosis along with Prednisone. In the hospital, they gave her albuterol treatments (the smoky thingy) and then switched to the regular inhaler. As of now- she only has an albuterol inhaler for whenever she wheezes severly.   Is it possible she may have inherited my predisposition to contract and keep pneumonia and is this something I should bring up when I see her reg DR this afternoon?   Thank you!\n\n",
    "posted_time": "Post  by RebsKas » Thu Apr 23, 2009 9:26 am",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=75530&sid=7525041e432efc9bb18e1f5a6344449f#p75530"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: genetic disposition to pnemonia",
    "content": "Hello --  While it is a rare genetic defect, there is such a one and it's well worth investigating the posibility that your daughter has inherited the trait you had to deal with. Since what she has is being called \"atypical\" pneumonia and is being treated with multiple approaches, it seems likely this is a familial thing. It's definitely worth a look, and even if your pediatrician feels this is unlikely I personally would request referral to a genetic counselor just to be certain this is not a heritable trait, as it could then turn up in subsequent generations and knowing if it's present is always useful information. If it's just a bizarre coincidence all the better, but this should be ascertained before writing this off to just bad luck. It seems a little too close for that.   I hope  this is helpful. Good luck to you and please follow up with us here as needed.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Sat Apr 25, 2009 9:28 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=75809&sid=7525041e432efc9bb18e1f5a6344449f#p75809"
  },
  {
    "author": "Khalil  Guest Posts: 1 Joined: Sun Mar 29, 2009 2:42 pm Gender: Male",
    "title": "Pneumonia with no fever",
    "content": "My son is 5 months old. 10 days back he developed whistling breathing with chest whizzing. He was diagnosed as having allergy and was given Decadron (Cortizon-bsed infant drug). When the symptoms continued for 5 days, a chest X-ray was done and he was diagnozed with Pneumonia taking 3/4 of the right lung. He never had fever, he was all the way active, though had lack of apetite for 3 days.  Doctors treating him were puzzeled by the fact that this baby has this X-ray as normally in such babies they are in hospital already.  He's being treated now by antibiotics at home. A blood exam yesterday was normal with no infection shown.  We are puzzled. Is there a Pneumonia with no fever? Are the X-ray symptoms of his right lung due to Cortizan?\n\n",
    "posted_time": "Post  by Khalil » Sun Mar 29, 2009 2:56 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=72348&sid=7525041e432efc9bb18e1f5a6344449f#p72348"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Pneumonia with no fever",
    "content": "Hello --  There are two reasons, as a rule, that a pneumonia may present without fever. First, some viral pneumonias simply never rise to the level of febrile, although with such a large amount of one lung involed this is surprising. There is a second possibility too, however. There is a form of pneumonia known as bronchiolitis obliterans organizing pneumonia or B.O.O.P. This is not an infectious pneumonia and usually will not trigger a fever (although it can). This type is usually of unknown cause, but is frequently found to be due to some inhaled or ingested substance which happens to trigger it.   There is also a possibility that, if cortisone (as Decadron) was administered, this may have suppressed any fever entirely, and this is the most likely cause of this in your son's case. Since steroids suppress inflammation they also suppress fever, and this is probably why,  by the time pneumonia was diagnosed, there was no fever.  I hope this answers your question. Best of luck to you.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Thu Apr 02, 2009 8:34 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=72900&sid=7525041e432efc9bb18e1f5a6344449f#p72900"
  },
  {
    "author": "fritz  Guest Posts: 2 Joined: Sat Jan 17, 2009 8:33 am Gender: Male",
    "title": "lingering fever, chills, rigors, dyspnea after pneumonia",
    "content": "49-year old male.  No previous health problems.  After exposure to friends who had been ill for 4 weeks, I experienced a fever, sore throat, body aches, and headache eight weeks ago.  Four weeks later I was diagnosed with pneumonia.  Z-pack helped but didn't cure.  Follow-up chest x-ray was clear.  Sputum culture clear. Next prescribed Bactrim: caused severe allergic reaction at end of dosage.  Three days ago had a post-check with the physician who could not hear anything further in my lungs.  Same night I continued running fever >101. Began Levaquin yesterday.  Ran fever of 102.1 at night.     I seem to be relatively functional throughout day (although dyspnea and productive cough remain and energy level is quite low), but continue to run a nightly fever with chills, rigors, and uncontrollable coughing fits for a few hours late each evening.   Chest only hurts when coughing.  My wife also has been sick for the past six weeks which started the same way but has not progressed to pneumonia.  She continues to struggle with moist cough and energy level.  (Proximity to me is likely a factor.)  I can understand the dyspnea & cough lingering, but cannot understand why I continue to run nightly fevers.  Should other tests be performed to lend insight?\n\n",
    "posted_time": "Post  by fritz » Sat Jan 17, 2009 8:57 am",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=68706&sid=7525041e432efc9bb18e1f5a6344449f#p68706"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: lingering fever, chills, rigors, dyspnea after pneumonia",
    "content": "Hello -  Since you've had a clear chest x-ray fairly recently but continue to have these symptoms and your wife is also having similar problems, you likely have a more stubborn form of bacterial or perhaps fungal pneumonia (or perhaps relapsing bronchitis which could cause pneumonia to start back up again). You're currently on a pretty strong antibiotic and hopefully your wife is being treated as well.   Have you been cultured to determine what, exactly, is causing the infection? This may be up for grabs, diagnosis-wise,and could warrant a change in medical therapy to knock this thing out once and for all. This would be my one suggestion, except that I can hardly imagine it wasn't already done. If not, though, that would be the one thing I'd ask to be added: blood cultures and sputum cultures. Perhaps even if you did have this done before it should be repeated, since there may have been an opportunistic bug that's moved in as often happens after a serious pulmonary infection.  I hope this is helpful. Best of luck to you both, and please follow up here as needed.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Sat Jan 17, 2009 8:52 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=68780&sid=7525041e432efc9bb18e1f5a6344449f#p68780"
  },
  {
    "author": "fritz  Guest Posts: 2 Joined: Sat Jan 17, 2009 8:33 am Gender: Male",
    "title": "Re: lingering fever, chills, rigors, dyspnea after pneumonia",
    "content": "I asked our doctor about ordering blood work, but she said she wouldn't know what to look for, so she has referred me to an infectious disease specialist.  In the meantime, my fever has gone away and I'm beginning to feel slightly better. Since the appointment with the specialist is not for another week and a half, I wonder if it will be necessary, but am thankful to finally feel as though I may be recovering.\n\n",
    "posted_time": "Post  by fritz » Fri Jan 23, 2009 9:57 am",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=69462&sid=7525041e432efc9bb18e1f5a6344449f#p69462"
  },
  {
    "author": "tbekkb  Guest Posts: 2 Joined: Tue Dec 30, 2008 7:36 am Gender: Male",
    "title": "Hard Cough-Blackout",
    "content": "I am a 49 yr old male smoker with a recent cold/cough. At times (3-4)I have coughed so hard I blacked out and fell down. It seems to be getting worse and more often. I have taken some over the counter cold/cough meds the last few nights just to sleep. The cough is much worse at night due to drainage from my nose. The blackouts are making me panic.\n\n",
    "posted_time": "Post  by tbekkb » Tue Dec 30, 2008 8:20 am",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=66366&sid=7525041e432efc9bb18e1f5a6344449f#p66366"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Hard Cough-Blackout",
    "content": "Hello -  Passing out due to excessive hard coughing is not at all unusual, but it's also not something you want going on, as you can get hurt on your way to the floor. The cough is the culprit, and you're going to need to find something that will help manage both the post-nasal drainage and the  cough. An antihistimine along with an expectorant. For the latter purpose (to loosen the secretions and help cough up what's down there without knocking yourself literally out) guaifenesin, brand-name Mucinex, is good. Also any cough medication that contains dextromethorphan should  help.   In the meantime, please do your best to not let the ticking and  congestion lead you into paroxysms of coughing, and if this is impossible then please make sure you're sitting down when you start to cough so as to avoid injury by falling. Try your best to avoid getting into these \"spells\", as they also aren't especially good for the pressure they cause inside your head. Again, this is a fairly common problem, but it's no fun. No need to panic, but please  take the appropriate precautions when it's happening. If it doesn't resolve within a day or two you'll  need to be seen by a regular MD as you may have a bacterial infection and might need an antibiotic to get this cleared up.  Best of luck to you. Please follow up with us as needed.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Wed Dec 31, 2008 9:56 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=66509&sid=7525041e432efc9bb18e1f5a6344449f#p66509"
  },
  {
    "author": "tbekkb  Guest Posts: 2 Joined: Tue Dec 30, 2008 7:36 am Gender: Male",
    "title": "Re: Hard Cough-Blackout",
    "content": "Thanks, I did visit with a Doctor prior to your reply and the information as you stated was correct.\n\n",
    "posted_time": "Post  by tbekkb » Fri Jan 02, 2009 8:43 am",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=66649&sid=7525041e432efc9bb18e1f5a6344449f#p66649"
  },
  {
    "author": "amnetdoc  Guest Posts: 1 Joined: Mon Nov 03, 2008 9:39 pm Gender: Male",
    "title": "round  pneumonia and post  pneumonia cough",
    "content": "I am 40 years old and non smoker. 7 weeks back I had high fever  and admitted to hospital. Initially doctors  thought  It's  TB.  So they did x- ray and found shadow in upper left corner of the  lungs Then they did CTScan. After that they realize that it's pneumonia.  and started giving anti-biotics. I stayed hospital 8 days. Then doctors did bronoscopy and biopsy. In the biopsy reports they just found  inflamotary cell  no other bad things. And also said it's infection and prescribed levaquin for 10 days.  After that they discharged me from hospital and asked  for follow up  after two weeks.  I am doing well now.  I had post pneumonia cough and doctor gave amox-clav for that. cough,  now  almost gone away.  Now primary doctor asked me to go for another CTScan to make that  shadow gone completely.   My concern is when they found nothing even in biopsy  and diagonize  as round pneumonia then do I relay need another CTScan?  I am feeling strong and good, even went for a short hiking trip.    thanks am\n\n",
    "posted_time": "Post  by amnetdoc » Mon Nov 03, 2008 10:33 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=63103&sid=7525041e432efc9bb18e1f5a6344449f#p63103"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: round  pneumonia and post  pneumonia cough",
    "content": "Hello -  The CT is a good idea because with pneumonia and other pulmonary diseases, there can be lesions  left which can either reactivate, or can become calcified. It's important, even if there is a calcified nodule left over from this, that it be noted, so that in the future if you have chest imaging done and something \"odd\" shows up, it can be correlated with the CT finding. If nothing is found, all the better. Either way, it's a wise thing to do. Glad you're feeling fine now. Pneumonia can be really insidious, as you've found out.  I hope this answers your question. Best of luck to you.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Tue Nov 25, 2008 9:19 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=64884&sid=7525041e432efc9bb18e1f5a6344449f#p64884"
  },
  {
    "author": "Docwhiskey  Guest Posts: 1 Joined: Wed Nov 12, 2008 10:34 am Gender: Male",
    "title": "Post pneumonia sputum",
    "content": "In November of 2003 I had pneumonia (I was 24 at the time).  Once I was diagnosed and treated I obviously started feeling better.  However, since then I have been coughing up sputum almost on an every other day basis (it is mostly clear and thick, though occasionally it is white).  My doctor doesn't seem to think anything of it, and I have had several chest x-rays since then and nothing has ever been found.  But I am slightly worried as before I got pneumonia I never had this problem, but since I have.  Is this something that I am going to just have to deal with, or is there something else at work here?\n\n",
    "posted_time": "Post  by Docwhiskey » Wed Nov 12, 2008 10:45 am",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=64017&sid=7525041e432efc9bb18e1f5a6344449f#p64017"
  },
  {
    "author": "Debbie Miller, RN  Nurse Posts: 4746 Joined: Mon Apr 16, 2007 2:41 pm Gender: Female Location: USA",
    "title": "Re: Post pneumonia sputum",
    "content": "Hello This will probably get better but it is not unusual to have lingering symptoms such as this for a while.  Without other signs of infection - fever, chills, etc. it is probably within the normal limits.  Best wishes.\n\n",
    "posted_time": "Post  by Debbie Miller, RN » Sun Nov 16, 2008 11:25 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=64467&sid=7525041e432efc9bb18e1f5a6344449f#p64467"
  },
  {
    "author": "virtualhost  Guest Posts: 2 Joined: Sun Nov 02, 2008 6:29 pm Gender: Female",
    "title": "Required room temperature for those with pneumonia",
    "content": "I was just diagnosed with pneumonia and I've been having chest pains. For 3 weeks now, it seems that there's a mass or something heavy in my upper chest, giving me a hard time to breath. I cough most of the time and breath as if I have asthma (i never had asthma before). Im taking medicines, tho.  Im a technical support for a data center and just last week, 5 people including myself was assigned to work at the server room where I am exposed to a lot of servers and routers with a 17 degree room temperature, quite cold.    Will this aggravate my pneumonia? What other health risk might cause me and my co-employees having been assigned to work in a 6 square meters server room with 17 degrees temperature?  Thanks in advance.\n\n",
    "posted_time": "Post  by virtualhost » Sun Nov 02, 2008 7:06 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=62984&sid=7525041e432efc9bb18e1f5a6344449f#p62984"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "Re: Required room temperature for those with pneumonia",
    "content": "Hello, Pneumonia is a sever form chest infections that is diagnosed primarily by clinical picture, examination and radiological investigation of the chest (X-ray or CT).  The causative organism is defined by sputum culture and sensitivity as a wide variety of bacterial and viral organisms can cause pneumonia. Fungal infections are more seen in immunocompromised patients.  Treatment is in the form of antibiotic course that is usually long enough to eradicate the infection. Doses, duration and type of antibiotic therapy is determined by the severity and the type of infection. Hospitalization is usually needed in most of the cases.  Physician usually recommend a follow up X-ray in 2-4 weeks of treatment to make sure that the lungs are clean and the patient is not at risk of complications.  Your symptoms indicate that your lung or at least the bronchi is still recovering and more cautions is needed. Avoiding cold moist air, specially sudden changes in the temperature of the surrounding environment, closed places, smoking etc is an important measure.  If you are on antibiotics for that period of time and you do not have a colored (yellow, dark, green) sputum, it is less likely that you are still infective and people around are not at risk of catching infecting from you.   However, it is always better to follow up with your Doctor get checked properly to ensure your and your colleagues safety. He will be more aware of your condition and will advise you with the most convenient measures to avoid relapse.  Hope you find this information useful. Please keep us updated. Best regards.\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Fri Nov 07, 2008 1:36 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=63468&sid=7525041e432efc9bb18e1f5a6344449f#p63468"
  },
  {
    "author": "virtualhost  Guest Posts: 2 Joined: Sun Nov 02, 2008 6:29 pm Gender: Female",
    "title": "Re: Required room temperature for those with pneumonia",
    "content": "Thank you, Dr. Mamoud for the advise; really appreciate it.  I don't have a colored sputum, just a colorless but quite thick matter when I cough.  The server room where I used to work 8 hours a day/6 days a week is an enclosed room and its pretty cold.  Will this worsen my pneumonia? I heard that certain viruses/bacterias love cold places.\n\n",
    "posted_time": "Post  by virtualhost » Fri Nov 07, 2008 8:30 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=63523&sid=7525041e432efc9bb18e1f5a6344449f#p63523"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "Re: Required room temperature for those with pneumonia",
    "content": "Hello, As I said before you seem to be not completely recovered so more cautions is needed. Avoiding cold moist air (like air conditions), especially sudden changes in the temperature of the surrounding environment, closed places; smoking etc is an important measure.  If this can not be done you better be checked by your doctor he would recommend an X-ray chest to make sure your lungs are clear.  Follow up with your doctor would be essential once any symptoms occur. Please keep us updated. Best regards.\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Mon Nov 10, 2008 3:14 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=63772&sid=7525041e432efc9bb18e1f5a6344449f#p63772"
  },
  {
    "author": "dusty ford  Guest Posts: 1 Joined: Mon Jan 02, 2006 9:31 pm Location: england",
    "title": "post pneumonia chest pain",
    "content": "Hello and happy new year to all!  I would like to ask as i am very curious.  I had pneumonia nearly 4 years ago.  I was in quite a bad state with it.  I had pneumoccocal pneumonia, septiceamia, DIC, renal failure and then my lung collapsed as well as getting MRSA.  Thats all what i can remember and excuse the spelling mistakes.  But ever since then i have had re-occurant chest pains every now and again in exactly the same place as the pneumonia 4 years ago, which is the right lung and towards the top.  Most of the time it is a dull ache, but sometimes the pain can be quite a sharp aching pain and can last for hours.  I get the pain if i have been lying still or go into the cold or i am stressed.  I have also got the pain for no apparent reason at all too.  I have been to the doctor many a times to be told that its just muscle pain and it will go away with time and to take pain relief if it occurs, but being 4 years on i would like to know if this is ever going to go away or is it something that i have to live with now as a result.  Please can someone help me understand whats going on and how long it is likely to persist and how to help alleviate the pain when it occurs.  Thank you very much.\n\n",
    "posted_time": "Post  by dusty ford » Mon Jan 02, 2006 9:56 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=27600&sid=7525041e432efc9bb18e1f5a6344449f#p27600"
  },
  {
    "author": "amojade  Guest Posts: 2 Joined: Wed Dec 28, 2005 1:29 pm Location: Omaha, NE",
    "title": "Costo?",
    "content": "Have you looked up or talked to your dr about costochondritis? I'm not a dr or anything but I recently had pneumonia and developed this afterwards. I'd look it up and see if possibly your symptoms are similar. =)\n\n",
    "posted_time": "Post  by amojade » Fri Feb 17, 2006 7:00 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=30892&sid=7525041e432efc9bb18e1f5a6344449f#p30892"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: post pneumonia chest pain",
    "content": "Hello dusty ford -  While amojade has given you one excellent suggestion (as well as a very good observation about possible pneumonia), the description of your discomfort doesn't sound as much like costochondritis (although it certainly could be); with all you went through during your bout of pneumonia I'm thinking it's  possible there could be some lasting sensitivity from the pnuemothorax (collapsed lung) or just the area in general. This could be pleuritic pain or something of a similar nature. Of course the treatment for it would be the same as for costochondritis, which would be to take an over-the-counter non-steroidal anti-inflammatory like ibuprofen or naproxyn (Advil or Aleve). If this were to fail to help then I'd strongly suggest a second opinion, as muscle pain shouldn't last four years either.   Hope this is helpful.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Fri Jul 18, 2008 8:25 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=58868&sid=7525041e432efc9bb18e1f5a6344449f#p58868"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "Re: post pneumonia chest pain",
    "content": "I agree with John!\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Sat Sep 20, 2008 10:51 am",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=61056&sid=7525041e432efc9bb18e1f5a6344449f#p61056"
  },
  {
    "author": "davetiznado  Guest Posts: 1 Joined: Mon Sep 01, 2008 12:50 pm Gender: Male",
    "title": "sharp stabbing pain on both sides of my chest",
    "content": "Hello im 16 years old and ive been having sharp stabbing pains that come and go, i get them on the both sides of my chest. on the right side i get it about 2 inches away from my nipple towards the inside of my chest.. the same on the left side. i also have a cough at night that has yellowish mucos and somtimes i feel like my throat tightens a little could this pneumonia. right now i havnt been to a doctors office because im currently in mexico, And there is no doctor around. I am waitng for the 5th when i get back to go visit him.\n\n",
    "posted_time": "Post  by davetiznado » Mon Sep 01, 2008 1:09 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=59668&sid=7525041e432efc9bb18e1f5a6344449f#p59668"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: sharp stabbing pain on both sides of my chest",
    "content": "Hello -  What you describe could be on the way to becoming pneumonia but at present sounds more like acute bronchitis (which is often a precursor of pneumonia when untreated). The tightening sensation in your throat would be consistent with pharyngitis secondary to a sinus infection draining post-nasally into your throat and on into the brochial tree. Hopefully you'll have seen  a doctor by now and will have been placed on an antibiotic, which would seem appropriate given the colorful discharge.   I hope you're doing well. Please do follow up with us. Best of luck to you.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Sat Sep 06, 2008 11:26 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=60010&sid=7525041e432efc9bb18e1f5a6344449f#p60010"
  },
  {
    "author": "Gulet  Guest Posts: 1 Joined: Fri Dec 30, 2005 7:27 pm Location: St. paul, minnesota",
    "title": "I sometimes have pain on the left side of my chest",
    "content": "The left side of my chest pains sometimes, to the extent that I can't sleep well. This pain also makes it hard for me to breath normally. I take so long before I go through it, but I know it's something that has followed me for years. So please help tell me whether what I have is pneumonia or anything else, and how to get medication. Thank you.\n\n",
    "posted_time": "Post  by Gulet » Fri Dec 30, 2005 7:44 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=27435&sid=7525041e432efc9bb18e1f5a6344449f#p27435"
  },
  {
    "author": "derek  Guest Posts: 14 Joined: Sun Jan 22, 2006 5:01 am Location: scotland",
    "title": "[no title]",
    "content": "I beleive that what it is you suffer from is simply muscular tension and the muscle seizes up and you are unable to breathe. pneumonia does not last for years but instead it lasts a few days if untreated then it will send you to hospital. If you simply wait a few minutes it will disperse. if it troubles you lots then you must go to your doctor and tell him/her  derek\n\n",
    "posted_time": "Post  by derek » Thu Dec 14, 2006 1:56 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=36169&sid=7525041e432efc9bb18e1f5a6344449f#p36169"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: I sometimes have pain on the left side of my chest",
    "content": "Hello -   As derek says, pneumonia wouldn't last for years. It can last a lot longer than a few days, though, just for the record, and people can have it for weeks or months before it is diagnosed. There are many kinds of pneumonias, but most of them have many other symptoms besides pain (if any, it is usually an ache in the ribs on the affected side). You may well have costochondritis, an inflammation of the cartilege between the ribs. You could also have a pinched nerve, or at least one that becomes pinched when you are in the most comfortable posture for going to sleep. It is probably an orthopedic problem. If an anti-inflammatory over-the-counter drug like ibuprofen (as Advil, for instance) helps, then it is an inflammatory collagen problem. If that doesn't help, then you should have a doctor evaluate you for possible nerve or other orthopedic problem involving your ribs on the affected side.  I hope this is helpful. Good luck to you.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Fri Jul 25, 2008 9:35 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=58981&sid=7525041e432efc9bb18e1f5a6344449f#p58981"
  },
  {
    "author": "Jamiehaddock  Guest Posts: 1 Joined: Tue Oct 19, 2004 3:30 pm Location: Texas",
    "title": "Coughing up thick stuff - Should I be worried??????",
    "content": "I started getting sick about a week and a half ago I spent 3 days in bed with what feels like the flu,, coughing didnt produce much then but   had runny nose,,just had no energy haf way crying from the sickness then I thought i felt better i starting moving around a little but still very weak then the next 3 days i coughed up extremely thick stuff  throwing up any thing i have eaten I have blown my  nose so much that it bleeds and it got a row and now scabby around the edges  Needless to say 3 days were spent in the bathroom near the toilet I cant lay down because I start having a coughing attack Im not coughing as much now  but still feel really sick I am exhausted and having trouble breathing yet it seems im breathing harder and now i have a wierd tingly feeling in my chest kinda like its asleep...please tell me its a bad flu and its stay wont last much longer because im scared to death to go to the dr\n\n",
    "posted_time": "Post  by Jamiehaddock » Tue Oct 19, 2004 4:33 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5952&sid=7525041e432efc9bb18e1f5a6344449f#p5952"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Should i be worried?",
    "content": "Dear Jamie,  If you are having new difficulty breathing, you should go to the doctor to be evaluated right away.  This could be a bad case of the flu and it could be comlicated by pneumonia.  What are you afraid of when you go to the doctor's?  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.  Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Tue Oct 19, 2004 4:49 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5953&sid=7525041e432efc9bb18e1f5a6344449f#p5953"
  },
  {
    "author": "fearless74  Guest Posts: 4 Joined: Thu Sep 08, 2005 11:42 pm Location: california",
    "title": "PLEURISY?",
    "content": "I also have a question, I had gotten streptoccocal pneumonia, and it infected my blood and both my lungs collapsed as a result, one lung completely and the other was half way collapsed. i was in ICU for a long time, my heart rate was 225 and they couldn't lower my blood pressure, I thought I was going to die..this was 2 years ago, but still now I suffer greatly with lung pain, and my old doctor said its just pleurisy..can it be after this long? i do have pain killers but seems this is so common, and the pain is intense at times. should I get a second opinion? or is this a common result in such a severe case? thank you Amy\n\n",
    "posted_time": "Post  by fearless74 » Thu Sep 08, 2005 11:46 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=20185&sid=7525041e432efc9bb18e1f5a6344449f#p20185"
  },
  {
    "author": "xyzmale  Guest Posts: 3 Joined: Wed Oct 12, 2005 4:42 pm Location: NY",
    "title": "i almost always have slight phlegm in throat",
    "content": "i almost always have a little phlegm in my throat and it produces bad odor. It never goes away... symptoms get worse and better. should i be worried?\n\n",
    "posted_time": "Post  by xyzmale » Thu Oct 13, 2005 2:15 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=23272&sid=7525041e432efc9bb18e1f5a6344449f#p23272"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Should I be worried??????",
    "content": "Hi Amy -  Yes, unfortunately, following a very severe pneumonia such as you experienced pleurisy can become chronic and should be treated with non-steroidal anti-inflammatory drugs such as ibuprofen or naproxyn. Therapeutic use of these can sometimes resolve the underlying inflammation although it is inclined to recur from time to time.  I hope this is helpful to you.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Fri Jul 18, 2008 10:33 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=58872&sid=7525041e432efc9bb18e1f5a6344449f#p58872"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Should I be worried??????",
    "content": "Hello xyzmale -  Your problem is a very common one. It is usually caused by postnasal drip due to allergy and/or a possible chronic sinus infection. This latter can produce pretty unpleasant breath odor along with pharyngeal irritation from the PND. There are several ways of combatting this: one, try and get any occult sinus infection resolved or allergy under control. Also, to help the phlegm move more readily and with less annoyance, an over-the-counter medication called guafenaisin (there is also a long-acting brand called Mucinex, and there are now long-acting generic versions as well) can help liquify, loosen and sometimes eliminate the phlegm. Drying antihistimines may be needed but also contribute to the thickened secretions because of the drying effect and sometimes lead to blocked and eventually infected sinuses. Seeing an ear, nose and throat specialist may be in order.  I hope this is helpful.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Fri Jul 18, 2008 10:39 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=58873&sid=7525041e432efc9bb18e1f5a6344449f#p58873"
  },
  {
    "author": "bugeye  Guest Posts: 1 Joined: Thu Aug 04, 2005 10:54 am Location: ga",
    "title": "Post pneumonia (Staph) continued sholder collar bone pain",
    "content": "My husband was first diagnosed with pleurisy and given pain medicine.  Pain increased in shoulder greatly, temp went to 103 degrees.  He was taken to hospital and admitted to ICU.  Sputum culture identified Staph infection.  His BP dropped and his heart rate raised to over 200.  Had other tests and was diagnosed with pneumonia.  Had IV antibiotics and pain medicine while in hospital 6 days.  He completed 10 days of antibiotics at home after released from hospital.  It has been about 2 to 3 weeks since he completed antibiotic treatment.  He is still having pain in right  shoulder, upper arm, and collar bone. No increase in temperture, BP normal, Temp Normal.  Please advise.  Thank you for your time.\n\n",
    "posted_time": "Post  by bugeye » Thu Aug 04, 2005 1:03 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=18107&sid=7525041e432efc9bb18e1f5a6344449f#p18107"
  },
  {
    "author": "piffero  Guest Posts: 1 Joined: Thu Aug 04, 2005 6:19 pm Location: australia",
    "title": "pneumonia",
    "content": "I, too, have recently had pneumonia and am now on the mend. But I still get very tired and also have intermittent sharp shoulder pain (left shoulder), so would be very interested in any replies to Bugeye. Piffero\n\n",
    "posted_time": "Post  by piffero » Thu Aug 04, 2005 6:24 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=18120&sid=7525041e432efc9bb18e1f5a6344449f#p18120"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Post pneumonia (Staph) continued sholder collar bone pain",
    "content": "Hello bugeye -   Chronic pleuritic pain following acute pneumonia is not all that rare and should be treated with non-steroidal anti-inflammatory drugs. It sounds like your husband had a very severe case of pneumonia and with all the various inflammatory processes, irritations, and interventions the pleura could be severely irritated or sensitized. Ibuprofen and naproxyn are the usual drugs of choice to reduce the inflammation and resolve the pain if this is, indeed, the case.   I hope this is helpful and that by now the pain has subsided.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Fri Jul 18, 2008 10:25 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=58871&sid=7525041e432efc9bb18e1f5a6344449f#p58871"
  },
  {
    "author": "Butterfly  Guest Posts: 2 Joined: Sat Jul 30, 2005 1:31 pm Location: FL",
    "title": "Pneumonia twice in 5 months",
    "content": "I have been hospitalized 2x w/pneumonia in the past 5 months.   I am a 30 yr. old with no previous medical conditions.  My first round of pneumonia, I was in the hospital for 2 weeks with a high fever.  It took me about a month to recover.  While in the hospital, a cardiologist was consulted and took care of me.  This past July, I got it again.  Instead of going to my general MD, I went straight to my cardiologist when I felt the first sign.  My third trip to the hospital, I was diagnosed w/some kind of GI infection. I just got out today, I was in for 5 days.  They could not figure out the source of the infection.  All I could really get out of the Dr.'s was that I have white blood cells in my stool and they tested it for multiple things and could not figure out what was causing it.  My cardiologist stopped by my hospital room yesterday and told me he was not happy about me being in the hospital again and there are some things he was going to look in to.  I have an appointment w/him next week.    I am scared with all of this sickness I have had.  Do you have any suggestions as to what kind of questions I should ask my cardiologist?  Why would my cardiologist be concerned w/GI problems?  Do the two go together in some way that I do not understand?\n\n",
    "posted_time": "Post  by Butterfly » Wed Aug 17, 2005 11:05 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=19008&sid=7525041e432efc9bb18e1f5a6344449f#p19008"
  },
  {
    "author": "prison526  Guest Posts: 3 Joined: Sun Sep 18, 2005 10:03 pm  Contact:   Contact prison526       Website",
    "title": "Fake",
    "content": "I have been hospitalized 2x w/pneumonia in the past 5 months.   I am a 30 yr. old with no previous medical conditions.  My first round of pneumonia, I was in the hospital for 2 weeks with a high fever.  It took me about a month to recover.  While in the hospital, a cardiologist was consulted and took care of me.  This past July, I got it again.  Instead of going to my general MD, I went straight to my cardiologist when I felt the first sign.   So where can i get the real one from then?\n\n",
    "posted_time": "Post  by prison526 » Sun Sep 18, 2005 10:03 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=20999&sid=7525041e432efc9bb18e1f5a6344449f#p20999"
  },
  {
    "author": "Butterfly  Guest Posts: 2 Joined: Sat Jul 30, 2005 1:31 pm Location: FL",
    "title": "PREDNISONE (PNEUMONIA)",
    "content": "I posted something earlier about how I have gotten pneumonia 2X since March of this year.  I got it again.  My doctor's are testing me for all kinds of stuff to see why I keep getting so sick.  But, what I want to ask about is the drug Prednisone.  This time, I wanted to do this out-patient.  So, they put me on 60mg of prednisone immediatley.  And dropped me down 10 mg @ at time.  They have leveled me out at 20mg x2 weeks.  I get to drop to 15mg tomorrow and see my Dr. again the following week for follow up.  Wow...prednisone...I got extremley depressed this time. Is there another drug they can give me besides prednisone?  I honestly scared myself this time in the depression.  I did not first realize it was a side effect of the drug.  I thought I was going crazy.  I do not want to have to take this ever again.  Any suggestiions for another drug?  Is this a normal side effect of the drug?  Can they put me on anti-depressants if they have to give this to me again?\n\n",
    "posted_time": "Post  by Butterfly » Sun Oct 30, 2005 4:49 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=24342&sid=7525041e432efc9bb18e1f5a6344449f#p24342"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Pneumonia twice in 5 months",
    "content": "Hello Butterfly -  There are several aspects of your problem which I'd like to get some more information on: first, why a cardiologist was in charge of your case unless a) he also functions as an internist or intensivist or b) he has taken an interest in your case; second, why you would be treated for pneumonia with Prednisone if you were running a fever. Normally pneumonia with fever is because of an infection, and Prednisone would be contraindicated in most instances, as it would mask the signs of infection. Generally Prednisone is used only for pneumonias which are not caused by microbes,  such as bronchiolitis obliterans organizing pneumonia (BOOP) or other forms caused by autoimmune responses.   The use of Prednisone also can suppress your immune system, which might have accounted for the second bout of pneumonia, but again there is that issue of the fever, something not usually seen except in infectious pneumonias. This takes us full circle, since iinfections are rarely treated with steroids.  As for the GI infection and why a cardiologist would be interested in that, I can only surmise that the cardiologist was following through because of having taken an interest in your case or in you as a patient. There seems to be nothing going on with your heart.   If you could provide any more details it might help to untangle the mystery. Meanwhile I certainly hope this finds you well. Please  follow up with  us.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Fri Jul 18, 2008 10:18 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=58870&sid=7525041e432efc9bb18e1f5a6344449f#p58870"
  },
  {
    "author": "tiameag3971  Guest Posts: 1 Joined: Mon Mar 03, 2008 4:13 pm Gender: Female",
    "title": "Pneumonia and Broken Rib??",
    "content": "I went to the ER, had x-rays and was diagnosed with pneumonia 1 week ago today and have been taking Levaquin 500 mg once daily (to be taken 10 days)  along with a breathing treatment of Atrovent .250 mg/ml and Berotec every 6-8 hours. I started out taking Amoxicillin but I had an allergic reaction so the Dr. started me on the Levaquin last Monday. I have no fever, no headache just an ugly cough at night and I'm still coughing up light yellow/green mucous. It has improved but it's been a week and I still hear the crackles and wheezing in my lungs.  I'm now experiencing pain in the lower part of my right rib cage when I move a certain way and it's hard to get comfortable lying down. You can imagine the pain when I need to cough. My question is should the wheezing and crackling still be going on if my last antibiotic will be taken in 2 days? Do I need another round? Also what can be done for a fractured/broken rib?   Please Help!! I am miserable :(\n\n",
    "posted_time": "Post  by tiameag3971 » Mon Mar 03, 2008 5:48 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=54951&sid=7525041e432efc9bb18e1f5a6344449f#p54951"
  },
  {
    "author": "Dr. A. Madia  Medical Doctor Posts: 207 Joined: Fri Jan 06, 2006 6:50 am Gender: Male Location: India",
    "title": "Re: Pneumonia and Broken Rib??",
    "content": "Hi,  A pneumonia is a consolidation of lumgs' air exchange spaces which fill up with infected secretions. The inflammation caused by this extends to the Pleura [membrane covering the lungs] also, and it is this which causes,the pain when you cough.   If you are not improving with antibiotics a change is needed but this time the antibiotic should be changed as per the Culture-sensitivity testing done from the sputum.  If the pain in the ribcage has appeared or got worse, a repeat X ray shoul be done to rule out an associated Pleural Effusion [collection of fluid in the membrane].  Take care,   Apurva\n\n",
    "posted_time": "Post  by Dr. A. Madia » Tue Apr 15, 2008 3:00 am",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=58083&sid=7525041e432efc9bb18e1f5a6344449f#p58083"
  },
  {
    "author": "re_becca  Guest Posts: 10 Joined: Wed Mar 12, 2008 8:02 pm Gender: Female",
    "title": "Pain after getting pnemonia in the middle of January",
    "content": "In January I got bacterial pnemonia causes by a staff infection, and almost died.  My mother was told that if I had gotten to the hopsital even two hours latter that I would have died.  I was in the room when she was told this, but completly out of it and didn't hear.  It's two months later, and I still have pain in my chest, and still have breathing and intensivied pain if I do anything phsycial like go down stairs to get something and come back up.  Last week I went to see my doctor about it.  She was in the middle of telling me I had something really long that started with ch, when her receptionist came in and said that the day care was calling.  My doctor asked her to take a message, and the receptionist said it there was an emergency regarding her child.  She left in a hurry, and I left shortly afterwards (what's the use of sticking around when the doctor has left).  I did understand why she left though.  I don't want to make another appointment for the same thing, and ask for to to explain what she was saying.  It was a long word, and I don't remeber the name of it.  Would you happen to know?  Can you explain it?\n\n",
    "posted_time": "Post  by re_becca » Wed Mar 12, 2008 8:20 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=55814&sid=7525041e432efc9bb18e1f5a6344449f#p55814"
  },
  {
    "author": "Dr. A. Madia  Medical Doctor Posts: 207 Joined: Fri Jan 06, 2006 6:50 am Gender: Male Location: India",
    "title": "Re: Pain after getting pnemonia in the middle of January",
    "content": "Hi Re_becca,  Pneumonia is infection of the lower resoiratory tract which consist of terminal bronchioles and alveoli that is the bubble like micro cavities responsible for gas exchange. These alveoli get infected and are filled with products of inflammation and are temporarily out of commission an cannot do their function of gas exchange. Technically this process of alveoli infection is called Consolidation. Severe forms can lead to hypoxia.[Low oxygen tension in blood.]  Complications of pneumonia can be Pleural effusion [Fluid filling bet the lungs and covering membrane], Empyema [pus in that same pleural cavity], Lung abscess, bacteremia [spread of bacteria in blood], septicemia [spread of infection throughout the body], septic arthritis, Infection of the heart muscle [myocarditis, endocarditis, pericarditis etc]. Most dreaded one is ARDS [acute respiratory distress syndrome] and respiratory failure. [You just possibly had this when your doctor said you could have died.]  I can't think of any other complication of pneumonia other than these and starting with a Ch. Your doctor could possibly mean a Chronic Bronchitis but this is not a complication of pneumonia, and an entirely different disease.  You should get in touch with your doctor on this and in fact it will throw some more light on the reason of your current breathlessness.   Apurva\n\n",
    "posted_time": "Post  by Dr. A. Madia » Mon Mar 17, 2008 11:31 am",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=56175&sid=7525041e432efc9bb18e1f5a6344449f#p56175"
  },
  {
    "author": "re_becca  Guest Posts: 10 Joined: Wed Mar 12, 2008 8:02 pm Gender: Female",
    "title": "Re: Pain after getting pnemonia in the middle of January",
    "content": "Thank you Dr. Madia:  I've been thinking I should go back to see her too.  I certianly understand that an emergency with her child took presidence over me, being a child-care provider myself.  But...  I didn't get to ask any questions, or even get her to repeat the name she just said (which is the name of what she thought I had).  So I guess I should return.\n\n",
    "posted_time": "Post  by re_becca » Tue Mar 18, 2008 8:17 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=56307&sid=7525041e432efc9bb18e1f5a6344449f#p56307"
  },
  {
    "author": "star_4487  Guest Posts: 1 Joined: Fri Dec 28, 2007 4:04 am",
    "title": "Do I have walking pneumonia?",
    "content": "My symptoms started out as if I had the flu. I was really tired, my throat hurt, my legs became really sore, my ears started hurting, I had chills-then later got really hot (and at some points nauseous), etc.  (All which I have read are signs of pneumonia). I got better from all that bad stuff that kept me in bed, but after that my throat was still bothersome, I was sneezing a lot etc. Two days ago I woke up and my voice was hoarse. Yesterday it was worse and today it was a little better. Along with the hoarse voice though came a bad cough. It is a dry cough. Once even when I was in a store I got a bad tickle in the throat (only in one spot) that I couldnt get rid of no matter how much I coughed. I was coughing so hard it probably sounded like I was going to throw up. I had to leave the store because it was such a horrible feeling and it wouldnt go away (but did once I ate something). I had that feeling twice before, once right before I got full blown pneumonia, and another time without pneumonia. My cough gets worse and night and worse when I lay down at night for bed. Sometimes I even have to think about breathing because it feels weird upon inhalation, a feeling I cant really describe. I have poor health insurance so a doctor visit is not the best option for me. Do you think this is walking pneumonia? Is there anyway to tell without going to a doctor? Are there any meds that can be prescribed without a visit? Thanks!\n\n",
    "posted_time": "Post  by star_4487 » Fri Dec 28, 2007 4:19 am",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=52156&sid=7525041e432efc9bb18e1f5a6344449f#p52156"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "Re: Do I have walking pneumonia?",
    "content": "Hi Star_4487,  Walking pneumonia is possible.  Walking pneumonia is a common name for an infection also known as an atypical pneumonia.  Atypical comes from the fact that it is caused by mycoplasma an \"atypical\" bacteria.  It is treated with an antibiotic called azithromycin.    Your symptoms may also be caused by the flu.  Influenza can cause all the symptoms you describe.  It is unlikely that you will be able to get prescription medications without being evaluated.  You may want to call your local health department.  Often there are clinics that can see patients without insurance on a free or reduced fee basis.  Your local health department can help you find these clinics.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Fri Dec 28, 2007 9:16 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=52227&sid=7525041e432efc9bb18e1f5a6344449f#p52227"
  },
  {
    "author": "memetosan  Guest Posts: 1 Joined: Sun Sep 09, 2007 2:19 pm",
    "title": "amoxicillin & fever",
    "content": "Hi I have been diagnosed with pneumonia last friday (2 days ago). Since Friday I'm on a cure with amoxicillin.   Now i have a couple of questions, hopefully you can help in answering them.  How soon should I see benefits from amoxicillin?  So far, I noticed that I can breath a little easier and the way I cough has changed.  Still I have fevers during the day of around 39C. How soon should these fevers disappear after using amoxicillin? Is it dangerous to still have fever and continue using amoxicillin?  Although , already now there is some light improvement, how is determined whether the antibiotic is nog good enough?  Thanks very much.\n\n",
    "posted_time": "Post  by memetosan » Sun Sep 09, 2007 2:25 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=47582&sid=7525041e432efc9bb18e1f5a6344449f#p47582"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Memetosan,  Typically, it will take 24-72 hours or so for the antibiotics to begin to take effect and the fevers to begin to improve.  More severe infections can take a bit longer.    It is not dangerous to continue the amoxicillin with a fever.  If you do not see your fevers beginning to improve in the next 1-2 days I would recommend you see your doctor again for a follow-up evaluation.  Occasionally, amoxicillin will not cover pneumonia (although most of the time it will).  This is usually signaled by failure of symptoms, including fever, to resolve.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sun Sep 09, 2007 9:04 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=47618&sid=7525041e432efc9bb18e1f5a6344449f#p47618"
  },
  {
    "author": "ihasan  Guest Posts: 2 Joined: Tue Jul 24, 2007 6:12 am",
    "title": "Strep Pneumonia, hair falling out, bump on rib",
    "content": "In short, I am 27 year old female who used to be very active and healthy and nonsmoker.  4 months ago I had a severe bout of strep pneumonia (in both lungs) and was hospitalized for 10 days.  I have been to numerous doctors and had tons of xrays, 3 catscans (with contrast), several blood tests and pulm function test...everything is coming normal or above normal.    HOWEVER, I am still having a 'squeezing' pain in my lower right lung when I take a deep breath in or yawn.  They are saying this might be damage to the lung wall from the pneumonia. Will it ever go away?  I have also noticed a bump on my left rib (close to the sternum) that has not gotten bigger or moved.  But it has been there since I got out of the hospital and is at times tender.  What could this be?  Lastly, it has been 4 months since I got out of the hospital and my hair is falling out.  It has been falling out for about 2 weeks and is getting noticeably thinner but no bald spots.  Could this be related to the pneumonia? And when will it stop falling out?  As you can see, I have been through quite a rough patch for the past 4 months and am getting more depressed each day.  Given my symptoms are the doctors missing something?    Sorry it's so long. Thank you in advance.\n\n",
    "posted_time": "Post  by ihasan » Tue Jul 24, 2007 6:32 am",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=45111&sid=7525041e432efc9bb18e1f5a6344449f#p45111"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Ihasan,  Chest pain for some time following a severe pneumonia is not uncommon.  It may very well be that you have some inflammation of the lining of your lung (a condition called pleurisy) that is causing some of your pain, especially with deep breathing.  This type of pain is usually well treated with anti-inflammatory medicines.  The spot on your rib may be a normal area that has now become inflamed, also potentially started by the pneumonia or simple brought out the fact that it was there.  Costochondritis can cause significant pain due to the inflammation of the cartilage portion of the rib.  Regarding your hair loss, you may want to have your thyroid level checked.  Testing your cortisol level may also be helpful.  Follow up with your doctor is important to help make sure you are being treated appropriately.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sat Jul 28, 2007 3:02 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=45443&sid=7525041e432efc9bb18e1f5a6344449f#p45443"
  },
  {
    "author": "ihasan  Guest Posts: 2 Joined: Tue Jul 24, 2007 6:12 am",
    "title": "Hair and thyroid",
    "content": "Thank you for your response.  But regarding the hair loss... My latest bloodwork came back okay. There were no signs of thyroid problems or any numbers that were out of range.    So I am curious is it common that the hair loss is related to the pneumonia?  And if it is, how long would a 'normal' time frame be for it to last?   And at this point assuming that is what it is related to...how long should I let it keep falling out? When should I be alarmed and seek further testing?  Greatly appreciated~\n\n",
    "posted_time": "Post  by ihasan » Sun Jul 29, 2007 9:26 am",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=45464&sid=7525041e432efc9bb18e1f5a6344449f#p45464"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "It would be uncommon for pneumonia to cause hair loss.  You may have a condition called alopecia ariata.  This is where the hair begins to fall out, often in circles.  I would suggest that you see your doctor about this.  You may need to see a dermatologist to get a diagnosis.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Mon Jul 30, 2007 10:34 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=45519&sid=7525041e432efc9bb18e1f5a6344449f#p45519"
  },
  {
    "author": "wifeandmom  Guest Posts: 2 Joined: Mon Jul 23, 2007 12:40 am",
    "title": "Pneumonia and Lung Lesion",
    "content": "Hi!  I was diagnosed with double pneumonia nearly 5 weeks ago.  I am a 39 year old female/non-smoker.  I was put on 2 consecutive Z-packs.  2 weeks later after initial diagnosis, they did another chest x-ray and dr said I was still wheezing and sent me to a pulmonary specialist.  The specialist said there was a spot on the x-ray so she ordered a catscan.  I was put on 16 days of prednisone and doxycycline.  Feeling better but chest really tight.  The catscan came back with report that I have a lung lesion.  My blood tests came back positive for mycoplasma.  The dr said the z-packs should have addressed the mycoplasma so she said she was concerned.  The dr said they could not rule out cancer but it probably was just a bad infection.  They couldn't see me for 2 weeks.  I go in tomorrow but am very concerned.  Could you tell me what I can expect?  What could this possibly be?  Why can't they rule out cancer and what are the chances it might be cancer?  Thanks so much!  Wifeandmom\n\n",
    "posted_time": "Post  by wifeandmom » Mon Jul 23, 2007 12:51 am",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=44936&sid=7525041e432efc9bb18e1f5a6344449f#p44936"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Wifeandmom,  I would tend to agree that the area is probably related to infection and not cancer since you just had a bad pneumonia.  They are unable to say for sure because when a CT scan shows a consolidated lesion in the lungs it is unable to give much information about it.    You have several things that help me say that it probably is not cancer.  You are still young and you do not smoke.  I suspect that they will want to do some follow up imaging to look and see if the spot is getting better/worse or staying the same.  If it is getting better it is almost certainly related to the infection.  If it is the same or worse (still possibly due to infection) they may want to recommend you have a biopsy of the area to help determine for sure what is going on.  Azithromycin (z-pack) is the correct treatment for mycoplasma pneumonia.  Unfortunately, even with treatment, mycoplasma pneumonia still tends to cause ongoing cough/chest pain until it resolves on its own.  The antibiotic help keep the bug from being contagious but really doesn't do that much for treating an already established infection.  Best wishes.  I hope all goes well for you.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Mon Jul 23, 2007 5:20 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=45026&sid=7525041e432efc9bb18e1f5a6344449f#p45026"
  },
  {
    "author": "wifeandmom  Guest Posts: 2 Joined: Mon Jul 23, 2007 12:40 am",
    "title": "Thank you!",
    "content": "Dear Dr. Lowe,  Thank you so much for your response!  When I went to the doctor today, it was exactly as you said!  They took a chest x-ray and it showed much improvement so I've been given the all clear!  Whew!   Thank you again for all of your help...and for calling me young!  (That doesn't happen very much anymore!  ha,ha!)  Have a great day!  Wifeandmom\n\n",
    "posted_time": "Post  by wifeandmom » Mon Jul 23, 2007 6:02 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=45047&sid=7525041e432efc9bb18e1f5a6344449f#p45047"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Thanks for the update.  I'm glad to hear all is well.  Come back and visit our site anytime.  We're here to help.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Mon Jul 23, 2007 6:10 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=45053&sid=7525041e432efc9bb18e1f5a6344449f#p45053"
  },
  {
    "author": "andrewashley  Guest Posts: 1 Joined: Tue Jul 10, 2007 7:47 am",
    "title": "pneumonia in doctors",
    "content": "Dear All,  One of my patients (male, early 40s), a doctor himself, picked up pneumonia from a patient. The guidelines here state that no sputum cultures are done in community acquired pneumonia (CAP); and if a ptient with CAP is admitted to hospital sputum cultures are only done if the patient didn't have prior antibiotics. he has always been fit and well, no risk factors for CAP, there was no one in his private life with any infections at all and he travels too and from work by car on his own. Everybody apart from his occ health dr thinks that it is more than likely he picked the infection up at work. A more than 50% likelihood means it will be classified as work related. We don't have to prove beyond any reasonable doubt as in criminal law. Any suggestions how to convince the occ health dr?  kind regards,  Dr andrew ashley\n\n",
    "posted_time": "Post  by andrewashley » Tue Jul 10, 2007 7:54 am",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=44531&sid=7525041e432efc9bb18e1f5a6344449f#p44531"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hello Doctor,  Perhaps you could remind your friend of the increased antibiotic resistance among hospital acquired strains of bacteria in addition to many of the strains being more aggressive.  We, as medical professionals, often make the worst patient.  I think we know too much.  Best of luck in convincing your friend to get treatment properly.  Regards,\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Tue Jul 10, 2007 11:15 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=44577&sid=7525041e432efc9bb18e1f5a6344449f#p44577"
  },
  {
    "author": "Songbird  Guest Posts: 6 Joined: Mon Apr 23, 2007 8:54 am",
    "title": "Breathing trouble after pneumonia",
    "content": "My daughter 33 had a mild case of pneumonia last November.  Her last 2 chest X-rays were fine, but ever since the pneumonia she has had tightness in her chest with trouble getting a deep breath.  This isn't all the time, it comes and goes.  She has slight acid reflux but other than that all tests are normal.  Could this still be post-pneumonia problems that will eventually go away?  I wonder if she has stress induced asthma because she sometimes has this tightness when she tries to clean house or play with her children out side, also air-conditioning seems to bring it on. She has an inhaler and it sometimes helps a little. The only other med. she takes is Synthroid.  Thanks for your suggestions.\n\n",
    "posted_time": "Post  by Songbird » Sun Apr 29, 2007 7:34 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=41680&sid=7525041e432efc9bb18e1f5a6344449f#p41680"
  },
  {
    "author": "Debbie Miller, RN  Nurse Posts: 4746 Joined: Mon Apr 16, 2007 2:41 pm Gender: Female Location: USA",
    "title": "[no title]",
    "content": "It certainly sounds suspicious for asthma and/or allergy problems.  I would follow up with an internal medicine or family practice doctor and explain the ongoing symptoms.  There could be further testing or referral needed from there.  The fact that her symptoms come and go lead me to think it is not lingering from the pneumonia episode.\n\n",
    "posted_time": "Post  by Debbie Miller, RN » Thu May 24, 2007 1:50 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=42933&sid=7525041e432efc9bb18e1f5a6344449f#p42933"
  },
  {
    "author": "jacluc  Guest Posts: 13 Joined: Sat Apr 28, 2007 7:31 pm",
    "title": "Pleuracy",
    "content": "I am a 33 year old female.  Approximately 2 months ago I got sick with a sore throat, swollen glands, cough, just the basic URI.  But after a month the cough was still lingering and pretty bad so I went to my doctor who said my lungs were clear but felt that I had a sinus infection and was coughing from the post nasal drip.  So I was put on Augmenten for 10 days but the cough never went away.  About a week after the completion of the Augmenten the doctor put me on a cough medicine with codine and while it helped some the cough just persisted.  Last week I noticed what felt like movement in my back under my right lung when I breathed in or coughed and by the next day the movement turned into a sharp pain.  Of course I thought I must have pulled a muscle from coughing so hard and ignored it.  Well within a few days the pain spread to under my right breast, just opposite to where the back pain is.  I found it odd for the pain of a pulled muscle to spread so I went back to the doctor.  He listened to my chest and my back and said that based on the way my right lung sounds as opposed to the left he would say pneumonia except for the fact that I have no fever and feel relatively well except for the pain.  An x ray ruled out pneumonia.  The doctor did say he suspected pleuracy.  The pain is severe upon breathing in, coughing, and moving.  Breathing is extremely labored while lying down and the pain increases.  I spoke with the doctor today and he said that he cannot explain why I am still in so much pain which of course makes me more concerned.  Does this sound like pleuracy?  Thanks in advance for any help.\n\n",
    "posted_time": "Post  by jacluc » Sat Apr 28, 2007 7:44 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=41626&sid=7525041e432efc9bb18e1f5a6344449f#p41626"
  },
  {
    "author": "Debbie Miller, RN  Nurse Posts: 4746 Joined: Mon Apr 16, 2007 2:41 pm Gender: Female Location: USA",
    "title": "[no title]",
    "content": "It definitely could be pleurisy and it sounds like your doctor is correct.  Treating the underlying cause of infection is the best course of action, though it may be caused by a virus which your body will need to get rid of without the help of antibiotics.  Keep in touch with the doctor, especially if you develop fever, shortness of breath or other symptoms that might indicate further infection.  Good luck.\n\n",
    "posted_time": "Post  by Debbie Miller, RN » Sat Apr 28, 2007 9:58 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=41632&sid=7525041e432efc9bb18e1f5a6344449f#p41632"
  },
  {
    "author": "jacluc  Guest Posts: 13 Joined: Sat Apr 28, 2007 7:31 pm",
    "title": "[no title]",
    "content": "Thank you for the quick response.  Can you please tell me about how long pleuracy usually lasts?  It has almost been 2 weeks and while my chest pain may be lessening slightly, my back pain is still bad and I now have pain on my right side.  Thanks for the help.\n\n",
    "posted_time": "Post  by jacluc » Mon Apr 30, 2007 9:16 am",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=41691&sid=7525041e432efc9bb18e1f5a6344449f#p41691"
  },
  {
    "author": "jb03530  Guest Posts: 1 Joined: Sun Mar 25, 2007 8:50 pm",
    "title": "pneumonia, plueral effusion, fever, lung mass, chronic cough",
    "content": "59 year old male/ diagnoses small cell lung cancer- right lung/ four inconclusive diagnosis/ 2 needle (ct scan guided) tissue biopsies, 1 plueral effusion biopsy/ 1 bronchial scope biopsy - 1 year in treatment  - 3 different chemo treatments/ 1 series of radiation/ little to no change in the mass, no mestatisizing to any other area of the body/ unresolving pneumonia and daily fevers, constant chronic cough, weakness on the right side of the body/ trembling right hand.  Many blood cultures for the fevers- all return a negative result, have been given levequin on a regular basis - no positive results, avelox - no positive results, fluconazole - no positive results/ recently hospitalized for 9 days - fever of 103, fungus growth in mouth and throat, open seeping lesions on the back, massive doses of IV fungal and antiobiotic medication/ low red count - white count - 0 -four units of blood and 1 unit of platletts administered at this time.  Currently I have a temp of 102, and a bumpy rash has developed subcutaniosly on the palm of my hands.  Have had two right lung collapses. At the occurance of the  second one a catheter was placed on the right side to allow daily plueral effusion drainage, approx 300 ML daily for 3 weeks.   I have had two strokes while hospitalized 1 year ago, pulmonary embolism  in the lung and blood clots in the right arm.  A filter was placed in the artery above the right lung to prevent additional  clots from moving in the lung.  I also have  afib, controled with  digitox.  Mother had luekemia, and a staph infection contracted while nursing.  I was a smoker for 30 years and also have mild emphysema. I  use  spriva daily and albuteral inhaler daily. Not on oxygen, oxygen levels have been in the 95 to 98 percentile range.  Blood pressure - 102/70.  I will be starting another new chemo treatment in two weeks.\n\n",
    "posted_time": "Post  by jb03530 » Sun Mar 25, 2007 9:43 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=39945&sid=7525041e432efc9bb18e1f5a6344449f#p39945"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "If I understand your post correctly, your WBC count is very low (zero?).  In this circumstance, the diagnostic possibilities completely change.  One must always consider typical infections; however, at this point the body is immunocompromised, so the opportunistic infections must also be considered.    On top of this, the inflammation from your cancer may also be triggering the fevers.  I would strongly suggest you continue with very close follow up with your oncologist and consider requesting an Infectious Disease specialist consultation.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Mon Mar 26, 2007 5:10 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=39987&sid=7525041e432efc9bb18e1f5a6344449f#p39987"
  },
  {
    "author": "HDK  Guest Posts: 1 Joined: Fri Feb 16, 2007 8:50 am",
    "title": "Pneumonia/confusion in elderly patient",
    "content": "My grandfather is in his early eighties and has always been very sharp (driving, actively discussing current events, etc.). Almost 2 weeks ago, he experienced rib pain, admitted himself to the hospital and was diagnosed with pneumonia. Cleared and released (although now in a rehab center), he has regained some of his strength, but after a day or so of being able to hold somewhat regular conversation, has begun hallucinating and showing signs of paranoia. It seems as though it is getting worse as time passes.  I've heard everything from possible urine infection, to withdrawal from the morphine he was (very) briefly on... We are still days away from tests, and I'd really appreciate any idea of how common something like this is, the chances of a full recovery of his faculties and the type of tests/care we should make sure is happening. Thanks for any help.\n\n",
    "posted_time": "Post  by HDK » Fri Feb 16, 2007 8:55 am",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=38764&sid=7525041e432efc9bb18e1f5a6344449f#p38764"
  },
  {
    "author": "Marceline F, RN  Nurse Posts: 229 Joined: Wed Feb 28, 2007 1:54 am",
    "title": "[no title]",
    "content": "Dear HDK, I certainly feel for you.  It is always difficult to watch a usually bright individual with all their faculties all of a sudden acting in an unusual fashion, especially when it includes paranoia.  There are so many possible reasons that he may be demonstrating these abberant behaviors at this time. Certainly infection is one possiblity, withdrawal from certain medications could contribute and the addition of any new medications could also be a factor.  I do however find that sometimes the answer is less obscure than that.  Many of our seniors keep their \"togetherness\" strong because they are usually surrounded by their loved ones and a familiar environment. Many of us, even, do not do well in strange places, with strangers in charge of our coming and our going, and to be at the mercy of someone else's choice of meals, activities and even television programming.  How much less adaptable might one be who has for the longest time been independent, and in full care of themselves?  The loss of independence is particularly frightening to many of our elders, and this fear can manifest in outbursts of paranoia, with the hallucinations being part of the mind's desperate attempt to make some sense of senselessness.  My best suggestion to you would be to include this supposition in the mix along with the attempt to isolate outside contributing factors.  Bring photographs of the family and other favorite items to the rehab as the facility permits.  Orient your grandparent to time and date, reminding him that the family is always there for him, and that he will be going home just as soon as the doctor deems him ready to go.  Above all, show patience and compassion, and share the photos with the staff members at the facility so that they also see the family involvement, and can be part of his reality grounding.  Marceline\n\n",
    "posted_time": "Post  by Marceline F, RN » Sat Mar 03, 2007 5:17 am",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=39155&sid=7525041e432efc9bb18e1f5a6344449f#p39155"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Dear HDK,  The symptoms you are describing seem to fit a condition known as delirium.  While the exact cause is not known, this condition commonly occurs during illnesses, in the face of new medications, etc.  It does tend to be transient and often will resolve over time.  Suggestions such as Rspct4trth has made may help.  If the delirium is severe enough there are some antipsychotic medications that can help on a temporary basis until the delirium resolves.  Often delirium resolves completely after the stressor that induced it has resolved.  I expect the chances that your grandfather will make a complete recovery are high.  There are some other possible causes of this, so it is important to make sure his doctors are aware of his symptoms.  They can follow him closely and assess for any other causes.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sat Mar 03, 2007 2:48 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=39171&sid=7525041e432efc9bb18e1f5a6344449f#p39171"
  },
  {
    "author": "raffi007  Guest Posts: 6 Joined: Mon Dec 25, 2006 1:21 am Location: Phoenix, AZ",
    "title": "walking pneumonia??",
    "content": "I was sick with a fever and what seemed to be bronchitis in early november.. never went to doctor because the fever subsided in a day.. ever since then i've been noticing chest congestion.. its not when i breathe but when i force an exhale I notice the congestion.. When I try to cough it up it is unproductive and I feel a rattle. I had a chest x-ray done and chest ct scan in early december, but it didn't show anything. i still have glazy/sometimes red dry eyes. achy , low grade fever (99.4) periodically throughout the day (rarely). my sputum is generally clear, sometimes when I blow my nose I'll notice a little bit of green, one ear has been clicking a bit. Does this sound like walking pneumonia or possibly lingering bronchitis??   Thanks - .\n\n",
    "posted_time": "Post  by raffi007 » Wed Jan 03, 2007 11:41 am",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=37154&sid=7525041e432efc9bb18e1f5a6344449f#p37154"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Hello,  This is more likely to be due to upper respiratory tract infection rather tan a lower respiratory tract infection.  It is commonly due to viral infections. Different viruses are known to causes the illness especially in winter. It is common to have eye symptoms with viral illness. Rhinitis and postnasal discharge result in cough due to irritation of the larynx.  - Walking pneumonia is terminology used to describe certain types of mild pneumonia in which the affected persons can continue his activity and do not have to rest in bed.   They on the other hand  may cause severe persistent (dry) cough, fever, chills, headache, and abdominal pain if left untreated, unlike a cold, it will get worse in 2 weeks if not treated properly.  The causative organism is Mycoplasma pneumonia which is responsible for majority of community-acquired pneumonia.  Direct clinical examination is essential. Chest -Xray and sputum or discharge culture (if needed) will identify the causative organism.  Follow up with your Doctor is essential for proper management.  Best regards.\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Wed Jan 03, 2007 4:58 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=37180&sid=7525041e432efc9bb18e1f5a6344449f#p37180"
  },
  {
    "author": "raffi007  Guest Posts: 6 Joined: Mon Dec 25, 2006 1:21 am Location: Phoenix, AZ",
    "title": "[no title]",
    "content": "is it normal for something like this to linger?\n\n",
    "posted_time": "Post  by raffi007 » Thu Jan 04, 2007 3:37 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=37240&sid=7525041e432efc9bb18e1f5a6344449f#p37240"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Hello,  When symptoms persist for longer periods the possibilities are:  - Cough and nasal discharge are of the symptoms that last longer than two weeks after recovery from certain viral infections.  The respiratory tract wall  becomes hyperactive and a form of asthma may occur as spasm of the airway is easier to take place.  - If you are not properly treated or received in adequate treatment, infection and symptoms will  remain also for long time.   When your immune system becomes more weak, the organism will be more active and an acute form of the infection will be clear.  - Also if you are allergic, allergic people have similar symptoms when exposed to an allergen and the duration of illness may be prolonged.  I advise you to follow up with your doctor and to discuss with him this information.  Best regards.\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Thu Jan 04, 2007 5:36 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=37249&sid=7525041e432efc9bb18e1f5a6344449f#p37249"
  },
  {
    "author": "tryingtogetbetter  Guest Posts: 3 Joined: Mon Dec 25, 2006 2:39 pm Location: nova scotia",
    "title": "pneumonia and im still sick",
    "content": "Hello, my name is Ryan McNeil, im 23 years old and i have a problem... 11 months ago i was diagnosed with pneumonia and given medication to cure it. Since i've had a long ride. To this day i still have chest pains( they can be severe im taking tramacet sometimes to help cope with the pain) and my glands and lymphnodes are still swollen in my neck. I've had 4 xrays and 2 cat scans to prove the pneumonia is gone, at least 10 blood tests recently i've had an upper gi and a fine needle biospy to try to find out what is going on. My anti-nuclear count is a little above avg. besides that everything has came back negative which is nice to hear but it is not helping me get better. If anyone has any helpful information on what could be going on it would be appreciated!! I hope to hear from someone soon                                                         Ryan McNeil Dizzlemcremix@hotmail.com\n\n",
    "posted_time": "Post  by tryingtogetbetter » Mon Dec 25, 2006 2:52 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=36720&sid=7525041e432efc9bb18e1f5a6344449f#p36720"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Hello,  It would be more helpful if you describe more the character of this pain, what aggravates the pain and if there are any other related symptoms or signs(dry cough, breathing difficulty etc).  Muscle spasm can cause chest pain of unidentified causes, it may occur due overexertion of the chest wall muscles after excess coughing.   Muscle spasm in many cases is the result of inappropriate posture for long time like traveling, driving, and certain types of work. These postures may not allow you to recover from the overexertion spasm caused by the previous illness.  Self care and avoiding the precipitating cause will lead to a gradual but clear improvement in the pain. Home treatment includes the use of Analgesics, cold or hot therapy. Rest for maximum two days is also beneficial  Keep us updated. Best regards.\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Tue Dec 26, 2006 2:02 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=36764&sid=7525041e432efc9bb18e1f5a6344449f#p36764"
  },
  {
    "author": "tryingtogetbetter  Guest Posts: 3 Joined: Mon Dec 25, 2006 2:39 pm Location: nova scotia",
    "title": "still sick",
    "content": "Thank you for a posting a reply.. The pain is hard to describe. I've tried to watch for triggers and cant seem to figure it out.. It is in the lower part of the left side of my chest. I do have some breathing problems which only feels like it is in the left side as well. I feel that this is a result of being a smoker. I am tring to quit but having difficulity. Is there any steps I can take or tests that i havnt mentioned that might help me put a close to all of this. If you need anymore information please let me know THANKS\n\n",
    "posted_time": "Post  by tryingtogetbetter » Wed Dec 27, 2006 9:08 am",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=36791&sid=7525041e432efc9bb18e1f5a6344449f#p36791"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Hello,  Another possible cause of your pain is pleurisy. Pleurisy is an inflammation of the pleura, which is a double-layered membrane covers the lungs separating it from the rib cage.   Viral infections like flu, are the most common cause of Pleurisy. The pain is felt as sharp pain which get worse by Coughing, sneezing, moving and deep breathing.   Being smoker and recovered recently from a pneumonia make your lung immune system weaker and more liable for repeated mild chest infections that present in the form of pleurisy.  There is no specific test to diagnose pleurisy. Auscultation of the chest shows a characteristic sound known as pleural rub. Chest x-ray sometimes showes mild pleural reaction obliteration the costophrenic recess.  Keep in mind also that smoking withdrwal symptoms include Tightness in the chest, chest pain and cough.  You have mentioned that they performed fine needle aspiration for you, from where did they do that, was there any fluid or mass found by radiological examination?  Follow up with your docotr is essential. Best regards\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Wed Dec 27, 2006 3:26 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=36811&sid=7525041e432efc9bb18e1f5a6344449f#p36811"
  },
  {
    "author": "tryingtogetbetter  Guest Posts: 3 Joined: Mon Dec 25, 2006 2:39 pm Location: nova scotia",
    "title": "follow up still sick",
    "content": "the fine needle biopsy was done on the right side of my neck in my gland. which came back 100 % negative  they are still very swollen. and the swollen lymphnode is more towards the back side of my neck and its keeps getting bigger im just a mess and i've seen so many doctors and they all do the same tests over and tell me im fine. Really it's starting to become hard to deal with.\n\n",
    "posted_time": "Post  by tryingtogetbetter » Thu Dec 28, 2006 3:40 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=36885&sid=7525041e432efc9bb18e1f5a6344449f#p36885"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Hello,  You mean they performed a Fine needle aspiration cytology FNAC not a biopsy.  Abnormal Lymph node enlargement tends to commonly result from infection / immune response, cancer and less commonly due to infiltration of macrophages filled with metabolite deposits (eg, storage disorders).   Sometimes, following infection Lymph nodes occasionally remain permanently enlarged, though they should be non-tender, small (less the 1 cm), have a rubbery consistency and none of the characteristics described for malignancy or for infection.  An increase in nodal size on serial examinations is significant. Hence nodes that continue to grow in size are important and those that regress in size tend to be more reassuring.   FNAC although a very useful technique in the diagnosis of many diseases. But being negative does not exclude a pathological cause.  I advise you to follow up with your doctor. A new CBC, and ESR may be helpful too.  Keep us updated. Best regards.\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Thu Dec 28, 2006 6:54 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=36894&sid=7525041e432efc9bb18e1f5a6344449f#p36894"
  },
  {
    "author": "tbarson  Guest Posts: 1 Joined: Tue Dec 12, 2006 10:49 am",
    "title": "Fever & pain after pneumonia & pleurisy",
    "content": "I've been on antibiotics for 24 days since being released from the hospital for pneumonia & pleurisy.  I still have some fever every day (about 99.5-99.9) and some chest pain (dull ache).  What causes the fever?  I can't believe there's still infection after the intravenous antibiotics at the hospital & the 24 days of oral antibiotics.  I'm female, 52, healthy & in good shape (other than this recent illness).\n\n",
    "posted_time": "Post  by tbarson » Tue Dec 12, 2006 2:03 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=35999&sid=7525041e432efc9bb18e1f5a6344449f#p35999"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Hello,  Pneumonia is an inflammation of the lungs resulting from infections. Most of cases are due to bacterial pneumonias (Streptococcus pneumoniae). Patients with pneumonia presents with: Productive Cough ( yellow, greenish, or bloody) Fever and chills  Chest pain  Breathing difficulty and Dyspnea   Patients usually improve after a  two weeks course of antibiotics and  may need to be hospitalized. If after treatment there  is any chest symptoms , patients should contact their doctors to exclude any possible complication  like (lung abscess), these symptoms include:   -Persistent fever  -Dyspnea  -Chest pain  -Productive cough  I advise you to follow with your doctor for further management. Best regards.\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Tue Dec 12, 2006 4:51 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=36008&sid=7525041e432efc9bb18e1f5a6344449f#p36008"
  },
  {
    "author": "blairbodie  Guest Posts: 1 Joined: Fri Dec 08, 2006 11:46 am Location: New York  Contact:   Contact blairbodie       Yahoo Messenger",
    "title": "walking pneumonia",
    "content": "How long should I wait before resuming strenuous cardio vascular activity after being diagnosed with walking pneumonia? I am a 29 year old female dancer and Pilates instructor. I still am coughing, but the spells are less frequent. I have been on Clarithromycin and methylprednisolone tablets for three days. I have had pneumonia once before.\n\n",
    "posted_time": "Post  by blairbodie » Fri Dec 08, 2006 11:54 am",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=35717&sid=7525041e432efc9bb18e1f5a6344449f#p35717"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Hello,  Walking pneumonia is terminology used to describe certain types of pneumonia in which the affected persons can continue his activity and do not have to rest in bed.   They on the other hand  can cause severe persistent (dry) cough, fever, chills, headache, and abdominal pain.  The causative organism is Mycoplasma pneumonia which is responsible for majority of community-acquired pneumonia. Dry cough may last for 6 weeks or more as the organism destroy the cilia of the bronchi and their regeneration takes time.   Antibiotics taken in Mycoplasma infections may be prescribed for 5 to 7 days.  I would advise you to consult your doctor about the appropriate therapy duration for your case.\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Fri Dec 08, 2006 3:23 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=35724&sid=7525041e432efc9bb18e1f5a6344449f#p35724"
  },
  {
    "author": "Ladysmith52  Guest Posts: 10 Joined: Wed Mar 01, 2006 1:20 pm Location: Bakersfield, CA",
    "title": "Lung Nodule Calcification",
    "content": "Does c. pneumonia cause lung nodules? If so, will they calcify as the disease goes away?  Thank you for your response. Ladysmith52  Female - 53 years old Diagnosis: coccidioidomycosis - 10/18/05 No past surgeries No smoking No alcohol No meds\n\n",
    "posted_time": "Post  by Ladysmith52 » Tue Mar 07, 2006 2:05 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=31791&sid=7525041e432efc9bb18e1f5a6344449f#p31791"
  },
  {
    "author": "Dr. A. De la Guerra  Medical Doctor Posts: 70 Joined: Fri Aug 26, 2005 8:00 pm Gender: Male Location: Lima, Peru  Contact:   Contact Dr. A. De la Guerra       Yahoo Messenger",
    "title": "[no title]",
    "content": "Hi Ladysmith52,  Sometimes calcium deposits in areas where an infection caused tissue damage or scarring. Thus, in your case calcifications are a sign of lung healing after the pneumonia. Mostly, calcified lung nodules are found after infections caused by mycobacteria (tuberculosis) or fungi (coccidiodomycosis), but also after bacterial pneumonia, in particular due to legionella.  Sincerely,   Dr. Alberto de la Guerra\n\n",
    "posted_time": "Post  by Dr. A. De la Guerra » Thu Apr 20, 2006 11:20 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=32429&sid=7525041e432efc9bb18e1f5a6344449f#p32429"
  },
  {
    "author": "crivers  Guest Posts: 1 Joined: Wed Jan 18, 2006 5:23 pm Location: SC",
    "title": "Pneumonia or Bronchitis?",
    "content": "My husband has been sick since last Thursday with fever, cough, fatigue,  and shortness of breath.  I took him to a Prompt Care clinic on Saturday and he was diagnosed with bronchitis. He started Cipro that day but had an allergic reaction so started a Z-pack on Monday. He was also prescribed Duraphen II DM.   It has been a week now and he's not getting any better. He has been bedridden since last Thursday except for the trip to the doctor. His temperature has been over 100 and closer to 101 every day since that time. At night, it goes over 102, with 103 being the highest the night before last. He is taking Tylenol, but it is not helping. His breathing is very labored if he gets up and moves around or talks. His cough keeps him up all night. The mucus he coughs up is very thick and yellow, sometimes brown.  He also has diarrhea and no appetite.  He called the Prompt Care center today and they told him to keep taking Tylenol. I don't want to make him leave the house if that isn't necessary, but I am concerned that maybe he has been misdiagnosed.  Please advise as to whether I should seek a second opinion.   Thanks.\n\n",
    "posted_time": "Post  by crivers » Wed Jan 18, 2006 6:07 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=28681&sid=7525041e432efc9bb18e1f5a6344449f#p28681"
  },
  {
    "author": "Shana Johnson, CNA  Nurse Assistant Posts: 356 Joined: Sat Sep 03, 2005 5:13 am Location: Las Vegas, NV",
    "title": "[no title]",
    "content": "If it has been a week with no sign of improvment I would take him back and ask for a chest x ray.That is how pneumonia is diagnosed (or ruled out).\n\n",
    "posted_time": "Post  by Shana Johnson, CNA » Wed Jan 18, 2006 7:50 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=28686&sid=7525041e432efc9bb18e1f5a6344449f#p28686"
  },
  {
    "author": "_freeze_  Guest Posts: 1 Joined: Fri Dec 16, 2005 4:37 am Location: Auckland, New Zealand - Most of family in Malaysia",
    "title": "Death from Pneumonia",
    "content": "Hi there, My grandfather has passed away last Sunday morning due to Pneumonia with a unlying coad,  :cry:  which really sucks... He had lived in Malaysia all his life, The doctors mentioned that they had to pump oxygen into his lungs but wasn't able to, they then tried to use medication (i forgot what it is called), the medication didn't take affect... then... .  Could he have died from a heart attack? Or what else could he have died from?  Thanks in advance,\n\n",
    "posted_time": "Post  by _freeze_ » Fri Dec 16, 2005 4:44 am",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=26851&sid=7525041e432efc9bb18e1f5a6344449f#p26851"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi _freeze_, First let me extend my sympathies for your loss. One of the complications of pneumonia (aside from other conditions) in the older population and the very young is respiratory failure. When a person experiences this condition it affects other all cells and organs in the body including the heart. After the heart is taxed to such a degree, trying to pump harder to circulate blood and oxygen to organs and cells, it in turn stops as well. It would be next to impossible for me to state the exact cause of your grandfathers death. Again, my most sincere sympathies. Sincerely, Theresa Jones, RN\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Fri Dec 16, 2005 9:17 am",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=26855&sid=7525041e432efc9bb18e1f5a6344449f#p26855"
  },
  {
    "author": "deeji  Guest Posts: 1 Joined: Tue Dec 13, 2005 3:51 pm Location: India",
    "title": "blood in sputum",
    "content": "Hi, I`ve been having a very small amount of blood in my sputum since a few hours. At times there is blood in my sputum and at times there isn`t. I had pneumonia about 6 years back and this was exactly what had happend then, but there was a large quantity of blood then. I`m suffering from Asthma and I use Salbutomol inhaler for the same. I do see blood in my sputum at times, say atleast once in 2-3 months on an average.. but I believe its mostly due to my bleeding gums, it happens whenever I eat something hard, or have lots of ice-chilled soft drinks.Today I havent had anything like that but there was still blood in my sputum which is making me worried. Kindly advise. Regards.\n\n",
    "posted_time": "Post  by deeji » Tue Dec 13, 2005 4:07 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=26667&sid=7525041e432efc9bb18e1f5a6344449f#p26667"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi deeji, Bloody sputum production can appear for a variety of reasons. Acute causes may be related to bronchitis, pneumonia. However, you should have an evaluation by your physician to identify if this is related to your asthmatic condition, current infection, or an underlying disorder. Sincerely, Theresa Jones, RN\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Wed Dec 14, 2005 5:49 am",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=26703&sid=7525041e432efc9bb18e1f5a6344449f#p26703"
  },
  {
    "author": "mike_c89449",
    "title": "intermittent pulmonary edema after eating",
    "content": "I'm a 21 year old male, healthy weight, smoked 1 pack a week for about a year, quit 6 months ago. echocardiogram revealed minor mitral valve prolapse 2 years ago.  Not taking any medications for that or anything else.  The symptom is after I eat a substantial meal, I cough up a small but noticeable amount of clear fluid out of my lungs.  After I resume normal activity it goes away. This has persisted for about 4-5 years.  I've never had pneumonia or any severe pulmonary condition. I live at an elevation of about 4,000 ft.   Was curious if pulmonary edma after eating was indicative of anything particular that would require treatment. Thank you very much for your input, since I cannot afford a doctor visit at this time.\n\n",
    "posted_time": "Post  by mike_c89449 » Thu Jun 16, 2005 1:56 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=15240&sid=7525041e432efc9bb18e1f5a6344449f#p15240"
  },
  {
    "author": "Shannon Morgan, CMA  Medical Assistant Posts: 530 Joined: Fri May 06, 2005 6:28 pm Location: Dallas, Texas. USA.",
    "title": "[no title]",
    "content": "Don't worry, you don't have pulmonary edema!    That can be fatal!  You probably just have some post nasal drip, sinus drainage in the back of your throat.  Thankfully your smoking history isn't enough to cause any permanent damage - congratulations on quitting!\n\n",
    "posted_time": "Post  by Shannon Morgan, CMA » Thu Jun 16, 2005 5:45 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=15251&sid=7525041e432efc9bb18e1f5a6344449f#p15251"
  },
  {
    "author": "Jewel  Guest Posts: 1 Joined: Thu May 26, 2005 10:25 am",
    "title": "Chemical Induced Pneumonia",
    "content": "I was inadvertantly exposed to the chemical Anhydrous Ammonia 5 weeks ago while on my nightly walk, this chemical was being applied to a local farm field. I ended up with chemical burns in and down my throat, broncial passages and lungs as well as a sunburn affect to my face and neck areas. (the only exposed areas of the skin). I have been treated with 3 different type of antibiotics thus far as well as 2 different types of inhalers. My worst symtoms throughout this ordeal has been the constant nagging dry cough that does not seem to go away. Will dimish for a day or two only to recycle once again. Any suggestions on what to do now. I am very concerned about the long term affects of this type of exposure, afraid of my cancer risks now, especially lung cancer, which is already in my family. Any suggestions, thoughts, or ideas?  Thanks\n\n",
    "posted_time": "Post  by Jewel » Thu May 26, 2005 10:43 am",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=14245&sid=7525041e432efc9bb18e1f5a6344449f#p14245"
  },
  {
    "author": "Dr. S. Adhikari  Medical Doctor Posts: 68 Joined: Sat May 14, 2005 1:49 pm Location: India",
    "title": "[no title]",
    "content": "Hi! Visit your doctor for a checkup. Don't worry about lung cancer now. Any cancer occurs due to prolonged exposure to something that induces it NOT a single exposure. If you have lung cancer in your family the best thing you can do to prevent it is by not smoking. Yur dry nagging cough may improve by steam inhalation but visit your doctor anyway.\n\n",
    "posted_time": "Post  by Dr. S. Adhikari » Sat May 28, 2005 2:29 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=14316&sid=7525041e432efc9bb18e1f5a6344449f#p14316"
  },
  {
    "author": "matthew111  Guest Posts: 13 Joined: Thu May 19, 2005 8:40 pm",
    "title": "[no title]",
    "content": "Many things you can do to minimize risk of cancer such as  Take MultiVitamin Supps such as  Cod Liver Oil  which contains  Vitamin A - Vitamin D - Vitamin E and  Omega 3 DHA / EPA  and  Olive oil is anti infammatory  Strong Antioxidants which you can find in Green tea (without milk) and recent reports show that white tea has significantly more powerful antioxidants than Green tea.  Japan has many smokers but they have a lower lung cancer rate than majority of countries. This maybe associated with the antioxidants they get from 'green tea' - drink around 2 - 5 cups per day.  Antioxidants found in Green tea mops up free radicals. It  kills cancer cells and inhibits tumor growth. You will atleast minimize the risk of cancer significantly.  Also its very good for avoiding common illnesses such as  Flu, colds and can prevent food poisoning etc.. Green tea is very very good.  You should be fine. But if you want to avoid lung cancer you will need to lead a healthy life style.  Also try to follow some of the advice I just gave you.  But talk to your doctor if you are worried.  1) Green Tea May Lower Risk of Lung Cancer - Link  2) Cod Liver Oil - Link\n\n",
    "posted_time": "Post  by matthew111 » Sat May 28, 2005 9:04 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=14327&sid=7525041e432efc9bb18e1f5a6344449f#p14327"
  },
  {
    "author": "James McMurray  Guest Posts: 2 Joined: Mon May 02, 2005 8:11 pm Location: Texas",
    "title": "Pneumonia and Erectile Dysfunction",
    "content": "A friend of mine* is suffering from erectile dysfuntion. The onset coincided with a severe case of pneumonia. He thinks th two are related, and that the dysfunction is most likely temporary.   * This really is a friend, so please ignore the medical history and medications I have listed. What I know of his medical history:  - He has had a few bouts with cancer, but as far as he knows all of the cancerous growths have been completely removed. - He has smoked steadily for years (at least 10, probably 15).[/list] - During his youth he did quite a lot of drugs, but as far as I know he hasn't done any for at least a couple of years. - As far as I know he is taking no drugs or medications. - He averages one alcoholic drink per day, usually beer. - The problem has existed for about 3 months now.  I have a few questions:  1) Can pneumonia, or any medicines used to treat pneumonia, cause erectile dysfuntion?  2) If so is it likely to be a temporary issue?  3) If not, does anything in the history points to a possible cause, and would that indicate that it might be temporary?[/list]\n\n",
    "posted_time": "Post  by James McMurray » Mon May 02, 2005 8:32 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=13293&sid=7525041e432efc9bb18e1f5a6344449f#p13293"
  },
  {
    "author": "James McMurray  Guest Posts: 2 Joined: Mon May 02, 2005 8:11 pm Location: Texas",
    "title": "[no title]",
    "content": "Anyone?\n\n",
    "posted_time": "Post  by James McMurray » Wed May 04, 2005 5:47 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=13367&sid=7525041e432efc9bb18e1f5a6344449f#p13367"
  },
  {
    "author": "Shannon Morgan, CMA  Medical Assistant Posts: 530 Joined: Fri May 06, 2005 6:28 pm Location: Dallas, Texas. USA.",
    "title": "[no title]",
    "content": "That's not nearly enough info - the smoking can eventually cause ED due to cutting off circulation in the tiny vessels that cause the tissue to harden.  If he truly only has one beer per day, it's ok, but if he gets even a little tipsy before sex, it can cause temporary impotence, especially if the drinking like that is daily.  Need to know if he can get an erection while masturbating, does he get erections in his sleep?  If he can and does, it's very likely psychological.  When it happens a couple of times before or during sex, men start to worry about it the next time, and that inhibits an erection, and so on.  He probably needs to have a test to measure blood pressure in the penis to rule out an organic cause.  If he has heart (coronary) disease, that is also a cause.  I also don't know how old he is; that is important.  If he is older, middle age and up he could also be suffering from a low testosterone level, although the symptoms wouldn't have been so sudden.    Certain medications like antidepressants and certain blood pressure meds can cause ED as well.  Meds for pneumonia 3 months ago have nothing to do with it.  If he has heart disease, that also\n\n",
    "posted_time": "Post  by Shannon Morgan, CMA » Sat May 07, 2005 12:38 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=13459&sid=7525041e432efc9bb18e1f5a6344449f#p13459"
  },
  {
    "author": "dev  Guest Posts: 1 Joined: Wed Jul 28, 2004 5:13 am Location: canada",
    "title": "pneumonia - in 3rd world country-pls help my brother",
    "content": "Subject: pneumonia - can someone help an ailing brother who lived in South America? -need some advice.  Hello room,   I am writing on behalf of a an eldest brother who is 65 years ol last month he suffered from pneumonia and was hospitalized for 1 1/2 week- his lungs was drained - but when he went home after his stay, he developed a fever- this fever never went away. He is going for more test and they suspect T.B. The lungs was x-ray and it shows some scars. not sure.  He lived in south america - where the medical care is not that great- and i am here to ask some advice from you all -  Can pneumonia be so complicated and why?  IS there any medication - that i can suggest to his doctor down there.  Why is he developing a fever? this is serious-and there are complication eg., the constant fever.  My brother means so much to me - and he was never sick in his whole life - and we are all scared that there might be more complication of his lungs - is this true?  What can his doctor do - any recommendation will be helpful.  I can ask his doctor many question but i don't know what to ask - that is why i am asking a doctor in this forum - so that i can be better equipped to ask.  I am wondering if i can buy his medication and sent it to his doctor down in south america? is that possible? Can he travelled? I would like for him to come here and be with me so that i can gave him the treatment he deserve.   What can i do at this moment - i am so saddend by his sickness - he means everything to me.  I am wondering if peneumonia can be so serious- i know in the 30's many people died from this sickness - but not today- so what can we do? I know there are good antibiotic - but i do not know if he get the latest antibiotic and i wondering wht you will recommend.  Can the doctor prescribed it for him and i will get it for him in Canada?  Oh please can someone help or suggest something - or advice me on what to ask so that i can tell you.  I thank god for technology but i feel sadden that he would not be able to get proper treatment. Why must pneumonia be so complicated. He took the antibiotic and was fed intraveniously. After 2 -3 weeks of discharged from hospital - he still get this fever and that drained him so much. Why is the fever and what can be wrong? does this mean the infection is still in his lungs?  please help me. god bless.  waiting to hear from you.  My brother is in south america and the medical condition is not that great- we all know that.   regards,  dev\n\n",
    "posted_time": "Post  by dev » Wed Jul 28, 2004 5:44 am",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=4262&sid=7525041e432efc9bb18e1f5a6344449f#p4262"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Pneumonia - in 3rd world country-pls help my brother",
    "content": "Dear Dev,  i hope that your brother is feeling ok now.  Fever usually points to an infection whether bacterial, fungal, viral or parasitic. There are some non-infectious causes of fever as well.   Pneumonia can prove fatal if not treated.  After pneumonia, the most common cause of persistent fever is most probably infected fluid collecting in the space around the lungs. Another cause can be developing an abcess in the lung where the pneumonia was. Treatment of infected fluid collection around the lung is drainage by a chest tube placement together with antibiotics.  When a fever occurs, it is always a good thing to obtain cultures from the blood, urine and sputum and start broad spectrum antibiotics awaiting the culture results. Once the cultures results come back, antibiotic are switched to the results of the cultures and the sensitivities of the bacteria to the antibiotics.  i am not sure about malaria in south america but i think it can be a possibility.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Tue Aug 10, 2004 11:24 pm",
    "category": "Respiratory disorders (Pulmonology)",
    "sub_category": "Pneumonia",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=4513&sid=7525041e432efc9bb18e1f5a6344449f#p4513"
  }
]