[
  {
    "author": "Azura  Guest Posts: 1 Joined: Sun Jul 25, 2010 6:08 pm Gender: Female",
    "title": "Prostate cancer metastisized to spine",
    "content": "my dad had prostate cancer 9 years ago, he currently is being treated with luprin. His psa was 300 6 months ago and was just tested again and was 714.Recent MRI. They have been searching for WHERE it had spread and just found it on his 4 and 5 lumbar and spread down to his sacrum. He was told inopperable and advanced stages but possible radiation. He's in good health otherwise. My question is; can you estimate how long before he succumbs to the cancer? How fast does it spread? What progression can we anticipate? Paralization? Extreme pain? Any info would be helpful.\n\n",
    "posted_time": "Post  by Azura » Sun Jul 25, 2010 6:17 pm",
    "category": "Oncology",
    "sub_category": "Prostate Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=98583&sid=f7d54a025406c4567f15049349309765#p98583"
  },
  {
    "author": "Dr.M.jagesh kamath  Medical Doctor Posts: 1303 Joined: Mon Aug 03, 2009 7:24 am Gender: Male",
    "title": "Re: Prostate cancer metastisized to spine",
    "content": "Hello,Bone metastasis significantly reduce the life expectancy and quality of life which ultimately lead to pathological fractures,reduced motility,pain,and bone marrow failure.The main area of seeding is the red marrow,and spread to multiple areas.Radiopharmaceutical drugs when given, lead to significant pain relief.Since the cancer cell interact with the bone tissue and take part in a paracrine way stimulating bone growth at the same time growing more,the cancer spreads.The more high grade the cancer is faster the spread.Also the use of endocrine therapy,the duration and intensity will have bearing on the severity of skeletal metastasis. Regards.\n\n",
    "posted_time": "Post  by Dr.M.jagesh kamath » Tue Aug 31, 2010 11:20 am",
    "category": "Oncology",
    "sub_category": "Prostate Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=102026&sid=f7d54a025406c4567f15049349309765#p102026"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: Prostate cancer metastisized to spine",
    "content": "Hi, Dr.Jagesh has already concisely explained the complications due to the bony mets.  The following two studies may address your concerns regarding the prediction of prognosis.  Soloway et al, suggested a semiquantitative grading system based upon the extent of disease observed on the bone scintigram, namely that patients with fewer than six metastatic deposits had a significantly better 2-year survival rate than those with more extensive metastases. Patients with a superscan or its equivalent, which means bone metastases in >75% of the ribs, vertebrae and pelvic bones, had a significantly poorer 2-year survival rate than those with fewer metastatic sites. [Soloway MS, Hardeman SW, Hickey D, Raymond J, Todd B, Soloway S, et al. Stratification of patients with metastatic prostate cancer based on extent of disease on initial bone scan. Cancer (1988) 61:195–202].  Others have not found this grading system reliable. No correlation between the survival time after the detection of bone metastases and the number of lesions at the time of detection was found. Kazuo Ohmori et al conclude thus:   “we think that the prediction of the prognosis cannot be made at the time of the detection of bone metastases, because the response to therapies for bone metastases, such as chemotherapy, radiation or hormone therapy, differs with the type of cancers and with the individual”. [Kazuo Ohmori et al. Japanese Journal of Clinical Oncology 27:263-267 (1997)].  There are a few reports suggesting that serial bone scintigrams are valuable in predicting the prognosis in patients with metastatic breast and prostate cancers. It appears the the \"rate of increase\" in the number of bone metastases on serial bone scintigrams is useful for estimation of the prognosis in patients with metastatic prostate cancer. Best wishes!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Tue Aug 31, 2010 11:53 am",
    "category": "Oncology",
    "sub_category": "Prostate Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=102028&sid=f7d54a025406c4567f15049349309765#p102028"
  },
  {
    "author": "bertie  Guest Posts: 3 Joined: Wed Mar 12, 2008 2:08 pm Gender: Male",
    "title": "can i stop using avodart",
    "content": "had a urologist check me out. he said there was a SLIGHT change in the cellular structure after a biopsy, and prescribed avodart because it shrink my enlargedEnlarged adenoids Enlarged prostate prostate and takes care of this PIN #. after 6 months there was no PIN,,,,and the prostate has shrunk(i do not know how much).  avodart has these side effects, and i don't like it. so i asked the urologist if i could not take avodart. he suggested i should continue but did not give me a definitive answer about whether the PIN would come back if i stopped. in fact, it sounded to me more like a strong SUGGESTION than a definitive MUST DO.  and that is my question to you. as a background note, i did not take avodart for the first month after it was first prescribed. also, my body seems to react very well to medicine,,,ie, i take the advair discus, but rather than the prescribed 2 puffs i can take 1 every other day.  anyway, does avodart eliminate the PIN or does it merely control it,,,like hbp medicine. if i stopped taking it, and the PIN came back, would taking avodart again eliminate the PIN again?\n\n",
    "posted_time": "Post  by bertie » Mon Sep 28, 2009 6:12 pm",
    "category": "Oncology",
    "sub_category": "Prostate Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=83324&sid=f7d54a025406c4567f15049349309765#p83324"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: can i stop using avodart",
    "content": "Hi, Androgen deprivation therapy for high grade 'Prostatic intraepithelial neoplasia' (PIN) has been tried and some reports indicate that  Androgen deprivation therapy decreases the prevalence and extent of PIN, suggesting that this form of treatment may play a role  in chemoprevention of prostatic cancer. In persons diagnosed as having 'Multifocal high grade PIN', it may take upto 10 years for a prostatic cancer to manifest. So,studies on chemoprevention necessarily have to be of long duration.What is the optimum duration of chemoprevention is not yot clear.Studies are on-going in this regard. Best wishes!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Mon Nov 23, 2009 7:31 am",
    "category": "Oncology",
    "sub_category": "Prostate Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=87533&sid=f7d54a025406c4567f15049349309765#p87533"
  },
  {
    "author": "mjod  Guest Posts: 1 Joined: Wed Sep 09, 2009 4:56 pm Gender: Female",
    "title": "PSA of 18000, dark spots on shoulder bone, postrate cancer",
    "content": "Brother 74 diagnosed with postrate cancer on Tue.  His PSA was 18000.  What does a PSA test that high reveal?  1 week later he had his testicles removed to stop testosterone production to stop cancer.  Dark spots were noted on an x-ray of his shoulder.  He was told that they could be testoserone.  I do not understand how testosterone could cause dark spots on the bone or is it as I suspect postrate cancer in the shoulder bones?\n\n",
    "posted_time": "Post  by mjod » Wed Sep 09, 2009 6:56 pm",
    "category": "Oncology",
    "sub_category": "Prostate Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=82290&sid=f7d54a025406c4567f15049349309765#p82290"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: PSA of 18000, dark spots on shoulder bone, postrate cancer",
    "content": "Hi, Testosterone is known to increase bone density. The only way (to the best of my knowledge) to connect testosterone therapy to 'osteolytic' bone lesions is by its association with  'Acne fulminans', a form of fulminant acne and osteolytic lesions have been reported in this condition.I do not know if your brother happens to have severe acne which developed while on testosterone therapy.   PSA ranges differ by race. The normal, or what is considered to be the safe range for European-American men aged  50 to 80 is  0 - 3.5 ng/ml.   The range for African-American men is quoted to be 0 to 2.0 ng/ml for men in their 40s, rising to 4.0 when they are in their 50s, 4.5 in their 60s, and 5.5 in their 70s.  A PSA value of 18000 needs to be repeated,preferably at a different laboratory! Best wishes!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Fri Nov 06, 2009 11:50 am",
    "category": "Oncology",
    "sub_category": "Prostate Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=86099&sid=f7d54a025406c4567f15049349309765#p86099"
  },
  {
    "author": "bertie  Guest Posts: 3 Joined: Wed Mar 12, 2008 2:08 pm Gender: Male",
    "title": "can i discontinue taking avodart?",
    "content": "i had an enlarged prostate, and the doctor said, after a biopsy, that there was a slight change on the cellular level. he prescribed avodart, and after 3 months it (PIN)was gone, prostate much improved( i also take saw palmetto). he suggested i continue with the avodart, but i would like a second opinion as to whether i must continue or can i stop taking avodart.  is this a \"maintenance\" issue, like controlling one's high blood pressure, that requires continued use of avodart? or once the PIN goes away, is it done with. and if returns in a similar manner, will resuming avodart remedy the situation once again.\n\n",
    "posted_time": "Post  by bertie » Mon Oct 05, 2009 1:33 am",
    "category": "Oncology",
    "sub_category": "Prostate Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=83441&sid=f7d54a025406c4567f15049349309765#p83441"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: can i discontinue taking avodart?",
    "content": "Hi, It would have been very helpful if you had told us whether the Prostatic intraepithelial neoplasia (PIN) that was identified in your prostatic biopsy specimen was low grade or high grade.I have to assume it to be high grade as you have been advised 'avodart'.  (PIN) is classified as 'low grade' and 'high grade'. The high grade variety is the one which is believed to increase the risk of prostatic cancer.Also, Multifocal PIN perhaps, has the highest risk.  It appears that in patients with high-grade PIN, the chance of developing prostatic cancer is about 35 to 40 percent in a five-year period.   In patients with low-grade PIN, it appears that the risk of developing cancer is about 15 to 20 percent over a 10-year period (some believe that this type has no increased risk at all).   In patients whose biopsies didn’t show any PIN, the chance of developing cancer in the future is about 10 percent. Many would agree, i believe, that currently there is no approved treatment for risk reduction in prostate cancer  Some workers may recommend prophylactic drug therapy (chemoprevention) in men who have high risk indicators  such as   age, suspicious findings on rectal exam,high PSA level,a high BMI [body mass index], a positive family history,etc.  If PIN(high grade) is present, then the risk period for development of cancer is quite long - even upto 10 years. PIN might regress on chemoprevention, but whether the risk also decreases.....only further studies ought to reveal!  Your doctor should be the one to decide whether to stop it or to continue. Best wishes!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Fri Nov 06, 2009 10:19 am",
    "category": "Oncology",
    "sub_category": "Prostate Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=86089&sid=f7d54a025406c4567f15049349309765#p86089"
  },
  {
    "author": "stillhere1947  Guest Posts: 1 Joined: Mon Jan 05, 2009 9:54 am Gender: Male",
    "title": "Anal sex after prostate surgery",
    "content": "I'm a closeted gay man who, almost two years ago, had surgery to remove a cancerous prostate.  Thankfully, all of my PSA tests since the surgery have indicated no return of the cancer and I'm in good shape in all other areas.  Now I'm wondering if and when I can start having anal [as the insertee] sex again.  I'm asking simply for a medical answer.  For the record, my partner ALWAYS used condoms and will continue to do so if we get the ok to start having anal sex again.  Thank you.\n\n",
    "posted_time": "Post  by stillhere1947 » Mon Jan 05, 2009 10:21 am",
    "category": "Oncology",
    "sub_category": "Prostate Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=66983&sid=f7d54a025406c4567f15049349309765#p66983"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "Re: Anal sex after prostate surgery",
    "content": "Hello,  Thank you for your question.   Regarding anal sex and prostate cancer, it obviously poses no increased risk of recurrence as I am sure you are aware. However, I understand that your concern is whether anal sex can affect the area of surgery. I am assuming this is a retro pubic resection. If you underwent a perineal resection there are concerns about higher rates of rectal incontinence.  Transrectal manipulations such as a rectal exam or transrectal sonar or biopsy are known sometimes to raise the PSA levels temporarily and can affect follow up if the prostate is intact. Even vigorous cycling and heterosexual activity can cause a transient rise in PSA levels. In your case I am assuming that there isn't any prostate tissue left.  It would be difficult for me to answer this question without having all the data. I am unable to give you the go ahead on this forum. I understand your need for discretion and you may consider a second opinion at a University Hospital where staff will approach your concern in a professional manner.  I hope that helps.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Tue Feb 03, 2009 8:36 am",
    "category": "Oncology",
    "sub_category": "Prostate Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=70454&sid=f7d54a025406c4567f15049349309765#p70454"
  },
  {
    "author": "sammy14  Guest Posts: 2 Joined: Sat Dec 20, 2008 8:57 pm Gender: Female",
    "title": "Can't Find The Cancer",
    "content": "Hello, my father had prostate cancer about 9 years ago and he had 2 choices, remove the prostate or get chemo. He chose removal.   Now he was told about a year ago from blood work that he has cancer again but they could not locate where it was at. He has had a MRI and a Cat scan, still no luck.   His numbers started off at a 2 when first diagnosed now after a year they are a 10.The doctor mentioned taking Estrogen but he said he could only live with one female in the house verses two!   Is there not any technology out there to find where his cancer is? Someone mentioned to me before about a Pet scan. Can you tell me a little about this scan or any other technology out there to help him?  Thank you, Sammy\n\n",
    "posted_time": "Post  by sammy14 » Sat Dec 20, 2008 9:24 pm",
    "category": "Oncology",
    "sub_category": "Prostate Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=65513&sid=f7d54a025406c4567f15049349309765#p65513"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "Re: Can't Find The Cancer",
    "content": "Hi, I am sorry to hear about your father.   When the PSA increases to the levels your father has it is more likely that he has metastasis. According to your description a local recurrence has been excluded by CT/MRI. Has he had a bone scan done? The bone is one of the most common sites of spread in prostate cancer.  A PET scan is a functional scan that is very sensitive for detecting the presence of cancer. There may be a role for PET scanning if your father's work up (including bone scan) is negative.  Best regards,\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Sat Dec 27, 2008 10:43 am",
    "category": "Oncology",
    "sub_category": "Prostate Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=66028&sid=f7d54a025406c4567f15049349309765#p66028"
  },
  {
    "author": "sammy14  Guest Posts: 2 Joined: Sat Dec 20, 2008 8:57 pm Gender: Female",
    "title": "Re: Can't Find The Cancer",
    "content": "Thanks for the good info! I have scheduled an appointment with a Doctor here in the Bay Area for a bone scan to start. I was frustrated because they told him they couldn't find the cancer but be happy he lived a good life. I can't except that. So thanks again!   Sammy\n\n",
    "posted_time": "Post  by sammy14 » Sun Dec 28, 2008 3:01 pm",
    "category": "Oncology",
    "sub_category": "Prostate Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=66163&sid=f7d54a025406c4567f15049349309765#p66163"
  },
  {
    "author": "Slammers  Guest Posts: 1 Joined: Wed Jul 27, 2005 12:54 am Location: marco island",
    "title": "Pain in the Butt..........",
    "content": "I am 46 years old and for the last several weeks have been experiencing a sensation that I am sitting on a golf ball.  The feeling really only occurs when I am sitting. I also have low back pain and an increase in the frequency of urination. My urine also looks greenish/yellow. Do I have prostate cancer???\n\n",
    "posted_time": "Post  by Slammers » Wed Jul 27, 2005 1:01 am",
    "category": "Oncology",
    "sub_category": "Prostate Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=17547&sid=f7d54a025406c4567f15049349309765#p17547"
  },
  {
    "author": "jeanniern  Guest Posts: 6 Joined: Sat Nov 05, 2005 9:17 pm Location: Illinois",
    "title": "[no title]",
    "content": "You should definitely make an appointment tp have your prostate examined. Only your doctor could tell you if tt is malignancy. Don't wait.\n\n",
    "posted_time": "Post  by jeanniern » Sat Nov 05, 2005 11:48 pm",
    "category": "Oncology",
    "sub_category": "Prostate Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=24631&sid=f7d54a025406c4567f15049349309765#p24631"
  },
  {
    "author": "Dr. E Asis  Medical Doctor Posts: 7 Joined: Tue Nov 25, 2008 12:37 am Gender: Male",
    "title": "Re: Pain in the Butt..........",
    "content": "Based from the symptoms that you are having right now and from your age,  you are probably suffering from a condition called benign prostatic hyperplasia. Its a common condition among male in your age group. We cannot really tell if it is cancerous unless a biopsy of the prostate is done. You better consult your doctor so that he can do a digital rectal exam, a prostate ultrasound and probably  request for blood work up  such as serum PSA (prostate specific antigen).\n\n",
    "posted_time": "Post  by Dr. E Asis » Thu Dec 04, 2008 8:14 pm",
    "category": "Oncology",
    "sub_category": "Prostate Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=65102&sid=f7d54a025406c4567f15049349309765#p65102"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "Re: Pain in the Butt..........",
    "content": "Hi there, I agree with Asis but would like to add that benign prostatic hyperplasia (BPH) usually appears in older individuals with a prevalence of 80% in men above the age of 80 years. That said, even cancers of the prostate can appear in men as young as 40 years old.  Symptoms of prostate disease are usually of the voiding and post-micturition type rather than the storage variety (eg, daytime frequency or nocturia). However, they can sometimes be the dominant symptoms in prostate disease.  I would think with your complaint and the pattern of pain (tenderness rather) that you probably have a thrombosed hemorroid. This classically leads to the sitting on a 'golf ball' sensation. In this case the frequency and the back pain would be unrelated.  Again as Dr. Asis suggested an examination is in order.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Fri Dec 05, 2008 7:43 am",
    "category": "Oncology",
    "sub_category": "Prostate Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=65114&sid=f7d54a025406c4567f15049349309765#p65114"
  },
  {
    "author": "GypsyAnne  Guest Posts: 1 Joined: Tue Nov 11, 2008 1:27 pm Gender: Female",
    "title": "Alternative Med for Chronic Cancer Pain?",
    "content": "My husband's grandfather suffers from chronic pain brought on by prostate cancer.  My question is, Is there a good alternative to morphine to combat the pain?  Any help and a quick reply would be greatly appreciated.  Thanks. A.S.\n\n",
    "posted_time": "Post  by GypsyAnne » Tue Nov 11, 2008 1:30 pm",
    "category": "Oncology",
    "sub_category": "Prostate Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=63889&sid=f7d54a025406c4567f15049349309765#p63889"
  },
  {
    "author": "terrytb  Guest Posts: 1 Joined: Fri Sep 19, 2008 11:28 am Gender: Female",
    "title": "Testostrone / prostate cancer",
    "content": "My husband had testicular cancer and lost one testicle 14 yrs ago.  He's doing well and all test are fine.  About 5 years ago he asked the Dr to test for low testostrone and he came back borderline low.  The Dr put him on Androgel and he's been on it ever since.  I have serious concerns about this since the Dr has never retested to be sure the levels are right and I worry about Prostate cancer.  He has had and continues to have problems with urinary flow and leakage (which he doesn't tell his Dr), he no doubt has sleep apnea (I listen to him at night ... not breathing, snoring, snorting to get a breath and not feeling rested in the morning), again, he doesnt' tell his Dr this and also, he's become much more easily aggitated about things, angry and obsessive at times.  We've been married 24 yrs and I've notice a big difference in his personality this past 5 years.  I'd like to send his Dr a letter telling him all the things that my husband won't bring up (he's afraid the Dr will test him and take away the androgel), he also has told me that he doesn't use the androgel each year when he has blood work done just in case they test his testostrone level so I presume he knows it may be high.  The Dr only checks PSA, Testicular Cancer markers, and CBC.  I feel like he's addicted to the drug and the \"high\" it gives him and isn't able to consider (and doesnt' want to  think about) the long term problems which obviously would affect us both.  What type of follow up should be being done?  Is his Dr liable to share info that I send to him about problems that he's having that he's not sharing?  Obviously, he'd be angry at me if he knew I'd shared info with the Dr about problems he's having.   I don't want to see him end up with prostate cancer when it could possibly be minimalized by customizing his testostrone doseage and better follow up care.  Can you help me so I can do what's right for him?\n\n",
    "posted_time": "Post  by terrytb » Fri Sep 19, 2008 11:51 am",
    "category": "Oncology",
    "sub_category": "Prostate Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=60994&sid=f7d54a025406c4567f15049349309765#p60994"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "Re: Testostrone / prostate cancer",
    "content": "Hello, Androgel is a gel containing 1% testosterone. Indications of its use include men who have testicular failure diagnosed by low serum testosterone levels and above normal gonadotropins (FSH, LH) levels.  Serum testosterone levels are measured 14 days after therapy initiation to ensure proper dosing and serum level.  It is true that testosterone esters can potentiate sleep apnea, especially in obese individuals or patients with chronic lung diseases. Depression, nervousness and emotional lability are known side effects that resulted in discontinuation of therapy in some studies.  Patients on testosterone replacement therapy should undergo screening for prostate cancer with PSA and DRE every 6-12 month. PSA is the most useful test for prostate cancer screening and it is reassuring that his doctor regularly examine him clinically and order a blood evaluation for PSA. Any warning or new symptoms should be reported to initiate proper investigations that include non invasive techniques like transrectal US.   I understand your worry about his symptoms and his reaction if you inform his doctor without his agreement. However, it is essential to inform his doctor with his current symptoms for proper management. You have to try to convince him get checked and to make sure he is going to inform his doctor with all his complaints. His doctor should also know hat your husband is not following the recommended dose so that testosterone level evaluation is essential.  Please keep us updated. Best regards.\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Mon Oct 13, 2008 4:47 pm",
    "category": "Oncology",
    "sub_category": "Prostate Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=62142&sid=f7d54a025406c4567f15049349309765#p62142"
  },
  {
    "author": "kazza26  Guest Posts: 38 Joined: Mon Jun 16, 2008 5:50 am Gender: Female",
    "title": "what are his chances with prostate cancer a second time",
    "content": "my uncle had prostate cancer but he got rid of it and it went into remission unfortunatly its now come back,my mum said if cancer comes back a second time the chances of survival are very low,as my grandad had skin cancer that went then he had liver cancer and died from it very quickly,so is there a high chance my uncle will die know he has prostate cancer a second time\n\n",
    "posted_time": "Post  by kazza26 » Fri Oct 10, 2008 10:36 am",
    "category": "Oncology",
    "sub_category": "Prostate Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=62051&sid=f7d54a025406c4567f15049349309765#p62051"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: what are his chances with prostate cancer a second time",
    "content": "Hello -  While I don't know what the specific statistics are on this type of cancer recurrence, I can tell you a couple things. First, any cancer carries a risk of recurrence. A cancer which recurs carries a statistically worse prognosis than a first-time cancer in the same location. All that being said, cancer is pretty much an ongoing problem, and while we always hope it won't recur, it can. It hasn't,  apparently, spread to any other part  of his body, so it's still localized and the doctors are aware of it. If it hasn't spread, prostate cancer is one of the more manageable ones. So the statistical chances for survival improve, theoretically because of that. It's difficult to say, without a lot of specifics, just how this bout of prostate cancer may play out, but it could be the original cancer was treated conservatively, which means it could be treated more radically this time (with removal of the prostate). There's no telling how this will turn out, but it is a better scenario than many are, and one can't compare one type of cancer with another, nor one case with another.   Hopefully your uncle's doctors are on  top of the problem -- since once one has had cancer, one has to be followed for it anyway,  even if it seems to be gone. This works to your uncle's advantage.  Best of luck to your uncle in his fight with this.  Please stay in touch here.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Sun Oct 12, 2008 8:55 pm",
    "category": "Oncology",
    "sub_category": "Prostate Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=62112&sid=f7d54a025406c4567f15049349309765#p62112"
  },
  {
    "author": "kazza26  Guest Posts: 38 Joined: Mon Jun 16, 2008 5:50 am Gender: Female",
    "title": "Re: what are his chances with prostate cancer a second time",
    "content": "ok thank you\n\n",
    "posted_time": "Post  by kazza26 » Mon Oct 13, 2008 3:29 pm",
    "category": "Oncology",
    "sub_category": "Prostate Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=62136&sid=f7d54a025406c4567f15049349309765#p62136"
  },
  {
    "author": "actor4stmtv  Guest Posts: 1 Joined: Fri Mar 07, 2008 11:24 am Gender: Male",
    "title": "Low FSH and LH",
    "content": "I have an \"irregular prostate\" as identified by my urologist.  I will be undergoing a US biopsy soon.  Bloodwork was done which has identified all things being normal (except PSA, results not back yet) except for unusually low FSH and LH.  They are so low that they are what they should be for a pregnant woman.  What could this mean in terms of prostate tumor(s)?\n\n",
    "posted_time": "Post  by actor4stmtv » Fri Mar 07, 2008 11:35 am",
    "category": "Oncology",
    "sub_category": "Prostate Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=55320&sid=f7d54a025406c4567f15049349309765#p55320"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "Re: Low FSH and LH",
    "content": "Hello,  This is confusing indeed. Reducing FSH and LH to low levels is actually one of the methods used to treat advanced prostate cancer tumors as these hormones are responsible for the production of endogenous androgens which enhance tumor growth.  Irregularity / asymmetry in the prostate gland requires that we rule out cancer. Your PSA level will help in the differential diagnosis.  Please update this topic and let us know how things turned out.  Best of luck!\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Sat May 31, 2008 3:53 am",
    "category": "Oncology",
    "sub_category": "Prostate Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=58434&sid=f7d54a025406c4567f15049349309765#p58434"
  },
  {
    "author": "mnn  Guest Posts: 1 Joined: Wed Jan 04, 2006 3:54 am Location: St. Louis Park, MN    USA",
    "title": "Post prostate radiation treatment anemia, intermittent back",
    "content": "My dad: 80, white, has smoked and used alcohol in the past, has had spinal fusion for a war injury, regular exercise, alert,active. Diagnosed with prostate cancer three years ago and underwent radiation therapy successfully. PSA very low. Problem: Rectal bleeding (thought to be a by-product of the radiation--treated but not corrected), severe anemia diagnosed Dec 2005 not responding well to medication, debilitating, intermittent back painfirst appearing May 2005 for which he uses a TENS unit and prescription medication. Has just begun to complain of pain in his groin.   Even though he completed radiation and follow up PSA's appear OK, can this cancer have spread to his bones or lymph system? Could this current batch of symptoms be related to a metastacized slow growing cancer? If the PSA is low, does that mean just the prostate itself is not the problem? Can you have a low PSA and still be dealing with a cancer--just not neccessarily a prostate cancer?  Thank you so very much for your insight--he's not exactly forthcoming, and I need help getiing him help.\n\n",
    "posted_time": "Post  by mnn » Wed Jan 04, 2006 4:28 am",
    "category": "Oncology",
    "sub_category": "Prostate Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=27680&sid=f7d54a025406c4567f15049349309765#p27680"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi mnn, There are numerous causes for intermittent back pain and rectal bleeding. Have there been any diagnostic studies to identify the etiology of the bleeding such as EGD, Colonoscopy, etc? Have there been any diagnostic studies to identify the etiology of the back pain, xrays, CT Scan, MRI, etc? If these diagnostic studies have not been completed for evaluation of the underlying disorder I would strongly suggest inquiring with his physician about this being completed. Sincerely, Theresa Jones, RN\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Tue Feb 28, 2006 5:42 am",
    "category": "Oncology",
    "sub_category": "Prostate Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=31496&sid=f7d54a025406c4567f15049349309765#p31496"
  },
  {
    "author": "basketball  Guest Posts: 3 Joined: Thu Jul 21, 2005 1:29 pm Location: california",
    "title": "foreskin/penis question",
    "content": "I am 15. A couple of weeks ago I woke up in the middle of the night because I felt a wierd feeling on my penis. When I looked at my penis, I realized that it was because the foreskin had been pulled back. It was kind of wierd, the foreskin was pulled back far enough so I could see the smegma, kind of like when I wash my smegma in the shower. So when I saw it, I just cleaned off some of the smegma and pushed the foreskin back into place... This has been happening more recently now, it just happened a couple of days ago. I wanted to know if this is normal or what might be causing it. My theory is that I could be that I get an erection at night, and some how the foreskin gets pushed back. Please reply if you have any idea, as I am getting worried.\n\n",
    "posted_time": "Post  by basketball » Thu Jul 21, 2005 2:05 pm",
    "category": "Oncology",
    "sub_category": "Prostate Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=17201&sid=f7d54a025406c4567f15049349309765#p17201"
  },
  {
    "author": "Dr. Anthony Solomon  Medical Doctor Posts: 510 Joined: Mon Nov 15, 2004 6:04 pm",
    "title": "UNFORCED RETRACTION OF THE PENIS",
    "content": "You may be right in your assumption that an unforced retraction of the foreskin may be due to a nocturnal erection. As long this retraction does not cause paraphimosis, it is harmless.  Your post is in the wrong forum, and it explains why it was not spotted early enough for an answer.  Dr Anthony Solomon Consultant Physician, Tropical & Genitourinary Medicine\n\n",
    "posted_time": "Post  by Dr. Anthony Solomon » Fri Dec 16, 2005 5:19 pm",
    "category": "Oncology",
    "sub_category": "Prostate Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=26878&sid=f7d54a025406c4567f15049349309765#p26878"
  },
  {
    "author": "JayJee04  Guest Posts: 5 Joined: Mon May 09, 2005 3:26 pm Location: Illinois",
    "title": "Problem?",
    "content": "Today, i noticed a dark/blackish substance in my semen.. i am not experiencing any pain or discomfort though.  Is this something serious?  what could be the cause for this?\n\n",
    "posted_time": "Post  by JayJee04 » Thu Jul 21, 2005 3:48 pm",
    "category": "Oncology",
    "sub_category": "Prostate Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=17207&sid=f7d54a025406c4567f15049349309765#p17207"
  },
  {
    "author": "druv  Guest Posts: 5 Joined: Thu Oct 06, 2005 12:33 am Location: india",
    "title": "[no title]",
    "content": "this need to be dealth with seriously and why don't you show yourself to a good doctor .. when the male testosterone levels are alarminlgy high then its a cause for worry. hope this is not the case with you. what medications are you taking .\n\n",
    "posted_time": "Post  by druv » Thu Oct 06, 2005 12:52 am",
    "category": "Oncology",
    "sub_category": "Prostate Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=22620&sid=f7d54a025406c4567f15049349309765#p22620"
  },
  {
    "author": "papia  Guest Posts: 3 Joined: Sun Oct 09, 2005 11:33 am Location: bangladesh",
    "title": "[no title]",
    "content": "hi jayjee, I feel druv is right. you should go and show yourself to a good doctor. casoded is used in combination with another treatment that reduces the amount of testosterone in the body which could be the reason for the discomfort.. casodex should not be used by:anyone sensitive or allergic to the ingredients of the tablet or people with early stage of  prostate cancer who would otherwise undergo watchful waiting ,children and females .\n\n",
    "posted_time": "Post  by papia » Sun Oct 09, 2005 12:05 pm",
    "category": "Oncology",
    "sub_category": "Prostate Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=22906&sid=f7d54a025406c4567f15049349309765#p22906"
  },
  {
    "author": "mwaura  Guest Posts: 4 Joined: Thu Oct 27, 2005 12:47 pm Location: nairobi",
    "title": "[no title]",
    "content": "hi a darkish substance could be anything maybe even blood i thinnk you should seriously consider seeing a good urologist for a thorough physycal examination and tests he should order prostate specific antigen ( p.s.a )and do a routine abdominal pelvic ultrasound to rule out any new growth or distortion in normarl anatomy of  the prostate also you should be observant on youre part in noticing any problems with urination  such as incontinence  or hesitancy in passing urine or testicular pain or swelling  .also check for assay of testesterone levels in a good lab hope u get well\n\n",
    "posted_time": "Post  by mwaura » Thu Oct 27, 2005 1:12 pm",
    "category": "Oncology",
    "sub_category": "Prostate Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=24182&sid=f7d54a025406c4567f15049349309765#p24182"
  },
  {
    "author": "alex1987  Guest Posts: 1 Joined: Fri Jul 15, 2005 7:01 pm Location: israel",
    "title": "I don't know if its cancer?",
    "content": "Sorry for my english.... I have a weard braun\\black dot on my penis. I need to know if its can be cancer.\n\n",
    "posted_time": "Post  by alex1987 » Fri Jul 15, 2005 7:11 pm",
    "category": "Oncology",
    "sub_category": "Prostate Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=16881&sid=f7d54a025406c4567f15049349309765#p16881"
  },
  {
    "author": "Dr. Anthony Solomon  Medical Doctor Posts: 510 Joined: Mon Nov 15, 2004 6:04 pm",
    "title": "LESION ON PENIS",
    "content": "More information is needed to be able to assist you. Is the brownish / black dot raised above the skin or flat, growing bigger, ulcerating or bleeding? Is it painful or itchy?  How old are you? Did it occur after sexual contact? Have you shown it to any doctor? Can you provide close-up views of the lesion?  Dr Anthony Solomon Consultant Physician, Tropical & Genitourinary Medicine\n\n",
    "posted_time": "Post  by Dr. Anthony Solomon » Sat Jul 16, 2005 8:38 am",
    "category": "Oncology",
    "sub_category": "Prostate Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=16910&sid=f7d54a025406c4567f15049349309765#p16910"
  },
  {
    "author": "mat0120  Guest Posts: 6 Joined: Mon Jan 17, 2005 5:22 pm",
    "title": "Info",
    "content": "I know this sounds stupid but anyway...  I hear all the time of people finding lumps 'down below', cust surious, can you see a lump when it comes or do they feel it?  Obviously there are two balls, is is normal for one to be bigger than the other? And they are not 'balls', more longer than ball shaped?!\n\n",
    "posted_time": "Post  by mat0120 » Tue Mar 08, 2005 1:10 pm",
    "category": "Oncology",
    "sub_category": "Prostate Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=10566&sid=f7d54a025406c4567f15049349309765#p10566"
  },
  {
    "author": "Rhonda P, CEP  Paramedic Posts: 252 Joined: Wed Mar 16, 2005 8:37 am Gender: Female Location: USA",
    "title": "testicular questions",
    "content": "The testicles aren't both the exact same size but they are relatively close in size. They aren't perfectly round, more egg shaped. Here is a link that may help answer questions for you.  http://www.testicle-pain-symptoms.com/h ... atomy.php3\n\n",
    "posted_time": "Post  by Rhonda P, CEP » Sat Mar 19, 2005 2:56 pm",
    "category": "Oncology",
    "sub_category": "Prostate Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=11104&sid=f7d54a025406c4567f15049349309765#p11104"
  },
  {
    "author": "mzhignz  Guest Posts: 2 Joined: Fri Jan 07, 2005 1:43 am Location: ohio",
    "title": "PSA",
    "content": "My father had his prostate removed in April. All blood tests have come back with a psa of 0 until December. These results came back with a .4 of a point raise in psa. It is my understanding that any rise in psa after surgery means the cancer had spread. Is this correct or is there a chance of a mistake? His next test is in a few weeks. I would appreciate any information about this. I'm worried sick and my father doesn't give me much information.\n\n",
    "posted_time": "Post  by mzhignz » Fri Jan 07, 2005 1:50 am",
    "category": "Oncology",
    "sub_category": "Prostate Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=7854&sid=f7d54a025406c4567f15049349309765#p7854"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "mzhignz, I can understand your concern and frustration. Posts are answered just as quickly as possible and we do the best we can. Not one post on this forum is any more or less important than another. Now in answer to your question, after a prostate is removed, generally speaking an elevation in PSA levels are considered suspicious and warrants evaluation by chest xray, bone scan etc. to rule  out any recurrence or spread of cancer. Sincerely, Rntdj\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Sat Jan 08, 2005 10:17 am",
    "category": "Oncology",
    "sub_category": "Prostate Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=7901&sid=f7d54a025406c4567f15049349309765#p7901"
  },
  {
    "author": "mzhignz  Guest Posts: 2 Joined: Fri Jan 07, 2005 1:43 am Location: ohio",
    "title": "[no title]",
    "content": "Thanks a lot rntdj\n\n",
    "posted_time": "Post  by mzhignz » Sat Jan 08, 2005 2:17 pm",
    "category": "Oncology",
    "sub_category": "Prostate Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=7913&sid=f7d54a025406c4567f15049349309765#p7913"
  }
]