[
  {
    "author": "pbanxious  Guest Posts: 1 Joined: Wed Aug 18, 2010 3:30 pm Gender: Female",
    "title": "Possible Kidney Cancer and Prominent Lymph Nodes",
    "content": "My 38 year old husband went to the ER last week due to vomiting, diarrhea and abdominal pain.  They did a CT scan and incidentally found a mass on his kidney that was 3.8 cm. The mass was confirmed through a renal US. After testing on his stool he was found to have Salmonella.  In the Ct scan he had done in the ER it stated \"prominent lymh nodes\".  The urologist wants to wait about 6 weeks before getting a CT scan with contrast in order for the inflammation from the Salmonella to be gone.  I am very concerned that prominent lymph nodes means the cancer has already spread, but the urologist says it could be from the Salmonella poisoning and it is best to wait so the results of the CT and eventual surgery are predictable and without complication.  Could it be possible that the lymph nodes around his kidney were prominent from a Salmonella infection, or do you think the cancer could have spread already?\n\n",
    "posted_time": "Post  by pbanxious » Wed Aug 18, 2010 3:40 pm",
    "category": "Oncology",
    "sub_category": "Renal Cell Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=101243&sid=8c2dda837e9286cf7c61de9923046967#p101243"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: Possible Kidney Cancer and Prominent Lymph Nodes",
    "content": "Hi, Thank you for the post.  You say that the CT scan report said there was 'lymphadenopathy', but there is no mention of which group/groups of lymph nodes were seen to be enlarged.   In salmonella enteritis, apart from the diffuse wall thickening typically seen in the ileum(salmonella ileitis), there are frequently, enlarged \"regional\" lymph nodes-usually the mesenteric nodes, and at times, the periportal lymph nodes.It is very unusual to have enlarged lymph nodes near the kidneys due to a salmonella enteritis.  Your urologist naturally, would prefer to wait and see if the nodes would subside with the treatment for salmonella enteritis (they are likely to), before attributing the nodes to the renal 'mass'. Good luck!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Sat Aug 28, 2010 11:45 am",
    "category": "Oncology",
    "sub_category": "Renal Cell Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=101959&sid=8c2dda837e9286cf7c61de9923046967#p101959"
  },
  {
    "author": "jmakh  Guest Posts: 1 Joined: Thu Oct 15, 2009 11:36 am Gender: Female",
    "title": "aren't I too young to have had Renal Cancer",
    "content": "I am a 34-year-old female who was diagnosed with renal cancer March - April 2007 (32 at the time) I had a partial nephrectomy of my right kidney after which a biopsy said it was actually pre-cancerous. what does that mean, really?  I was never refered to an oncologist, though our hospital (small town) did have an oncology department. I was alone at school and had no advocate or support system and things essentially just \"happened\" to me. It was an incidental finding and very small. I had earlier CT scans only a year before and no cancer was seen then. So was it just new and is there any way that this could have come from some other area in my body? Noone has ever checked, and now I have moved, have new doctors, etc. The only thing I can find is that apparently this is more of a \"geriatric\" cancer, though has been found in people in there 40s. I have looked up the risk factors and possess NONE. I have never smoked, or drank alcohol, or taken drug; I have never been on any medications, I am not a man, I am white and way younger than 60 years; I exercise regularity (though not excessively), I eat healty, I rest enough, I even practice yoga...  My question is two-fold:  How could I have even gotten this cancer? and Do I need to worry about any cancer in the future?  Sincerely, MC\n\n",
    "posted_time": "Post  by jmakh » Thu Oct 15, 2009 12:31 pm",
    "category": "Oncology",
    "sub_category": "Renal Cell Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=83920&sid=8c2dda837e9286cf7c61de9923046967#p83920"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: aren't I too young to have had Renal Cancer",
    "content": "Hi, Firstly let me try to appraise you of some of the reported features of renal cell carcinoma (RCC).  Unlike many genitourinary malignancies, premalignant lesions in the kidney are scarcely described. Intratubular epithelial dysplasia has been sited as the most common precursor of RCC.   In von Hippel-Lindau syndrome (VHL) where the evolution from a simple cyst - - atypical cyst with epithelial hyperplasia- - to cystic or solid conventional  RCC is well described in the literature.  An adenoma-carcinoma sequence has been recognized in the genesis of papillary RCC  with specific genetic changes.   Familial and genetic factors are well documented in VHL disease, in hereditary papillary RCC, in the tuberous sclerosis complex and in familial RCC.  One other thing worth noting is the observation that the familial renal cell carcinomas tend to occcur in younger individuals and could be bilateral.  Also, the incidence in women is on the increase and approaching that of men.  In the absence of more information (such as the histological type of your tumor, results of genetic studies (if any), it is difficult to predict the future course of your disease. Let's hope for the best.Good day!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Thu Nov 05, 2009 7:38 am",
    "category": "Oncology",
    "sub_category": "Renal Cell Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=85975&sid=8c2dda837e9286cf7c61de9923046967#p85975"
  },
  {
    "author": "Dig62  Guest Posts: 2 Joined: Thu May 31, 2007 6:13 pm",
    "title": "Question about follow-up care.",
    "content": "Hello and thank you in advance.  I'm a 44 year-old male diagnosed with stage II renal cell carcinoma in 2000 (at age 37).    My physician stopped providing follow-up care for this in 2005, stating that I had made it to the five year mark and the cancer is guaranteed not to come back.  It has now been two years since I have had follow-up testing of any kind and this does not feel quite right to me.  Further, I have never had a follow-up CT scan since my nephrectomy.  Only chest x-rays and bloodwork until 2005.  This is disconcerting to me since the original tumor did not show up on my bloodwork at all... only on CT scan and by accident.   So how can bloodwork and chest x-ray alone be a reliable indicator?  I would be grateful for any advice on proper follow-up care for renal cell carcinoma.  Sincerely,  Dig62\n\n",
    "posted_time": "Post  by Dig62 » Mon Jun 11, 2007 7:00 pm",
    "category": "Oncology",
    "sub_category": "Renal Cell Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=43539&sid=8c2dda837e9286cf7c61de9923046967#p43539"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Follow up plans for long term survivors of cancer may vary from oncologist to oncologist.  I am not knowledgeable enough in this area to know the direct answer to your question.  You may want to call another oncologist to ask their typical practice.  Additionally, some of my colleagues on this site may know more specific information for you about this.  Best wishes, and congratulations on making it to the five year mark.l\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Mon Jun 11, 2007 8:25 pm",
    "category": "Oncology",
    "sub_category": "Renal Cell Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=43541&sid=8c2dda837e9286cf7c61de9923046967#p43541"
  },
  {
    "author": "nipnose  Guest Posts: 2 Joined: Thu Apr 22, 2004 9:03 pm Location: Kentucky, USA  Contact:   Contact nipnose       Yahoo Messenger",
    "title": "Renal Cell Cancer",
    "content": "My husband who is 64 years old was diagnosed with nh lymphoma in March 2003. He underwent chemo and it went into remission for a while. He started having skin cancers and upon removing one on his face, the doctor discovered the kidney cancer and also a head and neck tumor called adnexal tumor. My husband is now refusing any treatments and no surgery on that kidney or the tumor that is on his neck. Do you know what our family can expect as far as time and the things that his body will be going through? The kidney and head and neck cancer was discovered in September of 2005. Also, the lymphoma is out of remission at this point.  Thanks for any advice you can give me.\n\n",
    "posted_time": "Post  by nipnose » Thu Sep 14, 2006 11:38 pm",
    "category": "Oncology",
    "sub_category": "Renal Cell Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=34051&sid=8c2dda837e9286cf7c61de9923046967#p34051"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Hello nipnose,  I am a bit confused with your report. Could you possibly tell me the details of the tumor histology? Is it a renal cell carcinoma that was discovered in the kidney and what was the histology of the cancer discovered in the head and neck?  Best regards,\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Fri Sep 15, 2006 8:36 am",
    "category": "Oncology",
    "sub_category": "Renal Cell Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=34064&sid=8c2dda837e9286cf7c61de9923046967#p34064"
  },
  {
    "author": "Eka  Guest Posts: 6 Joined: Sun Oct 02, 2005 2:21 pm Location: Georgia",
    "title": "Asking of advice",
    "content": "Patient: Female  Age: 20 years old  Diagnosis: Tumor renis dext., IV st., T3N2M1(pulm, lym)  Which treatment can be recommended?  [/b]\n\n",
    "posted_time": "Post  by Eka » Fri Oct 07, 2005 10:38 am",
    "category": "Oncology",
    "sub_category": "Renal Cell Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=22761&sid=8c2dda837e9286cf7c61de9923046967#p22761"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Dear Eka,  It would have been more helpful if you give more details about the pathological, the investigations results and the clinical data  for this patient, as well as her personal and family history (being young).  Metastatic renal cell carcinoma is known to be resistant to chemotherapeutic agents with a 6% overall response rate to the currently used chemotherapeutics.  Interleukin-2 is the only FDA-approved treatment for metastatic renal cell carcinoma is high-dose interleukin-2 and showed significant treatment results.  Other new chemotherapeutic and approaches like antiangiogenic factors are under investigation. Whenever possible patients with metastatic and advanced renal caner should be enrolled in clinical trials.  Best regards,\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Thu Aug 03, 2006 12:47 pm",
    "category": "Oncology",
    "sub_category": "Renal Cell Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=33643&sid=8c2dda837e9286cf7c61de9923046967#p33643"
  },
  {
    "author": "Neo776  Guest Posts: 4 Joined: Thu Dec 08, 2005 6:01 am Location: Australia",
    "title": "RCC Metastasis Lung, Liver and Toe?",
    "content": "Hello,  I am writing on behalf of my father, I'm just simply helping him out in his search for an answer, as well as my growing curiosily for Oncology studies.   Last December (2004) my father had a radical nephrectomy on his left kidney. The surgery did also reveal that the tumor was not only on the kidney, but also streching into the vena cava. They removed what they could, but the surgery got complicated (uncontrollable bleeding), so they removed what they could, but they did tell us that the cancer may come back.   So now it's a year and scans reveal that there is a tumor in his lung (from what i know 2cm), and his liver (1.7cm), and on his toe (not sure but at least 2cm). I've already researched and from what I know the Stage IV RCC spreads to the lung and liver, but nothing about a toe...but I have been told in extremely rare cases it does, but I have not found any information on it.   The thing is either my father is lying, but the tumor is shrinking. A couple of months ago he went for scans. Lung and Liver tumors were revealed. Lung tumor size is 2cm and the Liver is 1.7cm. Now hes had another round of scans (mainly CT, no MRI because of surgical staples) and they show that the tumors have shrunken down. Lung is not 1.7cm and the Liver is 1.3cm. Is this possible? From what I know it's not but...  Either that's the case, or it hasn't grown over the past few months.   He did have a tumor ressection[sp?] on that toe, me and my father are aware that there is a very high chance it will come back (on the toe), so he is going for biologic therapy (another Stage IV criteria for treatment) to strengthen the immune system.   My questions are: 1. Is it possible for a tumor to start shrinking, or at least stay the same size? 2. How rare is the tumor on the toe after a RCC nephrectomy? 3. Any other possible treatments apart from biologic therapy? 4. Any clinical trials availible in Australia, or would overseas be a better bet? 5. Chance of life over a 5-year period? Or an approximate year life span? 6. This is the first case of cancer in the family, am I at risk? 7. Is his cancer truly a Stage IV RCC?  Original Kidney Tumor size: 7.5cm  Regards,         Angel C.\n\n",
    "posted_time": "Post  by Neo776 » Thu Dec 08, 2005 6:27 am",
    "category": "Oncology",
    "sub_category": "Renal Cell Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=26363&sid=8c2dda837e9286cf7c61de9923046967#p26363"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Dear Neo776,  About 5% of patients with renal cell carcinoma have renal vein or inferior vena caval involvement at presentation.  Surgical resection is the treatment of choice in such patients. Studies showed  66%  5-year survival rate for patients who underwent radical surgical resection for their primary tumors.  Renal cell carcinoma is an immunogenic tumor. Spontaneous tumor regressions have been reported in cases of renal cell cancer.  Those who develop solitary metastasis after a disease free interval of more than one year have also better survival.  An aggressive surgical approach should be considered for this type of patients as long as the general condition does not preclude surgical interference.  33% of patients with solitary metastases who underwent surgical resection, survived for more than 5 years in a study.   Chemotherapy and radiotherapy did not show any promising results in renal cancer patients. Immunotherapy showed promising results and Interleukin-2 is the only FDA-approved treatment in metastatic renal cell carcinoma. New immunotherapeutic approaches under investigation for the treatment of advanced renal cell cancer.  Since your father did not undergo complete surgical excision, there is a higher risk for local recurrence as well as distant metastases, although his tumor behavior and the natural course of his disease is good (one year disease free plus spontaneous regression),  he would benefit from immunotherapy in case of evident recurrent or  metastatic disease.  Regarding the toe metastases; although rare, metastases to the small bones or to the soft tissue of the hands and feet (acrometastases) have been reported.  I advise you to follow up with the oncologist and keep us updated. Best regards,\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Thu Aug 03, 2006 12:32 pm",
    "category": "Oncology",
    "sub_category": "Renal Cell Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=33642&sid=8c2dda837e9286cf7c61de9923046967#p33642"
  },
  {
    "author": "Mrmtman1950  Guest Posts: 1 Joined: Mon Mar 07, 2005 12:15 pm Location: Florida",
    "title": "RCC with Liver Metasasis",
    "content": "My husband was diagnosed with Renal Cell Carcinoma in November 2002. The tumor was 1.7cm x 1.9cm. The urologists told us then it was a well behaved cancer with minimal chance of recurrence. His cat scan for 2004 came back showing a 1cm metastasis on his liver. He is seeing an oncologist now but the waiting game is horrible. He is 55 years old and cancer runs rampant in his immediate family. Of the 9 children born to his mother 3 have died from various cancers before age 60. 4 of them are currently fighting cancer now. Our grandson passed away 4 years ago from Burkitts lymphoma.  Here is the question. Is the waiting game the best action to take with this? His next cat scan is in 3 weeks with another appointment with doc 4 days later.  Is a form of chemo always done in metastasis cancer? Considering it is the liver would a correct paln be an aggresive one? What is the survival rate this type of cancer. Thank you so much for your time.\n\n",
    "posted_time": "Post  by Mrmtman1950 » Mon Mar 07, 2005 1:39 pm",
    "category": "Oncology",
    "sub_category": "Renal Cell Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=10527&sid=8c2dda837e9286cf7c61de9923046967#p10527"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Dear Mrmtman1950,  Renal cell carcinoma occurs as a sporadic form (most common) and rarely as a familial form. At least 4 hereditary syndromes associated with renal cell carcinoma are recognized. In the majority of them the disease tends to be multifocal and bilateral.  First of all he has to complete his work up to be sure that he has solitary liver metastases. If this is the case then, a surgical oncologist should be consulted for the possibility of surgical resection.  A small subset of renal cancer patients have solitary metastasis either at the time of presentation or develops during follow-up after nephrectomy. In general patients with solitary metastases have a better survival.  Those who develop solitary metastasis after a disease free interval of more than one year have also better survival. An aggressive surgical approach should be considered for this type of patients as long as the general condition does not preclude surgical interference.   33% of patients with solitary metastases who underwent surgical resection, survived for more than 5 years in a study.  I advise you to follow up with his doctor and keep us updated. Hope you find this information useful.  Best egards,\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Thu Aug 03, 2006 12:06 pm",
    "category": "Oncology",
    "sub_category": "Renal Cell Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=33641&sid=8c2dda837e9286cf7c61de9923046967#p33641"
  },
  {
    "author": "mc  Guest Posts: 1 Joined: Thu Jun 10, 2004 7:29 am Location: los angles",
    "title": "Creatinine",
    "content": "Hello I only have one kidney.  One kidney was removed in 1993, due to stage one renal cell cancer.   I recently had a ct scan and there were no noted concerns.  My lab work showed a high creatin level.  I am wondering if any one can led me towards a web site or book with information on a diet that might lower my creatin level.  I take no drug or medication and have been a vegetarian for the last 12 years.    Thanks\n\n",
    "posted_time": "Post  by mc » Thu Jun 10, 2004 7:41 am",
    "category": "Oncology",
    "sub_category": "Renal Cell Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3636&sid=8c2dda837e9286cf7c61de9923046967#p3636"
  },
  {
    "author": "Dr. Jeffrey Gordon  Medical Doctor Posts: 127 Joined: Sun Jan 05, 2003 5:22 pm",
    "title": "Creatinine",
    "content": "MC,  My apologies for the delayed response to your question.  The backlog of questions is being dealt with as more of us here at The Lounge are responding to the increased number of people asking questions.  I do appreciate your posting your question here and I do hope that you will stop by The Lounge again.  We are endeavoring to do better than we have done in the past in responding to questions in a timely manner.  The best resource to go to regarding a diet that can be \"safe\" or appropriate given your kidney is is a nutritionist or a dietician, especially one whom has experience dealing with kidany patients.  Many hospitals have such people on staff.  The larger hospitals may well have someone whom works in the Renal Medicine department.  Jeffrey A. Gordon, M.D.\n\n",
    "posted_time": "Post  by Dr. Jeffrey Gordon » Sun Mar 06, 2005 6:45 pm",
    "category": "Oncology",
    "sub_category": "Renal Cell Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=10470&sid=8c2dda837e9286cf7c61de9923046967#p10470"
  }
]