[
  {
    "author": "darkestdays30  Guest Posts: 77 Joined: Wed May 02, 2007 9:43 am",
    "title": "Can persistent green urine signal kidney trouble",
    "content": "Was wanting to see if green urine (x 3 days so far) could signal kidney trouble, failure, or such. I've had problems with small stones since 3-07. Doctor gave me Cipro but urine showed no signs of infection. He was concerned it might be my liver (trace Bilrubin in urine). Came home, took Cipro, urine turned dark cloudy yellow and I started burning really bad, flank pain worsened, & I started having hesitency, was not occuring before taking the Cipro. Doctor would not change medication. Urine turned back to green. After 2nd dose, it turned yellow only the 1st time I had to pea, then back to green, burning stopped, pain calmed down, urine is still green today, am not having signs of an infection now but still some hesitency. I am worried my kidneys are malfunctioning. The doctor did not order a blood test on my kidneys. I did have a CT earlier that morning from another doctor but don't have the results.   Urine went from a greenish blue color to pale green, to a teal color, to a dirty looking green to lime green. I have not taking any medications, food, or liquids that would have caused this.\n\n",
    "posted_time": "Post  by darkestdays30 » Thu Jan 01, 2009 10:23 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=66546&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p66546"
  },
  {
    "author": "Dr.M.jagesh kamath  Medical Doctor Posts: 1303 Joined: Mon Aug 03, 2009 7:24 am Gender: Male",
    "title": "Re: Can persistent green urine signal kidney trouble",
    "content": "Hello,This is a very interesting case.Similar case of a boy in a road accident admitted in ICU was treated with Medication included dopamine, methylprednisone, antibiotics , muscle relaxants and sedatives (midazolam, propofol, fentanyl), low-molecular weight heparin, clonidine, fluids and parenteral nutrition with addition of electrolytes, vitamins and iron. The cause in this case was traced to propofol,a muscle relaxant due to excretion of a phenolic chromophore.After stopping the medication green urine cleared. Bowling P, Belliveau RR, Butler TJ. Intravenous medications and green urine. J Am Med Assoc1981; 246: 216[Abstract/Free Full Text]   Department of Nephrology and Internal Intensive Care Medicine, University Clinic Charité, Campus Virchow-Klinikum, Humboldt-University Berlin, Berlin, Germany5-726.Green urine after motorcycle accident. Nephrol Dial Transplant (2000) 15: 72Julia Lepenies, Evjenia Toubekis, Ulrich Frei and Ralf Schindler.  Best wishes.\n\n",
    "posted_time": "Post  by Dr.M.jagesh kamath » Fri Aug 27, 2010 12:35 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=101941&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p101941"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: Can persistent green urine signal kidney trouble",
    "content": "Hi, Dr.Jagesh has provided some very interesting references. Several other drugs have been reported to be associated with greenish discoloration of the urine. There is one case report of association of metoclopramide with green urine. This article sites references to association with other drugs as well. http://ndt.oxfordjournals.org/cgi/conte ... 19/10/2677 Best wishes!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Fri Aug 27, 2010 1:15 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=101943&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p101943"
  },
  {
    "author": "WorkerVeryHard  Guest Posts: 1 Joined: Thu Aug 05, 2010 1:37 pm Gender: Male",
    "title": "Sweaty Clothes smelling like ammonia",
    "content": "I have recently noticed my old sweaty work clothes smelling like ammonia.  I am a heavy sweater as I am an outdoor laborer.  My wife claims this is my smell, but within the past few days, I notice it....something I never paid attention to or nopticed in the past.  I am 37 and a daily drinker 3-6 per day.  I have been drinking since 18, though 1-3 a day in 20s.  Had a CT scan of abdominal with the dye back about 5 months ago found Diverticulitis.  Had 2 rounds of blood work and urine 5 months ago and 4 months ago.  All came back fine and Drs said I am healthy. Had blood and urine back in 2006 with one liver enzyme slighty elevated.  Dr. said no big beal.  Always informed doctors that I was a daily drinker.  Whites of eyes have a slight yellowish tinge, but been like this for many yrs.  Bowl movements are typically solid and 2 times a day.  Sometimes they are spotted dark and brown.   I take Claritn D everyday as I have alergies.  I take 600mgof liver milk thistle detox a day with artichoke, dandelion root,  vitamins a and c, broccoil root, licorice root, echinecea (super lysiene).  My urine is dark in am until a good regiment of water drinking.  Then it is light yellow to clear in color.  I get bubbles when urinating, but they are gone withn 5 minutes.  I drink at least 70 ounces of water a day, somethimes double.  I work lots of hours with many hard \"pushes\" through the day working up a massive sweat.  I am concerned about the ammonia smell.   Aside from it all, I know I drink too much.  I am trying to cut back.  My grandmother drank 2 beers a day until she died at 84.  My grandfather drank heavily and smoked heavily until he was 75, then drank only a beer or 2 a day until he died at 92.  Since I was just checked , do I need to be immediatley rechecked for liver and kidney since the ammonia is present?  Sorry for the long question, just wanted to give as much background as possible.\n\n",
    "posted_time": "Post  by WorkerVeryHard » Thu Aug 05, 2010 2:03 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=99801&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p99801"
  },
  {
    "author": "Dr.M.jagesh kamath  Medical Doctor Posts: 1303 Joined: Mon Aug 03, 2009 7:24 am Gender: Male",
    "title": "Re: Sweaty Clothes smelling like ammonia",
    "content": "Hello,The ammoniacal odor is likely an apocrine bromhidrosis which are more localized to axilla,and genital skin.In contrast eccrine or sweat based odours are less common and mainly caused by offending foods.The ammoniacal odor is caused by bacterial  overgrowth.Disturbance in aminoacid mechanisms,and generally from young age are seen in the eccrine couterpart.Liver failure would produce a classic rotten eggs smell. Many a times patient's perception and nothing more may be the cause eg Body dysmorphic disorder. Antibacterial soaps do help so do antiperspirants.\n\n",
    "posted_time": "Post  by Dr.M.jagesh kamath » Wed Aug 11, 2010 11:01 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=100444&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p100444"
  },
  {
    "author": "abbisnana  Guest Posts: 1 Joined: Tue Aug 03, 2010 5:04 pm Gender: Female",
    "title": "Dialysis and complete kidney shut down",
    "content": "My mom has been on dialysis for about a year. She had to go to the Er the other night and she told the nurse that she has not been able to urinate at all that day. The nurse told us that her ability to urinate was the only thing keeping her alive with her dialysis. If this is true, how long does she have.?\n\n",
    "posted_time": "Post  by abbisnana » Tue Aug 03, 2010 5:09 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=99575&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p99575"
  },
  {
    "author": "Faye Lang, RN, MSW  Nurse Posts: 468 Joined: Thu Oct 30, 2008 7:01 pm Gender: Female Location: California",
    "title": "Re: Dialysis and complete kidney shut down",
    "content": "Hello abbisnana,  The use of dialysis is to provide artificial replacement for lost kidney function in people with renal failure.  It may be used in other situations, such as with an acute kidney injury, or in progressive, chronically worsening kidney function, or stage 5 chronic kidney disease (also known as end-stage kidney disease).  Dialysis is used until a renal transplant if transplant can be performed, or as the only treatment if transplant is not an option.    I'm not sure what the nurse actually meant, but it's possible for dialysis to continue almost indefinitely.  The failure to produce urine is an indication that dialysis is needed. People who are able to make sufficient urine do not require dialysis, unless there is an injury as noted above.  The time a person \"has left\" is determined by the success of dialysis, or replacing kidney function, and any other diseases that might be present, such as diabetes, atherosclerosis, autoimmune disease, cardiac disease, or other conditions.  If your mother's condition is grave, her physician is the best person to estimate how long dialysis might be successful.  Her ability to attend dialysis and return home doesn't indicate an imminent end or sound like the situation is grave.   This is obviously a stressful situation for your mother and your family, and I encourage you and your mother to clarify this with her physician.  Good luck to you both.\n\n",
    "posted_time": "Post  by Faye Lang, RN, MSW » Sun Aug 08, 2010 12:10 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=100059&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p100059"
  },
  {
    "author": "Athanatsisu  Guest Posts: 2 Joined: Tue Aug 03, 2010 12:05 pm Gender: Male",
    "title": "Kidney problems and hypertension",
    "content": "Hi,  I have been having a tough time with blood pressure meds and wonder if it could be related to kidney problems. each time my doctor prescribes a new hypertension med for me to try, it works OK for a few weeks and them makes me feel absolutely miserable - headaches, lethargy, depression, etc. When I go off the meds for a few days, I feel back to normal but them my BP slowly climbs back up. It seems as though the BP meds build up in my system. Also, I am not responding as well to to Bp meds, although my weight has been stable for the last three years. Lastly, my urine appears a little cloudy.  Could all of these things be signs of kidney problems?\n\n",
    "posted_time": "Post  by Athanatsisu » Tue Aug 03, 2010 12:18 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=99539&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p99539"
  },
  {
    "author": "vineetvj2  Guest Posts: 1 Joined: Mon Jul 26, 2010 10:41 pm Gender: Male",
    "title": "chronic kidney disease- homeopathic or allopathic treatment",
    "content": "dear sir,              i am 27 years old, i am facing the problems due to CKD,i have problem in walking using right leg,my left hand is also shaking while holding things, my test reports are as below :-  DATE : 21-jul-10  HAEMOGLOBIN   8.4 Gm. % CREATININE       6.0 mg/dl.          method : JAFEE (GmbH GERMANY). BLOOD UREA      104 mg/dl.         method : GLDH  U/S. K.U.B. Rt Kid : 3.5 x 8.5 cm. few small cortical cysts are seen, largest at upper pole measures approx 1.3 x 1.2 cm. renal parenchymal echogenecity is increased with completer loss of corico medullary distinction.  Lt. Kid : 3.9 x 8.9 cm. few small coritical cyst, largest at middle pole 1.0 x 1.1 cm. Ureter is not dilated. Urinary Bladder: rescanning after micturition shows residual urine volume in the range of 07cc as against prevoid volume of 446cc. Prostate :  Homogeneous, non-median lobe type with smooth serosal outline.Measures 2.7 x 3.0 x 3.6 cm. weighs about 15 Gms, No focal seen.  24 hours urine report  date: 20-may-2010 Urine Total Protein       1.35 gm./24hrs    Urine protein loss : 27 mg./100ml.  24 hrs. urine amount : 5000 ml.  Allopathic doctor has prescribed me all these medicines as bellow :-  tab. shelcal 250            ( three times a day) cap. rocaltrol 0.25        ( alternate days) tab. livogin                  (twice a day) tab. folvite                  (twice a day) inj.  vintor 3000           (once a week) tab  remyclin               (once a day)  Homeopathic doctor has prescribed me this medicine as bellow :-  aalserum 7x                 (five drops three times a day)  Please advice me what is better for me. Thank you sir.\n\n",
    "posted_time": "Post  by vineetvj2 » Mon Jul 26, 2010 11:18 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=98782&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p98782"
  },
  {
    "author": "Dr. Hein  Guest Posts: 1 Joined: Sat Jul 24, 2010 12:50 am Gender: Male",
    "title": "Can prescribing ketostril slow down the renal failure?",
    "content": "I m from Myanmar. My Father has been diagnosed to have renal failure for a year. last year, he had leg oedema and saw a physician. His urinalysis showed proteinuria (+++) and serum creatinine was 350 mmol/L. He was urgently referred to a nephrologist. My Father underwent a left nephrectomy due to hydronephrosis 8 years ago. There were many urate stones blocking in his left kidney. Now he do regular follow up to the nephrologist. Biopsy was not done to find out the cause for his renal failure. He doesn't have diabetes but has hypertension which can be well controlled with antihypertensive( current Blood pressure is 120/80 on most occasion). The medications he is taking currently are Atenolol 50mg, Amlodipine 2.5 mg, Acetylcistine, Atorvastatin 10mg and allopurinol 200mg. Yesterday, his serum creatinine went up to 517 mmol/L. and the doctor added ketostril and levocarnitine to his prescription. Can these drugs really stop the progression of renal failure and what is the most possible cause for his problem? i m looking forward to the helpful answer.\n\n",
    "posted_time": "Post  by Dr. Hein » Sat Jul 24, 2010 1:42 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=98407&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p98407"
  },
  {
    "author": "hopefullone2010  Guest Posts: 1 Joined: Thu Jul 22, 2010 11:17 pm Gender: Female",
    "title": "Possible medication error with kidney disease",
    "content": "Hello, I am wanting to find out if a doctor of mine gave me the wrong advice. I have stage 4 End Stage Renal Disease and I went to my family physician because I have had problems with being dizzy and having hot flashes. I am only 33 years old and besides renal failure, I have high blood pressure but nothing else wrong that I know of. This doctor ordered blood tests and it came back that my white blood cell count was up and so she told me I had a viral infection. She told me to take Levaquin 500mg for 5 days and told me to take sudafed to help get rid of dizziness. Once I started taking this medicine, I have felt worse than ever. I have had pain in my stomach and kidneys and my blood pressure is higher than normal. I am taking 2 different meds for my high blood pressure so I didn't think that would happen. I am not really confident in my family doctor and I quit taking this medicine. I have started to feel better, but I want to know if those meds were safe for me to take with my kidney problems. Thank you\n\n",
    "posted_time": "Post  by hopefullone2010 » Thu Jul 22, 2010 11:41 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=98290&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p98290"
  },
  {
    "author": "manlidher  Guest Posts: 2 Joined: Sat May 16, 2009 2:55 pm Gender: Male",
    "title": "Creatine Supplementation",
    "content": "Hi, Im a 18 year old male. I've recently been using creatine ethyl ester to supplement my workouts. I workout 5 days a week and they consist of mostly weight lifting.I only use 3-5 grams on days I workout. What I want to know is that can creatine supplementation increase your serum creatinine? I've heard that the half life of creatine is about a month so how long should I stay off creatine before getting a blood test or urine test done? My doctor has found my creatinine level to be higher than normal previously but I've never had pain in the kidneys, problems with urination or any other  symptoms. I'm worried about having renal failure.\n\n",
    "posted_time": "Post  by manlidher » Sat May 16, 2009 3:07 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=78480&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p78480"
  },
  {
    "author": "Dr.M.jagesh kamath  Medical Doctor Posts: 1303 Joined: Mon Aug 03, 2009 7:24 am Gender: Male",
    "title": "Re: Creatine Supplementation",
    "content": "Hello,An interesting question.Most studies conducted are of less than 10gms perday and did not show any direct effect on the kidneys or liver but then showed some increase in serum creatinine from the very next day of intake lasting for 4to6 weeks after which they returned to normal.Ther is data that these suppliments are quite safe at levels at 3to5 gms but it is best for you to get reveiwed in view of an earlier reading of increased serum creatinine.Best wishes.\n\n",
    "posted_time": "Post  by Dr.M.jagesh kamath » Mon Oct 12, 2009 11:29 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=83662&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p83662"
  },
  {
    "author": "tarot  Guest Posts: 1 Joined: Wed Sep 09, 2009 4:54 pm Gender: Female",
    "title": "can carbon monoxide poisoning affect the function of filteri",
    "content": "I was subjected to carbon monoxide poisoning over 3 years ago due to a faulty boiler at a rented property. previously to this I had experienced no major problems with my Kidneys. now it has been detected that my kidney is not filtering properly and is quoted as being slow. my last urine and blood results of 2 weeks ago showed that I had quite a lot of Blood in the urine and a high count of potassium in the Blood I am to have another test for both tomorrow and then see the Dr when the result come back he did say he might have to start me on some medication to try and prolong the kidneys as long as possible I am very scared and would like to know if carbon monoxide would of had caused this and it is just recently that it has been detected? THANKYOU\n\n",
    "posted_time": "Post  by tarot » Wed Sep 09, 2009 5:08 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=82280&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p82280"
  },
  {
    "author": "Preparing123  Guest Posts: 2 Joined: Mon May 25, 2009 12:22 am Gender: Female",
    "title": "Renal Insufficiency + AAA -- Transplant or Repair First?",
    "content": "Hi, everyone,  My fiance has a 4-cm AAA (stable since diagnosis one year ago) and has recently been diagnosed with moderate renal insufficiency.  He has a history of hypertension, now well controlled with medication, and high cholesterol.  I have offered and been medically cleared/matched to be a kidney donor for him when the need arises, so this is not an issue.  My question is this: given the above-mentioned comorbidities, which surgery should be performed first?  It is my understanding that AAA repair is not recommended at < 5 cm in diameter, and that it may remain stable for some time.  However, would abdominal adhesions caused by kidney transplantation interfere with the surgeons' ability to repair the AAA at a later time?  All opinions appreciated.  We are at the beginning of this process, having been told only last week that his renal insufficiency is progressing more quickly than anticipated.  Shelby (Peter's Fiance)\n\n",
    "posted_time": "Post  by Preparing123 » Mon May 25, 2009 12:36 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=79469&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p79469"
  },
  {
    "author": "SoBeBeachboy  Guest Posts: 2 Joined: Mon May 18, 2009 12:11 pm Gender: Male",
    "title": "Polycystic kidney disease",
    "content": "Hello,  My wife has very advanced polycystic kidney and liver disease.  This has caused ascites where for the past several months she has had weekly paracentesis draining out 8 liters of fluid each time.  She is going through the hoops in hopes of getting on a list for both a liver and kidney transplant.  How long can a person live in such a condition live?  She has severe muscle wasting also.  Her abdomen is so distended that she has a ventral hernia and also looks 12 months pregnant.\n\n",
    "posted_time": "Post  by SoBeBeachboy » Mon May 18, 2009 12:15 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=78673&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p78673"
  },
  {
    "author": "jawny  Guest Posts: 1 Joined: Sat Dec 27, 2008 3:38 am Gender: Female",
    "title": "ESRD (end stage renal disease) - donor match - survival?",
    "content": "A friend of a friend of mine has esrd, if a match were to be found what would happen? Could that save her life?\n\n",
    "posted_time": "Post  by jawny » Sat Dec 27, 2008 3:50 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=66002&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p66002"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "Re: ESRD (end stage renal disease) - donor match - survival?",
    "content": "Hi Jawny,  Unfortunately, this is a difficult question to answer because the outcomes from kidney transplant often are related to the initial cause of kidney failure.  While most causes of kidney failure can be treated with kidney transplant, there are a few that will just end up destroying the new kidney. These cases require discussions with a transplant expert and nephrologist to determine if this risk is too much to make a transplant an option.  In general, though, people who undergo kidney transplants have very good outcomes.  The patient's quality of life often goes way up since the need for frequent dialysis and many of the restrictions (food and fluid) go away.    Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sat Apr 11, 2009 2:04 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=73893&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p73893"
  },
  {
    "author": "ubnsmkd  Guest Posts: 1 Joined: Thu Dec 25, 2008 1:04 pm Gender: Male",
    "title": "GFR (glomerular filtration rate) test above 60 - bad?",
    "content": "i had blood work done estimated gfr was >60 from what i read this is bad.. iam confuesed doctor never said anything....  creatinine 1.07 sodium 138 potassium 4.6 albumin 4.7 bun 12 protein total 7.5 calcium 9.7 c02 32 alk 27 ast 29 alkaline phosphatase 74 glucose 109   very worried please help\n\n",
    "posted_time": "Post  by ubnsmkd » Thu Dec 25, 2008 1:15 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=65897&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p65897"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "Re: GFR (glomerular filtration rate) test above 60 - bad?",
    "content": "Hello Ubnsmkd,  A GFR > 60 is considered normal.  Often, these tests estimate the GFR by a formula using various blood levels including the creatinine.  The report often will say > 60 because a GFR > 60 is often the cut off point where one no longer needs to be concerned about adjusting medication doses, etc. for a low glomerular filtration rate.  The GFR is one way to measure kidney function.  When kidney function declines, often the GFR will also decline.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sat Apr 11, 2009 1:58 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=73892&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p73892"
  },
  {
    "author": "GirlOrange  Guest Posts: 1 Joined: Thu Jan 08, 2009 5:03 pm Gender: Female",
    "title": "Elevated GFR (Glomerular filtration rate) 96.5 mL/min",
    "content": "Thank you in advance for your help. I'm so worried and my physician is out of town and can't return my call.  My doctor diagnosed me as a Type 2 diabetic in August of 2008. My HbA1c was 11.3%, suggesting that I had had very high blood glucose for at least three months, and I'm sure much longer. My A1c is now 5.1%.  In December, my doctor suggested that I have some blood work done. I noticed my MCV and MCH were a little low (78.8 fL and 26.0 pg, respectively) and that my sodium, although with normal range, was on the lower end of normal: 137 mmol/L.  Anemia runs in my family, so I mostly dismissed the MCV and MCH, but when I posted my concerns about both on a diabetes forum online, a diabetes care worker told me to check my GFR by entering my numbers (BUN, creatinine, etc.) into a GFR calculator. The calculator also takes into account age, sex, race, and weight. I scored a 96.5 mL/min.  My doctor didn't seem concerned at all at my last appointment because my numbers, except for my MCV and MCH, were all \"normal,\" but I'm worried that 96.5 mL/min is a little low. I keep reading different information on the subject. Some insist that any value over 60 is good for a woman, while others say 90, and even smaller number of people argues that a normal, healthy adult should be in the 110-120 range. I am very confused and worried that I might have the early stages of kidney disease.  I am also scared because my chloride is on the higher end of the range (104 mmol/L when 110 is considered the upper limit) and my carbon dioxide is on the low end of the range (21 mEq/L when 21 is the lower limit). I know that both chloride and carbon dioxide levels can reflect impaired kidney function. My hemoglobin is 12.8 g/dL and 12 is the bottom of the normal range. Again, I read that hemoglobin could be another sign of kidney problems.  I don't know how long I was diabetic or what damage I did to my body before diagnosis. I don't have any signs of kidney problems (urinating normally, no pain), but I read that a person doesn't necessarily show signs in the beginning stages.  I would love some guidance. Thank you again and I apologize for my long-winded post.   Age: 26 Sex: Female Type 2 Diabetic (since August 2008), Hypo-thyroidism (August 2008, as well) Past surgeries: None Family history: Breast, cervical, and colon cancer, Type 2 diabetes, hypertension, high cholesterol, stroke, heart attack, anemia, hypo-thyroidism. Current medications: Metformin (850 mgs/twice a day), Glyburide/DiaBeta (5 mgs/once a day), Synthroid/Levothyroxine (50 mcgs/once a day)\n\n",
    "posted_time": "Post  by GirlOrange » Thu Jan 08, 2009 5:22 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=67457&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p67457"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Elevated GFR (Glomerular filtration rate) 96.5 mL/min",
    "content": "Hello --  While your concern is certainly understandable, it is pretty unusual to have had type II diabetes as young as you are and to have already sustained kidney damage. Your A1c is now actually extremely good, so you've reduced your risk of diabetic complications by more than half.   Further, while I'm sure the diabetes care worker has only the very best of intentions, the lab work involved in calculating creatinine clearance (which is what GFR does) is actually very arcane and not something that should be tossed into the lap of a patient, even if the patient is trained in laboratory medicine. There are so many variables involved in these calculations that must be taken into consideration along with the GFR number. And most importantly, all your numbers are within normal limits. This is important to remember: normal limits have to be set somewhere, and normal is, well, normal. It doesn't matter if you are right on the line (upper or lower) but that you are WNL (within normal limits). Things will vary from day to day, hour to hour, even. These tests are done under optimal stable circumstances, and often a chemical (such as inulin -- not insulin -- must be added to the mix in order to reach  the correct GFR). Your GFR is above 90, so you're good there. The other numbers are all WNL. While it is very important that a person with diabetes monitor him/herself for glucose levels, and to be familiar with the correct numbers. But to try and evaluate possible potential complications based upon extremely complex lab work, well, it's not fair to you to be expected to be able to interpret these. This is why we have doctors -- doctors who have spent a good many years learning not only essentials of medicine but more on their specialty. I hate to be critical of your diabetic care worker, but please bear in mind that this  person's training and experience is generally very narrowly focused. This is an area where a little knowlege can become a very dangerous thing -- dangerous to your peace of mind.   I am hoping to reassure you that your numbers are all good. Normal is good, whether square in the middle of the range, at the upper or lower end or, once in a while, just a hair off, even.   You obviously are doing all the right things to have such a good A1c result, and so long as you're not symptomatic for kidney disease and nothing in your blood work suggests otherwise, by all means enjoy the fact that  you're fine. I hope  this is helpful to you. Good luck with this, and please  stay in touch with us here.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Sat Mar 21, 2009 10:36 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=71500&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p71500"
  },
  {
    "author": "TGR  Guest Posts: 2 Joined: Thu Jan 08, 2009 7:50 pm Gender: Female",
    "title": "Renal Tubular Acidosis - Follow up Visits",
    "content": "Dear Sir/Ma'am,  Our 1 year Son was diagnosed with Renal Tubular Acidosis and is now on the Medication Cytra-2 Sol Cypress. Since reading up on this disease and realising how serious this is. We wondered how often should we follow up with a Nephrologist?  He was diagnosed in November 2008 and the first appointment we can get is February 16 2009.  This would be his first appointment since his diagnosis. Is this too far off?   Most kindest Regards Extremely stressed and concerned parents\n\n",
    "posted_time": "Post  by TGR » Thu Jan 08, 2009 8:08 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=67487&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p67487"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Renal Tubular Acidosis - Follow up Visits",
    "content": "Hello --  This is a very worrisome and stressful thing for parents to deal with, but it should be placed into its proper perspective, which may help to reduce the amount of stress on you both. It seems your son is receiving the appropriate treatment for the problem, and a 90 day interval between start of medical therapy and the first followup seems about right, assuming there are no sudden, significant changes such as decreased level of consciousness or orientation on the part of your son. So long as he seems to be behaving normally and is taking his medication without incident, three months would seem to be the right length of time to be able to evaluate the effectiveness of the medication. Of course if there are any sudden, untoward changes as outlined above, you should let his nephrologist know at once. Otherwise this is a treatable disease and while untreated it is dangerous, it seems everything is being done according to proper medical protocol.  I hope this helps ease your minds some. My best to you both and to your son. Please follow up with us here as needed.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Sat Mar 21, 2009 10:18 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=71499&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p71499"
  },
  {
    "author": "robots  Guest Posts: 1 Joined: Mon Jan 05, 2009 8:10 pm Gender: Female",
    "title": "Creatine level 4 - is a follow up approach correct?",
    "content": "my mother who is 62 and  has copd and heart bypass in 2001 has a level 4 creatine and a level 58 bun,went to kidney dr and there was no protein in her urine and everthing looked fine except those 2 levels. kidney dr took her off her lasix and will be doing another blood test next week to see if anything has changed, but in the meantime she is very weak, has no appetite, stomach pain. do u think her dr is doing the right things or should something be done immediately\n\n",
    "posted_time": "Post  by robots » Mon Jan 05, 2009 8:25 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=67068&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p67068"
  },
  {
    "author": "MWise  Nurse Posts: 3 Joined: Thu Jan 08, 2009 8:34 am Gender: Female",
    "title": "Re: Creatine level 4 - is a follow up approach correct?",
    "content": "I think your physician is doing the right thing by checking the creatinine after coming down on dose of Lasix, anbd he is waiting for the body to respond to that change in meds. The diuretics cause fluid volume loss which then affects the creatinine. However, if your mom is having stomach pains, you should call physician and notify him/her. This symptom may be result of some other problem or even side effect of some other medication.\n\n",
    "posted_time": "Post  by MWise » Wed Mar 18, 2009 7:14 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=71433&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p71433"
  },
  {
    "author": "supernal  Guest Posts: 2 Joined: Sat Jan 17, 2009 8:46 pm Gender: Male",
    "title": "Renal Failure & Animals",
    "content": "I have an older sister who is 28 years old and has complete renal failure in both of her kidneys. I know that this question may seem frivolous, but I just don't know where to look, and after a few google queries, this is where I was led to. Hopefully someone can answer my question.  My older sister tells me that there can't be an animal in the house because of her renal failure. I personally don't see a connection between renal failure and animal dander but my knowledge of medicine is extremely limited.   Any and all information that can be provided in regards to this question would be extremely helpful, and I want to thank anyone who responds ahead of time.\n\n",
    "posted_time": "Post  by supernal » Sat Jan 17, 2009 8:53 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=68781&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p68781"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Renal Failure & Animals",
    "content": "Hello -  I can only think of one reason why a healthy animal (or animals) shouldn't be present in a house where a person with kidney failure resides,  unless the kidney failure is due to an underlying cause which involves an impaired or supressed immune system. If this is what has led to kidney failure in your sister, then that, in and of itself, would likely rule out the  presence of animals, but would also be the cause of a whole new set of household rules and requirements which aren't mentioned. Removal of animals alone wouldn't make much sense, at least without an understanding of the underlying cause of the kidney failure.  I hope this is helpful. If there is more information you can provide, that would be helpful. It's not at all a frivolous question and could very well be a very serious one for whoever is living in the home with your sister, since pets are certianly ofen a crucial part of family life.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Fri Jan 23, 2009 10:03 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=69570&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p69570"
  },
  {
    "author": "supernal  Guest Posts: 2 Joined: Sat Jan 17, 2009 8:46 pm Gender: Male",
    "title": "Re: Renal Failure & Animals",
    "content": "Thank you very much for your help :). Your response was very informative.\n\n",
    "posted_time": "Post  by supernal » Wed Mar 11, 2009 8:24 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=71325&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p71325"
  },
  {
    "author": "kengw002  Guest Posts: 2 Joined: Wed Jan 14, 2009 9:41 pm Gender: Male",
    "title": "Can kidney disease be cured or only maintained?",
    "content": "My girlfriend has problems with her kidneys which she is currently seeing the specialists about. It is regarding her kidney producing to much protein or something of that effect and is currently taking steroids as part of her medicines. She is currently about a stage 2/3.  I have read in other information that once you develop a problem such as this that it cannot be fixed completely but can only be slowed down and maintained from here on end (be on medication for the rest of your life)?  Is this true or can treatment fix this kind of problem altogether?\n\n",
    "posted_time": "Post  by kengw002 » Thu Jan 22, 2009 6:40 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=69404&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p69404"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Can kidney disease be cured or only maintained?",
    "content": "Hello --  There are quite a few types of kidney disease, but elevated protein in the urine ususally suggests progressive kidney disease which won't go away but can be followed and, if necessary,  treated (or vice versa, depending on the stage and if there is an underlying cause that can be found). The underlying cause is usually the best predictor of whether or not the kidney problems can be cured, reversed or at least arrested, or if they are likely to be progressive and require lifelong maintainance. At stage two the disease may still be medically manageable, but probably isn't reversible/curable. Still, this depends upon management of any  underlying cause, if there is one.   Hopefully this is helpful. Good luck to you both.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Mon Mar 09, 2009 9:02 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=71297&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p71297"
  },
  {
    "author": "streatch  Guest Posts: 1 Joined: Fri Jan 02, 2009 4:16 pm Gender: Female",
    "title": "Renal pain, protein in urine after silicone leakage",
    "content": "I have been having white blood cells and protein in my urine off and on since my silicone implants leaked, all test results come back normal.  I have also been having flank pain in both sides ,these things  have been going on for a couple years, I seen my doctor and she did blood test and another urine sample. my blood test showed elevated levels in my kidney function and the urine sample showed that i had group b strep. I was treated with antibiotics for group b and its gone. I also had a ct that showed something that looked like a kidney stone in my uterer. I had a procedure where they looked in my uriter and kidneys with dye. they found that the mass wasn't a kidney stone, nore was it in my uriter. It's on the out side of my tube but not on my tube. my doctor says theres no cause for concern and if something was wrong with my kidneys it would have progressed into an obvious problem. i am still having the flank pain in both sides and both kidneys have fluttered. It only lasted a couple seconds and I'm not sure what it means when kidneys flutter. I am also urinating more frequently than normal. for example today ive urinated 5 times. is there something wrong with my kidneys?\n\n",
    "posted_time": "Post  by streatch » Fri Jan 02, 2009 4:45 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=66694&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p66694"
  },
  {
    "author": "adiggs36  Guest Posts: 7 Joined: Sun Mar 23, 2008 11:34 pm Gender: Female",
    "title": "What are some ways you know your kidneys are failing?",
    "content": "I just have a question about kidneys failing. When I was in the hospital mine failed due to medication Vancamycin(spelled wrong I know), I had a infection too lengthy to spell out. Other than feeling weak then, plus just sick overall. I am concerned that my kidneys may fail again. I just wanted to know what to look symptoms are present if they are not working properly. Thanks in advance. Adiggs\n\n",
    "posted_time": "Post  by adiggs36 » Wed Nov 12, 2008 10:23 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=64098&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p64098"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "Re: What are some ways you know your kidneys are failing?",
    "content": "Hello,  Unfortunately, some disorders in the urinary tract do not give symptoms unless they are irreversible and caused considerable damage. Kidney failure is one of them.   Moreover, when occur it gives clinical picture that can be shared with other organ failure like generalized weakness, loss of appetite, nausea, disturbed conscious level. So, the best way is to properly treat any predisposing factor or underlying conditions and to regularly follow up with specific tests.  Drug induced renal damage can range from reversible to irreversible forms. It is more common with certain medications and in patients with underlying kidney disease or dehydrated.  The degree of renal damage is diagnosed by kidney function tests (blood urea and creatinine), eGFR, and urine analysis. When reversible and properly treated the prognosis is very good and complete recovery is expected. Vancomycin is one of the medications that can cause renal damage but it is reversible in the majority of cases and most of patients recover completely when it is discontinued.  I would advise you to follow up with your doctor and to regularly check your kidney function if your doctor recommends doing so.  Please keep us updated. Best regards.\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Thu Nov 13, 2008 5:55 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=64181&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p64181"
  },
  {
    "author": "Moobum  Guest Posts: 1 Joined: Tue Nov 11, 2008 6:50 am Gender: Female",
    "title": "Effect of too much protien (only one Kidney)",
    "content": "My boyfriend (22 year old male born 1986) was born with only one kidney. He is a very active individual who excercises regularly at the gym. He has now started taking protein products such as \"USN pure protein\" and other protein suplements to build muscle. since he only has one kidney, is this a risky? does he fall into the category of people with renal disease who should be cautious of too much protein? and will too much protein have long term effects on his kidney? In this case, how is it possible to test for too much protein and how do you know how much protein is too much?\n\n",
    "posted_time": "Post  by Moobum » Tue Nov 11, 2008 7:02 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=63862&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p63862"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "Re: Effect of too much protien (only one Kidney)",
    "content": "Hello,  This is really a controversial issue. Some studies showed that people with normal kidney function are not at risk of renal or hepatic damage from high protein diet. Damage from high protein diet is due to high level of their waste products produced by their metabolism.  Other studies showed more probabilities of kidney stones in those receive regular high protein diet. This is in general expected to be more in individuals who do not take enough fluids and do not regularly check their kidney functions and blood pressure levels. Individuals with compromised kidney are at greater risk.  Since he has only one kidney more precautions are needed and I would advise him to check with his doctor the better dietary supplements he should be following and the precautions he should follow if he will continue on high protein diet.  Hope you find this information useful. Please keep us updated.\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Tue Nov 11, 2008 1:41 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=63890&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p63890"
  },
  {
    "author": "adiggs36  Guest Posts: 7 Joined: Sun Mar 23, 2008 11:34 pm Gender: Female",
    "title": "Vancomycin and Kidney failure also",
    "content": "Hi, I am posting because my sister who is 45 went to the hospital on March7th for surgery on a abdomonal abcess. It was MRSA. The surgery went well and after a few days a surgeon in for the weekend started her on Vancomycin. I asked about it because in July I had surgery and it failed my kidneys for 4 days. My function returned hers has not. She has been dialysized 2 times and no function yet. She is also losing blood. 2 units one day and another 2 units the next day. Her levels are low and they are giving iron. She has had a endoscopy and a colonostrophy  and no bleeding there. Please look over spelling. I guess my question is how long does it take before they give a definate answer to whether the function will return. She is mentally handicap and a diabetic. She entered the hospital with no kidneys issues and in overall good health. Seems she is getting more problems than she went in with. Can the bleeding be due to kidney failure also.The surgeon says he does not feel it is a surgical issue. Thanks in advance for your help. Sincerely adiggs36\n\n",
    "posted_time": "Post  by adiggs36 » Mon Mar 24, 2008 11:30 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=56781&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p56781"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "Re: Vancomycin and Kidney failure also",
    "content": "Hello Adiggs36,  Vancomycin is a nephrotoxic drug but generally does not do damage on its own.  If there were something else going on, such as an illness or other cause that may also cause kidney problems, vancomycin can exacerbate this.  The issue of returning kidney function really depends on what is actually causing the kidney failure.  A common cause is acute tubular necrosis where the cells of the tubules in the kidney die.  This condition ultimately typically heals when the lining regenerates; however, the length of time for this to occur is incredibly variable and depends on many factors.    I suspect your sister is being seen by a nephrologist (kidney specialist) who will be able to give you much better answers and more specific answers than I am.    Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Mon Mar 24, 2008 9:50 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=56824&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p56824"
  },
  {
    "author": "adiggs36  Guest Posts: 7 Joined: Sun Mar 23, 2008 11:34 pm Gender: Female",
    "title": "Re: Vancomycin and Kidney failure also",
    "content": "Thanks a bunch, I am just so frustrated because of the increase in her health issues. I just never expected her to be there for this length of time. Plus her mental state makes it much more stressful to see her so upset and desiring to come home. The doctors are involved but have yet to give any definate answers and it seems that hey are sugar coating the issues if not avoiding them all together. I do not want to in any way offend them but my entire family is losing our confidence in their ability to treat her. I am just concerned that they will at some point want to do exploratory surgery which may cause them to cut through her abdomenal wall. I do not want them to do this at this particular hospital and will at that point move her. I am just panicing I think and my brothers as well. We lost our mother in july due to lung cancer and she is the only person I have left and is very special to us all. The thought of her remaining on dialysis for her lifetime scares the hell out of us.  I will just continue to pray and hope that they heal and come back up. I just wish they had taken heed to me concerns about the  the use of this medication Vancomycin. I had a very different form of flesh eating virus which in 24 spread through out my body. Necrotizing Fecesia. It almost killed me. I was hospitalized July 4 and after caring for my Mom and sis 15 years I was not able to be here when she passed. So I have a fear of hospitals due to this. I thanks you for your help and will take the info you give to heart and try to place trust in our medical professional until they prove to be otherwise incapable. You have a blessed day and may continue to find favor in all you contribute to this forum your definately a contribution. They had told me for several days her test results were favorable and I had my hopes up and then all of a sudden they went bad again. It disappointed us all.Hugs Adiggs36\n\n",
    "posted_time": "Post  by adiggs36 » Tue Mar 25, 2008 12:02 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=56837&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p56837"
  },
  {
    "author": "thedude111  Guest Posts: 1 Joined: Wed Feb 27, 2008 2:11 pm Gender: Male",
    "title": "Severe Lower Left Flank Pain!",
    "content": "I have been having lower left Flank pain now for a week with it getting worse everday.  I finally went to the urgent care with no success, they said the ct and x-ray showed no signs and same with blood test.  Also my urine test came back pretty much normal as well.  What could be going on here, it could be muscular but it feels like it is alot deeper than that.  Plus when or if I flex my back muscles there are no pains and if I flex my Left Oblique, there is no pain.  However when I am relaxed or if I tuch it or someone else touches it, it feels extremely tender.  I am sorry if this is not even the right forum but I was not sure where to go.  I have had muscle injuries before and it does not feel the same.  I mean especially since I have not even been doing anything that would cause such an injury and I have pulled/torn muscles and this feels nothing like that.  Plus there are no visible signes of a torn or brused muscle.  Any help would be greatly appreciated with this matter.  Thanks much,  Greg\n\n",
    "posted_time": "Post  by thedude111 » Wed Feb 27, 2008 2:57 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=54520&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p54520"
  },
  {
    "author": "R. Zein, Pharm D  Pharmacist Posts: 157 Joined: Tue Jul 12, 2005 9:16 pm Location: USA",
    "title": "Re: Severe Lower Left Flank Pain!",
    "content": "Dear greg  there are so many different causes of flank pain, ranging from renal, to diabetes, to muscular, urinary tract infection, or even  neurological.  the fact that your doctor was able to rule out infection, renal and muscular causes, still leaves the possibility for a neurological cause. I am not saying that this is for sure what is causing your problem, but sciatica and peripheral nerve compression can lead to flank pain.   I am not sure if your pain was localized to one spot or involved other areas. the reason i am asking, is because pain induced by neurological casues, has the tendency to radiate to more than one area; eg sciatica; it involves the lower back and legs as well.  i hope you fell better thanks\n\n",
    "posted_time": "Post  by R. Zein, Pharm D » Fri Mar 21, 2008 11:48 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=56577&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p56577"
  },
  {
    "author": "mike1335  Guest Posts: 1 Joined: Sun Dec 09, 2007 11:48 pm",
    "title": "Microscopic Blood in Urine and Kidney Function",
    "content": "I am a 51-year old male. I am taking lotrel 5/20 mg once a day to control my BP. My Creatinine has been elevated in the past few years to 1.6-1.7 (eGFR=45-49). I have no apparent symptoms. There are microscopic blood in my urine (since I was 25). I have done extensive cystoscopy but Doctors found nothing. I wonder if my renal condition relates to blood in urine. My renal scan was normal. My Ca, PA, and Phosphorous were within the normal range. Bun=29 but microalbumin/creatinine ratio is 71.3. Uric acid level is 7.8.   Thank you.\n\n",
    "posted_time": "Post  by mike1335 » Mon Dec 10, 2007 12:23 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=51466&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p51466"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "Re: Microscopic Blood in Urine and Kidney Function",
    "content": "Hello Mike1335,  There is a condition called benign familial hematuria that can cause blood in the urine without any other conditions.  With your decreased kidney function, one must also consider conditions such as IgA nephropathy that can cause the blood.  If you are not seeing a nephrologist (kidney specialist) I would strongly recommend you do so.  They can help work up the cause of your hematuria as well as your decreased kidney function.  You should also discuss your blood pressure medication with them.  Lotrel contains a medicine in the class called ACE inhibitors.  These can be protective of kidney function but when kidney function begins to decline they can become damaging and further deteriorate the kidneys.  Your doctor can help determine if you should continue on this medicine or consider changing to a new one.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Fri Feb 01, 2008 12:37 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=53481&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p53481"
  },
  {
    "author": "helpme00  Guest Posts: 1 Joined: Sun Dec 23, 2007 3:44 am",
    "title": "Kidney Donor",
    "content": "I am a 17 year old boy and I want to donate my kidney to a woman who needs a kindey transplant if I am a match. Would I be able to donate my kindey even though I am under 18 year of age with parent permission?\n\n",
    "posted_time": "Post  by helpme00 » Sun Dec 23, 2007 4:06 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=51882&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p51882"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "Re: Kidney Donor",
    "content": "Hi Helpme00,  The rules regarding living organ donation by a minor vary from state to state; however, in general, they are very restrictive such that often it is not allowed.  If it were a relative receiving the chances may be higher but for non-related donation the likelihood of this being approved is low.  This doesn't necessarily mean it can't happen.  Just be sure that you and your parents are fully aware of all the risks of such a procedure, which are extensive.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Fri Jan 11, 2008 2:34 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=53096&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p53096"
  },
  {
    "author": "weedheaded  Guest Posts: 1 Joined: Sat Dec 15, 2007 11:48 pm Location: Los Angeles  Contact:   Contact weedheaded       Yahoo Messenger",
    "title": "FSGS & Extreme Edema",
    "content": "I was recently diagnosed w/ FSGS. I currently weigh about 40 lbs. more than my normal weight. I just started steroid therapy this week, and I take Lasix and also meds for thyroid, cholesterol and high blood pressure.   My main concern is the swelling of my scrotum. The swelling of the feet, ankles, calves, knees, thighs, hips, and stomach I can deal with. But my scrotum has swollen to the size of a large grapefruit. I can't walk normally, I can't sit down for any extended period  of time, I can't sleep comfortably. It presents all kinds of problems.   My doctor doesn't seem overly concerned about my scrotum. He said all the weight will come off gradually, maybe 2-3 months (I gained it in about 1 week) and that my scrotum will progress at the same rate. I don't know what I'm going to do if that's the case. I can't go to work like this. I went out this morning and bought an XL jock strap, but the problem is the waist is way too wide, and the part that actually holds your sack is way too small. I'm thinking about asking my friend Sally to take two of them and sew it into one super jock strap.   All kidding aside, though, I would appreciate any suggestions, advice, or even just related experiences from anyone who has gone through something like this before. Thank you. God bless.\n\n",
    "posted_time": "Post  by weedheaded » Sun Dec 16, 2007 12:01 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=51677&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p51677"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "Re: FSGS & Extreme Edema",
    "content": "Hi Weedheaded,  This can be a difficult situation.  Your doctor is correct that the best way to correct this is slowly.  Rapid removal of large volumes of fluid can cause dramatic and dangerous problems with electrolytes and other body systems.  The trick is managing the swelling until it resolves.  The excess fluid is basically gravity dependent so it will tend to collect in areas that are lower, such as the legs and the scrotum.  It may help some to try to elevate your scrotum while you are lying flat.  This can be done with pillows.  While standing, if you are not able to find a supporter you may be able to make one that will work at least a little with some gauze wrap (commonly called Kerlex) that can be obtained from your local pharmacy.  Follow up with your doctor is important.    Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Tue Dec 18, 2007 10:58 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=51777&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p51777"
  },
  {
    "author": "lin champagne  Guest Posts: 1 Joined: Sun Nov 11, 2007 6:15 am",
    "title": "cyst on kidneys",
    "content": "my 27 year old daughter  has recently had her gallbladder out,  has protien S deficiency, And has had 3 strokes prior to having a pfo repaired. after having gallbladder removed she was still having problems, doctor did another ct scan and found cyst on ovary and kidney does one atomatically have pkd if you have cyst on your kidney's? her current meds are cumidon,depacoat. and as far as we know no family history of kidney disease.\n\n",
    "posted_time": "Post  by lin champagne » Sun Nov 11, 2007 7:15 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50055&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p50055"
  },
  {
    "author": "Sandy Tracy RN  Nurse Posts: 60 Joined: Wed Nov 07, 2007 6:57 pm",
    "title": "[no title]",
    "content": "Hello Lin Champagne,  Many people have cysts on ovaries and kidneys without knowing they are there.  It is when there are other complications going on that these need to be investigated further.  Most cysts on kidneys and ovaries are benign and are found when the doctor is looking for other things.  These are called \"incidental cysts\"  One does not automatically have PKD if they have cysts.  However if there are other symptoms such as fever, frequent urination, blood in the urine or pain inbetween the ribs and hips further testing may be required.    I encourage you to continue talking to the Doctor that you are seeing and good luck  Sandy RN\n\n",
    "posted_time": "Post  by Sandy Tracy RN » Sun Nov 11, 2007 10:47 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50075&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p50075"
  },
  {
    "author": "momster3  Guest Posts: 1 Joined: Sat Jul 07, 2007 10:04 am",
    "title": "rapidly decreasing in eGFR, but still >60 mL",
    "content": "Hi, I'm a 32 (about 33) yr old female.  I was diagnosed with Raynaud's a year ago, clubbing of fingers, dilatated & irregular capillaries in nailfolds but other than a slightly above normal RF, all tests fine, ANA, etc.  1 year ago, my creatinine was .7, that's an eGFR of 103 mL.  Good.  I had the same run of chemistry tests 10 months later because I was smelling ammonia after a 30 minute walk, Other than barely low urea Nitrogen, all looked well but when I checked the creatinine, it was at .88, that's 79 mL, a 20% decrease over a 10 month period, average of 2.6 mL a month.  Then 2 months later, it was checked again & eGFR is at 74 mL.  That still averages out to a 2.6 mL drop per month.  My blood pressure has always been at low end of normal, & for a few months I've been taking 80mg 2x a day of Verapamil for migrains.  After 11 months of 2x 500mg a day of Relafen (NSAID) I just quit taking it, worried it is related to eGFR dropping even though Rheumotologist said no.  My Dr. says that my BUN & Creatinine are in normal range & not to worry about it.  My concern is that my eGFR has clearly been consistantly dropping (29mL in 1 year) & if it continues at this rate, I'll be around 45 mL in a year.  I read here on your site http://www.doctorslounge.com/nephrology ... -8128.html  that release of renin causes vasoconstriction of blood vessels.  Could that be related to my Raynaud's?  Should I be concerned about the rate of decrease in eGFR?  The Dr. also said my blood pressure is great.  But, if it's always been low end of normal & I take a calcium channel blocker, could blood pressure be increased due to kidney issues but go unnoticed due to verapamil & starting out with low end of normal BP?  There are diabetics on my dad's side of the family & I have 1 sister with Graves disease.  My TSH is normal.\n\n",
    "posted_time": "Post  by momster3 » Sat Jul 07, 2007 10:41 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=44220&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p44220"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "There are a few reasons that you may be seeing the drop in your GFR.  It may be that this is just normal fluctuation of your kidney function as your doctor has suggested.  With autoimmune diseases, though, there is also the possibility of an autoimmune disease causing the development of antibodies that damage the kidneys.  This is a well documented phenomenon with systemic lupus erythematosis as well as a few other autoimmune diseases.    You may want to consider seeing a nephrologist (kidney specialist) to get an opinion about the autoimmune damage and see if there are more tests that should be run.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Tue Jul 17, 2007 6:57 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=44765&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p44765"
  },
  {
    "author": "kidneyconcerned  Guest Posts: 2 Joined: Thu Apr 26, 2007 5:47 am",
    "title": "Many symptoms of renal failure and past kidney problems",
    "content": "I am a 20 year old female and I have had kidney infections since I was 7 years old. I have had an ongoing kidney infection that has not gone away for more than a week in the past 4 years. Antibiotics have stopped working with my body now. When I went into the hospital back in November with a severe kidney infection the doctor told me that he had never seen a kidney infection as bad as the one I had. He also said that with the rate my infections were going, 1 more kidney infection could cause my kidneys to fail. I have yet to see a Urologist about why this is happening. For the past month and a half I have had an infection and when I went into the ER they gave me antibiotics that I was allergic to. The next time I went in they didn't even do a urine test. So I was not perscribed any antibiotics. For the past 3 days I have been feeling lousy. I noticed that my eyes were turning yellow (I know that that is a sign of jaundice but was wondering if it could have to do with my kidneys.) and many other symptoms of renal failure which include: Excessive urine at night, ankle feet and leg swelling, generalized swelling, decreased sensation in the feet, decreased appetite, agitation, drowsiness, lethargy, delirium or confusion, mood changes, trouble paying attention, slow sluggish movements, lower back pain, nausea, prolonged bleeding, bloody stools, Flank pain, fatigue, unintentional weight loss (5 pounds in a week), headache, easy bleeding, decreased alertness, muscle twitching and cramps, excessive thirst, loss of appetite, itchy skin, shortness of breath, a sensation of pins and needles in feet, hand tremor, ear buzzing, insomnia, and low sex drive. These are about 75% or the symptoms I have found online! What my question is, if my kidneys are failing is there any sure way I can tell for sure and how long can I wait until I have to be treated. How long does it take before it gets fatal. The reason I ask how long is that it is nearly impossible to see my doctor and the nearest appointment he has available is in 3 weeks. I was wondering if I needed to go to the ER or if waiting 3 weeks would be OK. And if there could be anything besides renal failure causing my symptoms?! My family has no past kindey problems, just cancer problems. The only medication I am on now is Ortho Tri Cyclin Lo and I have not had any surgeries in the past.\n\n",
    "posted_time": "Post  by kidneyconcerned » Thu Apr 26, 2007 6:00 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=41462&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p41462"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "First, I apologize for not answering your question sooner.    Regarding your symptoms, there are other possibilities besides your kidneys that could be doing this.  In particular, if the liver is having trouble it can do much of the things you are experiencing.    I would recommend that you be seen soon.  I don't think you need to rush to the emergency department now, but I would try to be seen in the next 3-4 days if possible.    You should have a general work up for your symptoms including liver testing, electrolytes, a urinalysis/urine culture, and blood glucose testing.  Given your many UTI's and kidney infections you should have some imaging of your urinary tract including a renal ultrasound and voiding cystourethrogram to look for urinary reflux back up the ureters (which can predispose to severe/frequent UTI's).  You may also need some nuclear medicine scans to look for renal scarring/function.  If everything else looks ok and it does seem to be an issue with your kidneys you should see a urologist and, more importantly, a nephrologist.  Best wishes.  Keep us updated if you can.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Thu May 17, 2007 12:51 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=42632&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p42632"
  },
  {
    "author": "DiagnoseMe  Guest Posts: 1 Joined: Sun Mar 04, 2007 7:26 pm",
    "title": "kidney/abdomen pain, swelling, rapid heart beat",
    "content": "I am a 26 year old male.  For 5 weeks I have been suffering from a variety of symptoms - the list seems to grow from week to week.  Here's a timeline:  Started with pain in the right groin/abdomen area, and with urine that wasn't quite cloudy, but was strange looking - more dense (and currently quite bubbly).  I went to the doc and we did an ultrasound on the abdomen  to look for appendicitis (and a later ultrasound of the groin).  Ultrasound showed no problems.    I then started developing a situation where at 3:00am every morning I would wake up sweaty and having tremors all over my body, which seemed to start in the abdomen.  I was not running a temperature, but my blood pressure went from around 140/80 to as high as 175/84, and currently at 160/80.  I also had swelling and bloating and digestional problems (diarrhea once, and then constipation since then).  I also find my heart rate to be very unstable, and I can view my stomach move with my heart beat.  I did a complete blood test which checked for diabetes and thyroid problems among others.  Everything came back normal.  Same with the urine and stool analyses, and the EKG.  At the hospital ER, where I ended up one day, the doc said it could be an adrenal problem, so I did my own research and learned that too much aldosterone might produce these symptoms, so I started increasing my potassium and reducing my sodium and I have had no more tremors since then.    I have back pain now in the right kidney area, and still in the abdomen, I also developed a cold or something, which I am still dealing with.  It started with a sore throat and a lot of clear mucous coming from my nose.  At one point I sneezed non-stop for 2 days straight.  I also noticed swollen lymph nodes in my neck, under my right arm and under my clavicle on the left side.  Finally, I have had some numb-like feelings in the left arm.  And I feel like no matter how much I drink I am dehydrated.  This weekend I was having dizzy spells and nausea...almost like fluid in my head.  Also, my finger and toemails are half brownish-pink and half normal (not sure of a conncection here, but I did some research on this and they look like Terry's nails).  All of this and still no diagnosis.  I had mentioned that I lost over 100 pounds (275 to 170) in less than a year without working out, but I did move away from my mother's house and began caring for myself, meaning I was probably eating a lot less.    The one last thing I will say is that the day I first noticed the symptoms I was very, very stressed at work, and was having chest discomfort.  But I feel relaxed since then, so I don't know.  I am currently waiting to see an Internist, but until then I'd like any info anyone can give to me.  I am a little scared to be experiencing all this at such a young age.  Thank you.\n\n",
    "posted_time": "Post  by DiagnoseMe » Sun Mar 04, 2007 7:44 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=39229&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p39229"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Unfortunately, many of your symptoms are fairly non-specific.  So, it may take a little searching to find out the diagnosis.  The one thing I did notice is that even though your blood pressures were elevated, the diastolic pressure (the bottom number) stayed normal.  Aldosterone, too much salt, etc. essentially increase the amount of fluid in your blood vessels thereby raising blood pressure.  When this happens both numbers should go up.  One thing that explains your symptoms fairly well is panic attacks.  These can cause the heart rate to shoot up quite high and raise blood pressure without typically raising the diastolic blood pressure.  They can also cause some nerve type pain such as that which you are experiencing.  There are some important other things to consider.  Seeing your internist is a good idea.  This way you can have some other screening labs and work up to see if something else may be going on.  One note, anxiety attacks often happen when people feel basically OK.  Depression or other symptoms are not a requirement for the diagnosis.  I have had patients with severe anxiety attacks that would be completely well feeling in between episodes.  Best wishes.  Hope this helps.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Mon Mar 05, 2007 11:55 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=39266&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p39266"
  },
  {
    "author": "minxy1  Guest Posts: 1 Joined: Sun Jan 07, 2007 1:37 pm Location: United Kingdom  Contact:   Contact minxy1       AOL",
    "title": "Renal Failure Advice",
    "content": "Hello, I am posting this for a little advice. My Dad who is 62 years old was suddenly diagnosed with kidney failure. He went to the doctors as his legs and genital area had swollen, and he found it hard to breath while walking up hills, he was told to go to A&E. While there they did lots of blood tests and it ended up his blood pressure was very very high. When his results came back (while he was still in hopspital) they told him that his kidneys where working at less than 10%. This is about 4 months ago. He has had a small operation (fiscular vein). He is still not yet on dyalisis. I am very confused with this as I have read information on renal disease and they say if less than 10% it is  called End Stage Renal Disease, this says it could course complications which are multiple and severe or even death. Could anyone please give me some advice of what to do.[/quote]\n\n",
    "posted_time": "Post  by minxy1 » Sun Jan 07, 2007 1:54 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=37428&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p37428"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "I am more familiar with renal failure in children but I'll try to give you some info that will be helpful for you.    All the symptoms that you are listing are very compatible with renal failure-the swelling, difficulty breathing, and hypertension.  A renal functioning of 10% can be considered end stage renal disease; however, to truly call this ESRD there needs to be some more investigation done.  Specifically the cause of the renal failure needs to be identified if possible.  There are some causes of renal failure that can produce very severe decreases in function (even to the point of no function) that will still eventually recover and end up with normal renal function again.  Other causes do not have this favorable outcome.  It sounds as if your dad needs a renal biopsy to look at the kidney tissue and try to determine what the cause is.  Also, there are some blood tests that will be helpful (Complements C3 and C4 levels, for example).  Is your dad still urinating?  Often, even though renal function is low, if urine output remains dialysis is more likely to be avoided.  Loss of urine output is not, in and of itself, an indication for dialysis.  Indications to begin dialysis would include uncontrollable hypertension, electrolyte abnormalities (especially elevated K levels and high acid levels), and symptoms related to elevated blood urea nitrogen (BUN).  If BUN levels are very high dialysis may be done to try to keep symptoms from developing.  Best wishes.  I hope this helps a little.  Keep us updated.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Mon Feb 26, 2007 8:21 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=39037&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p39037"
  },
  {
    "author": "frmtch  Guest Posts: 5 Joined: Sat Dec 16, 2006 10:54 am",
    "title": "hepatic impairment",
    "content": "what is hepatic impairment?\n\n",
    "posted_time": "Post  by frmtch » Fri Feb 02, 2007 5:47 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=38293&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p38293"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Hello,  liver impairment means an abnormal reduced l liver function. Disease (hepatitis) or traumatic injury (chemical, drugs, alcohol) which reduce the liver normal activities.  Laboratory studies help in the identification of the form of liver injury, the functional condition of the liver, and the likely specific causes of disease.   Clinical picture of impaired liver function include: - increased bleeding tendency - jaundice  By investigations results indicative of liver impairment include: - increased levels of circulating hepatic enzymes  -increased billirubin -decreased albumin  Hope this information is useful. Best regards.\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Fri Feb 02, 2007 2:01 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=38325&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p38325"
  },
  {
    "author": "frmtch  Guest Posts: 5 Joined: Sat Dec 16, 2006 10:54 am",
    "title": "Nephrotic disease",
    "content": "What does nephrotic disease mean?\n\n",
    "posted_time": "Post  by frmtch » Sat Dec 16, 2006 11:09 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=36286&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p36286"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Hello,  Nephrotic syndrome is a disease of the kidney that is associated with protein in urine (3.5mg/m2/24hrs), generalized body swelling and high lipid levels in the blood.  Nephrotic syndrome is not due to inflammation of the kidney's glomeruli.  You can find out more about nephrotic syndrome on our website: Click here!\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Sat Dec 16, 2006 11:38 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=36289&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p36289"
  },
  {
    "author": "john colton  Guest Posts: 1 Joined: Thu Dec 14, 2006 11:11 am Location: los angeles  Contact:   Contact john colton       Yahoo Messenger   AOL",
    "title": "dialysis vs. kidney",
    "content": "DoctorsLounge,     I am 75. male. I just had one kidney removed because of cancer. I have a cancerous tumor at the renal pelvis of the other one. I'm comparing going on dialysis to keeping my kidney and treating it with chemotherapy. Would dialysis shorten my life span compared to having a fully functioning kidney?                                    Respectfully, john74151@yahoo.com\n\n",
    "posted_time": "Post  by john colton » Thu Dec 14, 2006 11:35 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=36150&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p36150"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Hello,  Since complete resection is the only known cure for renal cell carcinoma, radical nephrectomy is the established therapy for localized renal cell carcinoma.  Partial nephrectomy is considered in patients in whom a radical nephrectomy would result in permanent dialysis.  The 5 years survival can reach 80% in completely resected T1,T2 disease.  Dialysis patients, who follow the prescribed schedule of dialysis treatments,experience a good quality of life.  The exact life expectancy for patient in dialysis is difficult to be defined but some studies showed that patients on dialysis had an average life expectancy of 5.84 years.  Hope you find this useful. Best regards.\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Fri Dec 15, 2006 2:56 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=36249&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p36249"
  },
  {
    "author": "angelforever34  Guest Posts: 33 Joined: Fri Dec 31, 2004 10:38 am Location: Hurricane, West Virginia",
    "title": "slowed kidney function",
    "content": "Could I find out what it means when dye will not pass through your kidney? I had a test done to evaluate my kidney's and was told they was slow and especially the one the dye wouldn't go through. But I don't quite understand what that means. Have I lost my kidney function in one of my kidney's? Or is it just not functioning as well as it should?\n\n",
    "posted_time": "Post  by angelforever34 » Tue Feb 22, 2005 7:36 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=9828&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p9828"
  },
  {
    "author": "angelforever34  Guest Posts: 33 Joined: Fri Dec 31, 2004 10:38 am Location: Hurricane, West Virginia",
    "title": "[no title]",
    "content": "I had an IVP & was told I had a partial obstruction to my bladder. My bladder, uterus & cervix was prolapsed and messing up my bladder function. Surgery fixed the extreme frequency but I still have alot of pressure & pain from my bladder and left flank pain. Sometimes it shoots really sharp pain up the left side of my back. Hurts pretty badly. I figure it's just a spasmic or pressure problem as to where my bladder is diseased. All the medications I've tried are really ineffective. And all the tests I had done failed to show the problem with the flank pain. It's hopeless but thanks for the advice.\n\n",
    "posted_time": "Post  by angelforever34 » Tue Sep 26, 2006 6:36 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=34173&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p34173"
  },
  {
    "author": "bcsandip  Guest Posts: 1 Joined: Wed Nov 16, 2005 9:23 am Location: India  Contact:   Contact bcsandip       Yahoo Messenger",
    "title": "Creatinine level is too high after the angioplasty.",
    "content": "Hi,  It will so kind if any doctor give me the reason and suggestion for the foloowing problem with my Mother who is having high creatinin level in blood. She is 58 now has only left kidney functioning. She has just undergone angioplasty a couple weeks back because of 90% blockage in the blood artery of the working kidney and the same to the heart artery. Before the angioplasty she was having less than 2 unit of creatinine and immediate after the same it became 3.2, before the 1st. discharge she was having 2.2.But now she is having 7.1 and then 7.7 which is fatal. The symtoms are she is feeling vomitting to see food/water even sometimes to think about. She is having blood pressure in avaerage 160/80 after the angiplasty and she diabetisc as well which is now under 175.  I am in great anxiety.I will be highly obliged to you if you suggest me the reason and way out.  Kindly excuse me, if I have misspelled any medical term.  Thanks in advance. Sandip B. India.\n\n",
    "posted_time": "Post  by bcsandip » Wed Nov 16, 2005 9:41 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=25242&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p25242"
  },
  {
    "author": "R. Zein, Pharm D  Pharmacist Posts: 157 Joined: Tue Jul 12, 2005 9:16 pm Location: USA",
    "title": "[no title]",
    "content": "DEAR   I AM SO SORRY TO hear this about your mother, the fact that she went angioplasty, and has some risk factors such as diabetes, and hypertension, could have predisposed her to an episode of acute renal failure, meaning a sudden elevation in her Cr levels.....  this could happen in many cases where radiocontrast agent is used during the proceedure. and there has been alot of research in this area suggesting alot of hydration and use of sodium bicarbonate or mucomyst before such proceedures in high risk patients to prevent acute renal failure....  many times however, this episode might or not become reversable, and i hope your mother get to feel better i hopr this helped, thank you very much\n\n",
    "posted_time": "Post  by R. Zein, Pharm D » Sat Dec 10, 2005 10:37 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=26484&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p26484"
  },
  {
    "author": "donna harris  Guest Posts: 1 Joined: Mon Dec 01, 2003 11:51 am Location: pensacola florida",
    "title": "alports syndrome",
    "content": "Help i have two daughters with alports snydrome.I'm trying to find some sort of preventive diet low protein low salt eg... which vitamins to take what to stay away from. There has to be a diet to help slow this process.They have an uncle whom died at age 21,grandmother whom died at 54,father whom has already had transplant at 40. aunt and uncle with hearing problems.   All the info i have is women are mainly not affected, 54 is young.One of my daughters has had hematuria since age 2 now 19. If anyone can help please\n\n",
    "posted_time": "Post  by donna harris » Mon Dec 01, 2003 12:10 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1792&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p1792"
  },
  {
    "author": "comicluva  Guest Posts: 1 Joined: Thu Aug 25, 2005 7:01 pm Location: Australia",
    "title": "alports syndrome",
    "content": "Hi Donna, My boyfriend have been together since school and he has Alports, he is just 22, along with his younger brother and his sister is a carrier.  We were just told yesterday that in just a few more years he will be starting dialysis and will eventually have a kidney transplant.  He has regular appointments with his doctors and we have a dietition that helps us a lot. All the meals I cook have to match his diet so there is less strain on his kidneys. I am always checking salt levels and protien levels in foods when we are shopping (to make it worse I am lactose intolerant). If you wish to use salt in cooking etc there is a great salt called 'no salt' tastes the same but isn't really salt! There are also good proteins, I discovered yesterday, such as chicken instead of red meats.. I strongly recommend you see a dietition and they will be able to tell you how much protein/salt they should be getting in a day for their age and suggest some great cook books specially for them, you'll find there are still plenty of yummy foods that she can eat and will help slow any kidney problems\n\n",
    "posted_time": "Post  by comicluva » Thu Aug 25, 2005 7:23 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=19465&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p19465"
  },
  {
    "author": "rms123sls  Guest Posts: 1 Joined: Mon Dec 05, 2005 10:14 pm Location: home",
    "title": "alports",
    "content": "Donna,   My husband has Alports. He also used diet to hold off on having to have a transplant. He was only able to do this for three years. In 1997 he had a kidney transplant and has been doing fine. Have you considered transplant? Have you thought about transplant yet?   We were told to keep the protien down to about 3 grams per day. So that means lots of veggies. I am new to this forum but will answer any questions you only based on my experience.   Sherrie  sls7@verizon.net[/list]\n\n",
    "posted_time": "Post  by rms123sls » Mon Dec 05, 2005 10:22 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=26224&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p26224"
  },
  {
    "author": "pappi  Guest Posts: 1 Joined: Sat Jul 30, 2005 5:47 pm Location: new york",
    "title": "Vancomycin and Renal Failure",
    "content": "Preview  Posted: Sat Jul 30, 2005 11:03 pm     Post subject: Vancomycin and renal failure  I am not sure I am able to give enough information to get a correct answer. My father is 66 years old, in the hospital for retention of urine, due to a enlarged prostate. Developed an infection, I believe MSRA and was treated with Vancomycin and Gentamicin. Because of the antibiotics,  I was told his kidneys were affected but no other details were given. I just found out what his kidney levels were. I would like to know if having a bun of 31 and creatine of 2.5 is of concern? Yesterday it was 33 Bun and 2.6 creatine levels. I was able to get this information from the nurse. They talk to my dad but he is not always clear with me on the details when I speak to him later. .I hope I am giving enough for someone to explain this to me. he is on IV and was instructed to stay away from grapes, tomatoes and other fruits. I am trying to get the doctor to speak to me about his but I haven't been able to get him on the phone. I am totally discouraged by all of this. A cure ends up hurting him!!!  and a nurse then mentioned something about him being put on dialysis if they do not get his levels down.  I don't want him to be on Dialysis. If he is, is it definitely permanent???   I appreciate any information.\n\n",
    "posted_time": "Post  by pappi » Sat Jul 30, 2005 9:02 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=17782&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p17782"
  },
  {
    "author": "R. Zein, Pharm D  Pharmacist Posts: 157 Joined: Tue Jul 12, 2005 9:16 pm Location: USA",
    "title": "[no title]",
    "content": "DEAR INFACT the use of vancomycin and gentamicin for the treatment of MRSA IS TYPICAL. HOWEVER, these drugs can be nephrotoxic, meaning that they are toxic to the kidneys, if trough levels were not monitored carefully.   having said so, your dad, could have been prone to this, due to his medical or other medical conditions (being old, hypertension, nephrotic problems, dehydration, infection), etc, however, the main important point when using gentamicin and vancomycin for effective therapy is to monitor the drug levels in the blood. if the trough levels are too high, there is a chance that they can damage the kidneys, either acutly or chronically, meaning that this acute renal failure may be reversible or irreversible and last life long. it is very individual from patient to patient.  many times dialysis is an option to help treat these symptoms, and i hope your dad kidney function and infection improves with the upcoming days. thank you very much\n\n",
    "posted_time": "Post  by R. Zein, Pharm D » Mon Oct 03, 2005 12:26 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=22194&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p22194"
  },
  {
    "author": "Worried_one  Guest Posts: 3 Joined: Wed Aug 17, 2005 3:18 pm Location: St. Louis",
    "title": "Kidney Pain..dehydration...breathing difficulty...",
    "content": "I am 36, female.  I seem to be going through a cycle…  It begins with abdomen/leg/ankle/feet swelling, fatigue, then kidney pain.  I end up in the ER where they say I am dehydrated and give me bags of fluid through an IV and antibiotics.  I will literally gain 10lbs a day during this cycle!  I started with this as a teenager and now this happens 2-3 times a year. I do NOT get UTI's, ever…  My pain starts in the kidney, almost always the right one.    Three years ago I started having difficulty breathing, hypoxia, chest pain.  I have no allergies.  I was diagnosed with adult onset asthma after seeing a multitude of specialists and everything else was ruled out, although doctor did not view as asthma.  (…had nasal polyps removed)  Now I am hospitalized every few weeks with exacerbated asthma.   Prednisone is the only effective treatment.  I am in a constant 'asthma' attack and inhalers/medications only offer very temporary relief.    First, can these symptoms be related?  If not..then is there any probable cause for either?  My doctor has no idea what is wrong but thinks it's related somehow and not asthma at all.  I'm worried I won't make it long enough to get a proper diagnosis.\n\n",
    "posted_time": "Post  by Worried_one » Wed Aug 17, 2005 3:47 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=18987&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p18987"
  },
  {
    "author": "bruin75  Guest Posts: 5 Joined: Sat Sep 10, 2005 6:29 pm Location: United States",
    "title": "[no title]",
    "content": "You're complaints are interesting, and not unusual.   I presume that you are premenopausal and that you have regular periods.  Lets dissect your complaint and try to answer each aspect of it separately and see if we can make some sense of it all. First, if you have regular menses, does the abdominal and feet swelling occur around the time of your periods? Secondly I am not convinced that what you describe as \"kidney pain\" is in fact what you believe it to be. The kidneys have only two anatomical areas that might result in the symptom of pain, one is the fibrous capsule that surrounds the organ itself, the other is in the collecting area called the renal pelvis., where the urine drains out of the kidney into the ureter and to the bladder.  The conditions that would cause pain or an ache would have to cause relatively rapid expansion inside the renal capsule like a rapidly growing tumor or a hemorrhage. Neither is likely in your case. The other instance of pain would be an irritant in the renal pelvis or ureters, such as a stone or gravel (smaller crystals). This would result in near excrutiating pain in the back and flanks with radiation to the labia.  This is also highly unlikely from your description of your symptoms.  I suspect the discomfort you feel has nothing or at the least very little to do with your kidneys as the parenchyma of the kidneys (that is, the inside of the kidneys themselves have no pain fibers to elicit this kind of a symptom).  I suspect what you feel is a musculoskeletal discomfort. or even a referred pain.  In any event, your doctor can reassure you by getting an ultrasound of the kidneys to show you there is nothing wrong with them. I suspect however when you are examined and you point out the location of the pai, that it will be quite clear to your doctor that it is in no way related to your kidneys. Abdominal and ankle and feet edema (swelling) is very commonly seen in the perimenstrual and menstrual period.  This is self limiting and is due to hormonal changes that result in salt retention by the kidneys and secondary water retention.  If it is really a bothersome symptom, then a small dose of a thiazide diurretic may be usefull.   Your asthma needs to be evaluated and your doctor may want to test for the unlikely possibility this could be something other than asthma such as Sarcoidosis.  I would not seek your medical care in an ER but get a personal doctor to follow your care.\n\n",
    "posted_time": "Post  by bruin75 » Sat Sep 10, 2005 6:54 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=20306&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p20306"
  },
  {
    "author": "bruin75  Guest Posts: 5 Joined: Sat Sep 10, 2005 6:29 pm Location: United States",
    "title": "[no title]",
    "content": "bruin75 wrote:You're complaints are interesting, and not unusual.   I presume that you are premenopausal and that you have regular periods.  Lets dissect your complaint and try to answer each aspect of it separately and see if we can make some sense of it all. First, if you have regular menses, does the abdominal and feet swelling occur around the time of your periods? Secondly I am not convinced that what you describe as \"kidney pain\" is in fact what you believe it to be. The kidneys have only two anatomical areas that might result in the symptom of pain, one is the fibrous capsule that surrounds the organ itself, the other is in the collecting area called the renal pelvis., where the urine drains out of the kidney into the ureter and to the bladder.  The conditions that would cause pain or an ache would have to cause relatively rapid expansion inside the renal capsule like a rapidly growing tumor or a hemorrhage. Neither is likely in your case. The other instance of pain would be an irritant in the renal pelvis or ureters, such as a stone or gravel (smaller crystals). This would result in near excrutiating pain in the back and flanks with radiation to the labia.  This is also highly unlikely from your description of your symptoms.  I suspect the discomfort you feel has nothing or at the least very little to do with your kidneys as the parenchyma of the kidneys (that is, the inside of the kidneys themselves have no pain fibers to elicit this kind of a symptom).  I suspect what you feel is a musculoskeletal discomfort. or even a referred pain.  In any event, your doctor can reassure you by getting an ultrasound of the kidneys to show you there is nothing wrong with them. I suspect however when you are examined and you point out the location of the pai, that it will be quite clear to your doctor that it is in no way related to your kidneys. Abdominal and ankle and feet edema (swelling) is very commonly seen in the perimenstrual and menstrual period.  This is self limiting and is due to hormonal changes that result in salt retention by the kidneys and secondary water retention.  If it is really a bothersome symptom, then a small dose of a thiazide diurretic may be usefull.   Your asthma needs to be evaluated and your doctor may want to test for the unlikely possibility this could be something other than asthma such as Sarcoidosis.  I would not seek your medical care in an ER but get a personal doctor to follow your care.\n\n",
    "posted_time": "Post  by bruin75 » Sat Sep 10, 2005 6:57 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=20307&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p20307"
  },
  {
    "author": "bruin75  Guest Posts: 5 Joined: Sat Sep 10, 2005 6:29 pm Location: United States",
    "title": "[no title]",
    "content": "bruin75 wrote:bruin75 wrote:You're complaints are interesting, and not unusual.   I presume that you are premenopausal and that you have regular periods.  Lets dissect your complaint and try to answer each aspect of it separately and see if we can make some sense of it all. First, if you have regular menses, does the abdominal and feet swelling occur around the time of your periods? Secondly I am not convinced that what you describe as \"kidney pain\" is in fact what you believe it to be. The kidneys have only two anatomical areas that might result in the symptom of pain, one is the fibrous capsule that surrounds the organ itself, the other is in the collecting area called the renal pelvis., where the urine drains out of the kidney into the ureter and to the bladder.  The conditions that would cause pain or an ache would have to cause relatively rapid expansion inside the renal capsule like a rapidly growing tumor or a hemorrhage. Neither is likely in your case. The other instance of pain would be an irritant in the renal pelvis or ureters, such as a stone or gravel (smaller crystals). This would result in near excrutiating pain in the back and flanks with radiation to the labia.  This is also highly unlikely from your description of your symptoms.  I suspect the discomfort you feel has nothing or at the least very little to do with your kidneys as the parenchyma of the kidneys (that is, the inside of the kidneys themselves have no pain fibers to elicit this kind of a symptom).  I suspect what you feel is a musculoskeletal discomfort. or even a referred pain.  In any event, your doctor can reassure you by getting an ultrasound of the kidneys to show you there is nothing wrong with them. I suspect however when you are examined and you point out the location of the pain, that it will be quite clear to your doctor that it is in no way related to your kidneys. Abdominal and ankle and feet edema (swelling) is very commonly seen in the perimenstrual and menstrual period.  This is self limiting and is due to hormonal changes that result in salt retention by the kidneys and secondary water retention.  If it is really a bothersome symptom, then a small dose of a thiazide diurretic may be usefull.   Your asthma needs to be evaluated and your doctor may want to test for the unlikely possibility this could be something other than asthma such as Sarcoidosis.  I would not seek your medical care in an ER but get a personal doctor to follow your care.\n\n",
    "posted_time": "Post  by bruin75 » Sat Sep 10, 2005 6:59 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=20308&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p20308"
  },
  {
    "author": "Worried_one  Guest Posts: 3 Joined: Wed Aug 17, 2005 3:18 pm Location: St. Louis",
    "title": "[no title]",
    "content": "Hello, thank you for your input.  Actually, the swelling became so severe a couple of days ago that I did end up in the ER.  The swelling, as usual, began in my feet and ankles and by the end of the evening extended up to mid-thigh.  My abdomen was also very swollen.  (The swelling does go down at night but the area becomes painful and warm to the touch)  As I am always short of breath and wheezing, I was given two breathing treatments and intravenous Prednisone.  Of course, there was blood drawn, an EKG and a chest x-ray.  Of this, all was fine with the exception of a high white blood cell count that could not be explained.  I was walked up and down the halls with an oximeter attached, which did show that my SO2 (?) levels did drop significantly while walking.  I was then given a chest CT with dye which was fine.  In the end, I was told that they don't know why I have trouble breathing as my peak flow was the same before and after the breathing treatment, my breath sounds were diminished before and after.  There was no explanation for the swelling as well as why my feet turn blue when I am sitting.  I was told to follow up with a pulmonary specialist.  I am premenopausal however the swelling has been a daily occurrence for over two months and has become increasingly worse, I don't believe it is related to my monthly cycle.  I am not overweight.   As for the kidney pain, it is definitely kidney pain.  A couple of years ago I had a procedure, I think it was called an IVP?  It determined that I had something called Medullar Sponge Kidney and that one side was affected more than the other, with some loss of kidney function.  This just doesn't make sense to me as I thought this was a benign condition.  The condition does cause me to have frequent kidney (bacterial) infections that are relieved with antibiotics and lots of fluids.  This could also explain why I am often dehydrated I guess.\n\n",
    "posted_time": "Post  by Worried_one » Mon Sep 12, 2005 9:15 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=20395&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p20395"
  },
  {
    "author": "beckybee  Guest Posts: 1 Joined: Fri Sep 23, 2005 6:32 pm Location: atlanta",
    "title": "Creatine 1.9",
    "content": "What does your creatine levels have to be for you to be put on dialysis? I am sorry of repling with a question in this area, but I did not know how to post my question.  My creatine level is 1.9.\n\n",
    "posted_time": "Post  by beckybee » Fri Sep 23, 2005 7:04 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=21471&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p21471"
  },
  {
    "author": "gibsonjohnp  Guest Posts: 1 Joined: Wed Aug 17, 2005 8:01 am Location: Dallas",
    "title": "Renal Artery Stenosis-Polycystic Kidney Disease",
    "content": "Can you please assist.  I have a 5yr old son with Renal Artery Stenosis and Polycystic Kidney Disease (both kidneys).  His blood pressures have been consistently high for  the past two months (high 132/65, low 120/60).  For several years he ws running 90/60.  Blood levels are now showing off.  Creatinine is showing at 1.2.  BUN is allso showing high in blood.  24hr urine is showing low levels of Urea and Creatinine.  He is currently on a low sodium, low potasium diet.  Taking Enalapril HCTZ, Atenolol, and Norvasc twice a day to try and stabalize his blood pressures and it is not working.  Current Renal docs can not determine why pressures keep going up.  Is this Uriema?  The docs are arguing back and forth about it and my child is not getting any better.\n\n",
    "posted_time": "Post  by gibsonjohnp » Wed Aug 17, 2005 8:10 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=18959&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p18959"
  },
  {
    "author": "bruin75  Guest Posts: 5 Joined: Sat Sep 10, 2005 6:29 pm Location: United States",
    "title": "[no title]",
    "content": "Your child probably has what is called Autosomal Recessive Polycystic Kidney Disease or ARPKD.  ARPKD (also called infantile polycystic kidney disease) typically presents in infancy, although there are childhood and adolescent forms which are generally less severe   The estimated incidence is 1:10,000 to 1:40,000.  ARPKD is frequently associated with hepatic involvement, characterized by cysts, fibrosis, and portal hypertension.  Hypertension (high blood pressure)  is common during the first few years, even though the plasma creatinine concentration may be normal or only slightly elevated. Progressive renal failure ultimately occurs in most patients. However, the glomerular filtration rate, that is the rate at which the kidneys can filter the blood,  follows a fluctuating course. It is often decreased for the first weeks of life, then increases during the first two years. It may in fact  remains stable for several years, and then gradually declines. End-stage renal disease usually occurs after 15 years of age, although onset between ages 5 and 10 may be seen in children who present in the first year of life . However, a small subset of patients continues to have autonomous renal function at 40 to 50 years of age.   Unfortunately, your childs kidney's will not get better, it is an indolent and progressive disease that is a result of genetic mutations in chromosome 6. The defective gene has been isolated and has been cloned  The extremely large gene, PKHD1, encodes a novel protein product, named fibrocystin also known as polyductin, that is comprised of over 4000 amino acids.   Eventually he will need renal replacement therapy (dialysis) and will be a candidate for a kidney  transplant.  You should be aware that each child or new fetus will have a one in four chance of developing the disease (although the expression of the disease may be different from that in other siblings) and has fifty percent  chance of being a carrier of the defective gene.  Your child appears to be managed appropriately by his nephrologist. He is on the right medications for his blood pressure, particularly an angiotensin converting enzyme inhibitor. These medications reduce kidney injury by reducing the pressure inside the kidney, however, they do cause a rise in the serum creatinine but that is not a bad thing.  I would have trust in your childs physicians as they sincerely have the interest of your childs care at heart.  The details of his care may not always be agreed upon by each individual phyisician to which you have entrusted the care of your chiild. To the uninitiated that seems as if they don't have any idea of what to do.  I can assure you that these kinds of disagreements occur frequently in medicine and in science in general. It is as a result of these disagreements that the best ultimate results are obtained in the end.\n\n",
    "posted_time": "Post  by bruin75 » Sat Sep 10, 2005 7:30 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=20309&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p20309"
  },
  {
    "author": "puntin1919  Guest Posts: 1 Joined: Tue Jun 21, 2005 6:32 pm Location: riverside ca",
    "title": "severe swelling in legs,ankles,and feet.",
    "content": "i am 43 years old, i had kidney stones when i was 20, and have had multiple repeat kidney infections, i have random pain in my kidneys at any given time, but mostly my right kidney gives me pain.  I also swell up in my legs, feet ankles, stomach area, severly.  when i swell it takes several days of staying off my feet, for the swelling to subside, and it returns frequently, there is some pain with the swelling in my legs and ankles.  could this be a sign of kidney failure?  my father was on dialysis for 3 years and just died of kidney failure.  he also swelled and had multiple kidney infections.\n\n",
    "posted_time": "Post  by puntin1919 » Tue Jun 21, 2005 6:45 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=15565&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p15565"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi puntin1919, Symptoms such as yours may be related to impaired renal function, cardiac function, etc. I would suggest taking into consideration your family history that you have an evaluation by your physician for renal function studies. This is very important for you to do as your kidneys filter out waste products and you may become very ill if this is actually the causative factor. Sincerely, Rntdj\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Wed Jun 22, 2005 5:28 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=15584&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p15584"
  },
  {
    "author": "nity72  Guest Posts: 3 Joined: Sat Aug 09, 2003 4:34 pm Location: egypt  Contact:   Contact nity72       Yahoo Messenger",
    "title": "[no title]",
    "content": "my dear : swelling of the lower limp if on both side it should be taken seriously any way it may be related to kidney liver or heart problems .it need s good medical evalution of the 3 organs mention als u must get abdominal x-ray for kidney ureter and bladder , abdominal ultreasound and a complete blood investigations ,fbc , urea creatinine,na k, po4,calcium ,uric acid ,serum albumin and total protien ,alt,these investigation mostly will clearfy the situation  good luke\n\n",
    "posted_time": "Post  by nity72 » Wed Jun 22, 2005 10:54 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=15601&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p15601"
  },
  {
    "author": "tscales  Guest Posts: 4 Joined: Thu Mar 17, 2005 6:47 pm",
    "title": "Conversion from g/24 hours to ML/Min",
    "content": "My wife is a long-term diabetic who is starting to experience chronic renal failure. She recently had a 24 creatinine clearence test and the results were:  .56 g/24 hours   Her serum creatinine is 2.6 and the volume was 3500 ml.  Everything we find in our research discusses creatinine clearance in ml/min, not g/24 hours. We're having trouble finding the formula to convert from one to the other.  Can anyone point us to the proper formula?  Thanks,  Tom\n\n",
    "posted_time": "Post  by tscales » Thu Mar 17, 2005 7:02 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=10964&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p10964"
  },
  {
    "author": "Rhonda P, CEP  Paramedic Posts: 252 Joined: Wed Mar 16, 2005 8:37 am Gender: Female Location: USA",
    "title": "Serum Creatinine levels",
    "content": "Here is a link for you to contact the American Kidney Fund and the National Kidney Foundation. Their addresses and phone numbers are listed as well as a bit of information on how the test is measured. It's hard to explain conversions like this but I think they can answer your questions the best.  http://kidney.niddk.nih.gov/kudiseases/ ... dneytests/   If you can't open the link, here are the addresses:  National Kidney Foundation 30 East 33rd Street New York, NY 10016 Phone: 1-800-622–9010 or (212) 889-2210 Email: info@kidney.org Internet: http://www.kidney.org  American Kidney Fund 6110 Executive Boulevard Suite 1010  Rockville, MD 20852 Phone: 1-800-638–8299 or (301) 881-3052 Email: helpline@akfinc.org Internet: http://www.akfinc.org\n\n",
    "posted_time": "Post  by Rhonda P, CEP » Thu Mar 17, 2005 8:17 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=10972&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p10972"
  },
  {
    "author": "Dr. Anthony Solomon  Medical Doctor Posts: 510 Joined: Mon Nov 15, 2004 6:04 pm",
    "title": "CREATININE CLEARANCE TEST - how to calculate it",
    "content": "If the laboratory supplied you with these values and expected your wife to calculate the  Creatinine Clearance Rate (CCR), you are entitled to a refund or to a repeat test free of charge. As Web-Medic correctly explained in the first reply, it is difficult to explain conversions. It is not possible to convert g/hr to ml/min because one is a weight, and the other a volumetric measurement. Even doctors sometimes find the formula for calculation confusing and difficult to remember. The laboratory is expected to provide you with a calculated value.  I have calculated your wife’s CCR to be 149.54ml/min (normal range 90 –130 ml/min) assuming that the figures you supplied are accurate.  Here is the formula for calculating CCR based on the values you have given:  CCR =  A multiplied by B divided by C   where    A = The average volume in milliliters of urine excreted in one minute. In your wife's case, this would be 3500ml divided by 1440 minutes (24 hours). This equals 2.43ml/min.  B = The average amount of creatinine in milligrams in one liter of excreted urine. (0.56g  is equal to 560mg). This would be 560mg divided by 3500ml multiplied by 1000ml. This equals 160mg/litre.  C = The average amount of creatinine in milligrams in 100ml of blood. The result is 2.6mg/100ml  (incorrectly reported as 2.6 without the units).   Now, let us get down to simple mathematics: CCR = A x B divided  by C  = 149.54ml/min  Normal values for adult males range from about 100 to 140 milliliters per minute.  Normal values for adult females range from about 90 to 130 milliters per minute.    I wish you and your wife a Happy Easter and hope that her CCR improves with treatment.   Dr Anthony Solomon MB BS DTM&H DIP.VEN FRSM Consultant Physician, Tropical & Genitourinary Medicine\n\n",
    "posted_time": "Post  by Dr. Anthony Solomon » Sun Mar 27, 2005 6:18 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=11448&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p11448"
  },
  {
    "author": "tscales  Guest Posts: 4 Joined: Thu Mar 17, 2005 6:47 pm",
    "title": "calculation",
    "content": "Thank you so much for your reply. I had continued to research and finally found a similar formula, except that B was represented in milligrams per deciliter, resulting in 14.95 rather than 149.5.  Obviously quite a difference.  I guess I am surprised at the 149, which is ABOVe normal, given her high serum creatinine.  Not questioning your calculation, just awfully confused.  Thanks!  Tom\n\n",
    "posted_time": "Post  by tscales » Sun Mar 27, 2005 6:44 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=11450&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p11450"
  },
  {
    "author": "Dr. Anthony Solomon  Medical Doctor Posts: 510 Joined: Mon Nov 15, 2004 6:04 pm",
    "title": "CONFUSING RESULTS",
    "content": "The accuracy of the Creatinine Clearance Test is affected by many factors:  Incomplete or faulty urine collection Inaccurate estimations of serum and urinary creatinine Vigorous exercise prior to the test Obesity  Certain medications that interfere with the test  I was also surprised at the value obtained by the calculation, and can only attribute it to inaccurate laboratory results or faulty urine collection, not the formula or calculation.  If your wife had a CCR of 14.95 with your B interpretation, she would be in a very serious condition. Try another laboratory for comparison.   Dr Anthony Solomon  .\n\n",
    "posted_time": "Post  by Dr. Anthony Solomon » Sun Mar 27, 2005 7:46 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=11456&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p11456"
  },
  {
    "author": "tscales  Guest Posts: 4 Joined: Thu Mar 17, 2005 6:47 pm",
    "title": "Thanks",
    "content": "Yes, she would and I believe she is. We have an appointment with a Nephrologist on Friday. It's complicated by the fact that she has a nephroureteral stint and external bag, as she is not draining any urine through her ureter.    Thanks again for your help.  Tom\n\n",
    "posted_time": "Post  by tscales » Sun Mar 27, 2005 8:02 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=11458&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p11458"
  },
  {
    "author": "Dr. Anthony Solomon  Medical Doctor Posts: 510 Joined: Mon Nov 15, 2004 6:04 pm",
    "title": "Calculating CCr without using urine values",
    "content": "You may use any of the two methods described herein to obtain the CALCULATED CCr, which differs from the MEASURED CCr. The measured CCr utilises urine values; the calculated CCr uses the patient's age and weight which you have supplied to me by PM.    On the home page of our website (www.doctorslounge.com), click MEDICAL CALCULATORS (same column as Ask a Doctor); then click  Creatinine Clearance Calculator; tick female circle; insert 2.6 in first box and change units to mg/dl ; insert 47(weight of patient) in second box and ensure  unit is in kg; insert 43 in third box (age of your wife)   Click CALCULATE.  You should have a CCR of 20.70 ml/min.     From the link you sent to me by PM, click the Cockcroft-Gault formula in the last paragraph and calculate CCR as follows (USING THIS FORMULA)   (140 - 43) x 47                  72 x 2.6   Multiply the value of above by 0.85 (for female): CCR = 24.35ml/min   These two calculated values are more realistic, assuming again that the  serum creatinine figure of 2.6mg/dl is accurate.   Dr Anthony Solomon\n\n",
    "posted_time": "Post  by Dr. Anthony Solomon » Tue Mar 29, 2005 9:19 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=11551&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p11551"
  },
  {
    "author": "tscales  Guest Posts: 4 Joined: Thu Mar 17, 2005 6:47 pm",
    "title": "Calculated value",
    "content": "Thank you for your reply.  That matches what I had found in my research.  It's probably a more realistic number (certainly than 149!).  Tom\n\n",
    "posted_time": "Post  by tscales » Tue Mar 29, 2005 9:43 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=11553&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p11553"
  },
  {
    "author": "cockerham  Guest Posts: 2 Joined: Wed Feb 02, 2005 3:13 pm Location: Seymour, IN",
    "title": "renal insufficiency",
    "content": "Hi, I wrote yesterday about a case study I was working on.  I didn't give all the information so the doctor was unable to answer my question.  here is the complete case study.  Mr. RF, 96, was brought into the ED by his son due to extreme confusion that had progressed rapidly throught the day. His son indicated that he had never seen his father like this, generally he's healthy, oriented, and able to get around using his walker. In fact, yesterday Mr. F. watched TV and worked on crossword puzzles. But at breakfast today, he didn't know it was morning, and by lunchtime, he was unsure where he was and throught he was eating dinner.  By midafternoon, he knew little more than his name. The ED physician diagnosed abnormal mental state and admitted him to the 23-hour observation unit where you work.  As you review the ED form you note that at admission Mr. Ft's temperature was 104F (orally), P 86 (regular), R 18 (clear and unlabored), BP 90/40. Admitting lab values were: WBC 30,300 mm3, RBC-3.61 millioin/mme, Hgb 11.6 gm/kL, Hct 34.3%. At 1630 an IV (1000mL) of 0.9% NS was begun @ 75 mL/hr.  He received 150 mg of Gentamycin IM and 1g of Ampicillin IV.  As you assess Mr.F.  you note that his skin is warm, dry, and lacks turgor.  His temp is 99F (orally), P 80 (regular), R 18 (regular and even), BO 106/54. He has no abdominal or chest pain and no cough.  He doesn't take any medications and has an uneventful medical history, except for surgery 4 mos ago to correct a factured right hip. Since then he's had an indwelling urinary catheter to relieve urinary retention.  He has received 150mL of the IV NS and his uring output has been at least 30mL/h.   Serum chemistry tests ordered in the ED resulted in the following: Na 137 mEq/L, K 3.8 mEq/L, chloride 106 mEq/L, co2 18 mmol/L, BUN 19 mg/dL, creatinine 1.0 mg/dL. Microscopic urinalysis revealed bacteria and a high number of WBC, urine culrue showed more than 100,000 oranisms/mL, chest X-ray was negative.   From this information, we are to determine if this patient has impaired renal functioning.  With his BUN and Creatinine being WNL, is this possible?  I know his age will factor in this decision also.  thanks\n\n",
    "posted_time": "Post  by cockerham » Thu Feb 03, 2005 5:44 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8868&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p8868"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi cockerham, I have not yet read your other post but from what you describe here, In my opinion I would consider urosepsis or septicemia. Sincerely, Rntdj\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Mon Feb 07, 2005 8:18 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=9018&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p9018"
  },
  {
    "author": "cockerham  Guest Posts: 2 Joined: Wed Feb 02, 2005 3:13 pm Location: Seymour, IN",
    "title": "BUN and creatinine levels",
    "content": "Hi, I am a student nurse and I have a case study I am working on.  the patient presents with extreme confusion, T-104F, P 86 (regular), respirations 18 (clear & unlabored), BP 90/40. lab values WBC=30,300 mm3; RBC=3.61 million/mme; Hgb=11.6 gm/dL; Hct=34.3%.  started IV (1000mL) of 0.9% NS and gave 150 mg of Gentamycin IM and 1 g of Ampicillin IV.  Skin is warm, dry and lacks turgor.  no abd pain or chest pain and no cough.   had hip surgery 4 mos prior and still had indwelling catheter.  urine output 30mL/hour.  Na=137 mEq/L; K=3.8mEq/l; chloride=106 mEq/L; CO2-18 mmol/L; BUN=19 mg/dL; creatinine=1.0 mg/dL.  microscopic urinalysis revealed bacteria and high number of WBC; urine culter showed more than 100,000 oranisms/mL; chest X-ray was negative.  With this information, especially the BUN and creatinine being WNL, is it possible that this patient has impaired renal functioning?\n\n",
    "posted_time": "Post  by cockerham » Wed Feb 02, 2005 3:22 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8837&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p8837"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Hello, The term renal impairment is not a very objective one. A patient is either is renal failure or not. Renal failure may be acute or chronic. If it is acute the renal function tests may return to normal or they may progress to irreversable renal failure (chronic). In order to answer your question you would be required to compare the patient's current renal function tests with his previous tests. A persistant increase in renal function test levels even if within normal range is indicative of deterioration in renal function. To diagnose renal failure properly you would need to perform a creatinine clearance test. Especially that creatinine is not a sensitive test for detection of early renal disease.  That said however, it is possible for a patient to have acute pyelonephritis without deterioration in renal function. Provided of course, it is quickly treated.  As for possible causes of confusion, you should ask yourself: How long has his blood  pressure been this low? How old is your patient? Is it possible that he has developed a stroke (given the low blood pressure and the dehydration)? Is there an obvious cause for his hypotension? Hope this helps.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Wed Feb 02, 2005 3:51 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8838&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p8838"
  },
  {
    "author": "LBreedin  Guest Posts: 1 Joined: Sun Oct 17, 2004 3:58 pm Location: South Carolina",
    "title": "Creatininine Clearance",
    "content": "My husband recently did the 24 hour urine sample and a blood test.  He got the report in the mail this weekend. Below are the results as they are listed on the report.  Creatinine                       1.5 H    MG/DL Creatinine Clearance       74L       ML/MIN  The doctor attached a note saying it suggests mild kidney failure. Can you shed some light on this report??\n\n",
    "posted_time": "Post  by LBreedin » Sun Oct 17, 2004 4:08 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5914&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p5914"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Hello LBreedin, Creatinine is a substance that is commonly used to estimate renal function because it is excreted completely by the kidneys and very little of it gets secreted. It is a very good estimate of renal function.   Serum creatinine normally can reach up to 1.3 MG/DL. Your husband's results are higher (1.5) meaning that his kidneys are not excreting creatinine as it should and hence it is accumulating in the body.  A more accurate estimate is the creatinine clearance test. Here there is a direct estimate of creatinine excretion by the kidneys over a period of 24 hours. If below normal kidney excretion is less than it should be. As said earlier this correlates well with kidney function.  The normal values of the tests you mentioned are probably written in the report given. Please refer to them and if there is any descripancy between the normal values above and the ones on your report then follow the ones you have as lab variations exist.  Your husband should be followed up closely and a search for a cause should be sought.  Best regards,\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Sun Oct 17, 2004 5:07 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5916&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p5916"
  },
  {
    "author": "penniep  Guest Posts: 1 Joined: Tue Jan 18, 2005 9:54 pm Location: South Carolina",
    "title": "creatine levels",
    "content": "My husband was diagnosed in Oct.,2004 with IGA nephritis.He has had so much fluid on him that they increased his lasix to 4 three times a day 40 mg a pillLike 480 mg a day.In 5 days he lost 20 pds. in fluid.He's creatine level has been at 3.5 since Nov.2004Now as of today his level is 6.5He has not been on dyalisis yet.The Dr is gonna check the level again in a couple of days.How bad is the 6.5 level?  Thank You,  Pennie\n\n",
    "posted_time": "Post  by penniep » Tue Jan 18, 2005 10:14 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8293&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p8293"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "penniep, 6.5 is high, however, what matters more is the speed at which the deterioration happened. Depending on other clinical and lab findings his doctor may advice dialysis which will restore his creatinine levels, hopefully.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Wed Jan 19, 2005 4:33 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8299&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p8299"
  },
  {
    "author": "joanna  Guest Posts: 2 Joined: Thu Dec 30, 2004 1:21 am Location: california",
    "title": "what does elevated albumin indicate?",
    "content": "Hello, I am a 43 year old female with a family history of kidney disease and subsequent dialysis.  I was feeling fatigued, short of breath, with irregular fluttering feelings in my chest as well as elevated heart rate. My new doctor ordered tests that came back normal with the exception of my albumin level being 4.8g/dl and my ferr iron screen bing 25ng/ml. Should I be concerned about the albumin level, and should I try to raise my iron level with a supplement, for example, floridix? thanks in advance for your input...joanna\n\n",
    "posted_time": "Post  by joanna » Thu Dec 30, 2004 1:29 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=7503&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p7503"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Excess albumin levels are very rare. They can result from dehydration. How was your hemoglobin result? Could you specify the result of the iron screen in addition to the normal range provided by your lab.  Best regards,\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Sat Jan 01, 2005 7:26 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=7586&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p7586"
  },
  {
    "author": "joanna  Guest Posts: 2 Joined: Thu Dec 30, 2004 1:21 am Location: california",
    "title": "[no title]",
    "content": "Hello Dr. Fouad, My hemoglobin is 13.6g/dl and the normal range for \"iron screen Ferr\" is listed as 22-291ng/ml while i am 25ng/ml. my cholesterol is also on the high side, 219 which is very unusual for me.  Trigliycerides 64, HDL 104 and LDL 102. Everything else on my labs is in the normal range. I usuallyhave low cholestrol, except for once a few years ago, but it returned to normal and has been so for quite a while.  I have no idea why it's elevated now.  I also remember having low iron about 10 years ago, and going on iron pills.  I don't ever remember hearing about my albumin level before, but then this the is first health provider that sent my values home for my own records. thanks again! joanna\n\n",
    "posted_time": "Post  by joanna » Sat Jan 01, 2005 9:55 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=7592&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p7592"
  },
  {
    "author": "Emerald  Guest Posts: 3 Joined: Thu Dec 23, 2004 12:26 am Location: Pakistan",
    "title": "Diabetes and Renal Impairment.",
    "content": "HI, I am a Medical Student. I want to ask a question about my Mother. My Mother is 53 years old. She is Diabetic (Type-2) and Hypertensive. She also has Coronary Artery Disease with mild inferior wall ischemia. Her current drug therapy is: Insulin NPH 16/14 units Nitroglycerine 2.6 mg 2 times daily Diltaizem 60 mg 2 times daily Losartan 50mg 2 times daily. Low Dose Aspirin 75mg daily.   She had UTI without any symptoms so was not recommended to take any medicine for that. However her Urine RE indicates that she is passing Albumin (+2) in urine. To check the renal functions BUN and Creatinine were measured. The results are:  Blood Urea Nitrogen = 19 mg/dl Serum Creatinine = 1 mg/dl  I want to ask:  1. Is her BUN and Creatinine levels within the normal range? 2. What is the normal range for the above? 3. Do these results indicate Renal Impariement? 4. Can passing albumin in urine be due to the Urinary tract infection?  On the Lab report the normal range for BUN was 4-15 mg/dl. Seeing this my Mother got really upset and thought that she was suffering from Renal Failure because her BUN is 19 mg/dl. However in Books and at other places I found the normal range of BUN to be 7-20 mg/dl. Which one is correct? I also feel that she is a bit dehydrated and her protein intake during the last 2 months was high. For example she takes 2 egg whites everyday in breakfast and also likes and eat meat. Can this be a reason for the Lab results?\n\n",
    "posted_time": "Post  by Emerald » Thu Dec 23, 2004 1:21 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=7281&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p7281"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Hello Emerald,  1. Is her BUN and Creatinine levels within the normal range?  2. What is the normal range for the above?  The best estimate of the normal range is the one specified in her test results. There are variations in the normal range depending on the test-kits and the procedure used.  3. Do these results indicate Renal Impariement?  Many medical authorities do not like to use the term renal impairment. The kidney is either in failure or not. Renal failure may be temporary (acute renal failure) or permenant (chronic). The results above do not indicate renal failure. A better estimate of renal function would be a creatinine clearance test. I would recommend it.  4. Can passing albumin in urine be due to the Urinary tract infection?  Ok. This is what I think is wrong with your mother. It appears that her dehydration has caused her BUN to rise slightly indicating that she will need proper hydration. The albumin present in her urine is most probably attributable to her diabetes. To properly assess her albumin a 24 hour urinary albumin test is required. This is important to exclude nephrotic syndrome.  Best regards,\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Sat Dec 25, 2004 3:44 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=7347&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p7347"
  },
  {
    "author": "VW",
    "title": "Pain in kidney area upon awakening",
    "content": "I often have pain in my lower back on both sides where my kidneys are located. I have had a urinalysis done and there were no signs of a kidney or urinary infection. Sometimes it is so bad that I can't get up from the bed. I have to roll out on my side. This has been going on for the past couple of years and it is a huge concern. I have to wake my husband up to help me get up. I have noticed that when this happens I usually have to urinate really bad and while doing so it feels like the pain in my back subsides. Any ideas?\n\n",
    "posted_time": "Post  by VW » Wed Jun 04, 2003 7:22 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=879&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p879"
  },
  {
    "author": "dbierzynski  Guest Posts: 1 Joined: Tue Oct 26, 2004 8:52 am Location: morgantown pa  Contact:   Contact dbierzynski       AOL",
    "title": "renal failure",
    "content": "I have been having the same problems and I go for and ultrasound nov 19 it has been going on for a year if you get any information on what this could be please let me no.\n\n",
    "posted_time": "Post  by dbierzynski » Tue Oct 26, 2004 9:00 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6090&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p6090"
  },
  {
    "author": "abbott  Guest Posts: 1 Joined: Fri Jun 06, 2003 7:57 pm",
    "title": "acidosis",
    "content": "I have CRF with a creatinine of 3.9 for a couple of years.  Last November, a doctor prescribed diovan for blood pressure of 140/80 and my creatinine and Bun went up to 5.1 and 50. I am 19 years old.  For 6 months, the creatinine stayed high and Bun stabilized at 35.  I recently was treated for acidosis with sodium bicarbonate and suddenly my creatinine went down to 3.6 and BUN to 29.  It's been that way for 3 weeks now.  The doctor says that this is a real increase in renal function but can't really explain it.  I was thinking I was needing a transplant soon and now I don't know.  Has anyone ever heard of this happening?\n\n",
    "posted_time": "Post  by abbott » Fri Jun 06, 2003 8:07 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=901&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p901"
  },
  {
    "author": "aha_malki  Guest Posts: 2 Joined: Sun Oct 24, 2004 9:15 am Location: canada  Contact:   Contact aha_malki       Yahoo Messenger",
    "title": "[no title]",
    "content": "The Diovan you have used can impair renal function through its effect on vascular tone and reduction of intraglomerular pressure. This is particularly documented for a group of medications with near similar mechanism of action called ACE-inhibitors. You have used Diovan then your serum creatinine and BUN went up. Later on, you noticed improvement almost back to the baseline. Probably you stopped Diovan.  Either Diovan or other drugs (not mentioned) resulted in transient elevation of creatinine and BUN. Removing the cause leads to stabilizing renal function back to baseline values.  I hope this will make sense to you.\n\n",
    "posted_time": "Post  by aha_malki » Sun Oct 24, 2004 9:38 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6046&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p6046"
  },
  {
    "author": "tazshareef  Guest Posts: 6 Joined: Thu Sep 09, 2004 7:52 pm Location: usa  Contact:   Contact tazshareef       Yahoo Messenger",
    "title": "increased creatinine",
    "content": "Hello, i am new to this forum. My faher is 68 , recently migrated from pakistan, last month he felt shortness of breath  due to low Hb ( reason unknown), ekg nowmal, diagnosed with non ST elevated MI. angioplasty done of right coronory artery and 2 stents placed,9 08/20/04 his LAD is 70% blocked and 3 rd artery is totally bloacked, His Hb at the time of admission was 6 , he has been having low Hb since last 2 years , the lowest was 7.6 for which he received vit b 12 shot. During his stay in the hospital he received 4 units of whole blood and 5 units of platelets cause his platelets are low too. WBC'S normal.  He developed hematoma and pseudo aneurysm where they performed angioplasty ( in the groin area) for which he was kept admitted b/c of chilling fever. was given vancomycin. He was discharged on 26 th aug with following medicines zocor, clopidrogrel, metoprolol, aspirin,enalapril and folic acid, 2 days after he was discharged he developed killing pain on the medial border of scapula. The lab reults of 08/09/04 showed Hb 9.2 ( 9.6 at the time of discharg on 26 th aug) , platelts 57,000 and creatinine of 2 (o.7 ) at the time of discharge. He is scheduled to undergo bone biopsy on 29 sept 2004. Please let me know why has his creatinine gone up and what  management do we need to do?. Thanks\n\n",
    "posted_time": "Post  by tazshareef » Thu Sep 09, 2004 8:08 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5235&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p5235"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Increased creatinine",
    "content": "Dear Taz,  The elevated creatinine could be secondary to: 1. The dye load that he had for the angiogram and the stents. 2. He already has atherosclerosis and one of the complications of angiography can be having of what is known as cholesterol emboli to the kidneys as the catheter is advanced in the aorta towards the heart, it can dislodge some cholesterol to the artery supplying the kidneys.  That being said, he remained in the hospital for a few days, so if any of the above mentioned things could have happened, they should have had happened then and discovered before discharge because this is the time window during which they happen.  3. Simple fact that when he went home, he was not eating or drinking enough and taking medications that lowered his blood pressure like the enalapril and the metoprolol. 4. Enalapril can sometime affect the kidneys in some people. 5. Zocor can cause muscle damage and renal failure as a consequence. 6. Since he has atherosclerosis of his coronaries, he could have atherosclerosis of the arteries supplying the kidneys as well and as he had a heart attack, he had a \"kidney hit\".  The causes of increased creatinine are so numerous, increased creartinine has to be looked at on a case by case basis. In a complicated case like your father's, my inclination is to have a nephrologist involved.  The things that need to be done at this point is a simple urinalysis, to get an ultrasound of the kidenys, have a duplex ultrasound on the renal arteries to see whether there is any stenosis, get enough hydration, stop all medications that can cause harm to the kidneys.  There are not any medications that can make kidneys better, if the kidneys fail, dialysis is the only solution.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Fri Sep 10, 2004 2:41 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5241&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p5241"
  },
  {
    "author": "aha_malki  Guest Posts: 2 Joined: Sun Oct 24, 2004 9:15 am Location: canada  Contact:   Contact aha_malki       Yahoo Messenger",
    "title": "[no title]",
    "content": "Also the bone marrow biopsy result need to be checked as certain disorders associated with anemia, low platelets can be associated with renal impairment in different ways and mechanisms\n\n",
    "posted_time": "Post  by aha_malki » Sun Oct 24, 2004 9:28 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=6045&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p6045"
  },
  {
    "author": "dobean  Guest Posts: 1 Joined: Wed Jul 09, 2003 4:01 pm Location: Chelsea, AL",
    "title": "Diabetes and creatine level",
    "content": "Please explain what is the normal creatine level and what it has to do with diabetes and kidney function?  Thanks\n\n",
    "posted_time": "Post  by dobean » Wed Jul 09, 2003 4:10 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1095&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p1095"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "Creatinine",
    "content": "Creatinine is a substance that is readily filtered by the kidneys. Since it is neither actively reabsorbed nor is actively secreted in the urine via specific cells in the kidneys, it is taken as a good measure for the overall filtration ability of the kidneys and hence an indication of overall kidney function. Actually for the creatinine levels to rise in blood (which means they are not being filtered outside the body into the urine), more than 40% of the kidneys must have stopped working. Diabetes is a disease known to affect the small vessels of the body possibly by affecting the lipid balance in the body. These vessels become hard and tight so that less blood passes through them leading to a decrease in blood supply reaching the tissues. One of the tissues known to be affected by this condition is the kidney tissue. This leads to a disease known as Klimesteil Wilson Syndrome.   Normal levels for an  adult female: upto 1.1mg/dL (SI: 97 umol/L). adult male: upto 1.2mg/dL (SI: 106).\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Thu Jul 10, 2003 1:49 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1100&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p1100"
  },
  {
    "author": "MunchkinsDad  Guest Posts: 4 Joined: Tue Aug 24, 2004 3:28 pm Location: MD",
    "title": "JUst Diagnosed What could be the problem?",
    "content": "Hi! I have been just diagnosed with diabetes. It was a physical before a back operation. Now I cannot have it till everything is normal. My triglycerides are 3000 Blood sugar 338 Creatine +1 Liver function above normal I read this post and had a question... Could I have a liver disease that is causing my creatine level and tri's to go to 3000? I exersise very regularly and these results are horrible for the activities I do. It doesnt make sense and that is why I would like to find out what is causing these horrible results. I had been on a lo carb diet for some time and then went off it 6 months ago because of weightlifting and now I am back on it. I thought I was relatively healthy, I have been weightlifting 3 times a week for 7 months am 230lbs ( there is some fat still to get rid of). No work because of my back condition due to a car accident. I also wanted to take a creatine suppliment for weightlifting but am not sure if I should because my level was +1 Can you help? Thanks!\n\n",
    "posted_time": "Post  by MunchkinsDad » Tue Aug 24, 2004 3:38 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=4829&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p4829"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Just diagnosed what could be the problem?",
    "content": "Dear MunchkinsDad,  i suppose that the samples of triglycerides were taken after at least 12-13 hours of fasting.  High triglycerides can be expected in patients with diabetes. The reason for it is inuslin deficiency. It is part of the metabolic derangement that occurs in diabetes. Once your diabetes is under better control, it should come down, if not, you have to take medications to bring the triglycerides down, otherwise, you carry the risk of having pancreatitis with such high figures.  Were you taking any steroids then when you had these samples taken? Were you having any symptoms before that or totally accidentally found when you were having the pre-op evaluation?  Regarding what you mentioned as creatine level, did you mean creatinine level? Creatinine level is a blood test that is done to check for kidney function. i am not sure what you meant by +1. It has to have a figure and the lab should give the range of normal values and the units used as well because there are 2 ways in expressing creatinine levels and the values are really different.  If this is creatinine level that you meant and if it is 1, this is normal.   Regarding whether or not to take creatine, please, consult with your doctor before taking any medications or supplements.  About creatine, your kidneys have to be absolutely normal to be able to take creatine in order to be able to clear the additional creatine that is there during the loading dose. It looks like your kidney functions are normal. If your doctor decides that it is safe for you to take creatine then you have to make sure you are really very well hydrated particularly during the loading period.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Tue Aug 24, 2004 7:17 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=4831&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p4831"
  },
  {
    "author": "MunchkinsDad  Guest Posts: 4 Joined: Tue Aug 24, 2004 3:28 pm Location: MD",
    "title": "Re: Just diagnosed what could be the problem?",
    "content": "\"Hi!  Thanks for your response!  I had no idea what so ever that I had a problem, in fact, I would brag that I was as healthy as could be.  The Dr. did the physical and said he would call about the blood work but everything looked good for the back operation.  Before I got into my car he ran me down and said he had to talk to me more because they just faxed the blood work. Diabetes... put me on a pill and wanted more blood work which is when I found about about the high tri's and such.  No steroids! I just lift weights for excersise, fat loss and muscle building. Recreational kind of thing. I read that protien drinks help and so I had been taking that and getting ready to take creatine.  Yes it was creatinine 1.2  I did fast.  Ketones 1+  ALT 112  Ast 47  Its hard to believe I have diabetes but I am really concerned about any other problems that havent been found.  I am taking an herb to reduce the tri's.\"\n\n",
    "posted_time": "Post  by MunchkinsDad » Wed Aug 25, 2004 5:36 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=4847&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p4847"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Just diagnosed what could be the problem?",
    "content": "Dear MunchkinsDad,   At your age, the type of diabetes that you have is most probably type 2 diabetes which means that you have a genetic predisposition to have diabetes espeically if one or both of your parents or if any of your siblings have diabetes.  i think you are doing the right decision by continuing to exercise and lead a healthy life style. If you are going to take any herbal preparations, i personally don't have any objections to that on a condition that you tell your doctor about that supplement and that he makes sure that it does interact with any of the other medications that you are taking. Regarding taking creatine, i don't see a problem but you will have to tell your doctor about that, too.  You will have to be following with your doctor regarding your diabetes on a regular and close basis. You will have to take medications to protect your kidneys against diabetes, you will have to have eye examinations on regular basis to make sure that diabetes has not affected your eyes and you will have to make sure that your blood pressure and cholesterol profile are under strict control.   Thank you very much for using our website http://doctorslounge.com and i hope that this information helped and if you have any concerns, don't hesitate to post them.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Mon Sep 06, 2004 12:36 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5120&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p5120"
  },
  {
    "author": "MunchkinsDad  Guest Posts: 4 Joined: Tue Aug 24, 2004 3:28 pm Location: MD",
    "title": "Re: Just diagnosed what could be the problem?",
    "content": "Thank You Dr for your reply. My Dr. sais to stop taking the protien drinks and any other muscle enhancing products. I do not agree with him about that, but he says if you are not going to make money, don't take all the pills. I found some other herbal pills to help me stay off of perscription drugs for the diabetes. It is really interesting if you were to look up the 2 pills I am trying out to master this disease. Gimnema and billberry.   My goal is still to increase muscle size and I want to know what you have found in your experience with dealing with diabetics. Would it be advantageous or a waste of time for me to use suppliments such as creatine  and whey protine in my diet(with my disease) and expect results? I have heard that with diabetes it is very hard to lose weight and/or gain muscle mass.  Thanks! MKD\n\n",
    "posted_time": "Post  by MunchkinsDad » Mon Sep 06, 2004 2:55 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5129&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p5129"
  },
  {
    "author": "jjcf  Guest Posts: 1 Joined: Thu Sep 02, 2004 6:52 pm Location: USA",
    "title": "creatine levels",
    "content": "My friend had a successful kidney transplant 5 years ago. It was from a cadaver. He has done very well with no complications. Recently his creatine levels have been high. Is there anything he can do to help lower them? Are there things he should or shouldn't eat/drink?\n\n",
    "posted_time": "Post  by jjcf » Thu Sep 02, 2004 6:59 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5048&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p5048"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Hi, The cause of your rising creatinine levels should be investigated. This is a sign that your kidneys could be failing again. Please consult your nephrologist as soon as possible.  Best regards,\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Sat Sep 04, 2004 3:56 am",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5065&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p5065"
  },
  {
    "author": "fearuvhorses  Guest Posts: 13 Joined: Tue Jun 10, 2003 7:57 pm Location: Alberta, Canada",
    "title": "New Kidney Pain with Hypertension",
    "content": "I am a 42-year old female currently being treated for Hyperlipidemia, Angina and Hypertension.  I have recently begun experiencing new pain in my lower back.  A recent emergency room visit for Angina confirmed this as kidney pain, with further investigation recommended.  I often have a low-grade fever and had a recent UT/bladder infection.  Would this new kidney pain be a result of the bladder infection?  Also, what are the kidney complications of hypertension?  How does hypertension cause kidney problems?  Thank you.\n\n",
    "posted_time": "Post  by fearuvhorses » Sun Jun 22, 2003 11:07 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1020&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p1020"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Dear fearuvhorses; To answer the first part of your question. Yes it is highly possible that this new renal pain is due to ascending infection along the urinary tract. This can be confirmed by urine analysis and urine culture to determine the possible causative organism and prescribe the best treatment to which the organism is sensitive. Second, Uncontrolled hypertension is the second common cause of chronic renal failure in the United States of America. Hypertension causes renal damage by many mechanisms that lead to damage of the renal vessels (vascular nephropathy). This damage results in a condition called nephroscelrosis in which the vessels become narrowed, leading to insufficient renal blood supply and subsequent renal failure  Hypertensive nephrosclerosis may be responsible for a progressive renal disease only in a subset of hypertensive patients. In these patients, hemodynamic factors might with other non-hemodynamic factors, such as genetic determinants, metabolic abnormalities and local immune reaction, thus inducing progressive renal insufficiency.  More informations can be found in these sites: http://www.kidney.org/general/atoz/cont ... dneys.html http://www.kidney.org/general/atoz/content/hbp.html http://www.niddk.nih.gov/health/kidney/ ... potens.htm Thank you. Good luck\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Mon Jun 23, 2003 4:33 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1024&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p1024"
  },
  {
    "author": "David",
    "title": "Kidney pain",
    "content": "I am 19 and I have been drinking heavily for two years.  I know I need to slow down, and I think I may have gotten a wake up call.  I drank about three quarters of a fifth of whiskey last Saturday night, and my gut has been hurting since then.  It is now Wednesday night.  I can't tell where it hurts, but it is not the stomach.  I think it may be my liver, because my right side has a burning sensation that is very uncomfortable and a dull pain, but also when I lie down my lower back hurts, so maybe it is my kidneys.  What should I do?\n\n",
    "posted_time": "Post  by David » Wed Apr 09, 2003 9:35 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=617&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p617"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Dear david ; you have  to visit your doctor for full clinical examination and investigations will be advised according to the results of this examination. hope to hear you recovered soon. thanks\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Sun May 18, 2003 12:54 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=752&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p752"
  },
  {
    "author": "Doc",
    "title": "Re: Renal Failure v impairment",
    "content": "Excuse me, what is the definition of renal impairment and what are the differences between renal impairment and renal failure,  Thank you.\n\n",
    "posted_time": "Post  by Doc » Fri Mar 07, 2003 9:23 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=474&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p474"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Renal Failure",
    "content": "Dear Doc,   Renal impairment is the inability of the kidney to do its job, this is manifested by many things including increase in some substances that the kidney does not get rid of because it can't. Some of these substances can be and are estimated in blood to evaluate the degree of renal failure.   Sometimes, renal impairment and renal failure are used interchangeably.   Though, renal failure is usually used for patiens who have a progressive renal disease and that the renal functions have gone down by 50 % at least.   There is another term used \"End Stage Renal Disease\" this is used when the kidneys fail completely and the patient needs dialysis to survive.   Thank you very much for using our website and please don't hesitate to post your questions at any time.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Fri Mar 07, 2003 9:24 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=475&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p475"
  },
  {
    "author": "Doc",
    "title": "Thanx",
    "content": "Thanx for the info,  Travis.\n\n",
    "posted_time": "Post  by Doc » Fri Mar 07, 2003 9:24 pm",
    "category": "Kidney disorders (Nephrology)",
    "sub_category": "Renal Failure",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=476&sid=3aaba91e2fbfa7aaa4c1373ccd37aee0#p476"
  }
]