[
  {
    "author": "lorlasch  Guest Posts: 1 Joined: Fri Jul 23, 2010 7:22 pm Gender: Female",
    "title": "Found a bump on chest and  unsure whether this is normal?",
    "content": "Hi There  I am a 21 year old female. About 2 or  3 months ago I found a lump/bump on my chest. It is on my left side , I am not sure but I think on the sternum? It is along the bone under the collarbone, if that makes any sense? It feels hard I believe and is about 3 fingerswide. I have felt the other side of my chest and do not feel anything on that side. I also checked my mom sister and fathers chest and do not feel it on theirs. It has not bothered me except for a dull pain which comes and goes and a little bit of pressure now. I have also had some arm /should and back pain all on the left side (not sure whether this is related). I made an appointment with my doctor but it is not for 2 weeks as she is out of town and I cannot seem to rest about it.Is it normal that maybe it could just be a protruding bone or something?It also seems to feel a little swollen along the bone. (Hope that makes sense) Please any Any help would be very greatly appreciated. Thank you.\n\n",
    "posted_time": "Post  by lorlasch » Fri Jul 23, 2010 8:13 pm",
    "category": "Oncology",
    "sub_category": "Sarcoma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=98377&sid=2d1d1cad23ea60666966eb491f9a53b1#p98377"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: Found a bump on chest and  unsure whether this is normal?",
    "content": "Hi, Firstly, i would recommend that you refer to these following links where some of us at DoctorsLounge had addressed similar symptoms.  http://www.doctorslounge.com/forums/vie ... r+clavicle  http://www.doctorslounge.com/forums/vie ... r+clavicle  3 fingers wide is a pretty large lump which makes sebaceous cysts and epidermoid cysts rather unlikely.  Other important differential diagnoses(among several others) that should be thought of are, - a lipoma, - a lymphangioma,and - a cold abscess.  You must show to a doctor soon, so that delays in management are avoided. Good luck!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Sat Jul 24, 2010 11:19 pm",
    "category": "Oncology",
    "sub_category": "Sarcoma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=98491&sid=2d1d1cad23ea60666966eb491f9a53b1#p98491"
  },
  {
    "author": "fwusenw  Guest Posts: 1 Joined: Fri Nov 13, 2009 12:24 pm Gender: Male",
    "title": "estrogens usage after radiotherapy",
    "content": "Hi Doctor,  My mother(75) just finished radiotherapy for 200 cGy x28 for her pelvic tumor(squamous cell carcinoma was diagnosed)--two weeks ago.(10/23/2009),and her GYN DR. prescribed estradiol valerate for a months for her to take, we thought hormone is the fuel for tumor ? Could you help us to know more about the possible benefit for this hormone in take ?  Thanks Jim\n\n",
    "posted_time": "Post  by fwusenw » Fri Nov 13, 2009 5:33 pm",
    "category": "Oncology",
    "sub_category": "Sarcoma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=86867&sid=2d1d1cad23ea60666966eb491f9a53b1#p86867"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "Re: estrogens usage after radiotherapy",
    "content": "Hello, I apologize for the delayed response but I thought I would answer all the same. I hope your mother is doing well. What kind of pelvic tumor are we talking about - was it an endomtrial (uterine) carcinoma? a squamous cell cancer of the cervix? Please elaborate.   I believe, the estradiol she was prescribed would not be related to her diagnosis of cancer?  You are right that there are convincing reports about the increased risk of breast cancer and ovarian cancer with the use of estradiol. In the case of endometrial (uterine) cancer this risk refers to patients with an intact uterus not those who have had it removed.  I hope that helps.  Best wishes,\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Sat May 22, 2010 11:45 am",
    "category": "Oncology",
    "sub_category": "Sarcoma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=93327&sid=2d1d1cad23ea60666966eb491f9a53b1#p93327"
  },
  {
    "author": "eva_3012  Guest Posts: 1 Joined: Sat Jan 10, 2009 4:11 am Gender: Female",
    "title": "Follicular sarcoma of abdominal wall treatment with caelyx?",
    "content": "Dear Doctor,  I'm trying to help a friend of mine who doesn't speak English. This is very important and very urgent, we can't find any other source of info. Her husband is 36 y/o. Had undergone 2 operations, after which has been diagnosed with follicular sarcoma of abdominal wall. Has undergone 1st course of chemio, and he needs another 5. They are from Latvia, their Doctor has found out that that treatment with New drug Doxorubicin hydrohlorid liposomal (Cae Lyx 50mg/25 ml), a way to go, although she never worked with the drug before. It seems that the drug is new and very expensive, my friend would like to find out other independant opinion with reagrds of treating the particullar sarcoma with this drug. Whether it s practised and has positive results? She can't find the drug in Latvia or neighbouring countries but doctor insists on that drug, should they go ahead with it? The treatment should start in 1weeks time.  Thank you very much Eva\n\n",
    "posted_time": "Post  by eva_3012 » Sat Jan 10, 2009 4:29 am",
    "category": "Oncology",
    "sub_category": "Sarcoma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=67699&sid=2d1d1cad23ea60666966eb491f9a53b1#p67699"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "Re: follicular sarcoma of abdominal wall treatment with caelyx?",
    "content": "Hello,  I am sorry to hear about your friend's husband. Follicular dendritic cell sarcoma is a VERY rare cancer. It has been reported in around 100 cases in the medical literature. So I am afraid there are very few doctors who have experienced treating this extremely rare disease.  This also means that there is no 'recommended' regimen that is based on strong experimental evidence. This is because of rarity of the disease makes it impossible to recruit a minimum number of patients for a clinical trial.  As regards the presumed origin of this tumor it is presumed to be a non-lymphoid cell-derived tumor that originates from B-lymphoid follicles of nodal and extranodal sites.  That said, most of the cases that were treated have been treated with chemotherapy have received either classical lymphoma chemotherapy (CHOP regimen) or classical sarcoma regimens (Ifosfamide doxorubicin regimen or gemcitabine-taxane regimen).   I am attaching a link to a medical article published in the American Journal of Hematology in 2007 reporting on 14 cases treated at the M.D. Anderson Cancer Research Center.   Follicular dendritic cell sarcoma - A report of 14 cases and a review of the literature  I am also attaching the correspondence address in that article:  Barbara Pro,  Department of Lymphoma and Myeloma, Unit 429,  The University of Texas M.D. Anderson Cancer Center,  1515 Holcombe Boulevard, Houston, TX 77030  Email address: bpro@mdanderson.org  Regarding Caelyx. It's not really a new drug it's a better preparation of a very old drug that is very widely used in chemotherapy regimens. It's the famous red drug called doxorubicin. The liposomal preparation confers less toxicity and better delivery of the drug. The only article I could find about the use of Caelyx in the treatment follicular dendritic sarcoma was reported by a group at the University of Rome Italy. It is a single case report and the treatment is given as adjuvant (meaning after surgery). I read the article and the author does not cite any references for this form of use or the use of Caelyx in this setting. Indeed he specifically states that he does not know of any previous incidents of its use.  Follicular dendritic cell sarcoma of the neck: Report of a case treated by surgical excision and COP plus (PEG)-liposomal doxorubicin  I hope this information has helped.  Best regards,\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Sat Jan 10, 2009 9:13 am",
    "category": "Oncology",
    "sub_category": "Sarcoma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=67715&sid=2d1d1cad23ea60666966eb491f9a53b1#p67715"
  },
  {
    "author": "Jooles1977  Guest Posts: 1 Joined: Tue Sep 16, 2008 4:08 pm Gender: Female",
    "title": "Soft swelling on one of my lips around my vaginal opening",
    "content": "I am 25 weeks pregnant and have been feeling some pain around my pelvic area.  When I was in the shower I felt some swelling around one of my lips where my pubic hair grows.  I have been diagnosed with SPD (Symphisis Pubic Dysfunction) however this swelling I have is not related as I did not have this swelling during my first pregnancy even though I had SPD.  When I touch it it feels like if your veins are swollen and you press on it, it feels soft and squishy like that, the way varicose veins feels like (I have one on my knee).  I have had my husband take a look and he says it isn't red or rashy looking - it is just the same colour as my skin.  When I pinch it between my fingers I don't feel any lumps but to look at it it looks lumpy.  When I am lying down and I feel it it doesn't feel sore but when I am standing and I put my finger on it and press it lightly, it feels a little sore so I'm not sure if this pain is coming from the swelling or my SPD.  I have discovered this since I have been 20 weeks pregnant.  Do you have any ideas?  I am too embarrassed to go to my Doctor as it is a new Doctors practise I have joined and haven't met the female Doctor and so would prefer not to visit but I know I have to do something about this.  There is no history of cancer in my family but it is something that has been on my mind.\n\n",
    "posted_time": "Post  by Jooles1977 » Tue Sep 16, 2008 4:43 pm",
    "category": "Oncology",
    "sub_category": "Sarcoma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=60681&sid=2d1d1cad23ea60666966eb491f9a53b1#p60681"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "Re: Soft swelling on one of my lips around my vaginal opening",
    "content": "Hello,  The swelling you have felt could be dilated veins or a form of localized edema. Varicose veins are known to develop  during pregnancy in the pelvic area (genital and anal).   The two halves of the pelvis are connected at the front by a joint called the symphysis pubis. This joint is strengthened by ligaments that allow little movement. During pregnancy relaxin hormone softens the ligaments in your pelvis and makes them moves more frequently to accomodate for the fetus.  Improper movement of the two sides causes pain and inflammation at the symphysis pubis. The condition is improved gradually after labor and with physiotherapy.  The labia majora are fatty layers that fuse anteriorly with the anterior prominence of the symphysis pubis. Thus inflammation of the symphysis pubis may cause edema of the surrounding muscle and skin including the labia majora. However, this causes a diffuse swelling in labia majora that is more prominent and is associated with severe pain.  The only way to better define this swelling is through direct clinical examination. So, I advise you to seek direct medical consultation for proper evaluation.  Please keep us updated.\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Thu Oct 09, 2008 7:28 pm",
    "category": "Oncology",
    "sub_category": "Sarcoma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=62020&sid=2d1d1cad23ea60666966eb491f9a53b1#p62020"
  },
  {
    "author": "Befallingdusk  Guest Posts: 20 Joined: Tue May 17, 2005 2:08 am Location: Raleigh, NC",
    "title": "Multiple subcutanous nodules, swellings, myalgias, plus",
    "content": "I developed an unusual illness in 2005 involving left, non-pitting supraclavicular edema and a myriad of other signs & symptoms. At that time, I posted in various areas of the Doctor's Lounge and those posts should provide a decent history of onset.  Dr. Tamer Fraud and Theresa Jones thought my symptoms possibly indicated IBC (I did too because of breast pain/swelling).  Well, it's now two and a half years later and I'm not dead, so I no longer think IBC is the correct diagnosis(?).  My health care has been extremely limited since onset (mostly with primary care physicians and absent specialist evaluation) due to my lack of health insurance, numerous personal tragedies, and numerous physical upheavals (state-to-state, city-to-city moves).  But now, in 2007, my quest for a diagnosis is renewed admist new signs and symptoms on top of the old.  Yes, the supraclavicular edema has been chronic, began on the left but now also affects the right.  My current PCP made this discovery (but I already knew).  My ESR and neutrophils have periodically been elevated but return to normal.  I note this all began with localized left breast, axilla pain, left arm and supra edema.  Throughout, multiple lymph node groups became fluctuant.  NOW I am far more educated about the human body thanks to hours and hours of research.  I have recently developed an enlarged Lft Epitrochlear lymph node & multiple Lft Cubital lymph nodes of the Lft arm.  They are firm but mobile and the Epitrochlear feels about 1.5 cm.   I also have occupital nodes, anterior and posterior cervical nodes, and shotty supraclavicular nodes.  I suspect deep inguinal nodes but can't have these verified, but there is discomfort on both sides.  There is only occassional mild to moderate tenderness/pain involved.  And to top all of this off, about 4 months ago the back of my knees began to swell (left more than right), then the soles of my feet (the right more than the left), then various locations on the palms of my hands.  To better explain: i.e, I would notice localized discomfort and swelling near the fatty part at the base of my palm.  The swelling would recede and then I would find a tiny, firm but somewhat movable nodule deep in that area.  Within a week, the nodule would rapidly increase in size and then stabilize, but hurt and cause off and on swelling.  I now have 2 of these nodules in my right palm, 2 in my right foot, 1 in my left foot.  They don't hurt unless I poke or irritate them (the stickshift of my car/my computer mouse bother my palm, shoes bother my feet.  I went to my PCP crying one day because of the pain in my foot just as the nodules and swelling began forming there).  My PCP FINALLY referred me to a rheumatologist at UNC under the belief that they will be very thorough in their investigation.  However, while waiting for this appointment, and about 3-4 weeks ago, I developed further discomfort and swelling next to my knee.  When I layed in the fetal position, and my knees knocked each other, this area would hurt and ache.  Then, in short order, yet another lump/clump of tissue formed beneath this swelling, but it is far from small (think larger than a quarter, irregularly shaped, firm/tender/bulging center, squishy/diffuse edges that seem to run deep.  This lump is beside the knee bones, on the inside area, very close to the bend of the knee and seems to hurt the most in the evenings, but then, that's when I put the most pressure on it.  My PCP examined this lump, felt it, and immediately sent me for an Xray (this very day).  I do not have the report yet, but the technician told me that it all looked normal to her but the radiologist could get a better view.  Very frustrating.  So why am I posting here?  I am very worried now that I have some type of sarcoma.  I've read that these can be difficult to diagnose, most especially synovial cell.  I've also read that synovial cell can show up as lumps and nodules in the hands, soles of feet, near joints in general.  So I ask, do my symptoms possibly fit this cancer or am I worried about it for nothing?  If my Xray shows nothing, but this lump is definitely there, what should come next?  Any thoughts at all as to what this condition could be and why it is apparently such a puzzle?  And last, what are the chances a rheumatologist could stumble upon a cancer while looking for an autoimmune disorder?  Does this happen?  I would SO VERY MUCH appreciate any response .....  And Theresa, if you're out there, \"Hello!\"  Caucasion female, 41, (was living in Colorado, now in North Carolina), osteoarthritis in hands, 2 lung nodules (benign appearing, but 1 needs watching), painful ovarian cysts (need watching), R breast lump not evaluated yet but possible recurrance of fibroadenoma removed by lumpectomy in 2003.  Had a hysterectomy in 1989 due to cervical dysplasia Stage IV/carcinoma in situ, ovaries still intact.  Family history: multiple incidents of lung cancer (2 grandparents maternal side), kidney/brain cancer (uncles on fraternal side), high blood pressure/cholesterol (me too with these other symptoms); scoliosis, disc degeneration/dessication (brother/myself).  Medications:  Vicadin 7mg (as needed only); Lamictal (depression); Inderal (newly developed right hand extension tremor and high BP), acetometaphine (generic tylenol).\n\n",
    "posted_time": "Post  by Befallingdusk » Thu Dec 06, 2007 11:12 pm",
    "category": "Oncology",
    "sub_category": "Sarcoma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=51266&sid=2d1d1cad23ea60666966eb491f9a53b1#p51266"
  },
  {
    "author": "Befallingdusk  Guest Posts: 20 Joined: Tue May 17, 2005 2:08 am Location: Raleigh, NC",
    "title": "Re: Multiple subcutanous nodules, swellings, myalgias, plus",
    "content": "Well, plain XRAY came back normal, but there clearly is a significant lump beside my knee.  It is very firm, attached and is getting larger.  EVERYONE CAN FEEL IT!!!!  In fact, you can almost see it now, creating a mound rising in the skin over the area.  So, I've researched lumps that don't show on XRAY.  Most do (cysts) from what I've learned, but if it is a soft tissue mass and the bone is not involved, it may may be invisible on XRAY.  Is this correct?  I've further read that this may be especially so with sarcomas, if the bone is not involved.  Could anyone clear this up for me?  What type of subcutaneous lumps (large/4cm+) can't be seen on plain xray?  What should the next test be?  I thank anyone who answers!\n\n",
    "posted_time": "Post  by Befallingdusk » Wed Dec 19, 2007 10:07 pm",
    "category": "Oncology",
    "sub_category": "Sarcoma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=51806&sid=2d1d1cad23ea60666966eb491f9a53b1#p51806"
  },
  {
    "author": "Befallingdusk  Guest Posts: 20 Joined: Tue May 17, 2005 2:08 am Location: Raleigh, NC",
    "title": "Re: Multiple subcutanous nodules, swellings, myalgias, plus",
    "content": "Me again!  Sorry about the long post and lack of paragraphs!  I'm now fully informed about your TOS!  Sorry that I've posted in different areas as well, but please remember that I've been dealing with an undiagnosed condition for nearly 3 years, grasping at straws, and not knowing WHERE to post or to whom to direct my questions.  Please forgive me.  Anyway, I offer a brief update:  I saw 2 Rheumatologists (he and she) today for the first time.  After the most comprehensive physical exam I've ever received, and an in-depth review of signs, symptoms and numerous nodules and lumps, Rheumatologist immediately diagnosed me with wide-spread/significant lymphadenopathy to include: epitrochlear, cubital, supraclavicular, anterior/posterior cervical, thighs, occupital, axillary and more ...  Course of action:  1) massive blood work (I filled 8 large vials!);  2) an appointment with a surgeon to biopsy lymph node(s); 3) Cat scan of neck; 4) a consultation with a \"Cancer Specialist\" no matter what (I know she meant oncologist).    After discussions and my realization that they, too, were very concerned, and in the face of her/his fears, I assured them that even the worst news would be a great RELIEF because I would finally KNOW that it hasn't been \"all in my head.\"  FINALLY someone is helping me whether or not I'm insured.  YEAH! A diagnosis is coming....    (I will post this reply one time in another area -- then no more, I promise!)\n\n",
    "posted_time": "Post  by Befallingdusk » Mon Dec 31, 2007 7:19 pm",
    "category": "Oncology",
    "sub_category": "Sarcoma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=52449&sid=2d1d1cad23ea60666966eb491f9a53b1#p52449"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "Re: Multiple subcutanous nodules, swellings, myalgias, plus",
    "content": "Hi Bdusk, I certainly hope and pray that you will finally have a diagnosis. I am glad to hear that you have found physician's that have so diligently evaluated you. An update on the long waited results would be most appreciated. Best wishes. Sincerely, Theresa Jones, RN\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Sun Jan 13, 2008 9:59 am",
    "category": "Oncology",
    "sub_category": "Sarcoma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=53138&sid=2d1d1cad23ea60666966eb491f9a53b1#p53138"
  },
  {
    "author": "Befallingdusk  Guest Posts: 20 Joined: Tue May 17, 2005 2:08 am Location: Raleigh, NC",
    "title": "Re: Multiple subcutanous nodules, swellings, myalgias, plus",
    "content": "Hey Theresa!  Happy to see you're still on the Doctor's Lounge!  So sorry I lost contact with you for a while; long, disastrous story, which fits in well with the past 3 years!  I think someone must have cursed me or performed some major Voo-Doo!!!  LOL.  Too, I admit, as a result of my nightmare, I was soooo depressed for a long time! Please forgive me and I hope you and yours are okay??  Anyway, I developed Iritis this week to go with everything else.  Talk about painful!  CT with Contrast performed yesterday and I anxiously await results!  I will let EVERYONE know shortly after I do!\n\n",
    "posted_time": "Post  by Befallingdusk » Thu Jan 17, 2008 9:21 am",
    "category": "Oncology",
    "sub_category": "Sarcoma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=53223&sid=2d1d1cad23ea60666966eb491f9a53b1#p53223"
  },
  {
    "author": "Befallingdusk  Guest Posts: 20 Joined: Tue May 17, 2005 2:08 am Location: Raleigh, NC",
    "title": "Re: Multiple subcutanous nodules, swellings, myalgias, plus",
    "content": "CT came back with nonspecific nodes throughout neck, the largest being 2 cm, on the left, and nestled next to the carotid artery at the bifurcation of the sterno-- muscle (I won't spell that right / neck muscle).  I don't know if this is high or low, as I don't know where the bifurcation is!  My current PCP has been dragging his feet (I'm used to it) about getting me in for a biopsy.  BUT, he finally scheduled a surgical consult in 3 weeks.  I have firm lumps just about everywhere now.  The one next to my knee is getting ridiculously big.  Oh well.  Maybe they'll figure it out one of these days ......\n\n",
    "posted_time": "Post  by Befallingdusk » Sat Feb 02, 2008 2:18 am",
    "category": "Oncology",
    "sub_category": "Sarcoma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=53501&sid=2d1d1cad23ea60666966eb491f9a53b1#p53501"
  },
  {
    "author": "Lg867  Guest Posts: 1 Joined: Mon Nov 12, 2007 8:37 pm",
    "title": "liposcarcoma",
    "content": "Hello, I received an antibiotic injection in my hip/buttocks area 3 months ago.  It was unusually sore for a week and afterwards, I felt a lump.  After 6 weeks, the lump was still there so I went to my family doctor....who told me he wanted it checked out... to rule out liposcarcoma.  I saw the specialist and he said that he was 99.9% sure that it's not a liposcarcoma.  So I forgot about it.  It's been about 3 1/2 months and the lump is still there, however, I think it's a bit smaller.  Is it possible to get cancer from an injection?  Should I have this lump examined further?  If it's nothing, will the lump go away?  I'm 39 and female.  Thank you![/b]\n\n",
    "posted_time": "Post  by Lg867 » Mon Nov 12, 2007 9:01 pm",
    "category": "Oncology",
    "sub_category": "Sarcoma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50253&sid=2d1d1cad23ea60666966eb491f9a53b1#p50253"
  },
  {
    "author": "Debbie Miller, RN  Nurse Posts: 4746 Joined: Mon Apr 16, 2007 2:41 pm Gender: Female Location: USA",
    "title": "[no title]",
    "content": "What you have experienced is an injection site reaction.  This has never to my knowledge been shown to lead to any type of cancer.  Chances are the lump will eventually go away, but seeing a doctor for an evaluation couldn't hurt either.  Good luck\n\n",
    "posted_time": "Post  by Debbie Miller, RN » Wed Nov 14, 2007 12:53 pm",
    "category": "Oncology",
    "sub_category": "Sarcoma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50343&sid=2d1d1cad23ea60666966eb491f9a53b1#p50343"
  },
  {
    "author": "kelli19785  Guest Posts: 2 Joined: Sat Apr 28, 2007 11:25 am",
    "title": "Sarcomatoid carcinoma",
    "content": "My dad's history: 2004 colon/rectal cancer-removed, perm colostomy, margins and lymph clear  4/06- PET and bloodwork clean, late 2006 tumor on tongue ,(sarcomatoid carcinoma/spindle cell squamous) removed tumor, margins and lymph clear  Now for the strange part: In early April 2007 (feeling fine, normal activity) my dad felt a small lump on his chin, the size of a pea, within a week it was obvoius it was growing larger daily. He went to the doctor and the took a biopsy, said it was \"cancer\" nothing more specific. We made an appt with the radiologist at the cancer center, and in the meantime several more large bumps appear all over his body (neck, back, groin, armpit, chest, etc). These were intially painless, but started to cause regional pain as they grew larger. The radiologist ordered another PET, said there were lumps all over his body, many he could not see or feel. He also said the cancer is being carried around in the blood and just deposited all over the body, but not in lymph nodes. Only one bump was found on an organ, the liver. The radiologist said he could not help my dad and set him up with the chemo doctor. He also sent a larger biopsy to the pathology lab. We are waiting for the results, but my dad is getting really bad really fast. His tongue is swollen with sores on the very back and it is too painful to eat so we are giving him Ensure. He is VERY weak and needs help getting up and walking. The tumor on his chin prevents him from closing his mouth and he is having much trouble talking, so much we can barely understand him. More bumps are appearing DAILY. I am not exaggerating at all. Every day is worse and worse. I have never heard of something so fast. 25 days ago my dad was completely fine. Has anyone ever experienced something like this? Is all of this cancer or could there be something else going on? We are getting no where with the doctors here and his family doctor (not a cancer specialist) said \"well, I'm thinking he's got months\", but we're thinking it's going to be days at this rate. We need some help. I would appreciate any thoughts or suggestions on this.\n\n",
    "posted_time": "Post  by kelli19785 » Sat Apr 28, 2007 12:05 pm",
    "category": "Oncology",
    "sub_category": "Sarcoma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=41602&sid=2d1d1cad23ea60666966eb491f9a53b1#p41602"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "I'm not a cancer specialist but I'll try to answer some of your questions.  Most definitely this sounds like cancer.  When someone has had cancer before the first thought is that it is the same type of cancer but those who have had cancer before are at an increased risk of getting a different type of cancer (compared to the general population) partially because things have already lined up to get one type of cancer and partially because the chemotherapy/radiation therapy increases risk of future cancers.  Given that it seems your father's cancer is spreading by his blood, I suspect that he had a focal development that has eroded into a blood vessel and is now being carried throughout his body.  With widespread involvement I suspect that chemotherapy is really the only treatment.  Radiation therapy would likely not be appropriate at this point.  There are several things that can be done to help besided chemotherapy including placing central IV lines or G-tubes for nutritional support and hydration.    Unfortunately it does sound like the cancer is growing rapidly.  Before therapy can be started they'll need to determine what type of cancer it is.  Talk to your oncologist about the options.  I don't want to sound too forward but also keep in mind that sometimes it may be better to not treat with chemotherapy.  This may shorten the time he has left but the time may be a bit more quality without the side effects of chemotherapy.  Each case is individualized and this decision should be made with your family and your oncologist.  Best wishes.  I'm sorry to hear of this news.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Tue May 29, 2007 8:36 pm",
    "category": "Oncology",
    "sub_category": "Sarcoma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=43070&sid=2d1d1cad23ea60666966eb491f9a53b1#p43070"
  },
  {
    "author": "kelli19785  Guest Posts: 2 Joined: Sat Apr 28, 2007 11:25 am",
    "title": "[no title]",
    "content": "Dr. Lowe, thank you so much for your response. We ended up taking my dad to the hospital and he tried chemo (which did absolutely nothing). He passed away 5/18 at home with his family and hospice, he had just turned 57.    The cancer ended up being the same sarcomatoid squamous spindle cell carcinoma. It was very aggressive and took over his whole body (soft tissues, jaw, throat, spots in lungs, liver, bone, etc) in 4 months.   The whole thing happened so fast that we never got to get any 2nd opinions and hearing your thoughts have helped me realize that we did the best we could and even if I could have gotten him somewhere else, the prognosis would have been very similar. I truly appreciate your reply! Thanks, Kelli\n\n",
    "posted_time": "Post  by kelli19785 » Wed May 30, 2007 6:01 pm",
    "category": "Oncology",
    "sub_category": "Sarcoma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=43138&sid=2d1d1cad23ea60666966eb491f9a53b1#p43138"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "I am quite sorry to hear of your loss.  Cancer is a devastating disease.  I look forward to the day when we find a cure.  Unfortunately that day can't come soon enough.  Regards.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Fri Jun 01, 2007 1:07 am",
    "category": "Oncology",
    "sub_category": "Sarcoma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=43209&sid=2d1d1cad23ea60666966eb491f9a53b1#p43209"
  },
  {
    "author": "taylormom  Guest Posts: 1 Joined: Sat Mar 31, 2007 7:19 pm",
    "title": "should i have a biopsy?",
    "content": "I'm 41, female, good health, 2 c-sections, surgery to repair ruptured ovarian cyst 14 years ago,  my dad has prostate cancer. No current medications  I recently went to a general surgeon to have a lump looked at on my lower back. The lump is hard and feels about the size of an earaser head on the end of a pencil. I was refered to him by my gp, who thought the lump was a lipoma. The surgeon didn't agree with that and ordered an MRI.  He said the results were clear and there were no masses anywhere, but he couldn't even see the lump in question. It is definitely there and is, for the most part, painless and non-moveable and seems to be very close to, or attached to the muscle.  He wants to wait a year or so to see if it changes or grows. I'm not comfortable with that now that I have researched sarcoma. I asked him if he could do a biopsy and he said he was uncomfortable doing that without having seen in on the MRI, but  he wants me to come back in a month so he can look at it again. SHOULD I INSIST ON A BIOPSY??  or ask to be refered to an oncologist since he can't confirm sarcoma, nor rule it out?? I certainly don't want to wait to see if it gets bigger!!! Suggestions please!\n\n",
    "posted_time": "Post  by taylormom » Sat Mar 31, 2007 7:24 pm",
    "category": "Oncology",
    "sub_category": "Sarcoma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=40254&sid=2d1d1cad23ea60666966eb491f9a53b1#p40254"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "It's interesting that the MRI did not show the mass.  Without actually seeing the MRI I cannot definitively comment; however, if the mass is not seen this would indicate that the mass is composed of a material that is similar to the tissue around it.  If you are concerned you most definitely have the right to a second opinion.  Most doctors are not offended by this request.  I am always happy to have a second look at a challenging case to be sure I'm not missing anything.  Without examining you or seeing your results I cannot give you an opinion about waiting vs. biopsy or other course of action.  I hope this helps a little.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Wed Apr 11, 2007 8:34 pm",
    "category": "Oncology",
    "sub_category": "Sarcoma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=40615&sid=2d1d1cad23ea60666966eb491f9a53b1#p40615"
  },
  {
    "author": "dhansukh  Guest Posts: 1 Joined: Thu Dec 01, 2005 4:32 am Location: INDIA",
    "title": "Help for saving uterus in \"adenosarcoma of endometrium&",
    "content": "R/Sir, A solid mass was found in the uterus of my unmarried younger sister (26yrs) which was removed by the gynecologist. The pathologist detected the mass as \"Malignant Mixed Mullerian tumor of cervix \" and so we approached cancer Hospital for further treatment where they the slides & blocks and diagnosed it as \"adenosarcoma of the endometrium\".  The various tests & their reports are as follows: The MRI report: The liver is normal in size & shape and shows no focal area of altered parenchymal signal intensity. The uterine body and fundus appear normal. The bladder & rectum are also uninvolved. Both ovaries appear normal except for a follicular cyst in the left ovary. No abdominal or pelvic lymphadenopathy is seen. There is no evidence of hepatic metastases. The findings are suggestive of a malignant soft tissue neoplasm  involving the cervix, with early right perametrial infiltration  Tumor Marker Report: investigation of CA-125 gave value of 31.64 units/ml.  Chest Radiograph Report: Visualised lung fields and both CP angles are clear The cardiac and mediastinal silhouettes are within normal limits. No abnormality is noted.  Therafter the doctors examined the uterus under anesthesia and reported that the uterus is clean and no tumor is visualized. Dilatation and Curettage ( D & C )  procedure was done by him and the collected tissue was sent to the pathologist whose D & C Material Report is as follow:-  D & C Material Report: Proliferative endometrium along with a strip of ectocervical tissue. The stroma shows few discrete cellular foci with atypia, apoptosis and mitoses surmounting to stromal sarcomatous elements in this case of adenosarcoma.  After going through the above examinations the doctors have advised to remove the entire uterus along with ovaries. Is there any other treatment by which uterus can be saved? I have read articles about anthroposophic medicines in cancer treatment on internet. Will it be able to cure this type of Cancer? Please advice urgently.\n\n",
    "posted_time": "Post  by dhansukh » Thu Dec 01, 2005 4:40 am",
    "category": "Oncology",
    "sub_category": "Sarcoma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=25986&sid=2d1d1cad23ea60666966eb491f9a53b1#p25986"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Dear dhansukh,  Uterine sarcomas are not common tumors representing about 4% of all cancers of the uterine body. Carcinosarcomas are the commonest histological subtype.  Surgery is the mainstay of treatment for uterine sarcomas. For carcinosarcoma, the surgical resection consists of total abdominal hysterectomy and bilateral salpingooophorectomy in addition to peritoneal wash for cytology.  Unfortunately, this is the standard of care for this type of patients.  Hope you find this information useful. Best regards,\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Thu Aug 03, 2006 5:37 pm",
    "category": "Oncology",
    "sub_category": "Sarcoma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=33646&sid=2d1d1cad23ea60666966eb491f9a53b1#p33646"
  },
  {
    "author": "stevencar  Guest Posts: 1 Joined: Thu Sep 01, 2005 3:15 am Location: TP",
    "title": "Leiomyosarcoma=GIST? Need your help in my CT",
    "content": "Leiomyosarcoma=GIST? Can Try Gleevec?  I have to thank God I can have life until Now. I am 26 years old and a Christian. I know the Leiomyosarcoma is very difficult to treat. But I also want to seek some professional advises on my CT Report. Thanks !!!!!!!!!!    Report on 30/8/2005  Leiomyosarcoma of small bowel mesentery with liver metastasis. Had operation and RFA done. Now on chemotherapy. PET (6/2005)- no uptake anywhere. CT (5/2005)- 2 tiny lesions in caudate lobe and posterior segment. For FU of lesions.  Comparison is made with previous CT study dated 21/5/2005. The hypodense post-RFA area in right lobe shows mild decrease in size now measuring 9x11x12.5cm(TSxAPxCC). Morphologically, it remains similar with well-defined margins and static hypodense foci at its inferior aspect. No abnormal contrast enhancement in noted.  The two tiny hypodense lesions in the caudate lobe and posterior segment (Se3, lm63) remain similar in size when compared to previous scan in 5/2005.  Serial increment in size is noted in the hypodensities at segment V/VI. Postero-medial to the previous ablation site at its inferior aspect (Se3, lm63, 70). Another mildly enlarged hypodensity is also seen at segment VII (Se3, lm53). They all measure around 1cm in size with faint heterogeneous contrast enhancement. Few more tiny hypodensities are present in the posterior segment (Se 3, lm 63, 64, 73) with no significant changes when compared to scan on 21/5/2005. Nonetheless, all these hypodensities were not apparent in the CT study dated 21/5/2005.? Metastatic lesions.  The tiny wedge-shaped post-RFA site at the anterior subcapsular region of the left hepatic lobe remains static. Previously seen liver cysts also show no significant interval changes. Portal vein and hepatic veins are patent. Biliary tree is not dilated. Gallbladder is absent.  Spleen is enlarged measuring 12 cm in length longitudinally. No ascites is present. Pancreas, adrenal glands and kidneys are unremarkable except for the bilateral extra-renal pelvis noted. No significant intra-abdominal lymphadenopathy is detected.  Mild fibrotic changes as well as pleural thickening is noted at bilateral lung base. No focal pulmonary lesion is detected otherwise in the region included. No mediastinal or hilar lymphadenopathy is seen. No destructive bony lesion is identified in the scanned region.   Impression:  Known leiomyosarcoma with liver metastasis status post RFA and Chemotheraphy.  1.\tThe previous ablation regions remain static. 2.\tThe two metastatic lesions in caudate lobe & posterior segment show no significant interval changes. 3.\tHeterogeneously enhancing hypodensities are seen at segments V-VII with serial increment in size noted. Metastatic lesions has to be considered in the clinical context. Suggest FU scan for interval changes. 4.\tLiver Cysts. 5.\tSpleenomegaly.\n\n",
    "posted_time": "Post  by stevencar » Thu Sep 01, 2005 3:39 am",
    "category": "Oncology",
    "sub_category": "Sarcoma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=19799&sid=2d1d1cad23ea60666966eb491f9a53b1#p19799"
  },
  {
    "author": "Zahara  Guest Posts: 1 Joined: Thu Oct 06, 2005 3:55 pm Location: Germany",
    "title": "source of information for sarcoma",
    "content": "Sarcoma are rare, a good website, also with discussion board: http://sarcomaalliance.org/home.html\n\n",
    "posted_time": "Post  by Zahara » Thu Oct 06, 2005 4:55 pm",
    "category": "Oncology",
    "sub_category": "Sarcoma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=22679&sid=2d1d1cad23ea60666966eb491f9a53b1#p22679"
  },
  {
    "author": "zcraghead  Guest Posts: 1 Joined: Sat Feb 26, 2005 2:29 am Location: tremonton ut",
    "title": "lump in my arm",
    "content": "i have a small lump in my bicep that is painfull. with no color around it like it is inside but it hurts to the touch could this be a zit inside or something more serious\n\n",
    "posted_time": "Post  by zcraghead » Sat Feb 26, 2005 2:35 am",
    "category": "Oncology",
    "sub_category": "Sarcoma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=9966&sid=2d1d1cad23ea60666966eb491f9a53b1#p9966"
  },
  {
    "author": "Dr. Jeffrey Gordon  Medical Doctor Posts: 127 Joined: Sun Jan 05, 2003 5:22 pm",
    "title": "Biceps lesion",
    "content": "Zcraghead,  Thanks for posting a question here in The Lounge.  The vast majority of bumps and lesions found about the body are fortunately not cancer.  There can be various infections, most of which are bacterial, that can cause a lesion.  There can also be collections of fat cells, called lipomas, that occur about the body.  These tend to be somewhat firm to the touch.  Lipomas are benign.  In your case, I would talk with your family doctor.  If your doctor sees anything of concern, then the lesion may be removed for testing.  Sometimes if an infection is suspected, then a trial of antibiotic therapy is done.  Other times, a lesion is watched.\n\n",
    "posted_time": "Post  by Dr. Jeffrey Gordon » Tue Mar 01, 2005 8:38 am",
    "category": "Oncology",
    "sub_category": "Sarcoma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=10124&sid=2d1d1cad23ea60666966eb491f9a53b1#p10124"
  },
  {
    "author": "sparow64  Guest Posts: 1 Joined: Sat Sep 25, 2004 10:36 am Location: Knoxville, TN",
    "title": "Mysterious soft tissue lump",
    "content": "Anyone...Everyone...Please help!    On July 30, (I remember the date because of a funeral I attended), I noticed that my entire left leg was filling with fluid, and there was a large swollen \"mass\" on my lower left leg.  The mass covers an area if about 3 or 4 inches.  My left leg measured about 2 inches larger around than my right.  In the swollen area, it measured about 4 inches larger.  A friend of mine, who is a nurse, sent me to the after hours clinic to be checked for a blood clot.  I had a vascualr ultrasound, and there was no blood clot.  THere was a tiny poplateal cyst behind my knee.  I was given a prescription water pilll, and the fluid was gone the next day.  The soft tissue mass, however, was still there.  It was painless.  My regular Dr. was completely stumped.  Said he had never seen anything like it.  He brought his partner in to see it, who was also stumped.  They sent me to a vein clinic.  The surgeon at the vein clinic did a pelvic ultrasound, to see if an artery had been tied off during a recent tubal ligation.  That was negative.  He told me the mass is not related to a vein.  In the meantime, this swollen mass gets larger late at night, on days when I have been standing or walking alot.  My doctor prescribed Bextra, which had no effect.  He sent me to an Orthopedic doctor, who told me that it was basically in my mind.   Because it gest larger late at night, no doctor has seen it at its worst.  My doctor did an xray, and found nothing.   He does see the mass, and is stumped.  I went to a new doctor, who said that I have at least 2 inches more of soft tissue in that area of my left leg than on my right.  She did not understand that when the area swells it is not fluid.  Everything she has had me do revolves around it being fluid.   During these 2 months, the mass has grown to cover a larger area of my leg.  Sometimes it hurts, and I have started having pain from my ankle to my thigh.  When the mass swells, that portion of my leg can measure 3-4 inches larger than the right.  It is always swollen 2 inches larger than the other leg.  I am overweight, so it is hard to make the doctors understand that I don't think that is the problem.  None of the other areas of my body with fat stay swollen, and swell more at night!   In my attempts to find answers on the internet, I came upon information about Soft Tissue Sarcoma.  Should I insist on an MRI or biopsy to rule this out?  If not, has anyone ever encountered something similar?  (I am a 40 yr old female).  Any insight would be greatly appreciated.\n\n",
    "posted_time": "Post  by sparow64 » Sun Sep 26, 2004 5:45 am",
    "category": "Oncology",
    "sub_category": "Sarcoma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5609&sid=2d1d1cad23ea60666966eb491f9a53b1#p5609"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi sparrow, That is quite a significant difference in size. Since your condition has persisted and hasn't resolved on it's own you should insist on further investigation. If it turns out to be nothing to worry about, then great. At least you will have peace of mind    Sincerely, Rntdj\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Mon Oct 04, 2004 5:02 am",
    "category": "Oncology",
    "sub_category": "Sarcoma",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5790&sid=2d1d1cad23ea60666966eb491f9a53b1#p5790"
  }
]