[
  {
    "author": "jameswhitt  Guest Posts: 1 Joined: Wed Aug 18, 2010 6:36 am Gender: Male",
    "title": "Possible melanoma",
    "content": "Hello, I am worried that I might have melanoma on my inner thigh. I had this mark for a while, but I am not sure if it is staying the same size or possibly growing. I am 21 years old white male.    Thanks for any and all help.\n\n",
    "posted_time": "Post  by jameswhitt » Wed Aug 18, 2010 6:41 am",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=101198&sid=886fa469462e198fde10d6986769cc61#p101198"
  },
  {
    "author": "Dr.M.jagesh kamath  Medical Doctor Posts: 1303 Joined: Mon Aug 03, 2009 7:24 am Gender: Male",
    "title": "Re: Possible melanoma",
    "content": "Hello,Asymmetry,Borders irregular,uneven Color,Diameter over 6mm are the main features to look out for in suspicious moles.Color speading to the surrounding skin,Onset of itching,Bleeding,scaly appearence are the other features to be looked out for. Genetic predilection,sun exposure,presence of atypical nevi,fair skin with excess uv exposure,too many melanocytic nevi are all risk factors. Though I could not see the photo,sice it did not down load I would advise you to consult a physician if abnormal features above are present, for a screening. Dermascopy is a simple non invasive test for suspicious moles. Best wishes.\n\n",
    "posted_time": "Post  by Dr.M.jagesh kamath » Sun Aug 29, 2010 3:44 am",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=101984&sid=886fa469462e198fde10d6986769cc61#p101984"
  },
  {
    "author": "Sovari  Guest Posts: 1 Joined: Tue Aug 03, 2010 11:22 am Gender: Male",
    "title": "Non Melanomic Skin Cancer on Upper Leg?",
    "content": "I have this small irregular pea sized faint red patch on leg. Im a 14 year old white male. It is not elevated, kinda rough When I scratched it, it turned redder and gotten more swollen. Im afraid it could be cancer. Here is a pic (though kinda blurry:)  I do have brown fungal spots on my back though so im thinking this is fungal?  Again, I have my doubts that it is cancer but it is hard to get rid of and it could be cystic acne.\n\n",
    "posted_time": "Post  by Sovari » Tue Aug 03, 2010 11:25 am",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=99535&sid=886fa469462e198fde10d6986769cc61#p99535"
  },
  {
    "author": "Dr.M.jagesh kamath  Medical Doctor Posts: 1303 Joined: Mon Aug 03, 2009 7:24 am Gender: Male",
    "title": "Re: Non Melanomic Skin Cancer on Upper Leg?",
    "content": "Hello,The photograph enclosed show the features of nummular dermatitis.This is basically a coin shaped eczema most common on the lower legs.These are itchy too.Small papule develop on a reddish base.Cause is not known and peaks during winter due to dryness of skin. The treatment would consist of hydrating the skin with moisturizers and external steroids like hydrocortisone. Do consult your doctor. Best wishes.\n\n",
    "posted_time": "Post  by Dr.M.jagesh kamath » Thu Aug 05, 2010 10:08 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=99836&sid=886fa469462e198fde10d6986769cc61#p99836"
  },
  {
    "author": "tomoyoafter  Guest Posts: 1 Joined: Sun Dec 06, 2009 11:43 am Gender: Male",
    "title": "chemical in traditional soap harmful for bathing?",
    "content": "4 years ago i've switched over from liquid soap to traditional bar of soap, for the first two years of this 4 year period i've used it in moderate amounts in one bath per day, when i had noticed some of my skin in my palm is coming off and so i stopped for 7 months, but unable to switch back to the more mild liquid soap, i resumed using traditional soap and it's been another one year and a half since then, and this time i use them in excessive amounts to the extent that i consume one bar of soap in just a week, and i also use it on my hair as shampoo. people including myself have noticed my skin all over my body becoming much whiter than it should be, and i admit that the residue the soap leaves behind after bathing were very apparent and visible, and all over my body the outer skin peels off very easily in spots where i applied most soap, espically my hands. since a few days ago when i was told by a close friend who warned me that i could contract skin cancer if i continue like this as these traditional soaps aren't safe if use in such large amounts.  i sincerely ask of your help, please if you would please be so kind as to tell me if there has been cases before where soap have caused skin cancer, i would be eternally grateful to you. thank you so much!   rupophobia.\n\n",
    "posted_time": "Post  by tomoyoafter » Sun Dec 06, 2009 12:08 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=88269&sid=886fa469462e198fde10d6986769cc61#p88269"
  },
  {
    "author": "Dr.M.jagesh kamath  Medical Doctor Posts: 1303 Joined: Mon Aug 03, 2009 7:24 am Gender: Male",
    "title": "Re: chemical in traditional soap harmful for bathing?",
    "content": "Hello,Soaps are basically clensing agents which contain sodium coccoate.The soaps may vary in PH and some would contain antibacterial or fragrance.Moisturizing soaps have an adjusted pH.Time of contact with skin is minimal.It is not recommended to use antibacterial soaps for long term for it can chnge the bacterial flora.To the question of yours as to whether it causes cancer is that there are no reports to suggest such a possiblity being only fatty acids as content.Best wishes.\n\n",
    "posted_time": "Post  by Dr.M.jagesh kamath » Wed Dec 16, 2009 8:49 am",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=89177&sid=886fa469462e198fde10d6986769cc61#p89177"
  },
  {
    "author": "kswife  Guest Posts: 2 Joined: Sat Oct 27, 2007 11:58 am",
    "title": "Four Years or More with Basal Cell Carcinoma Lesion",
    "content": "My 42-year-old husband's new doctor informed him yesterday that biopsy results have indicated that a lesion on his cheek is basal cell carcinoma. The doctor is going to refer him to a dermatologist for removal of the lesion.   I am writing because my husband has had this lesion for at least four years, and though he's been told that basal cell carcinoma very rarely metastasizes, I'm worried that the cancer may have spread, given the length of time my husband has lived with it.   Is additional testing warranted in this case, or will the excision suffice?\n\n",
    "posted_time": "Post  by kswife » Sat Oct 27, 2007 12:04 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=49584&sid=886fa469462e198fde10d6986769cc61#p49584"
  },
  {
    "author": "kswife  Guest Posts: 2 Joined: Sat Oct 27, 2007 11:58 am",
    "title": "More Like Six Years",
    "content": "I've gone back and looked through our photo albums at photos of my husband, and realize now that he has had that lesion for at least five and a half, maybe six years or more.\n\n",
    "posted_time": "Post  by kswife » Tue Oct 30, 2007 7:04 am",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=49745&sid=886fa469462e198fde10d6986769cc61#p49745"
  },
  {
    "author": "teacup  Guest Posts: 1 Joined: Wed Jan 28, 2009 1:05 pm Gender: Female",
    "title": "Re: Four Years or More with Basal Cell Carcinoma Lesion",
    "content": "Reading your post I had to reply. I am not a doctor, but I do have a mother that has something on her cheek as well, and she had melanoma in the past. is basel cell carcinoma a form of melanoma? and could you tell me some of the characteristics of what your husband has? My mom is crazy and thinks Jesus put this on her face, so I can't get her medical help. I am searching to find out what she has, and i suspect cancer. She has had it for some time and I always wondered if it was cancer why hasnt she died yet?\n\n",
    "posted_time": "Post  by teacup » Wed Jan 28, 2009 1:21 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=70086&sid=886fa469462e198fde10d6986769cc61#p70086"
  },
  {
    "author": "miss mandy  Guest Posts: 1 Joined: Wed Mar 11, 2009 10:32 am Gender: Female",
    "title": "Re: Four Years or More with Basal Cell Carcinoma Lesion",
    "content": "I am in the same situation.  I had a red mark where the footprints of my glasses were. It seemed as though it was there forever.  It eventually became a bump but I thought it was from the glasses and did not seek medical advice until a year later.  That was 4 years ago. The dermatologist's nurse tech removed the lump, sent it for biopsy and then did a procedure in the office using scraping and heat.  I asked the dermatologist if I can go for Mohs and he said I didn't need it.  Six months ago I noticed a small red area on the suture line. It was positive for basal cell and I had Mohs surgery-which was a wonderful experience.  Every doctor seems to negate the possibility of metastasis but I am very, very worried.  I recently went to the doctor for a cough when I speak which has had a 11 week duration, so far.    He took blood tests and my liver enzymes are slightly elevated and amylase is 160 and I was told norm is 130.  I had an abdominal ultrascan which showed nothing except a cyst on the  liver.  My doctor wants to wait 10 days before he retests my blood and takes further action.  However, every medical pro thinks basal cell does not metastasize which is contrary to what  I have been reading.  I am very nervous\n\n",
    "posted_time": "Post  by miss mandy » Wed Mar 11, 2009 10:45 am",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=71321&sid=886fa469462e198fde10d6986769cc61#p71321"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: Four Years or More with Basal Cell Carcinoma Lesion",
    "content": "Hi kswife, Basal cell carcinomas can be very slow growing tumors.There are sub-types which also differ in their aggressiveness. Usually, these are slow growing, 'locally' invasive malignant tumors but rarely metastasize.   The incidence of distant metastatic basal cell carcinoma (BCC) is very rare— 0.003% to 0.5% of the population.  Large, neglected, ulcerated, locally invasive and uncontrolled tumors are most prone to metastasize . Metastases usually occur after multiple local recurrences.  Therefore,it is mandatory to treat BCC promptly and adequately and to have regular followups to avoid the risk of metastasis to regional lymph nodes or distant sites(The lymph nodes, lung, bone, skin, spleen, and brain are sites of metastasis).  If excision (preferably Mohs') is successful, then perhaps, one only needs to be follow up regularly and carefully. Best wishes!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Fri Nov 06, 2009 9:09 am",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=86080&sid=886fa469462e198fde10d6986769cc61#p86080"
  },
  {
    "author": "fursale  Guest Posts: 1 Joined: Sat Mar 28, 2009 7:26 pm Gender: Male",
    "title": "melanoma of the big toenail",
    "content": "I had a biopsy of my left toe on 3-25-09 after showing it to my doctor and telling him it started as a small black speck at the base of the toenail. It is now 6mm X 4mm. What are the chances that is is malignant. If so at what stage would the cancer be at relative to it's size. If confirmed what is the most likely prognosis. I would really like to know something while waiting for the results. Thank you. Jim\n\n",
    "posted_time": "Post  by fursale » Sat Mar 28, 2009 7:40 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=72252&sid=886fa469462e198fde10d6986769cc61#p72252"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: melanoma of the big toenail",
    "content": "Hi, Any pigmented lesion under the nail or proximal nail fold must be viewed with suspicion. The chances of it being a subungual melanoma (a type of Acral lentiginous melanoma)  is higher if... - one is one belongs to certain ethnic groups(asian or black),  - over 60 years of age.or - if the lesion is under the big toe nail or the thumb nail. (Majority of subungual melanomas (90%) occur on the thumb or   the great toe). Good luck!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Thu Nov 05, 2009 2:18 am",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=85961&sid=886fa469462e198fde10d6986769cc61#p85961"
  },
  {
    "author": "kousman  Guest Posts: 1 Joined: Wed Oct 28, 2009 10:42 pm Gender: Male",
    "title": "extremely worried and live in a reclusive area",
    "content": "Hello doctor, I am 30 year old man who recently noticed a hard painful inside the skin lump jsut under neat my scrotum. Since my notice i cant sleep and stop touching. When i roll my hand over it, it is painful and when i tried to squeeze it nothing comes off. I don't think its a pimple since i cant see a head and the lump is under my skin. Now I was wondering if it was skin cancer or something else even tough i read somewhere else that cancer lump are not painful. Is it true?   My second question and equally important is in regards to the nature of cancer lump. Now if I decided to wait before i could see a doctor in the city and the lump goes away, will it still be consider a cancer treat or not? In other words, doctor, does cancer lump goes away after ew days or does it stay longer and gets bigger? will a lunmp that gets smaller and goes away consider a cancer threat or not? to be more clear is that i was wondering if this lump goes away on his won after few days do i have to still be worried about it? the reason im asking you this is to be able to have a certain idea of my situation because if cancer lumps does not go away that easily and gets bigger then I will have better state of mind till my next doctor visit.\n\n",
    "posted_time": "Post  by kousman » Wed Oct 28, 2009 10:49 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=85141&sid=886fa469462e198fde10d6986769cc61#p85141"
  },
  {
    "author": "Dr.M.jagesh kamath  Medical Doctor Posts: 1303 Joined: Mon Aug 03, 2009 7:24 am Gender: Male",
    "title": "Re: extremely worried and live in a reclusive area",
    "content": "Hello,Cancer lumps do not go away and come back.Their nature is to grow and rarest of the rare disappear.What you have possibly is a sebaceous cyst or a folliculitis if it is just below the scrotal skin.If it is deeper may be an inflammation of epidiydymis just above the testis.All these can be tackle easily with antibiotic.Minor injuries due to cycling etc can leave behind blood collection in small areas known by name hematoma and it would reduce slowly.So do visit your doctor and do not worry.Best wishes.\n\n",
    "posted_time": "Post  by Dr.M.jagesh kamath » Tue Nov 03, 2009 7:51 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=85808&sid=886fa469462e198fde10d6986769cc61#p85808"
  },
  {
    "author": "rustygates  Guest Posts: 1 Joined: Fri Oct 30, 2009 8:27 am Gender: Female",
    "title": "Side Effects with Efudex",
    "content": "Two weeks ago, I was prescribed generic of Efudex cream for pre-cancerous skin conditions on both arms.  On the 3rd day of use, I developed severe diarrhea, suffering 4 to 5 episodes per day.  No other symptoms, no vomiting or fever, feel fine.  Stopped using the cream after 6 days after realizing this might be a side effect.  Dermatology PA insists this can't possibly be a reaction, must be another cause for the diarrhea, which is mostly water at this point.  Am keeping hydrated.  Should I take immodium, any side effects or interaction with current medications?  Since I've never had a history of diarrhea, I do believe this is a serious side effect of this drug.  Opinion please?\n\n",
    "posted_time": "Post  by rustygates » Fri Oct 30, 2009 8:57 am",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=85284&sid=886fa469462e198fde10d6986769cc61#p85284"
  },
  {
    "author": "Dr.M.jagesh kamath  Medical Doctor Posts: 1303 Joined: Mon Aug 03, 2009 7:24 am Gender: Male",
    "title": "Re: Side Effects with Efudex",
    "content": "Hello,While the diarrhoea may be unrelated to efudex,there are reported cases of people with an enzyme deficiency DPD  react by accumulating the drug even on external application leading to toxicity.These include diarrhoea  a manifestation as grade1 toxicity.You must get your blood examined to rule this out just to be sure.Do consult your doctor who would order for this rare but realistic possiblity.Best wishes.\n\n",
    "posted_time": "Post  by Dr.M.jagesh kamath » Mon Nov 02, 2009 9:59 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=85716&sid=886fa469462e198fde10d6986769cc61#p85716"
  },
  {
    "author": "dedleemiho  Guest Posts: 1 Joined: Sat Sep 19, 2009 1:52 pm Gender: Female",
    "title": "moles turning black and bleeding",
    "content": "Over the past 7 months I've had 6 different moles suddenly turn from their normal brown color to black. Each one would go through a stage of turning black and crusty, then beginning to hurt and bleed. Their usually rounded edges would start to become jagged and seem to lose color into my surrounding skin. Eventually the black would scale off and some of them look normal again but some look multi color brown now. The mole locations vary from one on my face, one on my upper back one on my upper arm, one on my lower arm, and 2 on my hip. Each one going all weird on me at a different times except the 2 on my hip that started changing together most recently. I've had these mole forever and some are tiny and some are pencil eraser size. Up until now they've always been perfectly round and one solid color brown. I don't know what to think and I don't have health insurance so I'm weary of going to the doctor if I'm worrying for nothing. Any thoughts or suggestions would be appreciated. Thank you.\n\n",
    "posted_time": "Post  by dedleemiho » Sat Sep 19, 2009 2:07 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=82865&sid=886fa469462e198fde10d6986769cc61#p82865"
  },
  {
    "author": "Dr.M.jagesh kamath  Medical Doctor Posts: 1303 Joined: Mon Aug 03, 2009 7:24 am Gender: Male",
    "title": "Re: moles turning black and bleeding",
    "content": "Hello,There is a method known as ABCD for moles to be identified to rule out serious problems like melanomas,A-Assymetry ie a rounded mole changing shape.B-Border irregularity.C-Color variation.D-Diameter over 6mm or more.In your case I do not know whether they are moles or other pigmented areas like lentigenes or seborrheic keratoses.The best option would be to get a dermoscopy done by a dermatologist,a very simple procedure.You must go to a physician,ideally a dermatologist who can help you to reassure you that there is no problem.Best wishes.\n\n",
    "posted_time": "Post  by Dr.M.jagesh kamath » Tue Oct 27, 2009 5:55 am",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=84932&sid=886fa469462e198fde10d6986769cc61#p84932"
  },
  {
    "author": "dreww0101  Guest Posts: 1 Joined: Thu Apr 02, 2009 8:08 am Gender: Male",
    "title": "how to tell whether i have skin cancer or just a spot",
    "content": "I am 20 and have developed a red spot which is smaller than a marble and sticks out a tiny bit ( probably about a milimeter) it has a tiny scab and if i pick it it showed a pin prick of blood. It is slightly itchy but only if i think about it, its not very very itchy. if i squeeze it no puss comes out of it.  It is approaching 2 weeks since i have had it now and it has not changed at all. Should I be worried? All the sites I have read about skin cancer say that if a lump has been there for 4 weeks without healing.  So i guess im asking do my symtoms sound like skin cancer? If not what should I be looking out for?   I am very paraniod as i went on the sunbeds about 3 weeks ago... And i regret it and know it was a mistake. At the time I just thought 5 minutes in a sunbed can't be much worse than a day in the sun in Greece... How true is this?     Many Thanks for any help,\n\n",
    "posted_time": "Post  by dreww0101 » Thu Apr 02, 2009 8:38 am",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=72817&sid=886fa469462e198fde10d6986769cc61#p72817"
  },
  {
    "author": "Dr.M.jagesh kamath  Medical Doctor Posts: 1303 Joined: Mon Aug 03, 2009 7:24 am Gender: Male",
    "title": "Re: how to tell whether i have skin cancer or just a spot",
    "content": "Hello,What you mention is mostly a small granuloma an would have disappeared by now.If it persists do show your doctor for further evaluation.\n\n",
    "posted_time": "Post  by Dr.M.jagesh kamath » Mon Oct 05, 2009 11:02 am",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=83457&sid=886fa469462e198fde10d6986769cc61#p83457"
  },
  {
    "author": "kevykev  Guest Posts: 1 Joined: Mon Sep 07, 2009 12:11 pm Gender: Male",
    "title": "Lesion on my scalp",
    "content": "Hi there.  I'm a 36 year old male, with an olive complexion. I'm bald and use a set of clippers to shave down the areas on my head where hair still grows.   Last week, I noticed a pink, inflamed cluster of bumps. I thought it was razor burn, but the cluster got a little larger over the next couple days and kind of formed into a flattish, raised lesion. Now, the lesion seems to be getting smaller. but I've also noticed it getting slightly scabby and red on spots. The area is somewhat sore and hard to the touch.   I recalled that I had used WD-40 on the clippers before using them (a lubricant I hadn't used on them before) on the day that I noticed the spots. I also went to a public water park that day.     So, naturally I'm wondering if this is some form of cancer or pre-cancerous growth or if it's just a kind of dermatitis, eczema or psoriasis. I've had little patches of eczema on other parts of my body in the past and have had a few rounds of blepharitis.   Here's an image of the lesion taken today (the small spot in the back/middle of my head has been there forever, I'm referring to the pink spot nearer the front of my head): http://farm4.static.flickr.com/3492/389 ... 3ab21a.jpg  Thanks so much.\n\n",
    "posted_time": "Post  by kevykev » Mon Sep 07, 2009 12:14 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=81991&sid=886fa469462e198fde10d6986769cc61#p81991"
  },
  {
    "author": "Dr.M.jagesh kamath  Medical Doctor Posts: 1303 Joined: Mon Aug 03, 2009 7:24 am Gender: Male",
    "title": "Re: Lesion on my scalp",
    "content": "Hello,There are two possible diagnosis.One a seborrheic dermatitis ie severe form of dandruff,the other psoriasis.The earlier one itches more often than the later,and not well circumscibed.Some times they are clinically difficult to distinguish  .They are not of precancer and respond well to treatment.Fungus infections are to be ruled out too.Best wishes.\n\n",
    "posted_time": "Post  by Dr.M.jagesh kamath » Wed Sep 09, 2009 9:25 am",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=82222&sid=886fa469462e198fde10d6986769cc61#p82222"
  },
  {
    "author": "pj000  Guest Posts: 1 Joined: Sat Apr 25, 2009 2:25 pm Gender: Female",
    "title": "rash on breasts and feverish",
    "content": "i have felt like i have a fever for a week now, its very strange because  i've taken my temp and i don't have a fever.  I've been tired this whole week. I don't feel like it has anything to do with my diet, i eat fine. I havent taken anything for this \"fever\". I don’t have any cold symptoms, no runny nose, no cough, no body aches. Also about a month ago I noticed a rash on one of my breasts and then a week later or so I noticed another one on my other breast, they itch occationaly, brownish in color .i wasn’t concerned I thought it would clear up on its own, it hasn’t.\n\n",
    "posted_time": "Post  by pj000 » Sat Apr 25, 2009 2:33 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=75793&sid=886fa469462e198fde10d6986769cc61#p75793"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "Re: rash on breasts and feverish",
    "content": "Hello,  It would be impossible to know what the cause of your fever is without a direct medical exam. The fever and the breast rash/eczema could be linked depending on the degree of inflammation in the breast. Your doctor may order a mammogram and put you on an empiric antibiotic for a couple of weeks depending on your exam.  Please keep us updated.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Tue May 26, 2009 5:21 am",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=79578&sid=886fa469462e198fde10d6986769cc61#p79578"
  },
  {
    "author": "floruit  Guest Posts: 1 Joined: Thu Feb 12, 2009 3:11 pm Gender: Male",
    "title": "Choosing a skin cancer specialist",
    "content": "Hi,  I am trying to determine which dermatologist would be the most qualified to handle skin cancer.  I want to get it right the first time around to prevent further headache.  There has to be dermatologists with varying degrees of expertise with regards to skin cancer.  What should I look for?  What is a adequate number for the number of skin cancer patients they have seen or see each year?  I noticed there are dermatologist that are fellowship trained either in american college of mohs surgery or american society of mohs surgery--which is better in regards to skin cancer?  Is there any other training which might make them a better pick?\n\n",
    "posted_time": "Post  by floruit » Thu Feb 12, 2009 3:58 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=70796&sid=886fa469462e198fde10d6986769cc61#p70796"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "Re: Choosing a skin cancer specialist",
    "content": "Hello,  I hope you are doing well now. I am sure there are many well qualified dermatologists that can handle skin cancer. It really depends on the type of skin cancer, but an oncologist (especially surgical oncologist for early disease) that specializes in skin cancer would be a good bet.  Good luck to you!\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Fri Mar 20, 2009 1:34 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=71469&sid=886fa469462e198fde10d6986769cc61#p71469"
  },
  {
    "author": "starless  Guest Posts: 21 Joined: Sun Nov 06, 2005 5:47 pm Location: Canada",
    "title": "Freckles on palm of hand",
    "content": "Today I noticed three black spots that form a straight line on the palm of my hand that were definitely not there yesterday. They are about the size of a head of a pin and are (roughly) about a centimeter apart from each other. They are located on the heel of my left palm (and off to the right a bit). I never had any freckles on my palms before so it's a bit unsettling to see three pop up at once. Is this something I should worry about or is it normal?\n\n",
    "posted_time": "Post  by starless » Thu Feb 19, 2009 5:47 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=70956&sid=886fa469462e198fde10d6986769cc61#p70956"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Freckles on palm of hand",
    "content": "Hi there --  Palmar freckles are very unusual, so this does raise an eyebrow at least. The fact they showed up rather spontaneously suggests they are innocent and probably due to some trauma to the heel of your hand, as this does sometimes result in the sort of lesions you describe.   However...if these do not disappear in  fairly short order (in a week or so), you probably would be wise to have a dermatologist look at them, since once in a very great while something problematic is found this way serendipitously.   Hope this is helpful to you. Good luck, and please follow up with us here  as needed.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Sun Mar 08, 2009 9:07 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=71263&sid=886fa469462e198fde10d6986769cc61#p71263"
  },
  {
    "author": "bdaycake  Guest Posts: 1 Joined: Wed Nov 12, 2008 12:42 pm Gender: Female",
    "title": "how do i keep myself safe?",
    "content": "Ever since all the risk factors for skin cancer were made known to me (at least 5 years ago), I have tried to be really cautious with my skin and sun exposure. I have blonde hair, really light blue eyes, very fair skin, and lots of moles and freckles. And it took a lot of trial and error to realize that only SPF 50 sunscreen keeps me from getting burnt. Well, the only thing I didn't have was family history, except for my great aunt.  Well, last year my dad was diagnosed with melanoma. He caught it very early and luckily didn't need any chemo or radiation. they just removed a huge chunk of skin, so now he has a big scar on his chest. The only problem, the melenoma was not at all \"textbook\", if you know what I mean. It was three small red freckles on his chest. He just got them checked out because he never saw them before, but the dermatologist who looked at it just wanted to biopsy it anyway, but assured him that it was probably not melenoma. Well, it was. So basically, I have learned that it's not just the ABCD thing that determines melenoma.  So now I'm a bit scared. My dad hardly went out in the sun without loads of sunscreen. He grew up in canada too, and never really went to the beach or pool. I have been to the beach every summer of my life for vacation and grew up where it's a lot sunnier. I have been burnt a lot more than him.  I'm pretty sure I don't have any serious skin anomolies right now, just some round freckles, a few \"beauty mark\" type moles on my back and shoulders. But it's kid of hard to keep track of what was there before and what is there now. I guess I'm just really scared that I'll end up with three small red freckles too and not even notice if they were there before or not. Most of my freckles/moles are on my back, and shoulders, places I can't see very well.  I just turned 18 and my parents before didn't want me to get a skin cancer screening just yet, but I plan to get one as soon as I can. But my main question is how can I be sure that my skin is fine? It seems to me that skin cancer is inevitable for me and I don't want to find out too late. My dermatologist (for acne, about a year ago) recommended a routine skin cancer screening once a year, is that enought to keep me safe? I don't know, maybe I'm just being paranoid, but I don't want to catch anything too late. Any help on how to stay safe, if there is anything more to do, would be greatly appreciated. Thanks lots.\n\n",
    "posted_time": "Post  by bdaycake » Wed Nov 12, 2008 1:09 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=64034&sid=886fa469462e198fde10d6986769cc61#p64034"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "Re: how do i keep myself safe?",
    "content": "Hello,  In absence of randomized studies that provide definite standard methods or recommendations for screening and early diagnosis programs for malignant melanoma, many physicians agree that highest risk individuals (e.g. those with a strong family history of melanoma) should follow frequent self-examination and annual professional (primary care physicians or dermatologists) skin evaluation.   The screening examination is done with a source of bright light and a magnifying lens. It takes a few minutes, is safe and allows visualization of areas that are difficult to be seen by self examination like the back and posterior legs.  Some dermatologists use a dermoscopy (microscope like) that may improve the visualization and the evaluation of a pigmented lesion.   There is no recommend age for starting the screening program and you better follow up with your doctor for better evaluation and to be reassured.  Hope you find this information useful. Please keep us updated. Best regards.\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Mon Nov 17, 2008 4:34 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=64542&sid=886fa469462e198fde10d6986769cc61#p64542"
  },
  {
    "author": "mabel  Guest Posts: 1 Joined: Sat Nov 08, 2008 8:05 pm Gender: Female",
    "title": "Sebaceous cyst changing",
    "content": "Hello i have had a small, white, raised lump on my back for about 2yrs.  It was the size of a pencil eraser.  Within the last 2 weeks it has gotten bigger, with the white spot staying the same size.  It has grown more and more tender in the last 48 hrs and it is red around the white spot.  i seen my doc for annual physical 2days ago and she said it was a sebaceous cyst that I could get removed if I wanted to, but not to worry about it.  Any advice would be appreciated.\n\n",
    "posted_time": "Post  by mabel » Sat Nov 08, 2008 8:21 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=63621&sid=886fa469462e198fde10d6986769cc61#p63621"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "Re: Sebaceous cyst changing",
    "content": "Hello,  This sounds like the cyst you have in your back is infected and inflamed. When inflammation occurs it becomes more swollen, red, painful and tender (abscess like). The skin around may feel warm and you may have a low grade fever.  This can be improved if you follow local antiseptic measure and apply local antibiotic ointment.  If this will not improve the condition, you should follow up with your doctor, who might prescribe systemic antibiotics or recommend its removal or drainage accordingly.  I would advise you to follow up with your doctor and to discuss with her your concerns.  Please keep us updated. Best regards.\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Mon Nov 10, 2008 6:34 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=63804&sid=886fa469462e198fde10d6986769cc61#p63804"
  },
  {
    "author": "lizabeth1973  Guest Posts: 1 Joined: Wed Feb 27, 2008 1:56 pm Gender: Female",
    "title": "Seroma will not drain",
    "content": "I had surgery to remove a malignant melanoma and also lymph node removal on November 27, 2007.  Three weeks after surgery I developed a seroma under my arm where the lymph nodes were removed.  Last week the seroma started to fill with fluid again.  I saw my surgeon yesterday and he tried to drain it again.  It would not drain.  He said the fluid may have \"gelled\" and he wants me to come back in 8 weeks.  He didn't say whether this was serious or not or how he would remove the gelled fluid.  If the lump does not go away on it's own, is there a risk for infection?  Will he have to surgically remove the gel?\n\n",
    "posted_time": "Post  by lizabeth1973 » Wed Feb 27, 2008 3:07 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=54523&sid=886fa469462e198fde10d6986769cc61#p54523"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "Re: Seroma will not drain",
    "content": "Hi lizabeth1973, A seroma is essentially a collection of fluid near the surgical site. These often resolve with the contents being reabsorbed by the body, after a few weeks time. Generally speaking the seroma itself does not pose a risk of infection although repeated attempts at aspirating the fluid does increase the risk. I hope this is helpful. Best wishes. Sincerely, Theresa Jones, RN\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Sun Apr 27, 2008 6:35 am",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=58226&sid=886fa469462e198fde10d6986769cc61#p58226"
  },
  {
    "author": "guy82  Guest Posts: 1 Joined: Tue Apr 01, 2008 2:32 am Gender: Male",
    "title": "Multiple Sebaceous Cysts on Scrotum",
    "content": "I am a 26 years old guy. Few years ago, i start noticing small lumps on my scrotum but as its is not itchy or painful, i ignored it.  Now, the numbers of these lumps which i believed are Sebaceous Cysts had increased to more than 30 of them. Most of them are small, only 2 of them are bigger (0.5cm wide)  They are now itchy and i managed to squeeze out some of the puss inside. But the lump increased in size afterward.  I also experienced excessive sweating on my scrotum when I am outside. This caused extreme itchiness and it is very warm around that area. The itchiness does not only restricted to the areas with the cyst.  May I know all these problems are due to Sebaceous Cysts? I heard that by applying a heat pad to these cysts will be able to cure the cysts. Is it true? If not, surgical removal of all 30+ cysts seems like a tough job.  Thanks in advance for any advices offered.\n\n",
    "posted_time": "Post  by guy82 » Tue Apr 01, 2008 3:02 am",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=57392&sid=886fa469462e198fde10d6986769cc61#p57392"
  },
  {
    "author": "Debbie Miller, RN  Nurse Posts: 4746 Joined: Mon Apr 16, 2007 2:41 pm Gender: Female Location: USA",
    "title": "Re: Multiple Sebaceous Cysts on Scrotum",
    "content": "Hello, You are right that squeezing these cysts will only compound the problem since it creates a wound in an are that is typically full of bacteria.  Most cysts will resolve on their own when left alone but in rare cases of multiple and large cysts, excision might be necessary to avoid further infection of surrounding tissues.  You should see a dermatologist who can remove them if needed or advise you otherwise.  For home care of the cysts, use an antibacterial soap and bathe regularly with it.  Apply warm, wet washcloths to the lumps for 20 to 30 minutes, 3 to 4 times a day. If you prefer, you can also use a hot water bottle or heating pad over a damp towel. The heat and moisture can soothe the lump, increase blood circulation to the area, and speed healing.  If by chance you are not eating a healthy diet, important in preventing and healing infections, you should be certain to take a vitamin to help.  Vitamin A, C, the Bs and Zinc are all important in healing so a daily multivitamin might be a good idea.  You may be experiencing other problems relating to the excessive sweat such as a yeast infection but it is unlikely caused by the cysts.  Yeast overgrowth occurs in a warm, moist environment such as the groin and can cause itching as you describe but can be treated with over-the-counter topical antifungal creams and powders.  Keeping the area as clean and dry as possible will help prevent future outbreaks.    Best wishes.\n\n",
    "posted_time": "Post  by Debbie Miller, RN » Thu Apr 03, 2008 8:34 am",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=57530&sid=886fa469462e198fde10d6986769cc61#p57530"
  },
  {
    "author": "JMan81  Guest Posts: 1 Joined: Sat Dec 01, 2007 4:05 am",
    "title": "Unpredictable and unexplained bleeding?",
    "content": "I'm sorry ahead of time if this turns out long, I have a ton to include in the topic that might be helpful to the diagnosis, any help would be greatly appreciated.   I'm a 26 year old male and just recently (starting yesterday) I've noticed that my fingers will start to bleed randomly for no apparent reason. I haven't had a surgery in almost a year now, I haven't injured myself in any way and I havent done anything remotely dangerous enough to make them bleed. I read somewhere that skin cancer is a possible cause of unexplained bleeding, is that an option I need to look into here?   As for past diagnoses the list could seem to never end, some of my past diagnoses include but are not limited to: heart failure, heart disease, cirrhosis of the liver and now I have a cancerous tumor on my liver as well. I was recently diagnosed with epilepsy and I have some nerve damage. As of right now I'm also recovering from viral meningitis.   Past surgeries include: a heart transplant, aortic valve replacement, and in January '08 I'll be undergoing a liver transplant as well.   Some of the medications I'm on include: diuretics, small doses of Tegretol, cholesterol lowering medication, ACE inhibitors, and occasionally I take aspirin. Other than the medications i absolutely have to have I don't introduce anything else to my liver because of its condition.   My family history includes: heart disease, lung cancer and other types of cancer but nobody has been diagnosed with skin cancer that I know of.   Thank you for all your time and for taking the time to read this, I appreciate any advice I can get.\n\n",
    "posted_time": "Post  by JMan81 » Sat Dec 01, 2007 4:36 am",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=51010&sid=886fa469462e198fde10d6986769cc61#p51010"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi JMan81,  I would recommend you see your doctor.  Skin cancer can cause the skin to bleed but usually there are other changes that can be seen with the cancer as well.  Some of your medines, the ace inhibitor and particularly the Tegretol, can cause platelet problems that can lead to increased bleeding.  Your doctor can do a CBC to look at the platelet numbers and some other tests to look at your ability to clot.  Also, if your liver is not functioning well it may not be able to make some of the needed clotting factors to keep you from bleeding (or more appropriately, stop you from bleeding).  I would look for something like this before being too concerned about skin cancer.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sat Dec 01, 2007 8:57 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=51061&sid=886fa469462e198fde10d6986769cc61#p51061"
  },
  {
    "author": "mswillms  Guest Posts: 1 Joined: Sun Nov 11, 2007 8:20 pm",
    "title": "cancer?",
    "content": "I am a 42 year old female. About a month ago, what looks like a mole or a wart, popped out of my knee. At first, it didn't bother me. Now the center has become soft, pliable and painful. If I brush my leg against a desk or  wall, it really hurts! It looks like a small hill under my clothes. Should I be concerned? Surgeries: Apendectomy, Tubal ligation Both maternal grandparents died of cancer no current medications\n\n",
    "posted_time": "Post  by mswillms » Sun Nov 11, 2007 8:29 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50116&sid=886fa469462e198fde10d6986769cc61#p50116"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Mswillms,  I would suggest you have your doctor take a look at this.  The description doesn't make me particularly suspicious of cancer although this is a possibility.  It may also be an infection beneath the skin that could require antibiotics to clear up.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sun Nov 11, 2007 9:28 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50131&sid=886fa469462e198fde10d6986769cc61#p50131"
  },
  {
    "author": "imissmom  Guest Posts: 3 Joined: Sun Oct 14, 2007 11:17 am",
    "title": "Melanoma Pictures",
    "content": "I am a 40/F No major medical conditions. 2 routine adolescent surgeries. No family history of cancer. I have several odd looking moles on my shoulders. I've had them forever and they haven't changed but I'd like to see some pictures of \"dangerous moles\" to ease my mind. I can't seem to find them for myself. Thanks!\n\n",
    "posted_time": "Post  by imissmom » Sun Oct 14, 2007 11:42 am",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=48955&sid=886fa469462e198fde10d6986769cc61#p48955"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Imissmom,  I don't have any pictures to show you but I can tell you what we look for when determining if a mole is concerning.  A good way to remember these characteristics is using the ABCDE mnemonic.  A=asymmetry.  A mole that is different on one side than the other is more concerning.  B=Borders.  A mole with irregular borders rather than smooth borders is more concerning.  C=Color.  A mole with multiple colors is more concerning than one with a uniform color.  D=diameter.  A mole greater than 6mm is more concerning.  E=elevation or evolution.  A mole that is raised is more concerning.  A mole that is changing is more concerning.  The more of these characteristics that a mole possess the more concerning it is for being melanoma.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sun Oct 14, 2007 11:04 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=49000&sid=886fa469462e198fde10d6986769cc61#p49000"
  },
  {
    "author": "imissmom  Guest Posts: 3 Joined: Sun Oct 14, 2007 11:17 am",
    "title": "[no title]",
    "content": "Dear Dr. Lowe, Thanks for the info! I have come across this guide before, so pictures would be more helpful, of course.   The 2 moles I'm concerned about are on my shoulder & lower right shin.   The latter is about 6 mm and is slightly raised, but has none of the other red flag characteristics. I'm worried because I haven't always had it...just in the last 10 yrs. or so.   The one on my shoulder is 3-4 mm, slighly irregular in both symentry & border, brown in color except for 1 tiny light brown bump that is slightly raised, but it isn't changing and is not new.   Both areas have been sunburned multiple times.  Any other info you can provide would be much appreciated.  Thanks again!\n\n",
    "posted_time": "Post  by imissmom » Fri Oct 26, 2007 2:05 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=49554&sid=886fa469462e198fde10d6986769cc61#p49554"
  },
  {
    "author": "neala  Guest Posts: 7 Joined: Tue Jul 10, 2007 6:26 am",
    "title": "Diagnosed with Spitz Nevi",
    "content": "I am a 28yr old female who was just diagnosed with a spitz nevi that was removed 2 weeks ago by my dermatologist. When my dermatologist told me of the diagnosis he was very unsure and said at least we got it all anyway...just in case.   I would not be worried about the diagnosis, but I have been feeling ill for the past year and a half. I have been having intermittent deep chest pains and been very fatigued. I had also noticed around the same time that I have an enlarged lymph node on my neck. My doctor is sending me to a specialist to have a look at the lymph node.   Should I be getting a second opinion on the spitz nevi diagnosis? I hear it is very hard to determine melanoma from spitz nevi. The mole that was removed was flat, dark, with light brown around the edges (almost like bleeding into my good skin) and it had a light brown spot in the middle.   Thanks so much.\n\n",
    "posted_time": "Post  by neala » Tue Oct 23, 2007 2:23 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=49442&sid=886fa469462e198fde10d6986769cc61#p49442"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Neala,  Your description does fit that of a Spitz nevus.  You mention that the mole was removed.  Typically, when a mole is removed it is sent to a pathologist for analysis to definitively determine what the mole was.  If it was melanoma it would be picked up this way.  Following up about the lymph node will be important.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Wed Oct 24, 2007 10:36 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=49487&sid=886fa469462e198fde10d6986769cc61#p49487"
  },
  {
    "author": "wwolsgra  Guest Posts: 1 Joined: Wed Jul 25, 2007 9:25 pm",
    "title": "White blotches on my shoulders and chest",
    "content": "I am 45, male and am diabetic.  I am outside alot in our pool and have a dark tan however I have white blotches on my shoulders and chest and concerned.  Could you please tell me what may cause this and how I should correct.\n\n",
    "posted_time": "Post  by wwolsgra » Wed Jul 25, 2007 9:37 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=45312&sid=886fa469462e198fde10d6986769cc61#p45312"
  },
  {
    "author": "Debbie Miller, RN  Nurse Posts: 4746 Joined: Mon Apr 16, 2007 2:41 pm Gender: Female Location: USA",
    "title": "[no title]",
    "content": "There is a condition called vitiligo you may want to investigate on the internet.  Google it and you will find photos to compare to your situation.  A dermatologist would be the specialist to see to rule out other conditions.  Of course skin cancers are always a concern so having the skin checked out is a good idea.\n\n",
    "posted_time": "Post  by Debbie Miller, RN » Fri Jul 27, 2007 7:01 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=45431&sid=886fa469462e198fde10d6986769cc61#p45431"
  },
  {
    "author": "BrandiWyne  Guest Posts: 5 Joined: Thu Apr 26, 2007 9:23 pm",
    "title": "Seborrheic Keratosis, Acanthotic Variant, Potential trouble?",
    "content": "Greetings:  A couple of weeks ago, I noticed some dark areas and a raised, jagged spot on my husband's back.  Husband is 41.  No previous surgeries.  I talked him into going to a dermatologist for consult, and after shave biopsy of three (3) spots, the diagnosis was Seborrheic Keratosis, Acanthotic Variant.  Pathology goes on to say:  \"In each sample, levels through the tissue designated \"x,y, and z\" are examined on one slide.  Sections demonstrate a seborrheic keratosis, acanthotic variant, characterized by acanthotic expansion on the epidermis with variable keratin cyst formation.  There are no malignant features identified as sampled.  H and E stained preparations are utilized in the evaluation.  The microscopic findings support the diagnosis.\"  My question is this:  to a layperson, this sounds like a great diagnosis, but I have Googled all this and have proceeded to alarm myself that this could potentially be pre-cancerous?  Is this a firm diagnosis of benign origin?? Is there anything else I should ask his physician?  We do not see him until July, and I am fairly alarmed, as he has more of these \"lesions\" that were not excised, and his physician said he has extensive sun damage on his ears.  Any help will be greatly appreciated!  Brandi\n\n",
    "posted_time": "Post  by BrandiWyne » Tue Jun 12, 2007 10:43 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=43596&sid=886fa469462e198fde10d6986769cc61#p43596"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Seborrheic keratoses are benign lesions of the skin.  They are often darker than the surrounding skin and have a raised appearance to them.  It's almost as if they are glued on.  Acanthosis is a condition that basically is very similar and involves thickening of the skin.  It, too, is a benign process.  There is another condition known as actinic keratosis.  These lesions are considered precancerous and should be treated to prevent them from becoming skin cancer.  They can be easily frozen with liquid nitrogen by your doctor.  These spots generally are less raised and have a more rough feel to them, almost like sand paper.  I would recommend you have your doctor take a look at the spots to see if they look like actinic keratosis or a variant of seborrheic keratosis.  Seborrheic keratosis (any of their variants) will only very rarely develop into skin cancer-mostly they are just annoyances.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Thu Jul 12, 2007 10:19 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=44659&sid=886fa469462e198fde10d6986769cc61#p44659"
  },
  {
    "author": "BrandiWyne  Guest Posts: 5 Joined: Thu Apr 26, 2007 9:23 pm",
    "title": "[no title]",
    "content": "Thank you, Dr. Lowe, for your response.  I truly appreciate it.  I will confer with his physician on this matter, as you suggest.  My biggest problem is I've become the Google Queen....  :)  Again...my sincere thanks,  Brandi\n\n",
    "posted_time": "Post  by BrandiWyne » Fri Jul 13, 2007 10:22 am",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=44674&sid=886fa469462e198fde10d6986769cc61#p44674"
  },
  {
    "author": "rp777  Guest Posts: 1 Joined: Sat Jul 07, 2007 11:13 pm",
    "title": "psoriasis",
    "content": "Hello I'm age 23, male, no surgeries except tonsils, acid reflux, no medication, and having problems with psoriasis. I didn't take them seriously for 6 months, and now I'm beginning to worry becuase I was told if it gets worse, it can become a skin cancer or something like that. I was told that there is a cream out there to remove psoriasis (cream product I found online), but not sure if it's safe. I'm looking for a solution to get rid of psoriasis. Can you help me? Thank you.\n\n",
    "posted_time": "Post  by rp777 » Sat Jul 07, 2007 11:25 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=44302&sid=886fa469462e198fde10d6986769cc61#p44302"
  },
  {
    "author": "Debbie Miller, RN  Nurse Posts: 4746 Joined: Mon Apr 16, 2007 2:41 pm Gender: Female Location: USA",
    "title": "[no title]",
    "content": "Psoriasis is treated by prescription from your doctor so it would be wise to see a dermatologist or other health care provider.  There are safe over the counter products to help relieve symptoms and you may wish to check out the National Psoriasis Foundation at http://www.psoriasis.org.  They discuss many treatment options and are a reputable site with support for people who have this condition.  Good luck.\n\n",
    "posted_time": "Post  by Debbie Miller, RN » Sun Jul 08, 2007 11:29 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=44374&sid=886fa469462e198fde10d6986769cc61#p44374"
  },
  {
    "author": "Smartpatrol9  Guest Posts: 12 Joined: Mon Dec 11, 2006 3:46 pm",
    "title": "Tattoo problems",
    "content": "I don't know where else to put this topic, its more related to infections. I got a tattoo from an unlicensed friend of mine a couple days ago. He useda  brand new needle and supposedly sterelized the gun. Ever since I have been sick (random bouts of nausea when I think about the tattoo but they go away), but I think its mostly in my head. What should I do?\n\n",
    "posted_time": "Post  by Smartpatrol9 » Sat Jun 23, 2007 11:18 am",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=43782&sid=886fa469462e198fde10d6986769cc61#p43782"
  },
  {
    "author": "Marceline F, RN  Nurse Posts: 229 Joined: Wed Feb 28, 2007 1:54 am",
    "title": "[no title]",
    "content": "Dear Smartpatrol9, I respect that you have been educated enough to recognise that it is of great value to use licensed technicians and estheticians for your body art.    Techniques employed by the artist should include \"aseptic technique\" which is a means of creating an environment that reduces the risks of infection.  The licensed provider has been specially trained to know how to do so.  The use of a new needle is a critical component, as well as proper cleaning or sterilization of other associated equipment.  Equally important is hand washing and the ink supply itself.  You have not indicated if the tattoo site is reddened or hot to touch, if the needle site is oozing at all, or if you are having a fever, or increased pain at the site.. These are all possible indicators of a localized infection.  Nausea that passes on its own (that you state seems triggered by your thinking about the possibility of infection) is not typically linked to a skin related infection - in the absence of other signs.   If any of these signs manifest, I would ask my primary physician or a local urgent care center to evaluate you and make appropriate recommendations.  If your friend is a good artist - I would also recommend that you strongly suggest they get a license so that they may continue to practice their art safely, for his/herself - and for the client.\n\n",
    "posted_time": "Post  by Marceline F, RN » Sun Jun 24, 2007 1:30 am",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=43789&sid=886fa469462e198fde10d6986769cc61#p43789"
  },
  {
    "author": "Mandrew  Guest Posts: 1 Joined: Fri May 18, 2007 4:13 am",
    "title": "Small wart like lump on chest",
    "content": "I am a 35 year old female and have a small soft wart like lump.cyst on my chest just above my right breast.  Should this be something to worry about?\n\n",
    "posted_time": "Post  by Mandrew » Fri May 18, 2007 4:20 am",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=42674&sid=886fa469462e198fde10d6986769cc61#p42674"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Hello,  It would be impossible to give you a useful assessment given the limitations of the internet.  Hear are some points to keep in mind:  Diagnosis of malignant melanoma requires expert knowledge, as early stages may look identical to harmless moles/warts. Signs and symtoms of malignancy include:  Darkly pigmented skin lesion, sometimes with areas of scanty pigmentation  Irregularly shaped skin lesion  Growth or change in shape in a previous mole  Itching, ulceration or bleeding in a previous mole   Best regards,\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Fri Jun 22, 2007 3:28 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=43772&sid=886fa469462e198fde10d6986769cc61#p43772"
  },
  {
    "author": "annie_uk  Guest Posts: 3 Joined: Wed May 09, 2007 12:19 pm",
    "title": "Should I be worried about this mole?",
    "content": "Hi,  I'm 28 and have a family history of melanoma and non-melanoma skin cancer - should I be worried about this mole. It's been scaly and bit itchy and has grown over the last 2 months.    Thanks Annie\n\n",
    "posted_time": "Post  by annie_uk » Thu May 10, 2007 4:17 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=42246&sid=886fa469462e198fde10d6986769cc61#p42246"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Just by looking at it, I think it is probalby OK; however, when moles begin changing as you are describing I generally recommend having them evaluated by a dermatologist and possibly removed for microscopic examination.  Just based on this picture I cannot say with 100% certainty that it is normal so I would recommend further evaluation.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Fri May 11, 2007 12:53 am",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=42270&sid=886fa469462e198fde10d6986769cc61#p42270"
  },
  {
    "author": "annie_uk  Guest Posts: 3 Joined: Wed May 09, 2007 12:19 pm",
    "title": "Thanks",
    "content": "I'm seeing my doctor on Wednesday - hopefully he will agree.  Thanks for your time and reply.  Annie\n\n",
    "posted_time": "Post  by annie_uk » Fri May 11, 2007 9:03 am",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=42288&sid=886fa469462e198fde10d6986769cc61#p42288"
  },
  {
    "author": "werstyle_teen  Guest Posts: 1 Joined: Sat Jan 27, 2007 12:15 am",
    "title": "eyelid surgery, facial surgery, cosmatic surgery, puffyeyes,",
    "content": "Hello, Can anybody tell me of a good website that provides information about   eyelid surgery, facial surgery, cosmatic surgery, puffyeyes, droopy eyes?   Someone recommended http://www.puffyeyes.com. Any recommendations on this?  werstyle teen\n\n",
    "posted_time": "Post  by werstyle_teen » Sat Jan 27, 2007 12:27 am",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=38114&sid=886fa469462e198fde10d6986769cc61#p38114"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "There are many websites with good information about medicine on the internet.  The difficult part is determining which sites are giving good information and which are not.  In general I recommend using sites that are well known and validated such as WebMD.  More obscure sites can give good information but you need to know what your looking for and what seems off.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sat Mar 17, 2007 6:37 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=39681&sid=886fa469462e198fde10d6986769cc61#p39681"
  },
  {
    "author": "yunggredd53  Guest Posts: 7 Joined: Thu Feb 22, 2007 11:47 pm",
    "title": "PENIS DISCOLORATION",
    "content": "i know you can not diagnos this over the internet but cna u at least tell me the likely hood of having penile cancer?. I have had this white spot on the top shaft of my penis for about 4-6 years. and recently i have had white pacthes of skin pop  up on my scrotum (i am 18 years old.n i am circumsized).. which may be because of a pimple i had popped and left a scar cause it seems to be goin away. but yea.the white spot on the penis has been there for a long time. sometimes i can squeeze very little puss out. from what i have decribed can you tell me what this could be? n the likely hood of bein penile cancer? i show no other syptoms besides jus discoloration jus white patches..not brown or anything else..\n\n",
    "posted_time": "Post  by yunggredd53 » Thu Feb 22, 2007 11:56 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=38961&sid=886fa469462e198fde10d6986769cc61#p38961"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Without direct examination it is not possible to accurately give you a diagnosis, but your description makes me think this is probably not penile skin cancer.  Being circumcised also reduces your risks of developing penile skin cancer.  You may have some blocked follicular glands that can produce symptoms such as these or you may have a fungal skin infection.  I would recommend that you be evaluated by your doctor as many of the possibilities have treatments.  Also, this way you can clarify the cancer issue much more definitively.  Hope this helps.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Tue Mar 06, 2007 3:54 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=39301&sid=886fa469462e198fde10d6986769cc61#p39301"
  },
  {
    "author": "Cav  Guest Posts: 1 Joined: Fri Dec 08, 2006 11:19 pm",
    "title": "Spots on glans penis",
    "content": "I am a 39 year old male.  I have no personal or family history of any type of skin cancer, but I have had a four dysplastic moles removed in the last 5-10 years and also had some others shaved but the biopsies returned normal.  I have dozens of other normal-appearing moles over by body as well.   I am otherwise healthy and taking no medications.  Since my first dysplastic mole, I have been checked by a dermatologist every year or two.  At a recent vist, I asked him to look at a mole on the underside of the shaft of my penis (he shaved that- biopsy was lentigo simplex).  At the same time, he asked about some spots on the top of the  head of my penis.  He seemed a little concerned but didn't go so far as to recommend another shave biopsy.  They have been there for some time, but I can't honestly remember how long.  My best guess is at least a couple years but probably not 10 years or more.    There are three of them and they appear like dark freckles or even small moles.   They are 1-2mm in diameter, slightly irregular in shape with fairly well defined borders.  They are colored a somewhat darker red/brown  than the surrounding tissue.  They are completely flat and not raised above the skin, there is no itching, peeling, pain or anything else unusual.   There are also a couple other lesser blemishes nearby, barely darker than the surrounding tissue.  I'd call them \"old age\" spots for lack of a clinical description.  They do not look like \"Fordyce\" spots that I've found in some photos while searching for information.  Does this type of spot seem unusual in this location?  Is it advisable to get another opinion from another type of specialist rather then a general dermatologist?  I'm a little reluctant to have a shave biopsy there for obvious reasons, unless it is clearly suspicious or unusual.  Obviously I'm watching them for changes, but have noted none in the few months since I became concerned about them.  Thank you.\n\n",
    "posted_time": "Post  by Cav » Mon Dec 11, 2006 11:11 am",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=35919&sid=886fa469462e198fde10d6986769cc61#p35919"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Hello,  This would be very difficult to tell over the internet.  It could simply be postinflammatory hyperpigmentation. These are localized, macular, dark hyperpigmentation at site of a previous inflammation. They occur at any age and are a reaction to trauma (physical or chemical injury), skin irritation, or dermatoses. They maybe associated with an inflammation of skin because of underlying injury or condition at the initial time of occurrence.  Call the doctor that examined you and tell him about your concerns. If he tells you he thinks you shouldn't worry about it then all that will be required is to keep an eye on them from time to time. From your description it does appear that they are harmless.  Best regards,\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Mon Dec 11, 2006 11:48 am",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=35924&sid=886fa469462e198fde10d6986769cc61#p35924"
  },
  {
    "author": "lmm  Guest Posts: 4 Joined: Sun Feb 12, 2006 3:38 am",
    "title": "This just in: new mole discovered, pain & uncertainty re",
    "content": "Hi! I am 25 years old and have recently been having strange back, armpit and breast/nipple sensations/pains for the last two weeks (isolated to the upper left quadrant), and I am at a loss as to what it could be. My dilemma, as with too many Americans today, is that I am presently uninsured, being between graduation from college and professional school. So doc appts are a last resort right now. Of course, I have had more health problems during this short period than I have over the course of my whole life -- go figure.  Anyway, this is probably just me overreacting and not knowing nearly enough about body systems or disease processes, BUT.. I recently found a mole-like thing in the area of the back where pain is coming from. It is kinda big, not dark (that's why I haven't noticed it) and is scaly/flaky and irregular in shape, slightly raised but not appearing inflamed or very weird. I think that just about everyone's biggest fear is cancer, so of course I just keep going through the list... \"I hope I don't have breast cancer, etc.\" so now I'm on to skin cancer. And I want to rule it out, but I can't find enough info online to really do that. I don't think my symptoms, which include pains, burning sensations, hypersensitivity (esp of the nipple, skin of the breast, armpit) could really indicate the presence of a skin cancer, but I dunno.  BTW, no lumps can be found in the armpit or breast, but I did notice a dimply like indent on my side (not near the breast). have no clue about what that could be, but no bumps detectable near it.  So I am just wondering: would a cancerous mole/growth change appreciably before causing problems like these pains, like become more nodular or larger? It's only about the size of an eraserhead right now. Also, I had a CBC recently which was just fine -- would this mean anything in terms of diagnosing skin cancer or something of the like? I personally am leaning toward a mechanical/muscular problem (like from poor posture which I have plenty of and is getting worse by the day), but I just wanted to see if other worries could be ruledout.  Thanks to anyone who can field this :)\n\n",
    "posted_time": "Post  by lmm » Tue Feb 14, 2006 9:27 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=30693&sid=886fa469462e198fde10d6986769cc61#p30693"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi lmm, There are different types of skin cancer, in which visible signs that indicate a change or abnormality is present, long before actual physical symptoms arise. It of course would be wise of you to have an evaluation to assure that there are no concerns. There are many low cost or free clinics offered in most areas that provide access to health care for individuals whom are uninsured/underinsured and are typically based on income. There are also a variety of cancer screenings (including skin cancer) offered at different times throughout the year. For example, Click here! If information can not be found at the above link for your particular area, call the American Cancer Society at 1-800-ACS-2345 or via email at Click here! under the \"contact us\" section of the website. I hope this is helpful information. Sincerely, Theresa Jones, RN\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Thu Aug 10, 2006 5:58 am",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=33810&sid=886fa469462e198fde10d6986769cc61#p33810"
  },
  {
    "author": "Outrider  Guest Posts: 1 Joined: Sat Dec 31, 2005 12:49 am",
    "title": "Brown spot on shaft of Penis",
    "content": "Hello,  I'm a little concerned about a slightly raised brown spot I have on the left side of my penis. It's about the size of a capital letter, \"O\", if one was using size 14 font. It's, in fact, the only spot I have on my penis. I'm currently 33yrs old and it's been there about 11 years. I've asked 2 doctors on separate occasions about it and they both feel that it's an age spot. One of the doctors said it doesn't appear to be forming a root deeper into the tissue so it's probably nothing to worry about. It has stayed relatively oval-shaped, but appears to have been getting a bit larger within the past 6/8 months. It's never ulcerated nor has it ever itched. Now, sometimes it appears to crater and then heal itself, but its never had any pus or any of the like. If it's not cancerous, and it is just an age spot, can this be something that I can have surgically removed? Is it about time for another doctor visit regarding it?   Thanks so much for having a place where queries and concerns can be  answered.  Good day\n\n",
    "posted_time": "Post  by Outrider » Sat Dec 31, 2005 1:19 am",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=27445&sid=886fa469462e198fde10d6986769cc61#p27445"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Dear Outrider,  There is no replacement for direct clinical examination, But according to your description,  It could be a condition known as Fordyce spots .  Fordyce spots are not infectious and their cause is unknown. They are abnormally dilated blood vessels, covered by thickened skin. They can appear on the glans, shaft or scrotum. They may be solitary, but frequently appear in crops of 50 to 100. They are usually small (1-5mm) in size and may present as bright red or purple papules, painless and are not itchy.  Fordyce spots usually affect younger men. They may cause embarrassment because of their appearance, or a fear that they might be sexually transmitted. They may bleed if injured or even during intercourse.  Although a number of approaches have been tried, there is no simple, reliable treatment to remove them. Troublesome bleeding spots can be sealed with a device that uses a small electric current (electrocautery).  Only by complete history and physical examination, the correct diagnosis can be reached.   Hope you find this information useful.  Best regards,\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Mon Aug 07, 2006 8:42 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=33743&sid=886fa469462e198fde10d6986769cc61#p33743"
  },
  {
    "author": "tiggersprings  Guest Posts: 1 Joined: Fri Sep 30, 2005 7:52 am Location: Tucson",
    "title": "Lump in neck",
    "content": "I was diagnosed with a stage III malignant melanoma six months ago.  It was surgically resected with free margins, and no one felt the need for me to follow up...  I also have a history of stage III cervical dysplasia (3 years ago).  I have had a solid, fixed mass just below my right mastoid process for at least a year.  It seems to have gotten bigger, however when mentioned to my pcp, he stated that it is probably nothing.  Should this be of concern?  I have felt a tingling-like pain in this area, as well as severe pain in my right ear (not infection related, but more of a sharp pressure pain) for over a year.  Also, when I put my finger in my right ear, I can feel something close to the opening, whereas I cannot on the left side.    The mass feels alot like bone, but this is not present on the left side.  I also had a neck x-ray done recently for neck pain, and it did not seem to show up on the films.    What should I look for in regards to lymph nodes, and should I be concerned about this mass?  Possibly get another opinion?    Thanks for your time.\n\n",
    "posted_time": "Post  by tiggersprings » Fri Sep 30, 2005 8:04 am",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=21955&sid=886fa469462e198fde10d6986769cc61#p21955"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Dear tiggersprings,  It is probably a Lymph node as it occurs in a Lymph node region, however this must be confirmed by your physician.   Palpation is the first step to confirm the presence of a Lymph node enlargement.  Nodes are generally considered to be normal if they are up to 1 cm in diameter.   Abnormal Lymph node enlargement tends to commonly result from infection / immune response, cancer and less commonly due to infiltration of macrophages filled with metabolite deposits (eg, storage disorders).   Infected Lymph nodes tend to be firm, tender, enlarged and warm. Inflammation can spread to the overlying skin, causing it to appear reddened.   The postauricular Lymph nodes (if my guess is correct according to your description) are located behind the ears. They drain the external auditory meatus, pinna, scalp. Common causes of enlargement include local infection.   You did not mention where the excised melanoma was. If it is in the drained area of this lymph node, then it should be taken seriously for more investigations. In such cases the nodes are from firm to hard in consistency.  An increase in nodal size on serial examinations is significant. Hence nodes that continue to grow in size are important and those that regress in size tend to be more reassuring.   A Conventional US study with or without Doppler can help in confirmation of the nature of this swelling. CT scan also would confirm the presence of a Lymph node.   The personal and medical history as well as the clinical examination gives a good idea about the possibility of this node to be of malignant Origin. Further investigations include, US, CT scan and FNAC or biopsy.  Hope you find this information useful. Do not forget that, here is no replacement to a direct clinical examination. Only by complete history and physical examination, the correct diagnosis can be reached.   Best regards.\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Sat Aug 05, 2006 6:52 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=33683&sid=886fa469462e198fde10d6986769cc61#p33683"
  },
  {
    "author": "LLL777  Guest Posts: 1 Joined: Fri Jan 27, 2006 10:28 am Location: USA",
    "title": "Lump On Shoulder",
    "content": "Hi, I am a 34 year old woman and have a small slightly red lump on my shoulder.  I have had the lump for a while, it is not painful and hasn't changed.  However, I was concerned about it and asked my general practioner to look at it during my annual physical a few months ago.  He said it was probably an Actinic Keratosis and gave me a topical cream.  So, I used the cream and it was successful in eating away a few layers of skin and making the area look worse, but I can still feel a lump.  My doctor doesn't seem concerned and said he doesn't think it has the characteristics of melanoma.  My question is, does a general practioner know enough to make that determination?  Should I still be concerned or should I get a second opinion?  I do have an appointment with a dermatologist for a full body exam, but he can't see me until September, I'm afraid if it's cancer I could be dead by then.  I'd just like your thoughts....Thanks.\n\n",
    "posted_time": "Post  by LLL777 » Fri Jan 27, 2006 10:47 am",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=29346&sid=886fa469462e198fde10d6986769cc61#p29346"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Dear LLL777,  Clinical examination is very essential for differential diagnosis of any palpable mass especially if the associated symptoms are not indicative of any possible diagnosis.    It sounds to be of benign cause as it did not increase in size, does not bleed, and not itchy.   You better get an appointment with a dermatologist for proper evaluation. Only by examination and investigations the nature of this mass can be defined.   Keep us updated. Best regards,\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Sat Aug 05, 2006 6:36 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=33682&sid=886fa469462e198fde10d6986769cc61#p33682"
  },
  {
    "author": "Charles  Guest Posts: 1 Joined: Sat Jan 28, 2006 9:37 pm Location: Palm Bay",
    "title": "Lump on back",
    "content": "I am a male, tenty six years old living in Florida.  I have had a small lump located near my left shoulder blade for about three years.  It has neveer bothered me much.  Very recently it has doubled in size, changed color,  and become very painfull to the slightest touch.  Should I race to the emergecy room? Can it be cancer?\n\n",
    "posted_time": "Post  by Charles » Sat Jan 28, 2006 9:52 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=29417&sid=886fa469462e198fde10d6986769cc61#p29417"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Dear Charles,  Clinical examination is very essential for differential diagnosis of any palpable mass especially if the associated symptoms are not indicative of any possible diagnosis.  A mass in such area could be a lipoma. Lipoma is usually felt as soft mobile mass. If it is painful and tender, mostly because it is infected and inflamed, thus becoming bigger in size. Other wise it has been exposed to trauma and hematoma has been formed.  You better get an appointment with your doctor for complete examination. Only by examination and investigations the nature of this mass can be defined.  Best regards,\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Fri Aug 04, 2006 7:07 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=33659&sid=886fa469462e198fde10d6986769cc61#p33659"
  },
  {
    "author": "Befallingdusk  Guest Posts: 20 Joined: Tue May 17, 2005 2:08 am Location: Raleigh, NC",
    "title": "Shave Biopsy on suspected Melanomas ....?",
    "content": "I had two lesions.  One on my back, one over my stomach. The dermatologist's PA-C stated the one on my back was large, very black and had a red \"halo\" around it as though it were inflamed or irritated.  She then immediately performed what I thought were \"SHAVE\" biopsies on both lesions and covered them with tiny, circular band-aids.  The one on my back was not entirely covered by the dressing.  I was left with circular depressions of raw areas that have now formed scabs.  I've since read that if malignant melanoma is suspected, shave biopsies should never be performed, but I can't find the reason why this is.  Could someone answer this for me?  My results came in today as both being \"BENIGN,\" and the fact that a shave biopsy was indeed performed, was confirmed.  Without my saying anything much, the tech went on to say, \"Amy's real good at shave biopsy's, she got the entire lesion, didn't she?\"  I didn't know how to respond to this.  Should I now be comfortable with a \"benign\" diagnosis even though I know shave biopsies were performed on suspicious, pigmented lesions?  Could someone please, pretty please, take the time to answer these two questions?  Thanks.\n\n",
    "posted_time": "Post  by Befallingdusk » Wed Jun 22, 2005 6:35 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=15641&sid=886fa469462e198fde10d6986769cc61#p15641"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Dear Befallingdusk, Different types of biopsies can be done to diagnose  a suspected melanoma. The preferred one is excisional biopsy since the whole layers of the skin can be chesked to see the exact tumor thickness which is a very important prognosti factor for cutaneaous melanoma. In shave biopsy, the epidermis and the most superficial part of the dermis are shaved with a surgical blade. it is not generally recommended if a malignant melanoma is suspected. An exception is in the case of lentigo maligna in which the the risk of misdiagnosis is higher if deeper biopsies are taken, a broad, paper-thin shave biopsy is prefrred. An expert dermatologist can recognize lesions that are more likely to be malignant and would recommend excisional biopsy. Congratulations that the pathology results in bengin lesions. Good luck,\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Fri Jun 30, 2006 5:48 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=33215&sid=886fa469462e198fde10d6986769cc61#p33215"
  },
  {
    "author": "firemom31  Guest Posts: 12 Joined: Mon Nov 15, 2004 8:49 pm Location: Ohio",
    "title": "What sx when melanoma on back spreads?",
    "content": "I am a 46 yr old fe, post-menopause, no sig med hx. Surgeries include hyst and gall bladder. Family hx sig for cardiac and cancer. I take no meds other than benadryl for allergies. I have had a suspicious mole on my back for at least a year but no money to go to a dr. It sometimes burns like some is sticking a lit cigarette on it. It is over my spine, thoracic area. Two weeks ago I started having painful parasthesia around around my waist from spine to midline. I also noted petechia. I thought I was getting shingles but that never materialized. I am now concerned that this mole may really be cancerous and could be causing irritation around my spinal column. Could this be the case or am I just being a worry-wart?\n\n",
    "posted_time": "Post  by firemom31 » Sat Feb 11, 2006 9:13 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=30479&sid=886fa469462e198fde10d6986769cc61#p30479"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Hello,  If you are suspecting something as serious as that you should be examined by a doctor immediately. I will not be able to give you a proper assessment over the internet.  Has your mole grown? Has it bled? You mention a burning sensation in it, is that constant?  Best regards.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Sun Feb 12, 2006 5:26 am",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=30511&sid=886fa469462e198fde10d6986769cc61#p30511"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi firemom31, The American Cancer Society offers many cancer screening events free of charge. When free screening is not available an evaluation can often be offered at a reduced cost. I would advise you to contact 1-800-ACS-2345 or click on the following link for additional information. Click here! I hope this is somewhat helpful. Sincerely, Theresa Jones, RN\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Sun Feb 12, 2006 9:02 am",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=30520&sid=886fa469462e198fde10d6986769cc61#p30520"
  },
  {
    "author": "firemom31  Guest Posts: 12 Joined: Mon Nov 15, 2004 8:49 pm Location: Ohio",
    "title": "[no title]",
    "content": "Thank you for taking time to reply. I will certaily look into free screening, I guess I didn't relaize that was something that might be available. In answer to the Dr., the burning is not continuous, just lasts a few minutes, every few days. There has been no bleeding that I am aware of. Again, I appreciate the time you both have taken to respond.\n\n",
    "posted_time": "Post  by firemom31 » Sun Feb 12, 2006 7:09 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=30558&sid=886fa469462e198fde10d6986769cc61#p30558"
  },
  {
    "author": "ACTN  Guest Posts: 4 Joined: Tue Nov 15, 2005 10:53 am Location: AL",
    "title": "Hard Knot on ear lobe",
    "content": "I have a hard knot on top top of my ear lobe....about the size of a pencil eraser. no color change or size change, not even a different color. it almost feels like bone. this is in anarea I recieve alot of sun due to my job, and most of the time my ears stay burnt in summer. Not painful, and has been there for a couple of years. any advice would be helpful. Thank you for any help.\n\n",
    "posted_time": "Post  by ACTN » Sun Jan 08, 2006 1:28 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=27984&sid=886fa469462e198fde10d6986769cc61#p27984"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi ACTN, Areas that have changed in appearance and texture warrants an evaluation by a physician. Sunburns cause damage to the skin. I would suggest an evaluation by a Dermatologist so the area can be evaluated. When you are working outside and exposed to the sun it would be advisable to use sunscreen. Sincerely, Theresa Jones, RN\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Sun Jan 08, 2006 2:46 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=27985&sid=886fa469462e198fde10d6986769cc61#p27985"
  },
  {
    "author": "bbm  Guest Posts: 1 Joined: Sat May 31, 2003 11:22 pm",
    "title": "sebaceous carcinoma",
    "content": "Hi, I was wondering if anyone knew of any good doctors that could treat this cancer.  Thanks\n\n",
    "posted_time": "Post  by bbm » Sat May 31, 2003 11:25 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=853&sid=886fa469462e198fde10d6986769cc61#p853"
  },
  {
    "author": "Ebeth  Guest Posts: 1 Joined: Thu Oct 13, 2005 12:53 pm Location: PA",
    "title": "Red Pea Size Lump on Upper Thigh",
    "content": "I discovered 3 pea-sized hard lumps today in the area of a 5 yr. old incision where a sentinel biopsy was performed in the groin area.  The lump are red and hard and a bit painful.  They are not deep but on the surface like a pimple.  HELP!\n\n",
    "posted_time": "Post  by Ebeth » Thu Oct 13, 2005 12:59 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=23263&sid=886fa469462e198fde10d6986769cc61#p23263"
  },
  {
    "author": "birdy  Guest Posts: 1 Joined: Tue Oct 11, 2005 3:49 pm Location: canada",
    "title": "Hard lump under skin biopsy",
    "content": "I am a 40 year old woman.  I had a lump under my skin on my lower back for some years now.  It grew really fast and then hasn't for a few years.  My doctor took it out today in his office, he didn't know what it was.  It was hard and white and about the size of a pencil eraser and kind of round.   I couldn't move it around under the skin.  He said he had to cut it out and then he scooped a little lower to make sure he had it all.  What are the chances that this is cancer?  It was never painful or red.  Just a lump.  It appeared to be dense white tissue.  What do you think it could be?\n\n",
    "posted_time": "Post  by birdy » Tue Oct 11, 2005 4:15 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=23111&sid=886fa469462e198fde10d6986769cc61#p23111"
  },
  {
    "author": "Dr. A. De la Guerra  Medical Doctor Posts: 70 Joined: Fri Aug 26, 2005 8:00 pm Gender: Male Location: Lima, Peru  Contact:   Contact Dr. A. De la Guerra       Yahoo Messenger",
    "title": "[no title]",
    "content": "Hi birdy, most lumps and swellings are benign. Frequent causes of skin lumps of the back are sebaceous cysts, lipomas, skin cancer, abscess, and melanoma. Skin cancers, including melanoma, have different behaviour and appearance from the lump you described. An abscess is painful, and develops in a few days, and has distinct manifestations, others that the one you had.  Lipomas are the most common benign tumors of the body; they are growth of fatty tissue cells and can develop in almost any organ of the body, but most commonly in the subcutaneous layer (fat) just below the skin. They grow slowly and are nonpainful. Sometimes, depending upon where in the body and what surrounding tissue or organ the lipoma has affected, they may swell and grow until inflammation goes away.  Other common cause of lumps in that site are sebaceous cysts, also called epidermal or epidermoid cysts. Sebaceous cysts most often arise from swollen hair follicles and are usually found on the face, neck, and trunk (back). They are slow-growing, painless lumps beneath the skin. At times, they may become inflamed and tender.  There are other less frecuent causes of back lumps, and most are noncancerous. I believe it is a lipoma or other benign tumor. But as always, the pathologist has the last word. Good luck.\n\n",
    "posted_time": "Post  by Dr. A. De la Guerra » Tue Oct 11, 2005 6:28 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=23123&sid=886fa469462e198fde10d6986769cc61#p23123"
  },
  {
    "author": "amicyco2  Guest Posts: 6 Joined: Sat Sep 10, 2005 9:08 am Location: Pahrump, NV",
    "title": "Is my husband cured of Melanoma?",
    "content": "My husband had a stage II malignant melanoma on his knee in 1986 and had it surgically removed.  He underwent a gallium scan and was told to do so every year to look out for reoccurance which he hasn't done since the first one.  He does get basal cells and squamous cell carcinomas regularly removed every year as he is very fair complected and is out in the sun minimally.  Is it possible that he is cured forever of melanoma?  I've heard that melanoma can come back inside the body even after many years of original removal from the skin.  Is this possible?  Any help would greatly be appreciated.  Concerned in NV\n\n",
    "posted_time": "Post  by amicyco2 » Sat Sep 10, 2005 9:32 am",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=20269&sid=886fa469462e198fde10d6986769cc61#p20269"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi amicyco2, The recurrence of melanoma may appear at the site of the original location or in another area of the body. Regardless of whether his risk factors are determined to be low, intermediate or high risk, just the fact alone that he has had melanoma in the past places him at risk for recurrence. If the advice of his physician was that he is to have yearly scans and follow-up evaluations then it would certainly be in his best interest to do as he was instructed. Sincerely, Rntdj\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Sun Sep 11, 2005 8:19 am",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=20347&sid=886fa469462e198fde10d6986769cc61#p20347"
  },
  {
    "author": "Poppy  Guest Posts: 1 Joined: Wed Aug 03, 2005 2:01 pm Location: Ireland",
    "title": "Lump on back of head",
    "content": "Hi,  My brother has a golfball size lump on the back of his head. It doesn't protrude to a great extent. I am very worried for him. He is hesisitant to go to a doctor as he has young children and doesn't want to find out anything bad.   He says it hurts at times. I have read that if something like this hurts it is a better sign that if it doesnt hurt. Am I right?  Can you give me any advice as to what it could be? Good or bad? I am so worried.  Thank you for your time.\n\n",
    "posted_time": "Post  by Poppy » Wed Aug 03, 2005 2:08 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=18040&sid=886fa469462e198fde10d6986769cc61#p18040"
  },
  {
    "author": "Jennifer R.N.  Guest Posts: 40 Joined: Tue Jul 05, 2005 10:07 pm Location: Michigan",
    "title": "See the doc.....",
    "content": "I know sometimes people don't want to go to the doctor for fear of finding something out that is bad but not finding out doesn't make it go away, you know? It may be just a cyst of some kind and you'll find out everyone is worried over nothing.  Or if it is something then maybe if he gets it checked out early enough it can be removed and everything will be fine rather than waiting until it spreads into something that can't be removed. They'd probably just do a little neddle biopsy to check. He really should be seen.\n\n",
    "posted_time": "Post  by Jennifer R.N. » Sat Aug 06, 2005 11:14 am",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=18197&sid=886fa469462e198fde10d6986769cc61#p18197"
  },
  {
    "author": "Romie1234  Guest Posts: 1 Joined: Wed Aug 03, 2005 3:36 pm Location: San Antonio",
    "title": "I just found out I have Melanoma",
    "content": "I just found this out about an hour ago and am freaking out!  The doc's office is going to fax me the pathology report.  What if the cancer has spread?  How will I know?\n\n",
    "posted_time": "Post  by Romie1234 » Wed Aug 03, 2005 3:40 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=18046&sid=886fa469462e198fde10d6986769cc61#p18046"
  },
  {
    "author": "Jennifer R.N.  Guest Posts: 40 Joined: Tue Jul 05, 2005 10:07 pm Location: Michigan",
    "title": "Melenoma.....",
    "content": "The doctor will remove the melenoma and do some other tests to make sure there is no metastisis. (sp?)  You'll most likely have some X-rays, CT scans, blood work, etc. That kind of thing. Im sorry about your diagnosis but rest assured that if caught early enough melenoma is almost always curable by surgical removal.\n\n",
    "posted_time": "Post  by Jennifer R.N. » Sat Aug 06, 2005 11:10 am",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=18196&sid=886fa469462e198fde10d6986769cc61#p18196"
  },
  {
    "author": "NazimTok  Guest Posts: 1 Joined: Sat Jul 09, 2005 1:00 am",
    "title": "Do I have cancer?",
    "content": "I'm a very healthy 18 year old male.  approximately 5'9\" or 5'10\" 145 pounds, and works out regualarly.  For at least the last year or two, I've had a lump under the skin of my right butt cheek.  Up till now, I thought that it was like a pimple or something.  All of the sudden I've gotten worried that it possibly might be cancer.  I don't have medical insurance so I can't have it checked out.  Advice would be appreciated.\n\n",
    "posted_time": "Post  by NazimTok » Sat Jul 09, 2005 1:05 am",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=16552&sid=886fa469462e198fde10d6986769cc61#p16552"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "You should have it checked out if it changes in size or shape or a new one arises somewhere else. Otherwise follow it for the coming few weeks. It should resolve by then. If it doesn't or If you develop any new symptoms have someone look at it.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Thu Jul 14, 2005 6:10 am",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=16794&sid=886fa469462e198fde10d6986769cc61#p16794"
  },
  {
    "author": "shnswms  Guest Posts: 3 Joined: Tue Jun 07, 2005 1:30 am Location: Virginia",
    "title": "Need help for my mother",
    "content": "My mother is 58 years old. About a month ago she noticed a bit smaller then a dime, raised reddish brown surface, has a white crust on the top of it, and looks a little inflammed on her lower right leg. She went to the doctors today and 2 of the top doctors there had never seen anything like it before. They want her to see a dermatologist asap but she cannot get an appointment till October. I want her to get this thing removed and biopsied immediately and I am not willing to let her wait until October. They did not come out and say they thought it was skin cancer but my mother assumes this. Any info would be great. Thank you.\n\n",
    "posted_time": "Post  by shnswms » Tue Jul 05, 2005 5:41 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=16339&sid=886fa469462e198fde10d6986769cc61#p16339"
  },
  {
    "author": "Jennifer R.N.  Guest Posts: 40 Joined: Tue Jul 05, 2005 10:07 pm Location: Michigan",
    "title": "Skin cancer....",
    "content": "I myself have just recently found some unusual moles on my back and I went in to have them looked at. My doctor said he didn't think they were anything but since I was a Nurse and we tend to \"watch things\" (as he put it) he removed most of both of them and sent them to be biopsied. Well they came back as Clarks dysplastic Nevi. This means that theyre not cancer but are more likely to become cancerous. He recommend me to a surgeon to get the rest removed just to err on the side of precaution. I would recommend the same thing to your Mom. Better safe then sorry. It doesn't sound like a Melanoma but more like maybe a Basal cell or a squamous cell carcinoma. Maybe it's neither and it's just an ugly mole but I would demand they remove it and have it biopsied. I know people don't like to do that with Doctor's sometimes, especially older people, but sometimes that's what you have to do. Sometimes you have to MAKE them ake care of you. What's it gonna hurt them to remove it and send it away. That's my advice anyway. Hope everything goes well and it turns out to be nothing.\n\n",
    "posted_time": "Post  by Jennifer R.N. » Tue Jul 05, 2005 10:15 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=16352&sid=886fa469462e198fde10d6986769cc61#p16352"
  },
  {
    "author": "Mark1234  Guest Posts: 1 Joined: Mon May 09, 2005 10:04 am Location: Canada",
    "title": "Round lump at the bottom of my penis",
    "content": "Hi I live in canada and I have noticed a round lump near the the middle of the bottom of my penis. I'm not sexually active and I squeezed it and a white puss came out, now when I squeeze it blood comes out and my balls are very sore. It was red and now I put some atibiotics that I had at home and now it looks white not really getting any better these days, this is also quit recent I had it for maybe 4 days maybe longer thats when I found it.  Please help me out on what this could be, and will it go away?\n\n",
    "posted_time": "Post  by Mark1234 » Mon May 09, 2005 10:14 am",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=13512&sid=886fa469462e198fde10d6986769cc61#p13512"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi Mark1234, Sebaceous/epidermal cysts are round, firm, and the contents or discharge is a foul smelling cheeselike material. If they happen to become inflammed or infected the result is pain and tenderness. People have the tendency to \"squeeze\" these areas (usually makes the problem worse) Call your physician, have the area evaluated, it may need opened and drained along with a cycle of antibiotic treatment. Sincerely, Rntdj\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Mon May 09, 2005 7:54 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=13534&sid=886fa469462e198fde10d6986769cc61#p13534"
  },
  {
    "author": "rdrmom777  Guest Posts: 4 Joined: Sat Apr 16, 2005 12:01 pm Location: USA",
    "title": "Actinic Keratosis",
    "content": "Hi,  Visited the dermatologist last week to get a baseline on moles, etc.  I am having one \"questionable\" dark mole removed.  She was concerned about my forehead and some possible \"AKs\".  I have a number of allergies and told her that this lesions have been here for years.  She prescribed some topicort to use twice a day for two weeks to see if they were gone upon next visit.    My question:  If these are gone, can we then be sure that they are not AK's that will come back?  Places on my face have always itched and burned with any kind of sunscreen or makeup with SPFwhen in the sun.  I had decided that this was just my super sensitive skin.  Should I be overly concerned, or suggest she remove anything questionable to be on the safe side?  Thank you so much.\n\n",
    "posted_time": "Post  by rdrmom777 » Sat Apr 23, 2005 7:56 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=12802&sid=886fa469462e198fde10d6986769cc61#p12802"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Hi there, I think the way your dermatologist is proceeding to manage your lesions is prudent. If your lesions go away after taking topical steroids then they are most probably allergic. If they don't go away then she may remove any more lesions that she suspects. It really depends on how suspicious the lesions appear to your doctor. I personally think you are being managed correctly. Let me know how everything turns out.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Sun Apr 24, 2005 4:55 am",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=12817&sid=886fa469462e198fde10d6986769cc61#p12817"
  },
  {
    "author": "Marcbolan  Guest Posts: 1 Joined: Sun Mar 06, 2005 5:35 am Location: Lincoln UK",
    "title": "Small white bumps on chest and back! Need advice Please!",
    "content": "Hi there,  My husband was giving me a back massage and he noticed some smallish white bumps on my lower back that look like scars. i also have them on my chest.  The ones on my chest have been there for about 2 years but I did not know about the ones on my back. They are not spots as nothing seems to come out of them. They are only slightly raised and do not hurt or itch! If anyone knows what they could be please let me know.  Thank you\n\n",
    "posted_time": "Post  by Marcbolan » Sun Mar 06, 2005 5:37 am",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=10411&sid=886fa469462e198fde10d6986769cc61#p10411"
  },
  {
    "author": "Dr. Jeffrey Gordon  Medical Doctor Posts: 127 Joined: Sun Jan 05, 2003 5:22 pm",
    "title": "Skin spots",
    "content": "Thanks for posting your question here at The Lounge.  Without seeing what you describe, it is difficult for me to comment fully.  Nevertheless, if the spots have been there for a long time, then that usually implies something benign.  This not is not a fool proof rule, however.  I would jave your doctor check the spots or have a Dermatologist evaluate them.  You may want to consider posting this question on the Medicine Forum.  Some one there, other than a cancer specialist, may be able to help you further.\n\n",
    "posted_time": "Post  by Dr. Jeffrey Gordon » Sun Mar 06, 2005 7:02 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=10474&sid=886fa469462e198fde10d6986769cc61#p10474"
  },
  {
    "author": "kb9umb  Guest Posts: 2 Joined: Tue Jan 18, 2005 10:05 am Location: Illinois",
    "title": "Malignant Melanoma treatment",
    "content": "Hello  I have malignant melanoma and have several malignant mets in the liver lungs and soft tissue. I had interferon at the first diagnoses and a cliinical trial of valcade and temodar lst year. The melnoma has become very aggresive now and they out me back on interferon low dose. I was wondering if you had an opinion on the itreatment I am on now. I thought that once I had interferon once that i couldn't get back on it. ( my oncologist said it was ok to do it again) ? How effective can this be for me?                                                                        Thanks\n\n",
    "posted_time": "Post  by kb9umb » Tue Jan 18, 2005 10:16 am",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8272&sid=886fa469462e198fde10d6986769cc61#p8272"
  },
  {
    "author": "Dr. Jeffrey Gordon  Medical Doctor Posts: 127 Joined: Sun Jan 05, 2003 5:22 pm",
    "title": "Melanoma",
    "content": "My apologies for the delay in your getting a response to your question.  There has been a backlog of questions here at The lounge.  We are endeavoring to respond to all questions, including old ones.  As more of us are responding to questions, we hope to be able to respond to new questions in a timely manner.   Retreatment with interferon can be done, especially if it worked the first time it was tried.  Without knowing the specifics of your case, it is difficutl  to answer your questions with specifics.  Retreatment with interferon may not be as successful as the first time or may not last in its benefit as the first time.  The standard does to use is not 100% certain, although the literature would suggest that higher doses give better initial responses, but that the toxicity of higher doses can be difficult to tolerate.  The long-term benefit of high doses versus lower doses is not 100% clear.  Have you been evaluated for any type of vaccine study?  I don't know if your situation applies to such a study, but it would not be unreasonable to explore that option.  There may also be various clinical trials looking at experimental drugs that could be next options for you.  The larger hospital systems have such trials.  My best to you.  Jeffrey A. Gordon, M.D.\n\n",
    "posted_time": "Post  by Dr. Jeffrey Gordon » Sun Mar 06, 2005 7:00 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=10473&sid=886fa469462e198fde10d6986769cc61#p10473"
  },
  {
    "author": "matteo72  Guest Posts: 1 Joined: Mon Jul 19, 2004 11:40 am Location: cerea",
    "title": "Radiodermatitis",
    "content": "Dear sirs,           I am an Italian 32-year-old mechanical engineer and I am very happy to have found your website, where it is possible to receive professional and competent answers to medical problems about dermatology.       The answer I need does not involve any problem of health of me or any member of my family but it is of prime importance for my private life, therefore I hope that you would not regard my question as trivial.       During the past years, I have been involved in reading books about religion ( I am a Christian Catholic ) and specifically about miracles; these matter is now of  big importance for me and I am reading in my spare time everything I can find about the official miracles that the Church regards as \" scientifically non-explainable \" and as \" result of direct intervention of the supernatural powers \".       Specifically, I have been involved in reading everything I can find about Dr. Manuel Nevado Rey, orthopedic surgeon, who is said to have been miraculously cured  from chronic radiodermatitis in 1992 through the intercession of Josemaría Escrivá.      Thia fact has been later on the basis for the canonization of Escrivá in 2002.       I admit that this fact has interested me tremendously: according to the Vatican, Mr. Nevado Rey in the beginning of the 90s suffered from \" advanced cronichal dermatitis \", an illness with \" no known cure \" that is always \" chronic and progressive, heading towards malignancy, never towards recovery \".      After having received a prayer card of blessed Josemaría Escrivá de Balaguer, Dr. Rey´s illness \" began to improve and after approximately a fortnight, the damage caused by the disease disappeared and my [his] hands became perfectly healed \"      The complete review of the whole process can be found here.      Here is the link of the Vatican site on the argument:  Click here!  In case you do not have Internet access available, I can send you both of the pages.      Other information are available on the internet on the subject, even if I could not find all the photos about Mr. Nevado´s hands or other evidence about what happened.       Regarding all this, I would like to hear your opinion about if advanced chronic dermatitis really is an illness with no known cure.       What is stated in the site http://www.vatican.va and in the site http://www.josemariaescriva.info  is enough evidence to state if what happened to Dr. Nevado has to be considered as a miracle or not or further elements are needed ?       Moreover, I have read in some publications that cancer can, in some very rare case, get cured spontaneously (i.e. without surgery or pharmacological intervention – I think this is called “ spontaneous recovery “); can this be the case of Dr. Nevado?       In the Vatican site is stated that “ to date, no case of a spontaneous cure from cancerous chronic radiodermatitis has ever been recorded in medical literature “, is this true?       At last ( I hope I did not abuse of your patience ), where is possible to find more documentation and clinical evidence of any case of spontaneous recovery from cancer reported in the medical literature ?       I deeply thank you if you can provide me with some help about this subject and, again, I hope I am not abusing of your time.       I would welcome any suggestion or opinion from you about the subject as well.       Many regards,            Matteo Martini           Viale Ungheria, 58      37053 CEREA VR           ITALY      matteomartini72@msn.com\n\n",
    "posted_time": "Post  by matteo72 » Tue Jul 20, 2004 3:44 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=4173&sid=886fa469462e198fde10d6986769cc61#p4173"
  },
  {
    "author": "Dr. Jeffrey Gordon  Medical Doctor Posts: 127 Joined: Sun Jan 05, 2003 5:22 pm",
    "title": "Radiodermatitis",
    "content": "My apologies for the delay in your getting a response to your question.  There has been a backlog of questions here at The lounge.  We are endeavoring to respond to all questions, including old ones.  As more of us are responding to questions, we hope to be able to respond to new questions in a timely manner.  I hope that you will visit The Lounge again and that you next experience here will be better than your last.  I would suggest that you speak with a Dermatologist or a cancer specialist whom specializes in the skin.  regarding your question about spontaneous cures of cancer, that is something that doesnot tend to ccur in the vast majority of patients.  However, there have been reports ofver the years of such occuring.  Many cancer doctors have had a patient now and then with a cancer that has appeared to disappear with treatment.  For most of those patients, the cancer really is not gone, but only with a residual microscopic area that cannot be seen, only later to grow and to reappear.  However, sometimes a recurrence does not occur.  Perhaps there is something with the body's immune mechanisms that kicks into gear.  There is a lot about this topic that is not understood.  Jeffrey A. Gordon, M.D.\n\n",
    "posted_time": "Post  by Dr. Jeffrey Gordon » Sun Mar 06, 2005 6:55 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=10472&sid=886fa469462e198fde10d6986769cc61#p10472"
  },
  {
    "author": "tomhoward  Guest Posts: 1 Joined: Tue Jun 08, 2004 5:39 am Location: Clarkston, MI",
    "title": "Cannot find source of melanoma.",
    "content": "A surgeon found a tumor on my dad's small intestine while operating to correct an ulcer. The biopsy of the tumor \"supports a diagnosis\" of melanoma. However, the source of the melanoma on the skin cannot be found.   How common is this that the source cannot be found?  The oncologist noted on the request for scans that the reason was colon cancer. This may be a stupid question, but can colon cancer also be melanoma?  Thank you for your time.\n\n",
    "posted_time": "Post  by tomhoward » Tue Jun 08, 2004 5:44 am",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3611&sid=886fa469462e198fde10d6986769cc61#p3611"
  },
  {
    "author": "Dr. Jeffrey Gordon  Medical Doctor Posts: 127 Joined: Sun Jan 05, 2003 5:22 pm",
    "title": "Melanoma",
    "content": "My apologies for the delay in your getting a response to your question.  There has been a backlog of questions here at The lounge.  We are endeavoring to respond to all questions, including old ones.  As more of us are responding to questions, we hope to be able to respond to new questions in a timely manner.  I hope that you will visit The Lounge again and that you next experience here will be better than your last.  Sometimes the primary site of origin of a melanoma cannot be found.  Melanomas can arise in areas other than the skin.  There is an interesting phenomenon seen in some cancers, including melanomas, in that the sites that have spread to other areas of the body can feedback and cause the original site not to grow and thus not be detected.  Also, there is a phenomenon seen in some cancers, including in melanoma,in  that the immune mechanisms of the body may be able to deal with the primary site of disease but are not able to deal with the sites that have spread.  There is still a lot not known about why some cancers spread but the original site cannot be detected easily or readily.  Jeffrey A. Gordon, M.D.\n\n",
    "posted_time": "Post  by Dr. Jeffrey Gordon » Sun Mar 06, 2005 6:51 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=10471&sid=886fa469462e198fde10d6986769cc61#p10471"
  },
  {
    "author": "FearfuL  Guest Posts: 16 Joined: Sat Feb 19, 2005 8:46 pm Location: here",
    "title": "Biopsies - safe?",
    "content": "Hello there.  I had a mole biopsy done a few days ago (the whole thing wasn't removed, just part of the top to check out; a shave I guess).   So, I don't know exactly what I was searching for on the net last night, but I stumbled upon this page.  He freaked me out a bit. Mind you, he's NOT a doctor. He's a 'researcher' and philosopher. All his sources seem to be from the internet too.   He's basically saying everyone should say no to a biopsy because that actually spreads the cancer if what you have tested is indeed cancer. Does anyone believe this guy or know if this has any merit? Or is he just a guy who holds no credibility?\n\n",
    "posted_time": "Post  by FearfuL » Sat Feb 19, 2005 8:52 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=9691&sid=886fa469462e198fde10d6986769cc61#p9691"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi Fearful, I viewed the link to the web page and in my opinion I would put very little faith in one who has no medical backround not to mention that it is incorrectly posted information. Breast cancer and prostate cancer is the most commonly \"diagnosed\" cancer. However, the \"death rate\" from lung cancer exceeds both and kills more men and women. To discourage breast self exams is ridiculous, as this is sometimes the reason for many women being diagnosed at an earlier stage. Initially because of their different or abnormal findings. The reason different types of cancer are being diagnosed is because of better technology. As for discouraging any biopsy, types of cancer are identified, and the best treatment options for that particular type of cancer are initiated. As for the question \"about believing this guy\" I don't.  As for your other post about bacitracin. Bacitracin ointment is an antibiotic/bacteriocide that is absorbed in \"minimal\" amounts through normal skin (not large open areas from burns etc.) and causes no harm, unless of course one is allergic to the drug. The reason substances may be absorbed through the skin is because of its vascular nature. The only true overdose with the medication bacitracin (not the ointment based which by the way is never taken internally) is with the intramuscular or intraveneous form which use has been mostly replaced with such medications as  penicillins, cephalosporins, and vancomycin. I hope this was helpful. Sincerely, Rntdj\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Sun Feb 20, 2005 3:43 am",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=9695&sid=886fa469462e198fde10d6986769cc61#p9695"
  },
  {
    "author": "BooneDog88  Guest Posts: 5 Joined: Wed Nov 10, 2004 6:55 pm Location: Greenville",
    "title": "Lump on the outside part of my ankle",
    "content": "Hey,    I am a sixteen year old male.  I am pretty confused and have used this site before, so I need to ask you a question.  I have a lump on the outside part of my ankle.  It has rough skin but doesnt hurt.  Its a pretty big lump and the other day I looked at it and it was bright purple, but usually its just bright red.  Im not even sure if this is the right forum or not, but could someone help me figure out what this is?  Thanks  BooneDog88\n\n",
    "posted_time": "Post  by BooneDog88 » Sat Feb 05, 2005 11:07 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8960&sid=886fa469462e198fde10d6986769cc61#p8960"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Hi there, It's always difficult to diagnose swellings and lumps without examination. I would therefore advise you to get an appointment with your doctor. It sems from what you say that it is a callus type lump (a corn). This can be the result of wearing tight shoes. It could also be a wart which is caused by a viral infection (human papilloma virus). Treatment is usually very simple using salicylic acid preparations.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Sun Feb 06, 2005 2:11 am",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8966&sid=886fa469462e198fde10d6986769cc61#p8966"
  },
  {
    "author": "silentnight  Guest Posts: 3 Joined: Tue Jan 25, 2005 10:38 pm Location: Rio Grande Valley  Contact:   Contact silentnight       AOL",
    "title": "A mole formed on my ear",
    "content": "About a year ago, a mole formed on my ear.  At first, I thought it was dirt, but it never came off.  People began to notice the change but they take it as \"wow, I never noticed you had a mole there\".  About 4 months ago, another mole has appeared on the back of my neck.  I am 16 years old, 17 in March, and was wondering if this was common or normal.   The mole on my ear is not all flat and very dark.  The one on my neck is a little harder to inspect, but I can see that it is very light and looks like someone marked me with a marker.  Is there anything I should be worried about?\n\n",
    "posted_time": "Post  by silentnight » Tue Jan 25, 2005 10:52 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8573&sid=886fa469462e198fde10d6986769cc61#p8573"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Hello, I really can't give you a definitive answer as to what the nature of your 'moles' are given the clinical limitations of the internet. However, have a look at this page, it will give you an idea of when to suspect a mole is cancerous or not.   Best regards,\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Wed Jan 26, 2005 12:18 am",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8578&sid=886fa469462e198fde10d6986769cc61#p8578"
  },
  {
    "author": "silentnight  Guest Posts: 3 Joined: Tue Jan 25, 2005 10:38 pm Location: Rio Grande Valley  Contact:   Contact silentnight       AOL",
    "title": "thank you",
    "content": "Thank you for replying to my question. I really apprciate it.  Jackie\n\n",
    "posted_time": "Post  by silentnight » Wed Jan 26, 2005 7:47 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8616&sid=886fa469462e198fde10d6986769cc61#p8616"
  },
  {
    "author": "silentnight  Guest Posts: 3 Joined: Tue Jan 25, 2005 10:38 pm Location: Rio Grande Valley  Contact:   Contact silentnight       AOL",
    "title": "thanks again",
    "content": "I got to take a look at the website and it really helped me.  Thanks again for making my moles and I feel normal.  Jackie\n\n",
    "posted_time": "Post  by silentnight » Wed Jan 26, 2005 8:42 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8618&sid=886fa469462e198fde10d6986769cc61#p8618"
  },
  {
    "author": "FranklinePen  Guest Posts: 1 Joined: Mon Aug 16, 2004 9:18 am Location: Ohio",
    "title": "Home Sunlamps",
    "content": "I am looking into getting a personal home sunlamp to use for the treatment of acne. I have used acne medications without much luck and I have noticed that sun exposure clears my face up. Do home sunlamps have any more detrimental effects than commercial tanning salons? Are they more harmful than sun exposure? Any help would be appreciated. Thank you.\n\n",
    "posted_time": "Post  by FranklinePen » Mon Aug 16, 2004 9:20 am",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=4580&sid=886fa469462e198fde10d6986769cc61#p4580"
  },
  {
    "author": "helping hands  Guest Posts: 1 Joined: Mon Jan 24, 2005 7:32 pm Location: nurse",
    "title": "Home sunlamps",
    "content": "To reply to your comment, I don't think there is much difference between home sunlamps and tanning beds. Any time there is more exposure to harmful effects of the sun's rays even if they are man made, the body has a negative reaction to it. I think that you should limit your amount of exposure to these lamps and make sure that you provide yourself with the necessary protection with sunscreen of spf of 15 or higher. You should also try washing your face with Phisoderm or another gentle soap. This helps with acne. And don't scrub your face hard. Wash gently because scrubbing will more than likely make your face break out further. You can also try using non-comedogenic make-up products. (They won't clog your pores.) How bad is your acne, and does stress cause it to flare up? I would avoid these sun lamps until they have been studied further. I worry about skin cancer with the use of these lamps and that is much worse than having acne that will change once your hormones decide to settle down. Hope this helps.\n\n",
    "posted_time": "Post  by helping hands » Mon Jan 24, 2005 7:43 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8524&sid=886fa469462e198fde10d6986769cc61#p8524"
  },
  {
    "author": "firemom31  Guest Posts: 12 Joined: Mon Nov 15, 2004 8:49 pm Location: Ohio",
    "title": "Mole located directly over my spine",
    "content": "I have a mole located directly over my spine, between my shoulder blades. In the past 6 mos or so it has become itchy and I have burning pain in it at night (feels like a lit cigarette on my back). I have recently started have back pain in the same area that feels like it is in my spine. I asked my husband to take a digital pic of it since I can't see it, and I was a bit concerned since it looks like a med school example of a cancerous lesion. I have no medical insurance and do not want to pay for an expensive dermatologist if this is likely to be something benign, but I don't want to put it off if it could be something more sinister. Anyone care to hazard a guess at what the odds are that it is a malignancy?\n\n",
    "posted_time": "Post  by firemom31 » Thu Dec 30, 2004 6:33 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=7519&sid=886fa469462e198fde10d6986769cc61#p7519"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Dear firemom31, You understand that no one could possibly reach a diagnosis without a direct examination with any degree of certainty. Having said that there are certain criteria in a mole that signal a red alert. Itching in a mole is one of these warning signs. Please have a look at our mailgnant melanoma page for more information on warning signs of malignancy. I think you should have it checked out and you may even need a biopsy taken.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Fri Dec 31, 2004 8:22 am",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=7540&sid=886fa469462e198fde10d6986769cc61#p7540"
  },
  {
    "author": "firemom31  Guest Posts: 12 Joined: Mon Nov 15, 2004 8:49 pm Location: Ohio",
    "title": "[no title]",
    "content": "Thank you for your quick reply. I guess I was looking for affirmation of what I already suspect. I have no medical insurance, but I will contact the health department asap. Thanks again.\n\n",
    "posted_time": "Post  by firemom31 » Fri Dec 31, 2004 10:38 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=7573&sid=886fa469462e198fde10d6986769cc61#p7573"
  },
  {
    "author": "fearuvhorses  Guest Posts: 13 Joined: Tue Jun 10, 2003 7:57 pm Location: Alberta, Canada",
    "title": "Malignant Melanoma - Heart Disease - A Link?",
    "content": "Is there a link between a new diagnosis of malignant melanoma (excised - borders clear) and worsening angina?  Does the presence of one change the outcome of the other?\n\n",
    "posted_time": "Post  by fearuvhorses » Sat Mar 27, 2004 1:42 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2941&sid=886fa469462e198fde10d6986769cc61#p2941"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Malignant melanoma - heart disease - A link?",
    "content": "Dear Fearuvhorses,  If you mean that there is a causal link between angina and malignant melanoma. i have not heard of one.  The most famous relation between malignant melanoma and heart disease is that malignant melanoma is notorius for sending metastases to the pericadium (membrane surrounding the heart).  So, if a patient has chest pain and history of malignant melanoma, i would suggest doing an echocardiogram to see whether there is any pericardial effusion (fluid) surrounding the heart which will be an indication of this possibility.  If this patient is known to have coronary disease, a new diagnosis of malignant melanoma could have put a stress on this patient and hence precipitating a new attack of angina.  The prognosis of malignant melanoma is actually determined by the depth in the skin to which it has grown not by the surgical margins and whether the tumour has metastasized to any where else.  If malignant melanoma has metastasized to distant organs, the prognosis is usually bad as most of malignant melanomas do not respond well to treatment whether chemotherapy or radiation.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Sat Mar 27, 2004 2:06 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=2942&sid=886fa469462e198fde10d6986769cc61#p2942"
  },
  {
    "author": "Guest",
    "title": "Skin rash",
    "content": "what is a rash that spreads rapidly when scratched?has small water type blisters!  Spreading all over legs and back.\n\n",
    "posted_time": "Post  by Guest » Wed Feb 19, 2003 11:23 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=383&sid=886fa469462e198fde10d6986769cc61#p383"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Skin rash",
    "content": "Dear Guest,  Skin rashes are best evaluated by doctors before any treamtent is taken over the counter on the part of the patient like creams or ointments.  What you are describing is associated in my mind with skin rash caused by a virus more than any thing else, still the person who has the rash should see a doctor to be evaluated and given the proper treatment.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Thu Feb 20, 2003 1:59 pm",
    "category": "Oncology",
    "sub_category": "Skin Cancer",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=388&sid=886fa469462e198fde10d6986769cc61#p388"
  }
]