[
  {
    "author": "Jaime23  Guest Posts: 1 Joined: Wed Aug 04, 2010 6:53 am Gender: Male",
    "title": "I Quit smoking Cigarette's and I feel weak",
    "content": "Hey,  I have a problem I believe only a Doctor can solve.  Anyway to the problem, I'm a 23 yr old male and I have just recently quit smoking cigarettes of 8-10 yrs, I usually  smoke a pack and a half a day more or less. I have gone 2 months with out smoking and I'm done Forever! So, I have been working out and I can't do as much push ups as I use to and I feel like I'm heavier I usually was able to do 40-50 when I was smoking and I usually did 2 -3 reps of  push ups  now I'm to 30 push ups and I feel I'm at muscle failure  ( muscle failure- when I can't possibly lift anymore or my body wont respond right to put it short my muscle will feel like rubber and I can't possibly do anymore push ups after only 30... )this also happens when I shadow box. when I was smoking I could shadow box for about 20-30 mins without muscle failure now its like 10-15 mins and I'm at muscle failure . this is very frustrating it's almost like trying to run a 100 yard dash with 2 sleeping feet I just keep trying and trying but can't go any further. I'm worried about this seeing I need to work out because I'm training to become a athlete and I really need to get in shape and train. Is their anything I can do? is their something wrong with my muscle's? or are they going through some kind of nicotine withdrawal? I don't know but it's getting to the point of concern and I can't just go through 30 push up's and expect to be in tip top shape or expect to succeed in the training I'm going to have to go through with my mighty 30 push ups. Also I have been jogging  for about 20 mins a day I feel there is nothing wrong there seeing I am getting slightly better my lungs are opening up and I'm running longer. but the week after I quit I tried to jog/sprint ( lasted for 15 mins)  and I had the same problem my body felt really weak and my legs were almost at muscle failure.   So yea if there is anything I can do to better this problem please inform me.  If you need me to explain a little better please feel free to tell me.  Thank you for any help I get.\n\n",
    "posted_time": "Post  by Jaime23 » Wed Aug 04, 2010 8:25 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=99626&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p99626"
  },
  {
    "author": "Faye Lang, RN, MSW  Nurse Posts: 468 Joined: Thu Oct 30, 2008 7:01 pm Gender: Female Location: California",
    "title": "Re: I Quit smoking Cigarette's and I feel weak",
    "content": "Hi Jaime23,  Congratulations on stopping smoking!  What you are experiencing is most likely related to the \"healing crisis\" of stopping the influx of nicotine and tars into your body.  One pack of cigarettes per day deposits about one cup of tar and other residues into your lungs, and affects every system in your body.  Your body is reversing the effects of 8 to 10 years of smoking.  Symptoms that occur when a person stops smoking extend beyond removing nicotine from the body - that takes about a week.  But the repair and readjustment take longer, on average 2 or 3 months, but it can take less time or more time, depending on the individual and the amount smoked.  These symptoms include headaches or a general heaviness, nausea, sore throat, shaking, sweating, feeling cold, fatigue, increased appetite, problems with concentration, persistent cough (your lungs are ridding themselves of the accummulated tars and residues), runny nose, wheezing, shortness of breath, insomnia, indigestion and/or stomach pain, muscle aches and weakness, pain - stomach cramps, sore gums, pains in chest, pain in arms and legs, or pain anywhere!  There may also be mild depression or sadness, anxiety, boredome and loneliness, anger or irritability, since there are no longer cigarettes available to fill certain psychological needs.  Your symptoms appear to fall within those listed above, and will likely resolve with time, as you are already noticing with your lung capacity.  If they persist or increase, then it would be a good idea to have a doctor check your overall status.  If you have further questions, please feel free to ask.  Good luck to you!!\n\n",
    "posted_time": "Post  by Faye Lang, RN, MSW » Sat Aug 07, 2010 4:58 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=100026&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p100026"
  },
  {
    "author": "FRITZTA  Guest Posts: 1 Joined: Sun Jul 25, 2010 6:10 am Gender: Male",
    "title": "Having back spasms from Gym Workout on Tuesday.",
    "content": "My significant other has over done it in the gym. She had a back work out on Tuesday and it's keeping her awake with spasms now, what can she take for the pain & spasms? I have Flexeril and Motrin 800 on hand, but am unsure.\n\n",
    "posted_time": "Post  by FRITZTA » Sun Jul 25, 2010 6:48 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=98514&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p98514"
  },
  {
    "author": "Nietzschean  Guest Posts: 1 Joined: Tue May 05, 2009 6:35 pm Gender: Male",
    "title": "Foot falls asleep while walking/running",
    "content": "I work out 4 to 5 days a week 95 percent of my work out is cardio on a treadmill I do a walk/run. My time on the treadmill varies from some days 40 minutes, to others 60 minutes so probably an average around about 50 minutes, each weak 4 to 5 times. Somewhere between the 30th minute and either the end or last leg of my workout my right foot falls asleep completely.  My left foot isn't affected. The only cure I can get from it is to step off the treadmill for 1 - 2 minutes with my leg raised or to hold myself up on the treadmill handels until the feeling comes back in my foot, however after a few more minutes it somtimes returns  . I have switched shoes and even switched how tight or loose the shoes are tied and it still happens. Is there anything I can do to try and prevent this from sometimes ruining my work out?   Thank you.\n\n",
    "posted_time": "Post  by Nietzschean » Tue May 05, 2009 7:04 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=77057&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p77057"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: Foot falls asleep while walking/running",
    "content": "Hello, You have done the first thing I would recommend - check your footwear.  I would also have a podiatrist or foot specialist examine the foot for pes planus or pes cavus (low or high arch).  Foot abnormalities can affect everything biomechanically during running (from foot to knee to hip to low back).   The other consideration is the lumbar spine.  A pinched nerve in the lumbar spine can cause foot numbness.  With the high impact of running (all the way up to the spine) and if you have any history of back problems, the back should be checked.  Take care and let us know how it goes.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Mon Jun 08, 2009 6:19 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=80449&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p80449"
  },
  {
    "author": "saintsdog  Guest Posts: 1 Joined: Tue Feb 02, 2010 8:42 pm Gender: Male",
    "title": "Re: Foot falls asleep while walking/running",
    "content": "I have a similar problem, but my toes and sometimes the heals of each foot get numb and turn white.  I have a cronic nagging back pain when I get up in the morning, but after a while, the pain is mostly gone.  I don't run as much as the other patient, but after about 6 minutes into the work out, the numbness is progressing and won't get better until I get off of the treadmill.  Is it from poor circulation?  Thanks\n\n",
    "posted_time": "Post  by saintsdog » Tue Feb 02, 2010 9:02 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=90912&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p90912"
  },
  {
    "author": "hawk941  Guest Posts: 2 Joined: Mon Dec 07, 2009 7:59 pm Gender: Male",
    "title": "chronic calf strains(?) playing basketball",
    "content": "Hello,  I've been playing basketball for years and only over the past 2+ years have experienced these strains/pulls.  They start by feeling like cramps or charlie horses in either calf, top or bottom.  They have resulted in tears at least twice (bruising at the heel) – not sure if by overstretching or use.  I used to overstretch when I felt the first twinges, as well as afterwards.  I was told that when I tear the muscle, the stretching hinders the recovery, as it pulls apart the cartiledge.    I use neoprene + velcro wraps when I play.  I think I used to tighten them too much, which I no longer do.  I am fairly flexible and in fairly good shape for my age (43).  Thank You, Hawk941\n\n",
    "posted_time": "Post  by hawk941 » Mon Dec 07, 2009 8:16 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=88401&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p88401"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: chronic calf strains(?) playing basketball",
    "content": "Hi,  Basket ball injuries may be classified as - Sprains (mainly involve the ankle),  - Overuse injuries (Achilles tendinitis,patellar tendinitis) and  - Traumatic injuries.  Muscle pulls or tears (a type of traumatic injury) in basketball players occur primarily in the large muscles of the legs (gasrtocnemius and soleus). Your injury perhaps belongs to this type. Stretching  the thighs and calf muscles well and doing  warm-up exercises before playing helps to prevent them.  It is not advisable to do stretch the muscles in the acute phase following the injury.This will only cause more damage and fibrosis and delay recovery. Best wishes!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Sun Dec 13, 2009 7:27 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=88904&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p88904"
  },
  {
    "author": "hawk941  Guest Posts: 2 Joined: Mon Dec 07, 2009 7:59 pm Gender: Male",
    "title": "Re: chronic calf strains(?) playing basketball",
    "content": "Thank you for your response, Dr. Kamath.  I am very good about stretching out and warming up before games, yet I still have this problem, which I never had before the past two years.  And it does not feel like hamstring and groin pulls I have had in the past.  It comes on as more of a cramp but it remains for weeks afterwards.  Other than stretching and warming up, are there any other preventative measures I can take?  Is it possible that there is some underlying problem causing these strains that I never once experienced before the last 2+ years?  Thank You Again, Hawk941\n\n",
    "posted_time": "Post  by hawk941 » Thu Dec 17, 2009 10:43 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=89257&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p89257"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: chronic calf strains(?) playing basketball",
    "content": "Hi, Thank you for the update. It may be better for you to lay off and rest for a while. A temporary break from the sporting activities may allow the problem to settle down. Good luck!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Mon Jan 04, 2010 8:47 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=90549&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p90549"
  },
  {
    "author": "Strazy6149  Guest Posts: 1 Joined: Wed Nov 04, 2009 6:01 pm Gender: Male",
    "title": "Lump under the skin of the right nipple",
    "content": "I have been working out pretty regularly for the past couple years, about a month and a half ago i started taking some over-the-counter muscle enhancers. After 3 weeks of taking them i noticed a change in my sexual performance, i immediately stopped taking the enhancer. Now i have a lump under the skin of my right nipple for about a week, until today at the end of my workout it never had hurt before. If pressure is applied a certain way earlier in the day, there is a stinging sensation. What might it be?\n\n",
    "posted_time": "Post  by Strazy6149 » Wed Nov 04, 2009 6:22 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=85926&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p85926"
  },
  {
    "author": "ray36  Guest Posts: 2 Joined: Mon Nov 09, 2009 11:05 am Gender: Male",
    "title": "Re: Lump under the skin of the right nipple",
    "content": "Hey, what is the name of the over the counter muscle enhancers you are taking? It sounds like you are taking some sort of pro hormone, which can produce gyno. Gyno symptoms can be minimized by taking an Aromotose Inhibitor, for example letro or arimidex are good test chemicals, sadly this will only help. The only way to rid gyno completely is surgically. Best of luck\n\n",
    "posted_time": "Post  by ray36 » Mon Nov 09, 2009 10:23 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=86409&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p86409"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: Lump under the skin of the right nipple",
    "content": "Hi,  Benign processes that may affect the nipple-areolar complex include cysts,adenomas, papillomas, leiomyomas, duct ectasia, periductal mastitis, and abscesses.  You say that you were on some muscle enhancer-which makes it likely to be hormone- related.The following possibilities need to be considered...  a) The nodule that you are describing could be an enlarged Montgomery's tubercle(usually enlarges in women during pregnancy and lactation).This is due to an imbalance of the male/female sex hormones- which can theoratically at least cause an enlargement of the Montgomery's tubercle(whether these tubercles exist in males is disputed).  b) Hyperkeratosis of the nipple and areola is a rare dermatologic disorder characterized by asymptomatic, hyperpigmented and verrucous hyperkeratosis (could be 'nevoid' as well). Occurs more often in young women and in men under estrogen treatment, suggesting an underlying hormonal influence. The condition is usually refractory to  keratolytics, retinoids, & topical steroids.  In your instance, the probability of hyperkeratosis of the nipple is very likely. You should consult a dermatologist or a surgeon first. It is very likely that a biopsy may be needed. Best wishes!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Thu Dec 17, 2009 6:32 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=89289&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p89289"
  },
  {
    "author": "ray36  Guest Posts: 2 Joined: Mon Nov 09, 2009 11:05 am Gender: Male",
    "title": "growth/knot on upper back from squats?",
    "content": "I recently (last year) have incorporated heavy squats into my training program. Within in the last 6 months I have noticed a hard growth/knot forming where I rest the bar. The growth is about the size of half of a mans fist in a perfect oval form.I have no pain or discomfort in the area, it just looks sort of awkward. I went to a plastic surgeon and he thought it was a lipoma due to the shape and feel. He tried to remove it through liposuction but failed because he discovered it was a \"solid mass of some sort.\" He then cut a piece of it off and sent it in for a biopsy. Any ideas what this could be? I am almost certain it is from my bar placement and cannot be harmful. Thanks.\n\n",
    "posted_time": "Post  by ray36 » Mon Nov 09, 2009 11:15 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=86342&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p86342"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: growth/knot on upper back from squats?",
    "content": "Hi, If it happens to be a lipoma, it would be perhaps by chance. Your description makes it very likely that it is in some way related to the chronic weight-bearing.  Localized pressures over a period of time could cause 'callosities'.Consistency of these callosities is highly variable.Some of these could be soft like a lipoma and others could be firmer or even hard.  In some instances, if the chronic pressure happens to be localized to an area of a known 'bursa', it can inflamme and enlarge a bursa -- 'bursitis'.  One other possibility is localized trauma causing a hematoma (soft to begin with and later firmer due to 'organization').  The biopsy result will no doubt reveal its true nature. Best wishes!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Wed Dec 16, 2009 7:19 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=89213&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p89213"
  },
  {
    "author": "summervillebuck  Guest Posts: 1 Joined: Mon Dec 07, 2009 7:35 pm Gender: Male",
    "title": "Right pectoral muscle contractures while walking",
    "content": "I am 55 and recently had double bypass heart surgery in March - I am now up and about. However after two months after surgery I noticed that whenever I walked about 50-75' my right pectoral muscle would tightly contract to the point where I would have to stop walking until it relaxed. It has done this consistently. I went to a local hospital where tests were done and they said it was muscular and not related to my heart surgery and basically not to worry. I do not believe the issue is related to my heart but it is still an issue. I work in health care as an administrator and my cardiologist was not aware of any similar case. After 6 months the contractures have not gone away. Any ideas/help would be greatly appreciated.\n\n",
    "posted_time": "Post  by summervillebuck » Wed Dec 09, 2009 8:51 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=88609&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p88609"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: Right pectoral muscle contractures while walking",
    "content": "Hi, Spasms of pectoral muscles are well known. Some of which are explicable (those reported following sub-pectoral breast implants).Botox injections have been tried for this condition.  The pectoralis major muscle arises partly from the sternum.A coronary bypass surgery involves 'sternotomy' (division of the sternum).This is often closed at the end of the procedure using stainless steel wires.  There is no authentic explanation that i can offer for the spasms that you are experiencing. One may extrapolate the 'sub-pectoral implants' model and postulate that there is at-least a remote possibility It may be due to the irritation of the pectoralis major muscle caused by the wires.  'Secondary skeletal muscle spasm' is a term used by some for these types of spasms.  In patients who experience these spasms, it is a priority to exclude anginal pain or MI. Best wishes!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Mon Dec 14, 2009 3:08 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=88972&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p88972"
  },
  {
    "author": "bullfighhterswife  Guest Posts: 1 Joined: Fri Oct 30, 2009 1:37 am Gender: Female",
    "title": "my husband was run over by a bull, has a lump in abdomen..",
    "content": "My husband was run over by a bull on the 10th of Oct. and suffered a few injuries, sternum was bruised, chest protector saved it from being broke, bruised right kidney,stitches in his chin and lips and scrapes and bruises all over his limbs...he has now noticed that he has a lump about the size of a quarter just above his pelvic bone near the hip, (upper part) It is not noticeable by just looking at it, you can only feel it by pushing on the area. It is hard and does hurt when pushed on, when laying on left side and if he straightens up too fast. It doesn't hurt when he sneezes or coughs. He has had trouble urinating, but goes often. The doctors did a urine analysis and it came back negative for infection and blood. He does have black, smelly stool that has just recently developed.  He is worried that he has a hernia, should we be concerned or is it a muscle contusion? Please help ease my husbands worries.\n\n",
    "posted_time": "Post  by bullfighhterswife » Fri Oct 30, 2009 1:58 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=85267&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p85267"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: my husband was run over by a bull, has a lump in abdomen..",
    "content": "Hello, A change in stools to blackness can mean blood in the gastrointestinal tract.  And considering the recent trauma, he will need to be seen by a physician as soon as possible. They should also check the lump: inguinal hernia?  An ultrasound would better define the lump.  Take care.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Sun Nov 01, 2009 6:56 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=85534&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p85534"
  },
  {
    "author": "blackout0887  Guest Posts: 1 Joined: Wed Oct 14, 2009 8:02 am Gender: Male",
    "title": "Refusal of Medical Treatment",
    "content": "What can somebody do if they are refused medical treatment? I was in a car accident two days ago and was told by the ER to see my doctor two days later and I went to see them and they said that I could not been seen.\n\n",
    "posted_time": "Post  by blackout0887 » Wed Oct 14, 2009 8:08 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=83758&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p83758"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: Refusal of Medical Treatment",
    "content": "Hello, MVA injuries can last a long time - pain and dysfunction. In the US, to have medical coverage paid for by the car insurance, you will need to comply with the physician visits. Take care.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Sun Nov 01, 2009 6:53 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=85532&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p85532"
  },
  {
    "author": "PulledPain  Guest Posts: 5 Joined: Thu Sep 10, 2009 5:24 pm Gender: Male",
    "title": "Pulled chest , next steps unknown.",
    "content": "This sunday, i was at the gym doing my chest workout (which was DB bench press, chest flies, DB incline bench press, incline flies and barbell pullover respectively) without problem (my friend told me that my arm was too far back when i was doing flies, which placed alot of stress on the place where the chest, deltoids and bicep meet) . The day after, i noticed my right pec was in pain aside from the soreness, it has bothered me up to now. this pain has limited my mobility to extend my arm horizontally (especially movements moving my right arm behind me) and i feel pain when the right pec is being in use. it feels that i have pulled my pec more noticeably in the upper right pec.   Can you please give some information on what i am having symptoms of and how i can treat this. Also how long will recovery time take, because in 4 days it feels as if the strain has the kept the same symptoms (pain and movement limiting).   Thanks alot.\n\n",
    "posted_time": "Post  by PulledPain » Thu Sep 10, 2009 5:38 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=82416&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p82416"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: Pulled chest , next steps unknown.",
    "content": "Hello, This sounds like a pectoralis major strain/sprain.  Treatment is rest, ice and NSAIDS for 48-72 hours.  Switch to heat and gentle stretching after 72 hours.  After 1-2 weeks the muscle may be ready for light (light) weight training.  Gradual return to full weight routine will take 4-6 weeks minimum.  Take care.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Sun Sep 20, 2009 9:04 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=82996&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p82996"
  },
  {
    "author": "PulledPain  Guest Posts: 5 Joined: Thu Sep 10, 2009 5:24 pm Gender: Male",
    "title": "Re: Pulled chest , next steps unknown.",
    "content": "ty for reply, i'm here for an update  its been about a little over 2 weeks and my pain has subsided. but what is bothering me is that now there is a gap around the sternum toward the right (injured) pec. the gap shows the space between the pec major and minor, although it doesn't hurt i don't think i had such a gap before. I keep thinking that i torn the muscle right off something around there, my friend said something about surgery to reattach it ( but there isn't any pain, although just a little loss of strength). the pec does look smaller then my left one for sure and the incline of the injured pec is Much smaller then the left one.   I believe i rly injured my right pec minor , because i can tell from the size shrinkage.   I am very scared as to if i do need surgery, please help me.   ty for reply\n\n",
    "posted_time": "Post  by PulledPain » Wed Sep 23, 2009 5:34 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=83224&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p83224"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: Pulled chest , next steps unknown.",
    "content": "Hello, The pectoralis minor attaches from the rib cage to the coracoid process so it would not tear at or near the sternum.  http://upload.wikimedia.org/wikipedia/c ... _minor.png  If the pectoralis major ruptures, it does so at or near its attachment to the humerus.  So I do not think the pectoris minor or major is torn if you notice a defect near the sternum.  Take care.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Thu Sep 24, 2009 8:42 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=83239&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p83239"
  },
  {
    "author": "PulledPain  Guest Posts: 5 Joined: Thu Sep 10, 2009 5:24 pm Gender: Male",
    "title": "Re: Pulled chest , next steps unknown.",
    "content": "Ty for reply,  is it normal for the pec to still be weaker then the other uninjured pec even after 2.5 weeks? (because at the gym i couldn't lift as much with the injured pec). I also noticed when i do pushups, there seems to be some tightening afterwards around the place where the pec meets the bicep and front delts (some minor pain in front delts afterwards too). All in all i can't lift as much as i could before, so approximately how long until i will be back to normal?  i will be getting an Xray soon in the future to find out what happened, I will post back.  thank you\n\n",
    "posted_time": "Post  by PulledPain » Fri Sep 25, 2009 5:39 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=83258&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p83258"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: Pulled chest , next steps unknown.",
    "content": "Hello, Give the injured pectoralis muscles 4-6 weeks for complete healing.  In that time, ease up on the exercise intensity.  There should be no pain before or exercise otherwise the muscle or tendon will not heal in a timely manner. Seek out a rehab professional if the pain continues.  Take care.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Sun Oct 04, 2009 7:47 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=83435&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p83435"
  },
  {
    "author": "PulledPain  Guest Posts: 5 Joined: Thu Sep 10, 2009 5:24 pm Gender: Male",
    "title": "Re: Pulled chest , next steps unknown.",
    "content": "Doctor says i'm OK (: just gotta take it easy on the chest for little longer (i'll be more cautious and wait for an extra month). After chest exercises, it feels a little stiffer on the injured pec then the normal one , will this go away in time?  Thanks alot for your info!\n\n",
    "posted_time": "Post  by PulledPain » Wed Oct 07, 2009 7:15 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=83512&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p83512"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: Pulled chest , next steps unknown.",
    "content": "This should heal with time but need to use good sense in the exercise program to allow for healing.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Wed Oct 21, 2009 10:13 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=84339&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p84339"
  },
  {
    "author": "PulledPain  Guest Posts: 5 Joined: Thu Sep 10, 2009 5:24 pm Gender: Male",
    "title": "Re: Pulled chest , next steps unknown.",
    "content": "update, chest seems to be doing fine except a little diffrent when working out (stiffness around the place where the chest meets the armpit).  The only thing that is bothering me now is that my sternum cracks. It is just like cracking your knuckles, it gets really stiff and when i move my arms back, it will expand and make my chest 'pop'. it isn't painful, it is actaually relieving from the stiffness.   I heard about simular stories about people's chest 'cracking' like mines but can't find the cause / cure, can you shine some light on this?\n\n",
    "posted_time": "Post  by PulledPain » Tue Oct 27, 2009 5:45 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=85007&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p85007"
  },
  {
    "author": "yungjay  Guest Posts: 2 Joined: Wed Sep 16, 2009 10:10 pm Gender: Male",
    "title": "possible dislocated pinky?",
    "content": "i was playing in a football game about 2 weeks ago and had a violent collision with a teammate. i don't know what happened but i think my left pinky got caught between both of our facemasks. it was really swollen,painful and bruised pretty bad. the tip of my pinky is further from my ring finger  than the pinky on my right hand. just the other night i was examining it and popped it. i thought i popped it into place but i doubt i did. then last night i was moving my pinky around. i cant make a full fist. then i found out that that the joint under my fingernail felt weird. i was able to grab above the joint and move the whole tip of my pinky around. i feel like the bones or something are rubbing against eachother.i also feel a huge pop when i move the tip of my pinky in a certain way. now theres just minor pain and less sweeling but theres a huge lump around the joint. i've played in two games since the incident. i taped my pinky to my ring finger and it felt just fine. what should i do? i really don't want to miss any games this season.\n\n",
    "posted_time": "Post  by yungjay » Wed Sep 16, 2009 10:25 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=82652&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p82652"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: possible dislocated pinky?",
    "content": "Hello, You should be able to continue to play in games and practice with buddy taping the two fingers together. To determine any fracture, x-ray the finger. Otherwise protect the joint and finger as much as possible to allow time for healing. Gradual painfree range of motion will help restore full motion.  Take care.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Sun Sep 20, 2009 9:07 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=82997&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p82997"
  },
  {
    "author": "yungjay  Guest Posts: 2 Joined: Wed Sep 16, 2009 10:10 pm Gender: Male",
    "title": "Re: possible dislocated pinky?",
    "content": "Hello,  its been about a month since the injury to my finger. i've been playing in my games while wearing padded gloves and buddy taping my pinky. i have no pain in my pinky but i have this huge lump on the top of it? also i cant straighten the tip of it out or make a full fist.\n\n",
    "posted_time": "Post  by yungjay » Sat Oct 10, 2009 9:53 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=83590&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p83590"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: possible dislocated pinky?",
    "content": "Hello, This sounds about right but you should try to gentle move the joint passively during the day to restore normal function.  Easy does it though.  The bump will go down with time - perhaps 6 months.  Take care.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Wed Oct 21, 2009 10:10 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=84338&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p84338"
  },
  {
    "author": "ashort123  Guest Posts: 1 Joined: Mon Sep 21, 2009 6:14 pm Gender: Female",
    "title": "Chest Spasms While Working Out",
    "content": "Hi!   After about an hour of strength training, I moved to the StairMaster. A third of the way into my session on the machine I felt as if the inside of my chest was shaking. Everything under my collar bone down to the sternum was shaking. I continued with my workout thinking it would pass; however, even on the walk back to my apartment the area still felt unsteady. It wasn't until about twenty minutes later that I felt normal again. I've had my legs and arms twitch occasionally after a hard workout, but never like this. It was my first time on the Stairmaster in a while; however, I run 4 days a week (3 miles). I just wanted to make sure this wasn't something to worry about.   Thanks! AJ\n\n",
    "posted_time": "Post  by ashort123 » Mon Sep 21, 2009 6:23 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=83108&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p83108"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: Chest Spasms While Working Out",
    "content": "Hello, This sounds like an unusual symptom to have while exercising on the Stairmaster.   You may want to see your family physician before proceeding with your workouts.  It will be important to ascertain: Any family history of sudden heart attack at young age. More details on the nature of the chest sensation A chest xray.   And depending on risk factors: a stress test.  In the end this sensation in the chest may be nothing to be worried about and may never happen again but would be worthwhile to have your family doctor review your symptoms and decide about any necessary testing.  In the least, clear you to return to your regular program.  Take care.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Sun Oct 11, 2009 8:22 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=83612&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p83612"
  },
  {
    "author": "ZWillie1  Guest Posts: 4 Joined: Sat Aug 01, 2009 11:25 am Gender: Male",
    "title": "Costochondritis treatment?",
    "content": "I have had to deal with what I believe to be costochondritis, inflammation of where the ribs connect to the sternum, for half a year now. The injury occured as a result of overuse in weightlifting.  It started as acute pain that spread from the diaphragm back to the shoulder blade, though a week of rest saw it disappear.  After lifting weights a couple of times the next week, it flared up again, and I had to wait longer for the pain to alleviate.  The third time I aggravated it, it stuck with me for good, and has been constantly sore ever since.  Almost every time I sneeze, my chest cracks painfully and audibly, which aggravates it further.    I have been to told to rest (I've done so ad nauseam) and that I will probably \"grow out of it\". Unlikely considering that I am 16 and haven't grown an inch since 11.  Been shaving since 13.  I'd like to know if any treatment options exist that I'm unaware of, and also if there are any upper-body exercises that can be done with the condition.\n\n",
    "posted_time": "Post  by ZWillie1 » Tue Aug 04, 2009 7:41 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=81315&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p81315"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: Costochondritis treatment?",
    "content": "Hello, The usual treatment for costochondritis is rest and anti-inflammatory medication.    You may get some benefit from physical therapy and a two week course of tapered corticosteroids to reduce inflammation.  In a month's time, you may be 50-75% improved.  Take care.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Mon Sep 07, 2009 3:11 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=82016&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p82016"
  },
  {
    "author": "daffodil89  Guest Posts: 2 Joined: Fri Jul 31, 2009 8:58 pm Gender: Female",
    "title": "Sprained ankle not healing",
    "content": "I sprained my ankle a little over a week ago. My job requires me to walk a lot, but for the past week I have been pretty much working from my desk.  The bruising was pretty much gone, and the swelling reduced significantly.  The pain was pretty much gone yesterday except for a little tenderness, but I have been feeling a numb tingling in my ankle for a few days.  I went back to work walking about 50% capacity yesterday, and when I woke up this morning my ankle has bruising again. I don't remember hurting again. I'm not really in a lot of pain, but it's tingling more today.  Is this normal?    Thanks!\n\n",
    "posted_time": "Post  by daffodil89 » Fri Jul 31, 2009 9:19 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=81058&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p81058"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: Sprained ankle not healing",
    "content": "Hello, The bruising is normal.  In fact the bruising should darken a bit with time and gradually the blood from the broken blood vessels will be reabsorbed into the circulation. The tingling may be a sign that you are taxing the ankle too much.  Ease up on the weight bearing a bit; elevate and wrap the ankle to control swelling; include ice packs.  Over time the ankle will heal but will take several weeks.  One week is still considered the acute stage and needs an \"easy does it\" approach.  Take care.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Wed Aug 05, 2009 9:43 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=81334&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p81334"
  },
  {
    "author": "Willyboy  Guest Posts: 2 Joined: Thu May 28, 2009 7:26 am Gender: Male",
    "title": "Little Leaguers Elbow",
    "content": "My son is 14 and was diagnosed with a strain, but no separation, of the growth plate in his elbow. The doctor said he could hit without injury but cannot throw. This was on May 1st. He tried to hit on May 8th and his elbow was aggravated so he has not throw or hit again until last night, May 27. He threw approximately 50 easy throws at about 60 feet. He said it felt great except on the last few his elbow felt tired or weak. We discontinued throwing and later allowed him to try hitting. He went 2 rotations through batting practice, taking about 15 swings each time. He again said it felt great. Afterward however, he had some minor aching that went away quickly and last night he said he \"felt it\" in the shower. We iced him last night, and this morning, May 28, he said he was fine. My questions are: Is he likely to make it worse by hitting, if that is causing discomfort? Is the aching or weakness a sign that he should not continue? Now that we have caused some irritaion to the injury, do we have to wait another two weeks to reevaluate his condition?  Thank you,  Willyboy\n\n",
    "posted_time": "Post  by Willyboy » Thu May 28, 2009 7:40 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=79871&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p79871"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: Little Leaguers Elbow",
    "content": "Hello, The hitting motion is less stressful on the medial elbow than during the pitching motion so hitting has less potential to aggravate the healing tissue (assuming he throws and bats the same side...if he throws right handed but bats left handed, hitting should put very little strain on the elbow).  I would suggest resting a day or two between pitching practice.  Pitching should be only practice (as you have stated) for a couple of weeks.  Again the time frame depends on the amount of soreness and the time to recover.  At this stage of his baseball life, erring on the side of caution is best.  Give him plenty of time to heal and gradually regain his strength and gradual return to competitive pitching.   When baseball season is over, remember to condition during the off season not only arm and shoulders but also legs.  Jim Palmer and Tom Seaver both Hall of Famers were known for their incredible leg strength and both were outstanding pitchers.  They both included long distance running in their work outs.  Take care and let me know how it goes.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Fri Jun 05, 2009 11:58 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=80391&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p80391"
  },
  {
    "author": "Willyboy  Guest Posts: 2 Joined: Thu May 28, 2009 7:26 am Gender: Male",
    "title": "Re: Little Leaguers Elbow",
    "content": "Dr. Plamondon,  Thank you for your response. I did not know anyone had responded and I only checked today.  The Little League Elbow seems to have healed nicely. Soon after he had no throwing discomfort, he was playing third and on a hurried throw to first, he injured his shoulder. Our doctor says it is a pinched rotator cuff muscle and that he can play but should reduce his throws to about 80% until it does not hurt. He is not pitching, but I'm wondering if it's time to take a few weeks off completely. If he plays, it is nearly every day.  How easy is a pinched rotator cuff turned into a torn rotator cuff?  Thank you again.\n\n",
    "posted_time": "Post  by Willyboy » Wed Jun 24, 2009 11:46 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=80743&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p80743"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: Little Leaguers Elbow",
    "content": "Hello, I tell folks with shoulder impingement to use caution because the rotator cuff tear can occur especially with bony spurs on the acromion.  In this case, he probably does not have bone spurs but repetitive throwing will likely aggravate the injury.  So, rest would be wise followed by some rehab with supervised throwing.  Take care.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Tue Jul 21, 2009 11:16 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=80963&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p80963"
  },
  {
    "author": "bernie2009  Guest Posts: 1 Joined: Thu May 07, 2009 12:19 pm Gender: Male",
    "title": "Pain in calf while jogging",
    "content": "Hi there, I have been running/jogging for many years and do about 25-30 miles a week. Lately, I have been getting a cramp-like pain while jogging in my right calf. Then that calf looks swollen and the pain may last a day or two. So I need to walk for several days before jogging again. Walking helps somehow to ease the pain. And eventually, when I start jogging again, the cramp (or whatever it is comes back). My right calf does have bulging varicose veins. It's frustrating. Even though I am a 63 year old male, I love to jog or run and I'd like to do it consistently again. I would appreciate any ideas or tips. Thanks.\n\n",
    "posted_time": "Post  by bernie2009 » Thu May 07, 2009 12:33 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=77306&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p77306"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: Pain in calf while jogging",
    "content": "Hello, Unilateral calf pain that increases from jogging but not walking and swells and is sore with history of varicose veins. Worse case scenario is there is a blood clot in the calf however this would be unlikely with your activity level.  If a blood clot, it would be more likely be superficial and poses a very little risk of breaking off and going to the lung.  So a visit to a physician may be in order to check the leg.   The other consideration is a pulled muscle.  This is more likely.  Treatment includes ice, NSAIDS, rest, gentle stretching, gradual return to activity, general lower extremity strengthening.  As a runner, it is important to cross train - swimming, biking, eliptical machine, etc.  This works and balances other muscles which get neglected during straight running and will improve your overall health and lower risk of injury.  Take care.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Mon Jun 08, 2009 6:14 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=80448&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p80448"
  },
  {
    "author": "Eirean  Guest Posts: 1 Joined: Sun May 10, 2009 9:05 am Gender: Female",
    "title": "Pinched nerve or muscle tear?",
    "content": "I play tennis very actively and until Thursday I had no problems. I was running for a ball on my forehand (Iam a right handed player) when I felt a minor pain in my left quad which caused weakness and I felt as if I could not support my weight. I continued to play but each time I ran diaganoly to my right it happened again.  I can stretch without any problems but if I kick my left leg up in the air I feel the pull. I am still having problems with weight bearing when I run for the ball.  Can anyone tell me if this is a pinched nerve or muscle pull and what should I be doing to fix the problem. I have a match on Tuesday and would like to be able to play at full capacity. Thanks.\n\n",
    "posted_time": "Post  by Eirean » Sun May 10, 2009 9:17 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=77587&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p77587"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: Pinched nerve or muscle tear?",
    "content": "Hello, Thank you for the fine description.  There are several muscles which may be involved as this sounds more like a muscle pull: sartorius gluteus maximus adductor magnus gracilis   I am thinking the adductor muscles may be involved ie adductur magnus and gracilis since the motion running diagonally to the right would require a bit strain on the adductors.  Nevertheless, you may need to check with a physician or sports training to check the leg neurologically and to check the thigh muscles to get an accurate diagnosis.  Thanks for writing in; let us know how it goes.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Mon Jun 08, 2009 6:07 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=80446&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p80446"
  },
  {
    "author": "firetruck73  Guest Posts: 1 Joined: Wed May 13, 2009 8:29 am Gender: Male Location: ga",
    "title": "cost of surgery no insurance",
    "content": "need surgery on wrist. open repair,reconstrution right triangular fibrocartilage complex , and right pollices longus tendon graft.i got hurt may 27 2008.will i ever be able to mechanic again?i am right handed this seems to have went from injury to handicap cant move fingers well have to do most stuff left handed cant pick up 2 year old or even open new 20 oz mt dew bottles the list goes on.thanks and have a good one\n\n",
    "posted_time": "Post  by firetruck73 » Wed May 13, 2009 9:01 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=77962&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p77962"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: cost of surgery no insurance",
    "content": "Hello, The triangular fibrocartilage complex (TFCC) is a group of ligament which help support the wrist.  If this ligament tears, the wrist joint can become unstable not allow proper use of the hand and wrist.  So surgical repair when indicated should after rehabilitation give you a better chance at returning to work than if you did not have the surgery.  The same principle applies to the thumb tendon graft.   There may be some concern about healing of the TFCC or the outcome of the surgery if the ulna is naturally too long and bears more weight than its normal 20% with the carpal bones (the radius bears most of the weight with the carpal bones 80%).  This is fairly detailed information but in general, you will want to discuss as many details as possible with the surgeon before proceeding.   Lastly, you may want to discus the rehab process with the physical therapist before you have the surgery to know what to expect.  The surgery is only part of the solution, the rehab after surgery is the other important consideration.  Take care.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Sun Jun 07, 2009 10:26 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=80432&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p80432"
  },
  {
    "author": "liam1591  Guest Posts: 1 Joined: Thu May 14, 2009 5:33 pm Gender: Male",
    "title": "Prohormone use in teens",
    "content": "Hello, Hope this is in the right place.   I was just wondering what effects (besides gyno, high blood pressure, acne)    prohormones have? I'm curious about what it would do to the endocrine system at the age of 18, even at low doses?   Thanks a lot.\n\n",
    "posted_time": "Post  by liam1591 » Thu May 14, 2009 5:46 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=78212&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p78212"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: Prohormone use in teens",
    "content": "Hello, Prohormones are precursors to other hormones like cortisol, testosterone and estrogen.  Some common prohormones would be pregnenolone and DHEA.   If I were to recommend DHEA or pregnenolone, it would be for a specific medical condition eg PMS, menopausal symptoms, low testesterone, or perhaps chronic fatigue.  I would also check both the end hormone and the prehormone levels.  Lastly, I would recommend hormone replacement products from a trusted and proven manufacturer.  From a supplement standpoint, it is imperative to buy any supplement from a manufacturer who is proven to provide supplements that are 100% natural and free from chemical processing.  When natural products are processed incorrectly, the chemical makeup and its effect can change and increase the risk of unwanted side effects.  I say this because both DHEA and pregnenolone are available in the U.S. without prescription.    I would not use anabolic steroids for muscle building.  Sexual side effects (gynecomastia, testicle atrophy etc) may be irreversible not to mention the potential side effects on the cardiovascular system.  Take care and let us know if you have any other questions.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Sun Jun 07, 2009 10:05 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=80430&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p80430"
  },
  {
    "author": "Dusty Shea  Guest Posts: 1 Joined: Mon May 18, 2009 8:26 am Gender: Female",
    "title": "Falling off a Horse",
    "content": "I fell off my horse at a gallop and landed on my left side, mostly my hip and buttocks.  I had a lot of swelling and bruising which is getting better but I have a sharp burning pain in the middle of my buttocks when I get in and out of my car or bed and sometimes when I bend over to pick something up.  Is this a pinched nerve and how long should I wait till I see a doctor?  Should I continue iceing it and applying heat?  The injury happened almost 5 days ago and the swelling and stiffnes are considerably better but I still have the sharp pain.  The pain does not radiat down my leg.  Help.\n\n",
    "posted_time": "Post  by Dusty Shea » Mon May 18, 2009 8:50 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=78656&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p78656"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: Falling off a Horse",
    "content": "Hello, Thanks for writing in and sorry to hear about the fall.  Sharp pain in the middle of the buttock muscle with the pain worsening with movement in and out of the car could be either from the swelling and bruising - injured gluteal muscle and / or it could be from an irritated sciatic nerve.  With a sciatic nerve inflammation however, I might expect pain or numbness down into the leg - does not occur all the time with sciatica but more typical.  You may continue a few more days with NSAIDS, ice/heat, and gentle motion of the hip especially hip flexion stretches.  If no improvement or worsening symptoms then certainly see a physician.  Take care.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Sun Jun 07, 2009 9:54 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=80429&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p80429"
  },
  {
    "author": "zeuzgod  Guest Posts: 1 Joined: Mon May 18, 2009 8:35 pm Gender: Male",
    "title": "Chest injury from weightlifting",
    "content": "Hello,  on March 30th, I went to the gym to do chest after completing an intense push up workout about 4 hours earlier for police academy.  While at the gym, I was maxing out, benched 305 lbs barbell flat bench then moved on to dumbbell flat bench.  I did four sets, 90 lbs for 6, 100 lbs for 6, 110 lbs for 4, 120 lbs for 2 reps.  After doing the 120 lb dumbbells I had intense tightness located around my upper chest close to my neck and collarbone.  I thought it was just muscle tightness from the work out so I immediately stopped lifting and went home.  When I woke up the next day it felt kinda strange and I had trouble lifting my right arm up.  I was unable to even shoot a basketball with my right arm.  It felt kinda sore (not weight lifting type sore) and still felt really tight.  I did not go back to the gym for a week.  After a few days it felt normal again.  When I went back I attempted to max out again.  All my strength was still there but once I got to around 255 lbs on barbell flat bench it started to feel tight again.  I proceeded to lift up to 295 lbs and once I lifted that it felt like what happened the first time all over again.  Next morning I had the same symptoms.    I figured it was probably a strained pectoral muscle or something so decided to rest it for about 5 weeks before lifting again.  After about 3 weeks I re tweaked it from doing push ups in the police academy.  Same ***** as before.  Academy is done now so now I am not exercising my muscles at all.  It has been three weeks and it started to feel fine, but now it starts to feel strange again.  I have not attempted lifting yet, but I am nervous I will get the same results and will not be able to lift heavy anymore.  What type of injury could this be? How can I treat it and will this affect my ability to lift heavy in the future? Below are pictures of where the injury is located.  http://img265.imageshack.us/my.php?image=dsc00001n.jpg  http://img265.imageshack.us/my.php?image=pain.jpg  http://img527.imageshack.us/my.php?image=pain2w.jpg  http://img527.imageshack.us/my.php?image=pain3.jpg\n\n",
    "posted_time": "Post  by zeuzgod » Mon May 18, 2009 8:40 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=78721&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p78721"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: Chest injury from weightlifting",
    "content": "Hello, Thanks for the pictures; that helps.   I think this is a strained or pulled pectoralis major (perhaps partially torn).   It will take time to heal then return to heavy weight training will be gradual.  Healing time is 6 weeks but you may consider some physical therapy during that time to help with healing process and start re-conditioning.  Total rehab time may take up to 6 months but depends on how well this is taken care of.   Let us know how it goes.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Fri Jun 05, 2009 10:19 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=80402&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p80402"
  },
  {
    "author": "Garyp  Guest Posts: 1 Joined: Sun May 24, 2009 12:35 pm Gender: Male",
    "title": "I am 17 and should I take Pronabolin?  If not why?",
    "content": "I thinking about buying Pronabolin( http://www.gnc.com/product/index.jsp?productId=2860136 ).  If I take this what could happen?  I want to take this to get stronger.  I have seen some of my friends take this and they put on a ton of muscle mass.  I don't care if I get more aggressive or acne.  I just don't want any major and long-term side effects.    By the way I am not done growing and have heard of people getting growth spurts taking this, which would be a good thing.\n\n",
    "posted_time": "Post  by Garyp » Sun May 24, 2009 12:46 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=79412&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p79412"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: I am 17 and should I take Pronabolin?  If not why?",
    "content": "Hello, I would not recommend this product.  I could not find a phone number or company website who makes the product.  The best I could find is that it contains herbs which may help boost testosterone.  The best way to gain strength and muscle mass is to work at it.  Protein drinks and lots of water are fine but I can not recommend altering the hormone levels in your body to gain strength.  It just is not wise.  Take care.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Fri Jun 05, 2009 10:08 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=80401&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p80401"
  },
  {
    "author": "cindysuewho  Guest Posts: 1 Joined: Mon May 25, 2009 8:32 am Gender: Female",
    "title": "swollen ankels low blood pressure",
    "content": "I have no idea what topic my question should be in. I am 56 I have very swollen ankels my blood pressure is 100/50 pulse 60 What could be going on?\n\n",
    "posted_time": "Post  by cindysuewho » Mon May 25, 2009 8:39 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=79491&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p79491"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: swollen ankels low blood pressure",
    "content": "Hello, Swollen ankles can mean many things.  It can stem from problems in different systems of the body.  To name a few: kidney: loss of protein through the kidneys can increase edema in the legs liver: a decrease in liver function can cause leg edema heart: poor heart function (e.g. congestive heart failure) can cause leg swelling leg veins (circulatory system): varicose veins or inflammation of the venous system can cause leg swelling. musculoskeletal: arthritis in joints, inflammation in tendons, fractures can all cause localized pain in the lower limb.   It would be a good time to see you family physician who can take a complete physical and do an examination of the above system based on your story and determine which is most likely to cause the ankle swelling.  Take care.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Fri Jun 05, 2009 9:53 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=80400&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p80400"
  },
  {
    "author": "Dexter101  Guest Posts: 1 Joined: Wed May 27, 2009 5:53 pm Gender: Male",
    "title": "Tennis elbow?",
    "content": "I thought it was an obvious one because I got back into racquetball & squash. Woke up one morning with a pain in the joint located just on the outside area of the elbow. However that is the only pain there is. I have no tingling down to my wrist or hand, it doesnt hurt when I move my wrist in any direction, etc, etc, etc, went down the whole \"tennis elbow\" list and this doesnt fall into any of the categories other than pain in the elbow.  The pain is a nagging \"burning\" type of pain. It goes away when I exercise (lift weights) or stretch. The only time its bad is when I try to swing a racquet. When at rest it starts acting up again... not better, not worse... just the same nagging pain. Ive tried Tiger Balm, Arnica Rub, Sports Rub... its always there until I start weight training or stretching.  So I really don't know if this is tennis elbow or just some weird strain.\n\n",
    "posted_time": "Post  by Dexter101 » Wed May 27, 2009 6:10 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=79811&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p79811"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: Tennis elbow?",
    "content": "Hello, This sure does sound like Tennis elbow (aka lateral epicondylitis).  Tennis elbow pain can be as simple as local pain at the insertion of the wrist extensors at the lateral epicondyle. In my experience it does not radiate down or up the arm except in severe cases.   Treatment includes: ice rest NSAIDS forearm brace gentle forearm strengthening and stretching gradual return to activity  Hope this helps. Take care.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Fri Jun 05, 2009 9:45 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=80399&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p80399"
  },
  {
    "author": "zelda19  Guest Posts: 1 Joined: Fri May 01, 2009 3:47 pm Gender: Female",
    "title": "really stinking feet",
    "content": "Hi I have very bad sweating smelly feet.  I am 48 and female.  Before putting on shoes (different pair virtually evry day).  I put in a pair of ordour eaters, and  within three hours the smell is unbearable and coming through my shoes or boots.  This is embarrassing to me and the people around me.  I have started making excuses to work on my own or not got to work at all.  when I get home from work I run upstairs and wash and dry my feet, but the smell is back again within half an hour. by this time I have no shoes or slippers on and walk around bare footed at home.  I have tried nearly all the home remedies I can find such as tea leaves/ lysol. and even bleach. Nothing seems to work. Can you help me please.\n\n",
    "posted_time": "Post  by zelda19 » Fri May 01, 2009 4:02 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=76565&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p76565"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: really stinking feet",
    "content": "Hello, The odor is probably caused by excessive sweat just like sweaty armpits.  So use  antiperspirant and deodorant ...instead put on the feet instead of the armpits.  I have also heard of people using essential oils like lemon, peppermint, or eucalyptus on the feet and/or placing a drop on cotton balls and placing in the shoes helps with odors.  Hope this helps.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Thu Jun 04, 2009 9:26 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=80378&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p80378"
  },
  {
    "author": "bluesneakers  Guest Posts: 2 Joined: Fri May 29, 2009 8:41 pm Gender: Female",
    "title": "Re: really stinking feet",
    "content": "My dad used to have the same problem - someone told him to soak his feet in tea (just use 4-5 cheap tea bags in warm water in a bucket...he used to use an old bedpan).  I have no idea why it worked, but it helped a lot.\n\n",
    "posted_time": "Post  by bluesneakers » Fri Jun 05, 2009 2:48 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=80394&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p80394"
  },
  {
    "author": "Spoo  Guest Posts: 1 Joined: Wed May 27, 2009 5:58 pm Gender: Female",
    "title": "Numbness in wrist arm and fingers",
    "content": "for the past week or so I have had a constanty numbness and tingling in my pinky finger and the one next to it on my left hand. I have frerquent numbness in my wrist and forearm as well as my palm and other fingers. At times it feels as if the affected areas are freezing.   For my job I am expected to be able to use my hands, and it has gotten to the point where I have problems opening lids to my water bottles. I cant seem to grip anything for very long without dropping it. I am not left handed, and I am a bit bewhildered.  Recently I have been wearing a wrist splint, which only seems to make my symptoms worse and it causes dull pains in my wrist. I have set an appointment to speak with a wrist specialist but they cannot see me for another few weeks. I need my hands to work and I am very stressed about this situation.  Can you please give me a few ideas as to what this is, and how I can help fix the problem as soon as possible. How bad is it really?am I going to have get surgury to fix this problem?   TY ~lex D:\n\n",
    "posted_time": "Post  by Spoo » Wed May 27, 2009 6:15 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=79812&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p79812"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: Numbness in wrist arm and fingers",
    "content": "Hello, With hand pain and numbness in the lateral (outside) portion of the hand, I think about pinched nerve in the hand, elbow or neck.  A thorough history and physical checking reflexes, sensation, muscle strength and neck movements (eg Spurling test of neck) are important.  Also, you may need an MRI or EMG/NCV (test conductivity of the nerves) to help define the cause.  In the meantime, taking NSAIDS and gentle stretching of the upper extremities and neck may help but use caution not to worsen the symptoms.  Take care.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Fri Jun 05, 2009 12:07 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=80392&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p80392"
  },
  {
    "author": "oob63  Guest Posts: 3 Joined: Sun May 31, 2009 1:07 pm Gender: Male",
    "title": "anabolic steroids / gynocomastia",
    "content": "Five years ago I was talked into trying anabolic steroids to give me a boost while body building, but in that time I developed gynocomastia.  I have seen a doctor and had my hormones checked and they are fine, but my gynocomastia continues.  Is there anyway to take care of this without plastic surgery?  I've seen pills online but I'm unsure if they are legit.\n\n",
    "posted_time": "Post  by oob63 » Sun May 31, 2009 1:17 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=80257&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p80257"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: anabolic steroids / gynocomastia",
    "content": "Hello, Adverse sexual side effects of anabolic steroids include gynecomastia (breast enlargement).  This is due to testosterone conversion to estradiol a hormone which in excess can enlarge breast tissue.  Generally speaking, the sexual side effects from anabolic steroid use may be irreversible.  Therefore any education on steroid use in athletes should include this statement.  Other sexual effects include risk of prostate cancer, decreasing testicle size, decrease sperm counts, and pain in the scrotum.    Regarding medicine, a selective estrogen receptor modifier (SERM) may help reduce breast tissue size by competing for the estrogen receptors in the breast thus blocking the effect of the increase in estrodiol from the anabolic steroid.  You would need to discuss this with your family physician who can prescribe and monitor the medicine.  Take care.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Fri Jun 05, 2009 11:48 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=80390&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p80390"
  },
  {
    "author": "sbaase01  Guest Posts: 1 Joined: Wed May 06, 2009 3:18 pm Gender: Female",
    "title": "Sheath around my Shin Muscle ripped many years ago",
    "content": "20 years ago (14) I was in a car accident and the doctor said the sheath around my shin muscle tore and could not be repaired.  I was a soccer fanatic so I continued to play with no issues.  I currently have about a 6 inch protrusion down my shin (very noticable) but as long as it was left alone I never had an issue with it.  Now, 20 years later, I've started exercising again and after jogging every day for 2 weeks I had my first feeling of shin muscle soreness.  I assumed I was just out of shape.  But yesterday, after 30mins on the treadmill I could barely walk.  Ice helped the pain and I was ok in the morning. My question is, how do I know if my shin is just out of shape or if I have injured it?  Is the sheath a vital thing that should keep me from jogging?  I know that being unable to walk is the \"huge\" sign but are there other signs I should be looking for?  Physical therapy is very expensive around here and I'm afraid to go there.\n\n",
    "posted_time": "Post  by sbaase01 » Wed May 06, 2009 3:34 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=77174&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p77174"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: Sheath around my Shin Muscle ripped many years ago",
    "content": "Hello, The limbs both upper and lower are compartmentalized by fascia (thick fibrous tissue which separates muscle).  Within the compartments are blood vessels, nerves and muscles. Other types of fascia encases muscle to make it move and slide easily under the skin. I take it that the area is to the outside of the shin bone (lateral).  This would be the anterior tibialis muscle.  The muscle is probable unconditioned so will require 6-8 weeks of strengthening before doing any regular running. The best way to strengthen the muscle is to walk on your heels.  Use some caution not to cause swelling or pain.  An easier exercise is to place a small weight on the forefoot and lift the forefoot off the floor keeping the heel on the floor.  For inflammation, use ice, compression and NSAID.  The compression is key especially when exercising and eventually when running.  For some time, you probably need some type of compressive wrap to support the muscle since the fascia has been damaged.  There are some neoprene shin splints sleeves which can be helpful or simply an ACE wrap.  Let us know how it goes.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Thu Jun 04, 2009 9:39 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=80379&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p80379"
  },
  {
    "author": "pouzar  Guest Posts: 2 Joined: Sun Apr 26, 2009 4:58 pm Gender: Male",
    "title": "MCL not recovering",
    "content": "I sprained my MCL four months ago.  Physio has helped increase my overall muscle strength (leg and hip) and I have a near-full range of motion again.  However, my knee is still tender.  It hurts a bit when I completely bend my knee in a baseball catcher stance, and I can still feel tenderness on the bottom part of the ligament, where it attaches to the shin bone.  While my knee is more than stable enough for daily activities, I know that returning to any running or stop-and-start sport would put me at risk of reinjury.  Will this tenderness go away eventually, or might it be that my MCL hasn't healed properly at the point where it connects to the shin bone?  Of course I know this is a general question that you can't fully answer without examination, but I'm just looking for general information at this point.  Thanks--\n\n",
    "posted_time": "Post  by pouzar » Sun Apr 26, 2009 5:10 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=75897&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p75897"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: MCL not recovering",
    "content": "Hello, You may check with the physical therapist to see if your rehab program and back to competition or athletics is too vigorous and has not allowed the tissue to heal.    Anti inflammatory medication may also help.  Bracing may also help support the medial knee so the ligament for a few more months to heal.   You may be overdoing it with your activity level and not giving enough opportunity for healing.  Take care.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Fri May 08, 2009 3:21 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=77433&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p77433"
  },
  {
    "author": "pouzar  Guest Posts: 2 Joined: Sun Apr 26, 2009 4:58 pm Gender: Male",
    "title": "Re: MCL not recovering",
    "content": "Thank you!  :)\n\n",
    "posted_time": "Post  by pouzar » Fri May 15, 2009 7:41 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=78386&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p78386"
  },
  {
    "author": "ninthriver  Guest Posts: 1 Joined: Mon Apr 27, 2009 6:30 am Gender: Female",
    "title": "limited sensation in the lower portion of my left tibia",
    "content": "hi :)  there seems to be limited sensation in the lower portion of my left tibia (front), from the lower half down to where the foot begins. the feeling's like a slight \"pins and needles\" sensation, like that portion of my leg's asleep. feels clammy when i touch it. sometimes, there's a slight cold sweat. there's no pain so far, although i feel a light tinge whenever i point my toe forward.  this has been going on for two weeks now but it got worse a couple of days ago, after a two-hour badminton session. i'm very active, and go to the gym a lot. i usually go to the les mills classes (body attack, combat and pump). lately, i've done a lot of attacks (http://www.lesmills.com/global/en/membe ... ogram.aspx) since it's the only class that can still challenge me physically.   prior this lack of sensation, i don't remember any instance wherein i may have landed on my feet incorrectly.   what could be wrong? is it my nerves?\n\n",
    "posted_time": "Post  by ninthriver » Mon Apr 27, 2009 6:41 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=75963&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p75963"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: limited sensation in the lower portion of my left tibia",
    "content": "Hello, This could be something simple as shin splints or tendon sprain/strain from the high intensity work outs.  Treatment consists of ice, NSAIDS, and rest.  Gradually return to activity.  I would also check for signs of infection - warmth, redness, swelling, fever.  If so, see a medical care provider for assessment and treatment. If you have suffered any kind of injury where the skin was broken (cut, scrape, even insect bite) and the leg is showing signs of infection, seek medical treatment ASAP.  Take care.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Fri May 08, 2009 3:29 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=77437&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p77437"
  },
  {
    "author": "foobarro  Guest Posts: 1 Joined: Thu Apr 23, 2009 6:20 pm Gender: Male",
    "title": "Tennis Knee Injury - Pain Gone, Swelling Remains?",
    "content": "24 y.o. male, had a tennis injury: while stopping and changing direction simultaneously, I felt like my thigh rotated counter clockwise while my foot was firmly planted on the ground. Heard 3 \"clicks\" from my knee and stopped activity immediately. I recall a minor, but similar injury, in the same knee from when I was 16-17. That eventually went away and I've been fairly active at Tennis & Snowboarding since.  Had some swelling and putting stress on the knee caused pain (bearable, but I have a high threshold). The knee also felt unstable immediately after the injury, but has since returned to about 70% stability in my estimation. Saw a doc the next day, got an XRay, no bone damage. The doctor said it's probably a meniscus injury but said ACL was also remotely possible. Put me on 500mg Naproxen anti-inflammatory. Been a week since the injury... I'm resting, taking the medication twice daily, and ice packing 2-3 times. The pain is almost gone, but some swelling is lingering. When I lay supine and gently knock on my patella, I can tell that there's some fluid beneath the patella on the injured knee.  Is this normal? What could be causing the swelling? How much rest should I be giving this injury? I feel just fine to walk around normally (with brace) but intuition says I should put minimal stress for as long as I can. How long should I keep off it? Is surgery something I should actively consider, given that I want to return to sports ASAP?  Thanks!\n\n",
    "posted_time": "Post  by foobarro » Fri Apr 24, 2009 5:36 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=75715&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p75715"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: Tennis Knee Injury - Pain Gone, Swelling Remains?",
    "content": "Hello, i agree that medial meniscus and possibly ACL may have been damaged.  An MRI would be the next step.  The swelling is likely from internal knee damaged.  I would continue to brace, ice, and ACE wrap (if able with the brace).   Take care and let us know how it goes.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Mon May 04, 2009 6:56 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=76874&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p76874"
  },
  {
    "author": "cwr117  Guest Posts: 1 Joined: Mon Apr 13, 2009 1:55 pm Gender: Male",
    "title": "Pulled Groin not getting better",
    "content": "I pulled my groin about 10 days ago.  I have been staying off of it, relaxinging alot, using ice, and taking Advil twice a day.  The pain is not getting any better, and I am having a tough time sleeping because of the pain.  I am wondering at what point do I go to the doctor?  I have never pulled my groin before, and I don't want to go to the doctor just to have him tell me to continue what I am doing.  But I am also worried that I may need surgery.\n\n",
    "posted_time": "Post  by cwr117 » Mon Apr 13, 2009 2:07 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=74108&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p74108"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: Pulled Groin not getting better",
    "content": "Hello, A pulled groin can be an aggravating injury with lasting pain.  I would not hesitate to see the physician who should test the strength of the hip adductors to make sure there is no complete tears (unlikely).   You may also benefit from physical therapy which will help rehab the leg/hip/groin.  Take care and let us know how it goes.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Wed Apr 22, 2009 12:19 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=75417&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p75417"
  },
  {
    "author": "NeeKKoo12  Guest Posts: 1 Joined: Mon Apr 13, 2009 9:54 am Gender: Female",
    "title": "I had Ulnar nerve release surgery now arm don't bend",
    "content": "I had surgery done in 2006 on my left elbow to release my ulnar nerve .Immed. following surgery I was in terrible pai .I returned to surgeon and saw his nurse who gave me pain meds,2days later I went back still in pain again I received pain meds,finally 5 days later I saw my surgeon He removed the cast and told me that was probably the cause of the pain,it was to tight.Eventually the pain lessened however my mobility is significantly decreased initially the dr.did not want to send me to therapy for fear of aggravating the nerve he did send me 6 months after surgery then after 3 visits he stopped the therapy because they were doing strenght not range of motion 5 months later my husband and I walked in for another of our weekly visits and the dr. turned to me and said there is nothing else I can do for you and walked out of the room.Since that time I have been to 9 dr.all of which have said my arm is stuck like this and no one will tell me why.Please understand my arm does not work when they measure my range of motion it is 90 and to top things off because I cannot bend my arm or move it I have developed frozen shoulder I received a cortizone shot for that but It did absolutly nothing.So now I have an arm that don't bend and a shoulder that hurts up to my neck.Have you any suggestions on a cause\n\n",
    "posted_time": "Post  by NeeKKoo12 » Mon Apr 13, 2009 10:36 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=74091&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p74091"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: I had Ulnar nerve release surgery now arm don't bend",
    "content": "Hello, Sounds like you had a release of the ulnar nerve in the cubital tunnel.  And now decreased use of the left arm including frozen shoulder.  There is hope.  With consistent exercise and treatment the shoulder stiffness can improve. This may require physical therapy.  The elbow may need a night splint to regain motion - this will take some time.   As long as the ulnar nerve is working well and not causing hand or wrist weakness then you should be able to rehab the elbow.  You may not regain full motion but depending on the restriction should make some gains over 3-6 months of night splinting.   Let us know how things go or if you have further questions.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Wed Apr 22, 2009 12:16 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=75414&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p75414"
  },
  {
    "author": "tigdra  Guest Posts: 5 Joined: Tue Apr 07, 2009 10:53 pm Gender: Male",
    "title": "weird sound due to leg contusion",
    "content": "I am in a contact sport and received a few strikes on my right leg. Initially I felt a little pain on the calf muscle, I first though that it might have been an intramuscular calf muscle contusion but two days later all I feel is some tightness on the muscle but what really worries me is that a little bit more than half way up the shin on the exterior side of the bone where the peroneus logus or the tibialis anterior muscle is, I feel a popping sensation. I push down with my finger and it feels as if I am forcing the muscle to mount another muscle and if I swivel my leg or press the muscle the other direction it dismounts. Both the mounting and dismounting are accompanied with the pop sensation. If I pull my toes back all I feel is a small tightness but if I point my toes there is pain associated with it and sometimes a pop as well and the pain is maintained until it pops back. There has been no bruising and minimal swelling. I am R.I.C.E. the injury and taking anti-inflammatory  medication.\n\n",
    "posted_time": "Post  by tigdra » Sun Apr 12, 2009 5:06 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=74027&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p74027"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: weird sound due to leg contusion",
    "content": "Hello,  The limb muscles and neurovascular structures are compartmentalized.  In the lower leg, the anterior tib is located in the anterior compartment and the peroneus muscles are contained in the lateral compartment. This sounds more like an anterior compartment problem.   Could the fascia between the two compartments be torn and allowing a lateral muscle to ride over ant tib or vice versa?  Very unlikely but worth having the orthopedist evaluate the leg.  Take care and let us know how it goes.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Wed Apr 22, 2009 11:59 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=75410&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p75410"
  },
  {
    "author": "amconfused  Guest Posts: 1 Joined: Sat Apr 11, 2009 8:58 am Gender: Female",
    "title": "herniated cervical disks and smoking",
    "content": "I have 2 herniated disks in my neck & I have done everything except surgery (physical therapy, epidural steriod injections). I am curious about something..I was an occasional marijuana smoker & I noticed that everytime I did smoke, the pain worsened. At first I thought this was just in my head but it seems to be an actual physical connection.  I haven't smoked for more than a week now & each day my neck feels even better!  So needless to say, that's great & I'm not going to smoke anymore. But I've always heard marijuana can help ease pain so can you give me a medical explanation as to why my disks are irritated more by the smoking?  I'm just curious.  Thanks!\n\n",
    "posted_time": "Post  by amconfused » Sat Apr 11, 2009 9:27 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=73906&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p73906"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: herniated cervical disks and smoking",
    "content": "Hello, This is a fascinating phenomena since marijuana has been proposed to ease pain rather than heighten it.  I do not know the mechanism involve in your case but seems like a direct correlation. I am not a supporter of the medical marijuana movement since it changes one's mood and affect and can be habit forming.   If I come across any information on the physiology of increase pain with marijuana, I'll send it along.  Thanks for writing in.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Wed Apr 22, 2009 11:47 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=75408&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p75408"
  },
  {
    "author": "iggs68  Guest Posts: 1 Joined: Tue Apr 07, 2009 1:25 pm Gender: Male",
    "title": "weight lifting shoulder injury",
    "content": "I have been working out with heavy weights for about the last 7 years.  About 3 years ago i have been experiencing significant shoulder pain after completion of a work out that consists of my front deltoid, or around that area.  I stopped doing shoulder work outs hoping that rest would heal the nagging pain, but the pain seemed to have come back.  I have full motion in my shoulder but i certainly can feel the pain, i was just wondering what this could possibly be and what should i do about it?   -Thank You  Tim\n\n",
    "posted_time": "Post  by iggs68 » Tue Apr 07, 2009 1:34 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=73462&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p73462"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: weight lifting shoulder injury",
    "content": "Hello, You may be suffering from tendonitis in the shoulder - pectoralis major or supraspinatus or long head of the biceps.  In any case, treat with ice, NSAIDS and gradual return to activity. If needed see a physical therapist for in depth treatment.  It is also important to check the integrity of the shoulder joint to make sure no laxity in the joint which may lead to subluxation...morever evaluating the shoulder muscle balance both anterior and posterior would be good since most weight lifting emphasizes the anterior musculature and neglect posterior muscles.  Take care and keep us posted.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Wed Apr 22, 2009 11:43 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=75407&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p75407"
  },
  {
    "author": "Ulyses  Guest Posts: 2 Joined: Mon Apr 06, 2009 8:29 pm Gender: Male",
    "title": "Brain Fog caused by, or made much worse by exercise",
    "content": "I am 51, male, 230 pounds, but (until recently) jogged 4 miles / day. Beginning 8-10 months ago, I began to be more disoriented than usual after exercise, and if I did more than an hour, I would notice a slight disorientation that would last for a day or two. This condition has gotten somewhat worse since then. My Doctor prescribed NAC and Folic acid. He said normally he would suggest increasing exercise for \"Brain Fog\", so he does not know how to approach this. The condition gets worse, then improves, gets worse, then improves....  Every place I have read about this seems to indicate exercise should improve this, and it helps if I do it every day without fail for about 30-45 minutes, any extra seems to make it bad for days! If I don't exercise at all, it stays at a low level, but does not go away. This \"brain fog\" causes me to forget names and words I should remember, makes me feel EXACTLY like I do after over-eating a turkey dinner on Thanksgiving, or like I'm slightly drunk all the time. It makes it more difficult to talk to others, it requires more focus than it should. It does not seem to affect my Sudoku puzzle skills.  I quit smoking about 2 years ago. Lungs feel better. I do have sinus trouble at times (allergies). My blood oxygen level is OK. Testosterone is 320. Blood tests showed nothing unusual except high trigycerides. Chocolate seems to make it worse. Eating a large meal makes it worse. MSG makes it worse. I have, some years back, worked in a high copper environment, which caused dry skin on the hands. I do not have excess tiredness that many associate with brain fog.  I did manage to eliminate the condition, largely, for 6-8 weeks with constant moderate exercise, taking herbal \"anti-fungal\" tablets, hydrogen peroxide therapy, and nano-silver, and high doses of crystal vitamin C. I don't know which, if any, worked. I stopped taking all three (still taking the C), and it seems to be returning.  I'd like your take on this. My doctor suggested perhaps a neurologist, but this sounds like the beginning of a search that could be frustrating. I have rarely been sick or ill, and I don't imagine myself sick.  Any ideas?\n\n",
    "posted_time": "Post  by Ulyses » Mon Apr 06, 2009 9:27 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=73394&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p73394"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: Brain Fog caused by, or made much worse by exercise",
    "content": "Hello, Thanks for writing in.    This may seems a little odd but I am thinking that this brain fog may be a type of migraine headache.  The clues that tell me it may be a migraine are: increase with chocolate, MSG, and exercise (beyond 30-45min). Treatment includes eliminating triggers, abortive medicine if needed, and prophylactic medicine if needed. Your neurologist can talk to you about all the triggers and any prophylactic medicine.  Take care and let me know how it goes.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Tue Apr 21, 2009 10:05 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=75339&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p75339"
  },
  {
    "author": "Ulyses  Guest Posts: 2 Joined: Mon Apr 06, 2009 8:29 pm Gender: Male",
    "title": "Re: Brain Fog caused by, or made much worse by exercise",
    "content": "Thanks for the reply. This is an interesting idea. The thing is, I really don't have headache pain, just this \"spaciness\". I will repost if any thing changes, or if something new happens....\n\n",
    "posted_time": "Post  by Ulyses » Tue Apr 21, 2009 10:40 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=75342&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p75342"
  },
  {
    "author": "GBIC  Guest Posts: 1 Joined: Wed Apr 01, 2009 1:10 pm Gender: Male",
    "title": "Fell foward and landed on my chest",
    "content": "I feel forward and landed real hard on my knee and chest, of course my knee swelled up and I was knocked out of breathe for a minute. But I have severe pain in my chest especially when I cough, or move sudden. I felt if this is a bruised chest bone what if anything can be done about it or just let nature take it's course?\n\n",
    "posted_time": "Post  by GBIC » Wed Apr 01, 2009 1:20 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=72720&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p72720"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: Fell foward and landed on my chest",
    "content": "Hello, Any trauma to the chest or rib cage which causes pain with breathing warrants an xray to rule out fracture and puncture to the lungs.  Moreover, it is important to take analgesics to control the pain.  Shallow breathing can lead to atelectasis or pneumonia.  Take care and keep us posted.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Tue Apr 21, 2009 9:57 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=75338&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p75338"
  },
  {
    "author": "shytiger  Guest Posts: 2 Joined: Sun Sep 21, 2008 5:27 pm Gender: Male",
    "title": "partial quad tendon tear and pulled quad",
    "content": "Nearly a year ago I fell off my roof. Landing in power squat, I heard a popping noise and felt a pain through out my right upper quad region. At the time I thought it was my knee exploding. I rushed to the ER and they took x-rays. The doctor told me I hadn't broke or tore anything...so no need for surgery. I never went back to see a doctor afterwards. After the swelling went down I was immediately aware of the damage. As you can see in the attached pics, my quad tendon has become partially detached from the patella, evident by the dimple. You can see that my whole quad has moved up away from the patella a good 2 inches or so. My question...can this be fixed with surgery from a cosmetic and functionality standpoint? I still do not have 100% strength in that that region. Sometimes when I jog, it will give out on me for split second. Any advice or comments would be appreciated.  after the ER visit   current picture   image of my good leg for comparison.\n\n",
    "posted_time": "Post  by shytiger » Sun Sep 21, 2008 5:54 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=61140&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p61140"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "Re: partial quad tendon tear and pulled quad",
    "content": "Hi shytiger, I would first encourage you to have an evaluation by an Orthopedic specialist. Some injuries are treated by physical therapy while others may require additional interventions. Untreated injuries may lead to an array of other problems.This type of specialist can identify the most appropriate and beneficial treatment for your particular case. Best wishes. Sincerely, Theresa Jones, RN\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Mon Sep 29, 2008 11:15 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=61561&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p61561"
  },
  {
    "author": "shytiger  Guest Posts: 2 Joined: Sun Sep 21, 2008 5:27 pm Gender: Male",
    "title": "Re: partial quad tendon tear and pulled quad",
    "content": "Well I finally consulted with a orthopedic specialist.  As soon as she took a look, she told me it was a torn quad.  They sent me to have an MRI done and from there we'll figure out if I'm canidate for surgery.  The surgery for a torn quad is very invasive, but if I can get my strength back it will be worth it...I'll chime in to later as this saga progresses.\n\n",
    "posted_time": "Post  by shytiger » Sat Apr 04, 2009 6:32 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=73115&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p73115"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: partial quad tendon tear and pulled quad",
    "content": "Hello, Looking at the pics.  The involved quad has lost lots of muscle mass and I'm sure strength.   Running on a leg without good quad strength may lead to patella-femoral problems. Keep us posted about the MRI results.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Mon Apr 06, 2009 7:30 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=73383&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p73383"
  },
  {
    "author": "mellebelle  Guest Posts: 1 Joined: Tue Mar 24, 2009 1:07 pm Gender: Female",
    "title": "possible mid-back muscle pull, should i see a doctor?",
    "content": "i used t be an avid dancer, but havent danced for about 2 years until last week when i was a dancer in my school musical. during a pretty rigorous routine, i believe i may have pulled a muscle in the middle of my back. this was four days ago now. i have a sharp, stabbing pain in the middle of my back with a lot of pressure in my lower back and a stiff neck. the pain has been getting a little worse each day. is it time to see a doctor?\n\n",
    "posted_time": "Post  by mellebelle » Tue Mar 24, 2009 1:23 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=71695&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p71695"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: possible mid-back muscle pull, should i see a doctor?",
    "content": "Hello, Worsening back pain would be an indication to see a physician.  This is probably nothing more than strained muscles or ligaments but using prescription pain meds or muscle relaxers may help relieve symptoms in the short term.   Most acute back pain resolves within 4 weeks regardless of treatment (PT, chiropractor, exercise) however studies have shown that bed rest may cause secondary symptoms of muscle weakness and eventual worsening pain so the recommendation is activity as tolerated. Also, the physician should test the nerve status (sensory check, deep tendon relexes, limb strength, and straight leg raise test). Let us know how it goes and write back if there are any questions.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Sat Mar 28, 2009 10:38 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=72187&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p72187"
  },
  {
    "author": "mikok  Guest Posts: 1 Joined: Wed Jan 28, 2009 10:08 am Gender: Male",
    "title": "Penicillin and training",
    "content": "Hi, ive been taking two kinds of penicillin combined with omeprazol against Helicobacter Pylori infection. I need to take the meds for 2 more days, but after that i want to start training again.   How long is recomended to wait for body to recover from heavy use of penicillin under a period of 1 week?\n\n",
    "posted_time": "Post  by mikok » Wed Jan 28, 2009 10:22 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=70070&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p70070"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: Penicillin and training",
    "content": "Hello, Thanks for writing in.  You have reported a concern over training during antibiotic and proton pump inhibitor use (to eradicate H. pylori).  As far as I know, there is no contraindicated to exercise while treating H. pylori.  Common sense dictates training.  Plenty of fluids and plenty of rest between work-outs.    If in doubt, consult your physician.  Take care and keep us posted.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Mon Feb 02, 2009 3:23 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=70424&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p70424"
  },
  {
    "author": "philomina  Guest Posts: 6 Joined: Wed Jan 21, 2009 11:08 am Gender: Female",
    "title": "Re: Penicillin and training",
    "content": "no it wont take more than a week, after that you can get back to your normal training\n\n",
    "posted_time": "Post  by philomina » Mon Feb 09, 2009 9:59 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=70707&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p70707"
  },
  {
    "author": "lancastermike  Guest Posts: 2 Joined: Sun Jan 18, 2009 10:59 pm Gender: Male",
    "title": "Severe Ankle Sprain Recovery",
    "content": "I hope you are doing awesome!!  Not sure if you check your facebook, but I emailed this to Brad as well.  I have a question for you about my ankle im hoping you can answer for me.   If i can get any advice or my questions answered that would be great.  I sprained my ankle 10 months ago and it was diagnosed as a grade 2-3 tear in 3 places.  I inured myself playing sports and have always been a very active person.  I am 27 years old and never had an ankle injury in the past  My ankle is now strong and i am able to play sports without pain and can do what i used to do eg. Jump, change direction, sprint etc.  The problem is that my ankle is still noticablly swollen.  It really hasnt changed size for 3 months even though i have been working hard on my exercises to fix the stiffness that i had and can now do the things i want to on it.  I also ice it almost everyday.    It's been 10 months since my injury and given that i am almost back at 100% i find it strange that its still swollen.  Is this a common thing??   How long more will it be swollen for?  Will it be that size forever?    Also, it swells up everytime i wear shoes unless im exercises.  It's strange, it gets really swollen after being out for a few hours, or a 1-2 hr drive, or even going to dinner......(it never swells up after running etc.)  It should also be known that a few months ago i had an x-ray that showed no break.  I was worried that my recovery was taking a long time so i got an x-ray.  The physio i had here just said i needed to improve my range of motion and it would get better.  I went really hard on the exercises and it worked and now im back, but still swollen?  What do i do to get rid of the swelling at this late point.  Do i just stick to what im doing???  If you can help me out with any info it would be most appreciated.    Mike\n\n",
    "posted_time": "Post  by lancastermike » Sun Jan 18, 2009 11:03 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=68920&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p68920"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: Severe Ankle Sprain Recovery",
    "content": "Hello, Thank you for writing in.  You have reported ankle sprain 10 months ago with residual swelling.  All other aspects of the ankle are back to normal.  What to make or to do about the swelling.  Swelling is usually the last symptom to leave in a lower limb injury or post operative condition.  So this is not uncommon especially.  The swelling may come and go over the next 6 months.  As long as the ankle is not \"tweeked\" (minor trauma), the swelling should gradually vanish.    To treat the swelling, do retro grade massage and use a compression garment (eg neoprene sleeve).  Of course elevation, active motion, and ice are indicated too.  Keep us posted and take care.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Mon Feb 02, 2009 11:06 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=70408&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p70408"
  },
  {
    "author": "lancastermike  Guest Posts: 2 Joined: Sun Jan 18, 2009 10:59 pm Gender: Male",
    "title": "Re: Severe Ankle Sprain Recovery",
    "content": "Thanks for your reply.  One last question.  What is retro grade massage???  thanks again\n\n",
    "posted_time": "Post  by lancastermike » Mon Feb 02, 2009 3:01 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=70420&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p70420"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: Severe Ankle Sprain Recovery",
    "content": "Hello, Retrograde massage is simply massaging a limb in a direction toward the heart...toward the body rather than toward the fingers or toes.   Cheers.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Sat Feb 07, 2009 1:19 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=70644&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p70644"
  },
  {
    "author": "jaimmortal  Guest Posts: 2 Joined: Sun Jan 25, 2009 12:15 am Gender: Male",
    "title": "Ankle injury",
    "content": "It's been four days since I sustained what appears to be a serious ankle sprain in a soccer training session. X-rays were negative for fractures, and so the doctor's diagnosis was such.  I have been taking very good care of my ankle since the injury, following RICE. My ankle is in just as much pain, and is just as swollen as the first day.  All of the sources I have read state that swelling from ankle sprains should reduce in the first 48 hours with proper care.  What I am trying to find out is how long it could be before I begin seeing any reduction in swelling and pain without suspecting anything more serious like a complete tendon tear.\n\n",
    "posted_time": "Post  by jaimmortal » Sun Jan 25, 2009 12:30 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=69670&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p69670"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: Ankle injury",
    "content": "Hello, Thanks for writing in.  You have reported an ankle fracture with negative xrays.  Pain and swelling continue despite RICE treatment.  I recommend MICE instead of RICE.  Motion Ice Compression Elevation.  Motion involves ankle pumps and mini wall slides.   You may also check in with an athletic trainer or physical therapist for specific rehab measures.  Take care and keep us posted.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Mon Feb 02, 2009 3:13 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=70423&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p70423"
  },
  {
    "author": "sailtheworld  Guest Posts: 1 Joined: Wed Jan 21, 2009 12:30 am Gender: Male",
    "title": "Possible Torn Muscle/Ligament In Groin Area",
    "content": "Hi,  There is a small lump on my left inner thigh that I suspect might be a balled up muscle that ripped. A few days ago I thought I may have heard a popping sound (I figured it was my joint cracking, but I sort of felt the muscle stretch at the moment too.) and later that night I noticed the bump. I can walk fine without pain, I can move my leg in all directions fine without pain. There is no bruising. It is slightly tender to touch to bump but not very much so. I researched symptoms of muscle tears and the \"balled up\" muscle theory combined with the popping sound I thought I heard make me think it is a torn muscle, however the lack of pain and bruising make me second guess that. After looking at some muscle diagrams, I am guessing the muscle was either the adductor magnus, the gracilis, or the Semimembranosus muscle.  Is this something serious, or does the lack of pain suggest that its not a big deal?\n\n",
    "posted_time": "Post  by sailtheworld » Wed Jan 21, 2009 12:44 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=69187&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p69187"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: Possible Torn Muscle/Ligament In Groin Area",
    "content": "Hello, Thanks for writing in.  You have reported a history of a painless bump or lump on the inner thigh.    I agree that a muscle rupture or even a small tear would be odd given the lack of pain and bruising.  Adductor magnus and semi-membranosus are big muscles; if torn, you would know it.  Gracilis probably the same effect - pain, swelling, bruising.  If this is not affecting your physical function and does not hurt let it be for a couple weeks.  If any changes for the worse, see your physician.  Take care and keep us posted.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Mon Feb 02, 2009 3:03 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=70421&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p70421"
  },
  {
    "author": "martino13  Guest Posts: 1 Joined: Sun Jan 18, 2009 6:41 pm Gender: Male",
    "title": "Jammed Finger for 4 months. Desperate need of help",
    "content": "Here's what happened. I was playing basketball and i tried to block a pass and i jammed my left thumb. I thought it would go away just like any other jammed finger, but after 2 months it was still there. i went to a hand specialist and he told me to soak in in warm water for 10 min everyday for the next month, and if i came back and it still hurt, he would give me a shot of cortisone.   A month later, i went back and once again and the pain was still the same. He then said to come back in a another month and he will give me a cortisone. I never went.  Another thing is that i play Baseball for the school's team, and every time i swing the bat my thumb will hurt. its causing me to swing bad and i need this pain to go away. please help me, what should i do?\n\n",
    "posted_time": "Post  by martino13 » Sun Jan 18, 2009 6:47 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=68896&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p68896"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: Jammed Finger for 4 months. Desperate need of help",
    "content": "Hello, Thank you for writing in.  You report a history of a jammed thumb that has chronic pain for 2 months.    I would recommend an xray or MRI as there may be a small fracture or torn ligament or tendon.  Alternatively, getting a cortisone injection would treat arthritis in the thumb.    NSAIDS are also important in the treatment plan.  Wrapping the thumb with self adhesive bandage will give the thumb joints some support especially during sport.    If no fracture or torn ligament or tendon, an occupational therapist can guide you through rehab so you can return to sporting painfree.  Keep us posted.  Take care.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Mon Feb 02, 2009 10:59 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=70407&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p70407"
  },
  {
    "author": "Tagerinator  Guest Posts: 1 Joined: Sat Dec 27, 2008 10:54 pm Gender: Male",
    "title": "Osgood-Schlatter disease problems",
    "content": "(just to notify you I'm 14) One day I went into the doctors just for a physical check up. And he notified me that I have Osgood-Schlatter disease. I asked him what are the treatments that I could use. He suggested that I quit sports for about a year or so and get physiotherapy. I worried because its been about 3 years and I haven't done anything yet. I can get physiotherapy but I CANT quit sports because I do sports all year long, and basically its my life. Ice hockey is MY thing. So I've come on here to ask for an alternative to this. I am really worried because this disease is preventing me from doing a lot of stuff.  All advice is much appreciated\n\n",
    "posted_time": "Post  by Tagerinator » Sat Dec 27, 2008 11:08 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=66095&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p66095"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: Osgood-Schlatter disease problems",
    "content": "Hello, Osgood Schlatter disease is a condition where the patella tendon pulls excessively on the tibia tubercle (point of its attachment) causing inflammation and a hard bump.  The bump is bony and again is caused by repetitive stress on the tendon's attachment site.  Sometimes the bump can avulse or separate from the bone - not common but can occur. Osgood Schlatter occurs in adolescents because the bones grow faster than the tendon and the tendon does not have time to elongate and adds stress to its insertion. Sports usually worsens the condition because of the demands placed on the quadriceps muscle and its patellar tendon. Treatment includes ice, NSAIDS, proper rest, stretching and strengthening exercise.  A physiotherapist can help with rehab. Whether you play hockey or other sports will depend on the degree of inflammation and the response to rehab.   Use of a patella strap may help. Take care and let us know how things go.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Sat Jan 17, 2009 8:48 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=68704&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p68704"
  },
  {
    "author": "jaimmortal  Guest Posts: 2 Joined: Sun Jan 25, 2009 12:15 am Gender: Male",
    "title": "Re: Osgood-Schlatter disease problems",
    "content": "I had Osgood when I was about 12-13. I am 18 now. I play soccer, and there were about 3-4 weeks straight when I would get extremely sore up and down my legs, not just my knees. I went to the doctor and he basically told me that I couldn't hurt my body by playing with the pain, which I did, but I also started physical therapy.  I took about 3 weeks off going through physical therapy, and one thing they did was give me a knee brace, which worked wonders once I got back to playing. I would highly suggest trying a simple strap that goes just below the knee joint, firmly around the bump described by the previous post. Soccer was, and still is my life.  I used a knee strap for about 3 years, every single time I played. I remember having a very noticeable tan line from it over my knee, as I would spend hours and hours every day during the summer playing. I didn't care, it got me back to playing, and I never really had any significant problems with it anymore.  You'll grow out of it eventually. I no longer use a knee brace and haven't since I was 15.\n\n",
    "posted_time": "Post  by jaimmortal » Sun Jan 25, 2009 2:50 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=69674&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p69674"
  },
  {
    "author": "tropicalcrz29  Guest Posts: 1 Joined: Wed Jan 14, 2009 6:42 pm Gender: Female",
    "title": "not a side-stitch, but abdominal pain while running",
    "content": "Okay, I have had this reoccuring pain in my upper right abdominal right next to the edge of my ribcage.  Over the last year and a half, I've gone through periods of exercise, running a few miles a day while doing crunches on the side.  After about two weeks of running, I experience a sharp pain in my upper right abdominal.  This pain will not go away like a side-stitch when I run through it; it grows into a sharp pain that stops me from running.  I have to stop as soon as it reaches a sharp knife like pain; there is no way that I can run through it.  I have noticed that when I sprint, the pain is less severe then when I immediately slow down to a slow jog. If I push it too far, I feel the same pain (a dull remaining pain) the next day. Recently I have been exercising again and the pain returned.  After running (with the pain) I did some crunches to see if they irritated it.  They had no affect.  The only way that I can run with out the pain is when I go a month or two with out running.  Then the whole cycle starts up again when I start to run again. I would love to be able to run without pain; to be able to actually get in shape again. I have no idea what it is. My parents think that it’s a gull bladder stone that gets irritated.  I don’t know if I have a tear in my diaphragm and things rub together when I run, reopening it back up? I don’t know.  If you could help me I would be thrilled. Thank you so much for your time.\n\n",
    "posted_time": "Post  by tropicalcrz29 » Wed Jan 14, 2009 7:57 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=68350&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p68350"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: not a side-stitch, but abdominal pain while running",
    "content": "Hello, Gall bladder inflammation or pain from a blocked bile duct can cause right upper quadrant pain and nausea/vomiting.  The symptoms usually proceed 30 minutes or so after meal especially fatty food.  If the gall bladder is infected or gangrenous then fever may occur along with increase belly pain and nausea/vomiting.  It would be worthwhile seeing your family physician to take your history and do a physical exam to find an accurate diagnosis.  A chest xray or other imaging of the abdomen (US or CT scan) may help with diagnosis.    Also check your leg lengths and check for scoliosis of the spine.  Both could cause pain in the thoracic rib cage area.  Take care and keep us posted.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Sat Jan 17, 2009 9:04 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=68709&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p68709"
  },
  {
    "author": "jaymac91  Guest Posts: 1 Joined: Mon Jan 12, 2009 6:07 pm Gender: Male",
    "title": "What are the health effects of losing weight for wrestling?",
    "content": "What are the adverse health effects of losing drastic amounts of weight rapidly in order to make a certain weight class for wrestling\n\n",
    "posted_time": "Post  by jaymac91 » Mon Jan 12, 2009 6:12 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=68054&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p68054"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: What are the health effects of losing weight for wrestling?",
    "content": "Hello, Most the weight lost quickly in wrestlers is water weight.  The risk is dehydration and organ damage (eg kidney).  Performing in athletics with dehydration is dangerous and the body can not regulate its temperature well and unable to supply the needed blood to muscles and internal organs.  Loosing water weight quickly in order to wrestle in a certain weight class is not wise and may lead to serious health problems.  Take care and stay healthy.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Sat Jan 17, 2009 8:55 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=68705&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p68705"
  },
  {
    "author": "lawinu  Guest Posts: 1 Joined: Tue Sep 02, 2008 11:14 am Gender: Male",
    "title": "I stoped smoking, what can i expect in my run times?",
    "content": "I have stoped smoking, what kind of run time improvement can I look forward to? I haven't run in awhile, I do alot of walking at work and occasional sprint in hury chasing bad guys ( I am a cop) (I have an extremely fast sprint and usually end foot chases quickly)... I have started bike riding 3 to 5 times a week...   I am getting ready to start runing 3 miles as a norm... Before (about a year ago) I could run 3 miles in about 29 minutes....   I stop smoking completely about 4 months now (I wasn't smoking real heavy since december) I smoked for about 5 to 6 years...   I will start doing my runs this week... I am interested in how the body repairs from smoking...    So i guess my  questions are   1.what I could expect? How much improvement in long distance running will I see? 2. Also when I went for a physical for the military ( I am trying to become an officer in the marines) they had to get my blood pressure 3 different times until it was down low enough. They asked was I nervous, I was a little tired as it was 0530 in the morning and I had worked late the night before, but I worry if I may have a problem... I wonder if this is due to the smoking and that it will improve now that I stoped?\n\n",
    "posted_time": "Post  by lawinu » Tue Sep 02, 2008 11:26 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=59701&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p59701"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: I stoped smoking, what can i expect in my run times?",
    "content": "First, congratulations  on stopping smoking. You'll not only see some improvement in your run times, but you've extended your lifespan and improved your future health prospects incalculably. Now then...  Anwering your questions in order:  1) This is near-impossible to know. Much depends on how much the smoking was affecting  your performance before you quit. Then comes the question of how fast your lungs will recover from that. While all residue from your smoking habit should be gone inside a year,  and since you probably didn't smoke long enough to cause significant or irreversable damage, you should note improvement, but it's virtually impossible to predict by how much and in what length of time.  There are just too many variables. The more athletic you were before you quit, the less you're measureable change you're likely to see, but the longer you'll be able to do it.  2) Your blood pressure elevation (we don't have numbers, but I know what the DoD cutoff is) could have been elevated due to stress, anxiety and sleep deprivation for sure. It also could have been affected by your having been a smoker,  which, if true, will probably improve over time. You could also have an independent issue with blood pressure, but since they were able to get one acceptable reading out of three, I suspect this was a matter of circumstances and probably won't be a problem in the future. If it is, it will be something you can follow utilizing military medicine.  Hope this is helpful. Best of luck with the Marines and  your officership aspirations.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Sun Dec 21, 2008 9:43 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=65600&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p65600"
  },
  {
    "author": "hoosierfan_1  Guest Posts: 1 Joined: Fri Sep 05, 2008 5:55 pm Gender: Male",
    "title": "Knee injury playing basketball",
    "content": "I was playing in a basketball game and jumped up to block a shot.  When I landed I felt a pop and a pain on the outside and back of my knee.  It swelled up and I went to see a doctor and he ordered an MRI.  His diagnosis was that I had a ligament sprain, a chipped bone, and a Baker's Cyst.  He recommended Physical Therapy.  It has been two months now and my knee will still buckle and pop and that is accompanied by pain.  Is this normal?\n\n",
    "posted_time": "Post  by hoosierfan_1 » Fri Sep 05, 2008 6:15 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=59926&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p59926"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Knee injury playing basketball",
    "content": "It's not especially normal, at least not given the diagnosis you recieved. It sounds as though either the Baker's cyst is increasing in size and pushing the knee out of alignment, or that you may have actually ruptured a ligament, which probably wouldn't respond well to PT. I'd recommend a second opinion or at least to return and have the injury re-evaluated, since the knee buckling suggests a weakness in the  joint that shouldn't be  present this long after a sprain. The Baker's cyst may also need draining at this point.  I hope this is helpful. Good luck to you.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Sun Dec 21, 2008 9:33 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=65597&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p65597"
  },
  {
    "author": "Ravicasi  Guest Posts: 1 Joined: Mon Sep 15, 2008 10:41 am Gender: Female",
    "title": "Is Hydroxycut (fat burning supplement) safe?",
    "content": "I am a 24 years old women with not medical history, I exercise 2 to 3 times a week and eat fearly healthy. I used other supplements in the past and had no side effects. I still a little worried about these king of supplent not been safe for my health. Any advise?\n\n",
    "posted_time": "Post  by Ravicasi » Mon Sep 15, 2008 10:52 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=60553&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p60553"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Is Hydroxycut (fat burning supplement) safe?",
    "content": "Hi there -  Hydroxycut used to contain ephedra, but was banned because of this component, which is[ b] not[/b] especially safe. However, Hydroxycut is now back on the market, and while it's safe, it's not especially effective either. It only contains caffeine as a metabolic \"kick starter\", much safer than ephedra, but not much more useful than having a caffeinated drink prior to exercise. You have to exercise for it to work; you're already exercising.   There's nothing that's both safe and effective that will promote an unnatural degree  of weight loss when combined with exercise.   I hope this is helpful to you. Best of luck and keep up the good work with your exercise  program.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Sun Dec 21, 2008 9:29 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=65596&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p65596"
  },
  {
    "author": "srividhya  Guest Posts: 1 Joined: Tue Aug 26, 2008 12:46 am Gender: Female",
    "title": "ligament tear",
    "content": "My boy friend who is an athlete had a severe pain in his right knee when playing  football last year. consulted a doctor . the doctor told him that his ligament has torn and he should to take rest. he dint opt for any surgery. used a pain killing jel and had physiotherapy for about two months. After three months he tried playing volleyball and  he felt the same pain . Till now he is not able to run. the knee aches a lot. he fears that his athlete career is gone . please guide him what treatment can relieve his pain  so that he can continue his sports career.\n\n",
    "posted_time": "Post  by srividhya » Tue Aug 26, 2008 1:10 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=59300&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p59300"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: ligament tear",
    "content": "Hello -  It seems  that a torn ligament might well require surgical repair, especially if it hasn't healed properly after all this time. While your boyfriend's athletic career may not be at an end, it may be interrupted, as this isn't getting better on its own, and surgery could take a while for things to heal, then slowly get back into shape. I would think a second opinion and possible surgery would at least give the knee a chance of getting better and allowing your boyfriend to return to whatever sport or sports he competes in.  I hope this is helpful. If there is any more information to add, please feel free to do so. Otherwise please update us if anything changes.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Thu Sep 25, 2008 12:36 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=61427&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p61427"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "Re: ligament tear",
    "content": "I hope your boyfriend is feeling better. Please keep us updated.  Best regards,\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Sun Dec 14, 2008 5:22 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=65337&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p65337"
  },
  {
    "author": "bob12321  Guest Posts: 1 Joined: Wed Oct 29, 2008 1:02 pm Gender: Male",
    "title": "shoulder, or back injury(muscle related i think not sure)",
    "content": "so it was either from boxing, or from doing weigh training that i obtained this injury, i got it a year and a bit ago when i was 17, if it was from the weight training which i think to be the case, i don't really remember what the exercise was called but i can describe it you take a bench press bar, or curling bar, load up either end with weights, and with your arms pronated, or with your nuckles bearing outward, and hands only about 6 or 8 inches apart, you lift it directly upwards, elbows flaring outwards making sort of a triangle till you touch almost your clavicle with the bar then repeat the exercise, it was either that night, directly after, or during the weekend, i cannot quite remember being that it was so long ago, that i felt a severe tightness and pain in my armpit tereits minor section, and my scaupla and lattisimus dorsi area where thier was a tightness in pain, my stance was akward, namely my shoulder was upright it was in an akward position, and stayed this way for a while, oh and it was also pretty painfull, it wasnt like a sharp pain, more of a dull continual aching pain that lasted well for a year and 2 months now, it has become an incredible hassel on my life, my doctor said that it was just a muscle pull that lasted this long, but i don't think that it is, i mean she said just stop working out and it should repair itself, but if anything, it has just worsened, my whole right shoulder, and lateral to medial back near the scapula is in an intense awkward state all the time, it feels tight, like a fabricated motion, it does not glide smoothly within the paramaters or planes that it usually should, namely that my other arm does, when i work i get alot of pain on my scapula area, and when i sit down against a backrest like right now my scapula feels like its on an angle pointed outwards, and my armpit feels tight and out of place as with my shoulder, it is an enormous neuscence, especially since i plan on joining the army in a few months, this just \"abnormal-norm\" cannot suffice. also i had a ultra sound on my shoulder, and under arm area, to check for tears and the like , and the test came back negative, nothing was wrong, thier were no tears, what do you think my best bet is, or what it is, or what i should even do? its causing a great deal of stress in my life, i'm not so much worreid about it, just worried that it will have more negative affects in the future, i'm always always always stressed about it, it aggravates me to an extreme.   i hope to hear from someone thanks, tanner\n\n",
    "posted_time": "Post  by bob12321 » Wed Oct 29, 2008 1:19 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=62603&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p62603"
  },
  {
    "author": "Tom Plamondon PA-C  Physician Assistant Posts: 1164 Joined: Fri Oct 31, 2008 8:55 am Gender: Male",
    "title": "Re: shoulder, or back injury(muscle related i think not sure)",
    "content": "Sorry about the delayed response.  I appreciate your description of the shoulder, scapula, and surrounding muscles.    Often the shoulder complex musculature becomes out of balance.  The pects overpower the shoulder retractors.  Rarely vice versa.    The teres minor is part of the rotator cuff while the latisimus dorsi helps adduct the arm or pull the body up with the hands fixed over head.    The exercise you described should not have over worked either muscle.  Biceps curls obviously work the biceps.    What to do about this?  I would send you to an orthopedic physical therapist for a thorough stretching program and focussed strengthening regimen.  One key to rehab: strenghtening should focus on the rotator cuff and scapular thoracic muscles working in syncrony or harmony.  This requires professional supervision and instruction.    An MRI is a better test than US to find pathology of the shoulder.  (Without contrast)  Let us know how it goes.\n\n",
    "posted_time": "Post  by Tom Plamondon PA-C » Wed Dec 10, 2008 7:11 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=65244&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p65244"
  },
  {
    "author": "iancghln  Guest Posts: 1 Joined: Tue Sep 16, 2008 3:51 pm Gender: Male",
    "title": "Throw up whenever I workout",
    "content": "Every time I work out I throw up. It doesn't matter if it is running or lifting weights or doing sit ups, light or hard excercise. I don't know what causes it. It's been like this for a few years and I've just dealt with it. I'm in the Army so working out is pretty important. My mother has a thyroid problem, I don't know if that might be something. Just tryinging to give you as much info as possible.\n\n",
    "posted_time": "Post  by iancghln » Tue Sep 16, 2008 4:16 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=60676&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p60676"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Throw up whenever I workout",
    "content": "Hello -  You don't describe how this throwing up takes place. Do you become nauseated and feel sick, stop what you're doing and then vomit, or do you simply find that suddenly food is being regurgitated during your workout? The former would require a pretty thorough workup, as no obvious cause and effect can be inferred from it. The latter, however, could be pretty simple: an incompetent lower esophageal sphincter (LES) which allows stomach contents to be expelled when exerting, especially the abdominal muscles, or when bending at the waist (and of course, especially when doing both).   Without any additional details I would strongly suspect the latter, which may be helped by not eating for 2-3 hours before the workouts take place. Also, there are medications which can sometimes help the LES work more effectively to keep stomach contents where they belong: in the stomach.  Please let us know if this is the case or if you actually become ill when you are working out, which would be of more concern.   Good luck to you and please follow up with us.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Mon Oct 27, 2008 10:09 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=62517&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p62517"
  },
  {
    "author": "Shortguy  Guest Posts: 2 Joined: Sat Aug 30, 2008 5:24 am Gender: Male",
    "title": "Growth in height",
    "content": "Hi, i'm 17 years old (18th birthday in december), and at the moment im 163 cm ( around 5\"3 i believe), and i am worried about my height, all of my friends around me have all grown up in height, 175cm+, and yet i'm remaining short. so, i need an experts opinion, will my height increase in the next 2-3 years? or will i remain short for life? note that my voice changed like a year ago, could that be a sign that im \"late\" in my growth and maturation?\n\n",
    "posted_time": "Post  by Shortguy » Sat Aug 30, 2008 5:35 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=59559&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p59559"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Growth in height",
    "content": "Hello -  Based upon heredity and a few other factors, height growth can occur late and in rather surprising spurts, or can remain stunted permanently. I've seen young men in your age group grow as much as 5-6 inches in the course of two years, so it's not out of the question that you could  add a few inches over the next couple years. After age 19 it's unlikely you'll gain any more height, but not impossible.   How tall are your parents? Have you been expecting to be considerably taller than you are, or are you within a few inches of one  or other of your parents?   I hope this is helpful. Best of luck to you.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Sat Sep 20, 2008 12:27 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=61030&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p61030"
  },
  {
    "author": "firefighter27  Guest Posts: 1 Joined: Sun Sep 07, 2008 11:52 am Gender: Male",
    "title": "Letrozole for gyneocomastia",
    "content": "I am a 27 year ff. I developed a small lump behind my right nipple that was found to be gyneocomastia. Has anyone ever heard of the drug letrozole(femara) being used to reverse this, I have read several studies claiming it does.\n\n",
    "posted_time": "Post  by firefighter27 » Sun Sep 07, 2008 11:58 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=60036&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p60036"
  },
  {
    "author": "Debbie Miller, RN  Nurse Posts: 4746 Joined: Mon Apr 16, 2007 2:41 pm Gender: Female Location: USA",
    "title": "Re: Letrozole for gyneocomastia",
    "content": "Hello, Letrozole blocks production of estrogens so it can be effective in the treatment of gynecomastia.  When used for this purpose it is called, \"off label\" meaning that was not the primary use for the medication but it has been found useful in other cases.  Many of the drugs we use are \"off-label\" so don't be alarmed about that.  Of course this is done under a doctor's supervision.  Best wishes\n\n",
    "posted_time": "Post  by Debbie Miller, RN » Wed Sep 17, 2008 12:44 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=60797&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p60797"
  },
  {
    "author": "jeffd99  Guest Posts: 4 Joined: Sun Nov 18, 2007 9:24 pm",
    "title": "Odd bicep and upper arm/chest issue",
    "content": "Odd problem.  Was lifting heavier than normal.  A few days later I was doing some yardwork and lifted a heavy table above my head.  The next day I began to experience left  upper arm pain and pain in the front area of the shoulder where the arm meets the chest.    My bicep muscle looks like it is constantly \"pumped\" - like I just finished lifting weights - very odd.  Could this be bicep tendonitis? or what?\n\n",
    "posted_time": "Post  by jeffd99 » Tue Jan 22, 2008 12:31 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=53326&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p53326"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Odd bicep and upper arm/chest issue",
    "content": "Hello -  I am going to assume from your post that you lift weights routinely, and so are at least in that respect athletic. What you describe sounds like it could be compartment syndrome, where the connective tissue which comprises the compartments of the extremities (muscle mass, blood vessels, lymph nodes, etc.) becomes irritated and, since it is limited in its ability to stretch, can cause swelling and pain. If this resolves on its own there's no need to do more, but if it continues for more than a week or if it recurs periodically, you should see an orthopedist about it, as it can cause injury to the muscle tissue, vessels, etc., within the affected compartment.   Non-steroidal anti-inflammatory drugs (ibuprofin, naprosyn) would be your first line of relief. If the problem continues for more than a few days, do get this looked at.   Hope this is helpful.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Fri Aug 08, 2008 11:44 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=59167&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p59167"
  },
  {
    "author": "jeffd99  Guest Posts: 4 Joined: Sun Nov 18, 2007 9:24 pm",
    "title": "Re: Odd bicep and upper arm/chest issue",
    "content": "Thanks but...apparently my self diagnosis of bicep tendonitis was right. Went to doc...then to PT and had therapy for about six months.  It's all good now.\n\n",
    "posted_time": "Post  by jeffd99 » Sun Aug 31, 2008 8:18 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=59636&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p59636"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Odd bicep and upper arm/chest issue",
    "content": "Good job. I'm glad you were on top of it and it's been handled properly. Hopefully it doesn't happen again. Best of luck to you.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Tue Sep 02, 2008 10:34 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=59697&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p59697"
  },
  {
    "author": "assam  Guest Posts: 3 Joined: Tue Jan 01, 2008 1:52 pm",
    "title": "Deltoid injury from baseball?",
    "content": "Hello, As a child I played baseball, and when I from around 11-13 I played on a team as their only catcher. I threw more than anyone on the team. I threw in practically every play, and caught for every pitcher. Toward the end of the last season my arm started hurting REALLY bad when I threw. Being a boy I just kept throwing until it became unbearable and I finally told the coach, and we rotated another player in as a backup catcher and it really helped. I still just threw through the pain though. I don't remember any specifics about it though, other than my arm hurt (ie. it wasn't my elbow or shoulder or anything I don’t think)  After that I started getting out of sports and lost my interest in it due to many things, so it never bothered me since really. The few times when I like throw rocks or the such though my deltoid hurt, and I always thought it was just from not being used to throwing. Just recently, however, I've started throwing (baseball) again with friends, and my deltoid hurts after the throws. If I warm up it seems to not hurt actually until after i've been throwing for a bit. But if I just pick up a baseball (or acorn, or rock) and throw it cold, I get a shooting pain in my deltoid (Kinda of feels like it's knotting up!).   It feels like it stems from the bottom of my deltoid though. Does anyone have any ideas about this? Is it possible that it could be leftover from my childhood? The coach thought maybe I had out thrown my arm back then, but we never really did anything about it. I am 22 years old now.  It doesn't bother my ever unless I'm throwing or unless I do some extreme range of motion with it, like attempt to scratch my back over the top, or stretch my arms back behind my head upward (then it doesn't really hurt it just feels kinda tight...)  Well any help would be greatly appreciated!! I'm just wondering if it stems from back as a catcher as a child, or if I re-injured it, or if it's nothing at all...  Thank you!\n\n",
    "posted_time": "Post  by assam » Sat Jan 05, 2008 9:32 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=52784&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p52784"
  },
  {
    "author": "John Kenyon, CNA  Nurse Assistant Posts: 2846 Joined: Wed Dec 20, 2006 1:05 pm Gender: Male Location: Laurel, MD",
    "title": "Re: Deltoid injury from baseball?",
    "content": "Hello -  While you probably did create some chronic irritation in the affected area as a child, and this probably did cause some permanent, minor tissue changes (even some scarring or just sensitivity), it seems if you do the reasonable things before using the arm it then responds perfectly normally, if perhaps is a little more sensitive than it would be otherwise. This is hardly surprising given the amount of overuse it saw early on. Just continue to warm up appropriately and let it rest when it starts \"talking back\" to you and it should be fine. Only if you were planning to resume competitive throwing on a regular basis might this pose a problem, and unless it were going to affect your career (as an athlete) should it be medically evaluated for correction at this point. Of course if it becomes chronically painful or you lose range of motion in regular activities, see an orthopedist, but otherwise, just treat it right (as you are now doing) and it would seem it responds just as one might expect.   Hope this is helpful. Good luck to you.\n\n",
    "posted_time": "Post  by John Kenyon, CNA » Sun Aug 10, 2008 9:28 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=59183&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p59183"
  },
  {
    "author": "reuf  Guest Posts: 1 Joined: Sat Mar 01, 2008 8:37 am Gender: Male",
    "title": "Knee pain, volleyball",
    "content": "I am 21 years old, and I play volleyball for about 10 years. Semi-pro, but very intensive trainings, also at summer beach volley... What also might be good to say, since I was a child I could (and still can) jump very high about a meter vertically. A few months ago, I started to have back pain, in my lower spine, and horrible knee pain. I can still handle the back pain cause it stops after 30 minutes of training, and returnes after it (I don't care as long as I can play), but knee pain in my left knee is horrible. Yesterday I jumped and felt as like someone is stabbing me with a knife in my knee. I couldn't stand on my left leg for 10 minutes, and after that it still hurts a bit, but I can walk nicely today, and I have full movement of my knee. The pain is at the top of my patella and inside, if it helps, I have uploaded a picture, to show where do I feel pain:  http://tinypic.com/view.php?pic=2iqzlg8&s=3  What do I do? please help!!!\n\n",
    "posted_time": "Post  by reuf » Sat Mar 01, 2008 8:42 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=54761&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p54761"
  },
  {
    "author": "Debbie Miller, RN  Nurse Posts: 4746 Joined: Mon Apr 16, 2007 2:41 pm Gender: Female Location: USA",
    "title": "Re: Knee pain, volleyball",
    "content": "Hello, You should see a rheumatologist or orthopedic doctor about this to see if you have any underlying problem or have damaged your knee.  You may have a condition that can benefit from anti-inflammatory medication but it's best to get an accurate diagnosis which may require studies as well as an examination.  It would be impossible for us to say.  Possibilities include synovial fluid inflammation, bursitis, arthritis, gout, ligament problems, strains and sprains, dislocation, infection, etc.  You can see why it would be hard to guess.  Best wishes.\n\n",
    "posted_time": "Post  by Debbie Miller, RN » Mon Mar 31, 2008 6:18 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=57363&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p57363"
  },
  {
    "author": "Russell3041  Guest Posts: 8 Joined: Mon Feb 25, 2008 9:02 pm Gender: Male",
    "title": "Training in cold weather for a competition in warmer weather",
    "content": "How does cold weather affect breathing with regards to training and then traveling to a warmer climate and then trying to compete at peak performance?  An example would be training during December for a January 10K race.  Training would take place in Ohio, Michigan, Indiana and Illinois, then traveling to Souther California or Miami via aircraft to compete in a race a few days after arriving.  Can I expect to be able to compete fairly against the athletes from that area or will the fact that my body is acclimated to the colder weather cause me a slight disadvantage.  For instance, if I run a 5:00 mile average, how would I fair against an athlete from that area who also runs a 5 minute mile.  My feeling is that because of the cold weather, the air is denser and so your lungs will not be as strong as they need to be in the warmer weather.  Also, I would think your breaths would also be shallower to keep the lungs from experiencing pain.  Sort of like taking quick short sips of a freezing milk shake is OK but taking long hard pulls on the straw will give you what my wife calls an ice cream headache.  I would also think that the cold air will also cause me to take shorter strides as a safety against puling a muscle in the colder temps.  Thus when I go to a warmer temp, I suppose I would find my stride to be much safer against pulling a muscle but my muscles would be trained for a shorter stride which is not going to be good when racing against guys used to taking a more aggressive stride.  Any knowledge on this subject would be great.\n\n",
    "posted_time": "Post  by Russell3041 » Mon Feb 25, 2008 9:26 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=54390&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p54390"
  },
  {
    "author": "Russell3041  Guest Posts: 8 Joined: Mon Feb 25, 2008 9:02 pm Gender: Male",
    "title": "Re: Training in cold weather for a competition in warmer weather",
    "content": "I would like to see some universities do very extensive studies that look at all facets of this.  I imagine that traveling to your competition, especially when time zones are crossed and when the weather is very different, etc... would have an impact on all physical aspects of your performance and also possibly on your mental alertness and concentration.  It would be very interesting to see universities spread around the nation do testing to establish a base line then travel to other locals and do more testing to see how much the traveling impacted your performance and if there is an impact, how long it takes to adjust to your new environment such that it no longer impacts your performance.\n\n",
    "posted_time": "Post  by Russell3041 » Sat Mar 01, 2008 3:04 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=54779&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p54779"
  },
  {
    "author": "Russell3041  Guest Posts: 8 Joined: Mon Feb 25, 2008 9:02 pm Gender: Male",
    "title": "Re: Training in cold weather for a competition in warmer weather",
    "content": "I would say that by the lack of replies, this is a subject that should seriously be studied.  I can't find anything on the net or any kind of fitness or running magazines so I am assuming that there really hasn't been a lot of research into just how much changes in environment can affect mind and body.  For instance, if a northern college plays a southern college in a bowl game and the northern team has been living in weather that is very cold, say around 0 to 20 degrees Fahrenheit and goes to Florida and plays a team from very near that area and the temps there are in the mid 60's to mid 70's does the temperature seem much hotter to the players from the north.  In other words, do their bodies react the same way the southern team's bodies would react if the temps were in the high 90's?   Also how much does travel and time zone changes affect mental acuity?  Could a dropped pass or a missed tackle, or a QB not seeing a blitz coming be attributed to the 3 times zone difference?  How much does the distance of travel affect things.   I see a great opportunity for universities around the country to work together to study this stuff.  I would think that they could use some volunteers and set up a standard physical test of running, swimming, push-ups, pull-ups, stretching, etc...Basically you would want to have you subjects meet every day and work out together.  Again I think this should be a set standard.  The same amount of running and swimming and stretching, etc... Then after a set period, you do testing to get some solid numbers for each individual.  Do the tests every day for a week.  Then you travel to other universities and do the test on the same track and pool that that university uses for it's tests.  Again you do the tests for a week.  This would allow for us to see if there is a period of time within a week where your body adjusts and returns to peak performance.   These tests could allow us to see if it is harder to go from a cold climate to a warmer climate to compete or from a warmer climate to a colder climate.  We also might be able to see if there are temps that start to become a problem and also see if the actual temp is more important or the difference in temps from home to the unfamiliar climate the competition is held in.  Humidity could also be a factor that is kept track of.  How much does humidity affect you.    To me this is a fascinating subject and I would live to see a group of universities around the country study this.  I would also think that the military and businesses could make great use of the info as well as the sports medicine field.\n\n",
    "posted_time": "Post  by Russell3041 » Tue Mar 18, 2008 8:23 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=56226&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p56226"
  },
  {
    "author": "dwhitney  Guest Posts: 1 Joined: Tue Mar 11, 2008 3:02 pm Gender: Male",
    "title": "Severe ankle sprain",
    "content": "Hello,  I sprained my right ankle about 3 weeks ago (x-ray was negative) and it is taking a very long time to recover. I have sprained my ankles many times, but it has never taken me more than 2 or 3 weeks to feel good enough to at least jog, and have had little to no pain moving it around.  This time however, is different.  I still cannot perform any physical tasks other than walking, and i have trouble rotating the foot- especially inward and backwards (think of pointing your toes toward your opposite leg, and towards the ground).  Why am I having so much trouble recovering this time?  I have iced it, elevated it, used crutches, minor rehab (rotating the foot alone and w/resistance band), soaked it in hot water and epsom salt, wore an air cast and ace bandage, all to no avail.  Please help!  Thank you,  Doug\n\n",
    "posted_time": "Post  by dwhitney » Tue Mar 11, 2008 3:12 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=55675&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p55675"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "Re: Severe ankle sprain",
    "content": "Hello Doug,  You may have torn one of the ligaments or tendons of the ankle.  I would recommend you follow up with your doctor for reevaluation.  You may need to have some further imaging such as an MRI to evaluate for this.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sat Mar 15, 2008 9:57 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=56049&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p56049"
  },
  {
    "author": "angels  Guest Posts: 1 Joined: Mon Mar 17, 2008 7:52 pm Gender: Female",
    "title": "Re: Severe ankle sprain",
    "content": "My ankle rolled two weeks ago and I couldn't walk on it for a about a hour and some the next morning.  Since then it hurts when I walk on it a lot.\n\n",
    "posted_time": "Post  by angels » Mon Mar 17, 2008 8:22 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=56205&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p56205"
  },
  {
    "author": "shaz29  Guest Posts: 24 Joined: Mon Apr 23, 2007 3:13 pm",
    "title": "Anabolic steroids",
    "content": "Hi I'm living in the UK so steroids are legal to possess here, wanted to ask a question, i am planning to use testesterone enthanate at 500mg a week for 12 weeks, i will be injecting into the glutes.. is this sort of dosage safe?   Shazad\n\n",
    "posted_time": "Post  by shaz29 » Wed Apr 25, 2007 5:50 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=41431&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p41431"
  },
  {
    "author": "enanthate  Guest Posts: 2 Joined: Tue May 15, 2007 7:09 pm",
    "title": "Re: Anabolic steroids",
    "content": "hi guy. I am not a doc but I have some experience with what you are talking about.  Test is extremely potent especially enanthate ester. But everyone reacts differently, for some of my friends 500mg/week is easy going on test E. I have friends shooting 1gram every 4 days that are competing. But it is very dangerous as well, I have had friends have heart attacks during theyre sleep! Some wake up from spasms in the middle of the night, can never sleep, loose ALLOT of hair especially with enanthat ester. You WILL see these signs: Accelerated loss of hair, Enlarged prostate, you will need to urinate allot more often, these 2 things will NOT get better after quitting the testo cycle, you will loose almost everything you gain if you do not have proper post-cycle drugs as well which all run theyre own side affects.  also you will be risking, cancer in the testicles, liver cancer, prostate cancer, acne, infection from injection, your own test axis will be screwed up, when you bombard your body with testosterone your testicles will shut down to try to lower your own level of testosterone resulting in testicular atrophy, with no way to know if your natural testosterone levels will ever be back to what they were at. You can become sterile and rist having to take multiple HCG injections just to try to get your own testo and sperm count back in line. I mean is all this worth a little cycle to have fun in the summer? Trust me you will not regret if you stick to naturall bodybuilding!\n\n",
    "posted_time": "Post  by enanthate » Tue May 15, 2007 7:31 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=42538&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p42538"
  },
  {
    "author": "enanthate  Guest Posts: 2 Joined: Tue May 15, 2007 7:09 pm",
    "title": "Re: Anabolic steroids",
    "content": "Also you can have an allergic reaction to lab-made testosterone, and you can imagine injection 2ml (if you ahve the 250mg/ml vials) of something that you are allergic to deep into your body, it will really mess you up!\n\n",
    "posted_time": "Post  by enanthate » Fri May 18, 2007 6:25 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=42677&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p42677"
  },
  {
    "author": "Russell3041  Guest Posts: 8 Joined: Mon Feb 25, 2008 9:02 pm Gender: Male",
    "title": "Re: Anabolic steroids",
    "content": "What about Anavar?  I remember reading an article about this a very long time ago, probably in the early 90s and the article was stating that research was suggesting that it was actually quite safe when used properly.\n\n",
    "posted_time": "Post  by Russell3041 » Mon Feb 25, 2008 9:40 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=54393&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p54393"
  },
  {
    "author": "extasm  Guest Posts: 1 Joined: Fri Feb 22, 2008 12:42 pm Gender: Male",
    "title": "HGH for growth in height",
    "content": "I am 24 years old, 5'7'' and I tend to be the shortest of everyone I'm around.  My question is will HGH make me taller at this point in my life? I turn 25 in march.  If it does work, 1)How would I get it?  2)How long would I have to take it?  3)How much does it cost?  If this does not work, would there be any alternative methods to make me taller?  Thank you!  (I wasn't sure where to post this, I hope it was ok to post this here.)\n\n",
    "posted_time": "Post  by extasm » Fri Feb 22, 2008 12:49 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=54155&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p54155"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "Re: HGH for growth in height",
    "content": "Hello Extasm,  Human growth hormone (HGH) is unlikely to increase your height at this point.  The reason is that your growth plates are closed.  Growth hormone has the most effect on growth before they close.  Once the growth plates close there is very little vertical growth that can occur.  At this point, there is really not much to increase your height.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sat Feb 23, 2008 8:47 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=54233&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p54233"
  },
  {
    "author": "truth  Guest Posts: 1 Joined: Mon Dec 31, 2007 8:25 am",
    "title": "Contact sports after splenic injury?",
    "content": "I'm a 22 y/o female, I recently ruptured my spleen after being kicked in the stomach during sparring at karate.  CT scan showed a grade 3 laceration to the superior aspect of the spleen with a 7-8 cm intraparenchymal haematoma, artery and vein intact and I was managed conservatively.  My doctor has told me that my spleen is now permanently weakened due to scarring (however no follow up imaging was done) and I was advised to never engage in any contact sports again eg no rugby, hockey or contact karate ie sparring due to the ongoing risk of further injury.  I would particularly like to continue sparring at karate, I thought a foam guard of some sort would make it ok but my doctor still said no.  However after reading journal articles about conservative management of splenic injury, I have found that usually people are allowed to participate in unrestricted contact sports after 3-6 months off sports to allow for healing time, also not all cases seem to show scarring.  I have not yet found any articles with all out bans of contact sports for the rest of their lives.  Would you agree with the advice of my doctor or that of the doctors writing articles?  What is the normal long term advice given?  Is the risk of further injury high?\n\n",
    "posted_time": "Post  by truth » Mon Dec 31, 2007 8:15 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=52451&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p52451"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "Re: Contact sports after splenic injury?",
    "content": "Hello Truth,  The exact best recommendation for activity restriction following a splenic laceration is not fully known.  There was a good study done in 2002 looking at return to normal activity levels that showed that a restriction of 2 weeks plus the grade of the laceration was an appropriate restriction time (i.e. for a grade 3 laceration, 3 + 2 weeks = 5 weeks restriction).  This study showed that if these guidelines were followed only 1.9% of patients required hospital readmission.   A lifetime restriction may be a little aggressive; however, keep in mind that the above study was return back to NORMAL activity levels.  I was not able to find a definite guideline for strenuous contact activity such as rugby.  The risk will be higher with more intensive contact activity.  You'll need to make your own decision about this.  I suspect that your doctor is being cautious because splenic lacerations can be life threatening if severe enough.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Thu Feb 14, 2008 11:47 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=53829&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p53829"
  },
  {
    "author": "abroad07  Guest Posts: 4 Joined: Sun Sep 30, 2007 3:47 am",
    "title": "Frustrating problem after resistance exercise",
    "content": "Hello all  I'm 34, male, with a history of glandular fever recurrence in my teens. No current medications.  Whenever I do light jogging or cycling I have no negative reaction, but when I do anything involving resistance eg weight training or heavy cycling, I feel great for a few hours, then briefly I feel sleepy, then after that I become irritable and stressed for no apparent reason for the next 3 or 4 days. I also sleep very poorly for those days as well and feel really sluggish and lethargic. I don't have hunger pangs as such but I do find myself eating more than usual.   My doctor is sending me off to a sports clinic but, judging by the clinic's website, I'm not convinced they'll be able to help.   I've thought for a while that the problem could be with my endocrine system, I've had a standard blood test (which looked for probems with my thyroid, for example) but it didn't show anything unusual. Mind you, I had that test on a normal day, not after doing resistance exercise.   Anyway, it would be really good to hear from anyone that might be able to offer some help for this really frustrating problem. I'm supposed to be doing knee strengthening exsercises following a cartilage operation but I can't due to this reaction to resistance exercise.   Thanks & kind regards\n\n",
    "posted_time": "Post  by abroad07 » Mon Oct 01, 2007 11:46 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=48516&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p48516"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "Re: Frustrating problem after resistance exercise",
    "content": "Hello Abroad07,  I apologize for the delay in answering your question.  I'm not exactly certain what the cause of this might be.  I suspect that when you go to the doctor, have tests, etc. you feel fine so they aren't really getting a good look at what is going on.  You may want to discuss with your doctor about doing an exercise treadmill test and then AFTER the exercise period, draw labs such as an electrolyte panel and muscle enzymes to see if anything shows up this way.    Seeing a sports medicine specialist may actually be very helpful.   I'm sorry I can't offer much more of an explanation for you.  If you don't mind, will you keep us updated on your progress and if you find a cause.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Wed Jan 23, 2008 4:49 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=53337&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p53337"
  },
  {
    "author": "the1orangeb  Guest Posts: 1 Joined: Mon Dec 24, 2007 11:00 am",
    "title": "Abdominal Pain; Which doctor?",
    "content": "Recently, I have felt a slight pain in my lower right abdominal area, especially after doing sit ups and some other weight lifting exercises, but I have also felt this pain outside gym activities as well.  I had a colonoscopy about 2 months ago with a polyp removed.  All test results were negative.  I'm very healthy according to my general practitioner and the specialist I went to, 2 months ago.  I went to them both, because I have been having anal leakage (mucous).  I'm still having anal leakage, and does this new abdominal pain problem related to the anal leakage, my recent colonoscopy or my lifting weights/situps?  I feel like I don't know which doctor to turn to, and neither doctor has been able to figure out the anal leakage problem.  I'm having an issue of trusting either one of them to diagnose me (their intentions are good, but tired of going to the doctor every few weeks).  This question should have been posted under something extremely general, but the problem is increased after gym workouts.  What to do...  Thanks for your help and insight.\n\n",
    "posted_time": "Post  by the1orangeb » Mon Dec 24, 2007 12:15 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=51953&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p51953"
  },
  {
    "author": "Debbie Miller, RN  Nurse Posts: 4746 Joined: Mon Apr 16, 2007 2:41 pm Gender: Female Location: USA",
    "title": "Re: Abdominal Pain; Which doctor?",
    "content": "Hello, I certainly understand your frustration, but you need to know that medicine is not an exact science.  It is a combination of science and art with some intuition and divine intervention thrown in at times.  Even the best doctors cannot always find the diagnosis for a problem.  Sometimes the problem must become worse before it becomes apparent.  I personally would vote for the fictional \"Star Trek technique\" where they waved a wand over the body and the computer told them everything they needed to know.    It is somewhat deceptive now because since we have such great technology we come to believe we have answers, if not cures, for everything.  This is far from the truth.  While we are much better and finding answers now than ever before, there is still a long way to go.    If I were you I would consult with a gastroenterologist.  You didn't say what \"specialist\" you have already seen.  Between this doctor and your general practitioner, you may eventually find the cause of your distress or at least learn that it is not doing any long-term harm.  Some conditions we just have to live with once we know nothing can be done to help.  But please don't judge a doctor's competence based on his or her inability to always find the right answer.  Continuing with a doctor who knows your history is a good option since they may learn more as you go along and of course they are familiar with your history.  Meanwhile, keep a diary of your experiences - exactly when this pain occurs and what makes it better or worse.  Sometimes it is purely random and coincidental; other times there will be a pattern that emerges.  Good luck\n\n",
    "posted_time": "Post  by Debbie Miller, RN » Sat Jan 19, 2008 10:15 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=53267&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p53267"
  },
  {
    "author": "Paolitta  Guest Posts: 5 Joined: Thu Mar 29, 2007 10:16 am",
    "title": "Calf & Fingers Swelling & Toe Pain",
    "content": "Hi,  Im a 25 year olf female. I am a candidate for diabetes, hypertension and heart problems as they run in my family I personaly have had and still have issues with my stomach (i had hernia/virus and inflammation of the lining of the aesophagus) and hypothyroidism.  I didnt know which forum to post this in but i really hope i can get an answer.  My right leg calf muscle has been hurting and swelling and becoming hard as concrete. My doctor thought i could have DVT and had a vascular ultrasound and found nothing. My left foot's big toe hurts as well and in the morning my fingers are swollen and uneasy to move them. My calf was swelling only when i walked up a hill or walked for a long time but now it happens everytime i walk just for a minute. It could be also a problem from my right heel bcause my heel hurts when i sit for too long then stand up or when i wake up first thing in the mornings.  My calf issue has been going on for about 2 months now. but my toe has been appearing/disspearing over the course of a year or so. My fingers swelling has only been for 2 weeks.  The pain of the calf which is my main concern is best described as numb, tight and it feels like something is pulling. The pain is always at the top of the calf where the knee connects. I would have stop whenever i am walking and fold my knee for a few minutes and also massage/punch my concrete like calf until the tightness loosens up.   I only had a vascular ultrasound done because my primary care thought it could be DVT. The woman who did my ultrasound thought that i should mention that 13 years ago i have broken my right ankle (bones were crushed) same leg that has the calf problem.\n\n",
    "posted_time": "Post  by Paolitta » Wed Sep 26, 2007 7:30 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=48320&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p48320"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "Re: Calf & Fingers Swelling & Toe Pain",
    "content": "Hi Paolitta,  I'm not exactly sure what is going on but I have a few thoughts.  These symptoms may be due to a condition like multiple sclerosis although this would not be classic for it.  I would also suggest you consider seeing a rheumatologist.  Conditions such as Systemic Lupus Erythematosus or possibly rheumatic arthritis may also present this way.  The rheumatologist can help guide further workup for you.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Fri Dec 21, 2007 11:40 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=51847&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p51847"
  },
  {
    "author": "jadecrowe  Guest Posts: 1 Joined: Sun Nov 25, 2007 1:22 pm",
    "title": "ankle sprain or fracture?",
    "content": "i stepped in a hole in my neighbor's yard yesterday and rolled my ankle.  there is no swelling or bruising, but it is extremely painful, more so today than it was yesterday.  the majority of the pain is on the top and sides of my foot.  should i be concerned or just ice and elevate? my medical history is as follows: 39 yr. old female history of fibromyalgia, carpal tunnel syndrome, sciatica, bursitis of hip. past surgeries are hysterectomy, ovarian cyst removal, and tonsilectomy. i am not currently on any medication.  thank you in advance for any advice you can offer.\n\n",
    "posted_time": "Post  by jadecrowe » Sun Nov 25, 2007 1:30 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50789&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p50789"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Jadecrow,  This is a great question, one that I'm sure many of our readers also have.  Overall, the more common occurrence is to have an ankle sprain rather than a fracture; however, fractures do occur.  There is a set of criteria that we use for adults who have ankle injuries to help us decide if an x-ray is needed or if observation is an appropriate initial choice.  These are known as the Ottawa ankle rules.    They are: 1) there is point tenderness (pain in one specific spot) over either of the inner or outer prominent parts of the upper ankle bones (the medial and lateral maleolus). 2) There is point tenderness  over the bones of the top of the midfoot (the long bones of the foot). 3) There is inability to bear weight both immediately following the accident and upon evaluation.  If any of these criteria are met, an x-ray will likely be done.  These criteria are certainly not diagnostic of a fracture but are more indicative of a fracture.  If your pain is more along the joint line on the outside of the foot below the prominent bone of the ankle and above the foot (the deltoid ligament area) then the injury is more likely to be a sprain.  If your pain is improving it is likely that rest, icing, elevation and possibly a compression dressing like an ace wrap (being sure not to make it too tight) are appropriate treatments.  If your pain is not getting better or it lasts for more than 5 or 6 days without being much better you should have it checked out.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sun Nov 25, 2007 8:23 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50824&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p50824"
  },
  {
    "author": "mhouse8228  Guest Posts: 1 Joined: Sun Sep 23, 2007 12:50 pm",
    "title": "Unexplained Swelling",
    "content": "I am not sure which 'specialty' to ask this question under.  This came closest so I will try here.    I am a 52 y/o female, controlled diabetic and asthmatic.  Last night I fell from a step...thought I was on a flat surface and just kept walking.  Next thing I knew I was on my face.  (Pretty funny when you think about it!)  Nothing broken but on outside of my upper thigh I have developed a swollen area that feels very much like a bruise but there is absolutely no discoloration.  Probably stands about an 1 1/2\" high at its highest point and is about the size of my open palm.  What would cause that and how do I get it to go away?\n\n",
    "posted_time": "Post  by mhouse8228 » Sun Sep 23, 2007 1:01 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=48159&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p48159"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Mhouse8228,  It is very possible that you may have bruised the underlying muscle without causing a bruise to the skin.  If this pain doesn't begin to get better in the next day or so I would recommend you see your doctor to have this evaluated.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Wed Nov 14, 2007 11:58 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50380&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p50380"
  },
  {
    "author": "underoath32  Guest Posts: 1 Joined: Mon Nov 12, 2007 2:34 pm",
    "title": "protein supplement?",
    "content": "Hey, I'm gettin back into lifting weights after football season. Is there anything bad about taking a protein powder as a supplement. My mom is leary about it.  I have acid reflux, but I wouldn't think extra protein would bother it. You tell me, is there anything to worry about. Looking to add some weight.\n\n",
    "posted_time": "Post  by underoath32 » Mon Nov 12, 2007 2:37 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50210&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p50210"
  },
  {
    "author": "Sandy Tracy RN  Nurse Posts: 60 Joined: Wed Nov 07, 2007 6:57 pm",
    "title": "[no title]",
    "content": "Hi, Underoath32  Most nutritional experts discourage the use of protein supplement for the following reasons:  1. Too much stress can be placed on the Kidneys. 2.They can contribute to dehydration. 3. Animal sources of protein can increase your risk of heart disease, because of the high fat intake. 4.Ingesting a large amount of amino acids can lead to imbalances of potassium, sodium and chloride. 5.Stomach cramping\n\n",
    "posted_time": "Post  by Sandy Tracy RN » Wed Nov 14, 2007 5:23 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50359&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p50359"
  },
  {
    "author": "Sandy Tracy RN  Nurse Posts: 60 Joined: Wed Nov 07, 2007 6:57 pm",
    "title": "[no title]",
    "content": "Sorry about that.  Stomach cramping, diarrhea and dehydration have been linked to some amino acid supplements.  If you still have questions, I encourage you to ask your football coach or trainer for more information.  If these sources are not available feel free to ask you family doctor they will be able to lead you in the right direction.  Thanks for your question and good luck Sandy RN\n\n",
    "posted_time": "Post  by Sandy Tracy RN » Wed Nov 14, 2007 5:26 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50362&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p50362"
  },
  {
    "author": "mckoolet  Guest Posts: 1 Joined: Mon Nov 12, 2007 3:45 am",
    "title": "Plantar Fasciitis",
    "content": "i am a 46 year old male and in very good health. I work out a lot and run 3-4 miles everyday even though i can feel some pain in my heel.The pain flares up when you first start an activity after resting. It's very painful so, i decided to visit the doctor and had an x-ray. the result was \"bone spur formation, calcaneus\". my doctor prescribed me some pain killer and ask me to rest and avoid strenous activities for a while. it's been a month now and it seems that my heel pain is gone. my question is, since it's not hurting anymore, can i start running again? it's a very painful experience and i don't want it to happen again.   i just had my general check- up last Sept. and everything is good.  i had an hemmoroid operation 8 yrs. ago, i'm not taking any medication except multivitamins.  thanks and best regards....\n\n",
    "posted_time": "Post  by mckoolet » Mon Nov 12, 2007 4:35 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50160&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p50160"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Mckoolet,  It is safest to start back into exercising slowly.  If the pain redevelops I would recommend you see a podiatrist.  Be sure to have some quality running shoes to help prevent more problems.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Tue Nov 13, 2007 11:38 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=50320&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p50320"
  },
  {
    "author": "fparley  Guest Posts: 1 Joined: Sat Oct 27, 2007 11:22 pm",
    "title": "Strained groin muscle, or worse?",
    "content": "I am a 20 year old male taking zocor and minocycline.  I exercise regularly, including heavy weight lifting.  Last week I noticed general pain in my groin a couple days after a workout.  I went to my doctor, who checked everything out, concluding that all felt normal, and that I probably strained a muscle in my groin.  The pain was not affected when he put pressure on different areas in my groin, it is simply a dull aching pain in the left side of my groin.  He said that I most likely did not have a hernia, but I think that I might.  Though he says my testicles were normal, I am quite sure that one is larger than it has been (the left side, corresponding with this pain).  I brought this up, and he expressed little concern.  From what I have read of inguinal hernias, testicular swelling could be a symptom along with groin pain.  Is it possible that he missed one of these, and would an ultrasound detect it if I have one?  Are there any stretches I could do to determine whether or not the pain could be from a muscle or a hernia, or the \"sports hernia/gilmore's groin\"?  I am just troubled by the diagnosis that I got, as this feels strange and unlike a strained muscle, plus I can't see how I would be imagining this swelling of the testicle.  Thanks in advance for any advice you may have for me.\n\n",
    "posted_time": "Post  by fparley » Sat Oct 27, 2007 11:44 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=49627&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p49627"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Fparley,  Hernias can cause pain similar to a pulled muscle.  Most commonly they present as a bulge in the scrotal area.  While they theoretically could cause some testicular swelling this would be pretty unlikely, unless the swelling is actually intestine in the scrotum and not enlargement of the testicle.  Hernias are typically more noticeable with standing or with bearing down of the abdominal muscles.  They typically become smaller upon lying flat.  To my knowledge there are no stretches to help determine if a hernia is present.  An ultrasound may be helpful in some cases but often is not needed.  My best recommendation for you is to follow up with your doctor for reevaluation to address your concerns.  Generally a thorough physical exam can detect a hernia.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Thu Nov 01, 2007 10:49 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=49800&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p49800"
  },
  {
    "author": "laughterjones  Guest Posts: 1 Joined: Sun Oct 28, 2007 11:29 am",
    "title": "Knee injury while lifting",
    "content": "Symptom: My right knee feels as if someone has taken a fist grip on it and is squeezing. I am able to turn my leg a certain way and my knee will pop/click which relieves pain for about ten seconds then the pain returns(which I am trying to avoid). The pain is not so bad as I can stand on it, walk or sit fine but when I am useing it it is definately an issue.  The direct area of pain is just below the knee cap and to the inner side of the cap. Sometimes pain comes from the 'middle' inside of the knee.  History/Misc: I believe my knee may have popped before but never associated with pain or any condition/injury and very seldom.  I am a fit 25yo male with no prior injuries to this knee.  Cause: This past Tuesday I was doing the leg press machine with some considerable weight. About halfway through my routine, I felt a small sharp pain in my knee then I stopped with that machine. It seemed fine the rest of the day but on Wednesday it became a real issue.  Treatment: Currently I am taking ibuprofen four times a day, 200mg, and am trying to stay off of the leg as much as possible. Seeing as I still need my cardio I did some swimming the other night and plan on doing more of this in the coming weeks.  Questions: Should I continue avoiding to pop my knee? Is this a serious tear or will self medication work? Possible prognosis? Should I wear a brace?  Hope this was clear enough. Thanks for reading.  lj\n\n",
    "posted_time": "Post  by laughterjones » Sun Oct 28, 2007 12:06 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=49652&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p49652"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Lj,  You may have a small tear in one of the cartilage cushions of the knee.  These may or may not heal on their own.  It is important to minimize ongoing trauma to the area while it heals.  I would recommend you see a sports medicine doctor or an orthopedic surgeon to have this further evaluated.  Your primary doctor is likely able to evaluate this well also.  I would suggest having it evaluated rather than waiting to see if it gets better to minimize the chances of worsening what ever may be going on.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Tue Oct 30, 2007 1:34 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=49753&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p49753"
  },
  {
    "author": "yarrowd  Guest Posts: 1 Joined: Sun Oct 21, 2007 4:39 pm",
    "title": "Foot pain related to swimming?",
    "content": "Hi, I'm a 33 year old male in decent shape.  I've recently started swimming, which I love.  But--since I've started I've had foot pain. I'll feel a little left ankle soreness after swimming itself, but worse than that is pain in my left foot when I first wake up in the morning.  The pain goes down the top of the foot, roughly radiating down the furrows between the bones on the top of the foot.   It is bad enough that it hurts to walk at first, though after 20 minutes or so of being up and around the pain fades.  There is also some achilles tightness, which persists a bit longer into the day, not quite pain, but tightness if I stretch the tendon. I'm 75% sure that swimming is related to this, as it seems a bit better if a few days go by without swimming.  But swimming is a great exercise so I'm looking to get more info about whether swimming is really to blame, and suggestions about how to overcome this problem.  I should say that as a former high school and college football player, I've had several bad ankle sprains through the years, but never anything quite like this top of foot pain.  Any help would be appreciated,  Thanks!\n\n",
    "posted_time": "Post  by yarrowd » Sun Oct 21, 2007 4:46 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=49248&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p49248"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Yarrowd,  Your pain may be related to using new muscles to swim that are now having some pain from the increased exercise.  Swimming uses different muscles than typical walking and daily activities use so the muscles may be getting more of a work out than they previously were.  Stretching well before swimming may help this.  If your pain is not getting better or if it is getting worse I would recommend you see your doctor for an evaluation.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Sun Oct 21, 2007 9:29 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=49280&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p49280"
  },
  {
    "author": "nadine  Guest Posts: 2 Joined: Mon Sep 03, 2007 8:25 am",
    "title": "swelling after exercising",
    "content": "Hi! When I do any type of exercises (rollerblade, mountain walking, badminton...), I seam to get swelling or water retention in my legs.(??) By the next day, It actually looks like I've gained 2-3 pounds !? What can this be? I'm actually afraid to work out...gaining weight is definitely not the goal. Thanks!\n\n",
    "posted_time": "Post  by nadine » Mon Sep 03, 2007 9:08 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=47279&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p47279"
  },
  {
    "author": "Debbie Miller, RN  Nurse Posts: 4746 Joined: Mon Apr 16, 2007 2:41 pm Gender: Female Location: USA",
    "title": "[no title]",
    "content": "Hi Nadine,  Remember that water weight is not fat and it definitely temporary so don't be tempted to avoid the exercise for this reason.  Fluctuating hormone levels can contribute to water retention in women - you may even notice additional retention corresponding with your menstrual cycle.  Another factor to look at is diet.  If you use lots of sodium (salt and sodium rich foods that are typically overabundant in the American diet) this will also exacerbate the problem.  Not drinking enough water can also contribute. Add a little lemon to the water and the benefit increases.  You may also benefit from a calcium supplement.  Many women are not getting enough calcium in their diet and helping prevent fluid regulation is just one reason we want to be sure we get enough.  You may want to add around 1,000 mg. daily - dairy products can do this too in a form your body can utilize well.  If you take a supplement, the citrate is more readily absorbed than other forms such as carbonate.  Of course, water retention can also be a sign of a more serious medical condition such as kidney malfunction.  So, if the other measures don't seem to help, be sure to have this evaluated by your doctor.    Take care and congratulate yourself on your commitment to exercise.\n\n",
    "posted_time": "Post  by Debbie Miller, RN » Mon Oct 01, 2007 3:56 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=48532&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p48532"
  },
  {
    "author": "lmckain  Guest Posts: 1 Joined: Wed Jul 25, 2007 7:36 am",
    "title": "Ankle Pain",
    "content": "I am a 46 year old male and it very good health. I workout at least three times and week, including legs exercises. No pain or problems when working out legs. However, I noticed, recently, that my ankles hurt terribly when I go for a long walk. There is no swelling and the pain will go away about 5 mins after I stop. The pain will start about 1/2 mile into the walk. I tried to play tennis recently (played lots of times before) and 5 minutes into the games my ankles were killing me.  I endured the pain for about an hour and half and at the end of the game the pain was still there and I felt a tingling and burning sensation in my toes (feels almost like frostbite - 85 degree outside). Also, I noticed that when I am in traffic and I have to constantly switch from the gas pedal to the break pedal my ankle will start to hurt. Any idea what could be causing this problem?  I have never had surgery and never had injury to my ankle. My last annual checkup (April 2008), all my blood work were normal except for a sign of slight anemia but my doctor says it wasn't significant.  The only medication I am taking in AmbienCR for sleep. Also, I have had asthma since childhood but it's under control but I have taken different medications including steroids (Medrol pack) and puffers to control it. I am currently controlling the asthma with acupunture, which seems to be helping  Thanks,  Lipton\n\n",
    "posted_time": "Post  by lmckain » Wed Jul 25, 2007 8:10 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=45240&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p45240"
  },
  {
    "author": "Debbie Miller, RN  Nurse Posts: 4746 Joined: Mon Apr 16, 2007 2:41 pm Gender: Female Location: USA",
    "title": "[no title]",
    "content": "My first guess would be perhaps some osteoarthritis.  You may want to get this checked with a family doctor, rheumatologist, or orthopedic doctor.  You may be able to be helped with anti-inflammatory medications.  Good luck\n\n",
    "posted_time": "Post  by Debbie Miller, RN » Thu Aug 02, 2007 5:51 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=45621&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p45621"
  },
  {
    "author": "favotcrystal  Guest Posts: 1 Joined: Wed Jul 25, 2007 7:10 am",
    "title": "Shin Splints",
    "content": "Hello, I am a 23 year old female who has been suffering with shin splints for 5 years. I recently had a baby she is 3 months now so I have not ran for about a year. I healed amazingly and just started to jog slowly and for short periods of time (2 minute intervals with walking) early morning 3 days a week. I went jogging this morning and was able to do a little more because my tolerance is increasing and my shin splints started to ache to the point where I am now limping. I have spent about $600 dollars in physiotherapy when i first got them five years ago and they are still here. Nothing seems to take the pain away and I did not over work them at all because I am aware of them. I love to run and I have been struggling with this for years and getting extremely frusterated. I've iced them and done calf workouts and I try everything to make them feel better but now they are worse then ever and I only jogged for about 5 minutes. Please help me or give me some other form of advice because they are really discouraging when I'm trying to lose the baby weight. Thank you Crysatl\n\n",
    "posted_time": "Post  by favotcrystal » Wed Jul 25, 2007 7:24 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=45238&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p45238"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Hi Favotcrystal,  Shin splints can be incredibly painful, as you have discovered.  Unfortunately, they are prone to recur, as you have also discovered.  Ibuprofen is often helpful with the pain; however, it is important not to use the ibuprofen to take the pain away so you can keep exercising as this just makes things worse.  Rest is important.  Stretching well before exercising can help some.  You may want to see a sports medicine specialist.  They may have some good tips for you on how to keep the shin splints from returning.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Thu Aug 02, 2007 5:48 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=45620&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p45620"
  },
  {
    "author": "Runner Guy  Guest Posts: 1 Joined: Sun Jul 08, 2007 10:42 am",
    "title": "Knee Pain",
    "content": "I am a 41 year old male in excellent health.  About 10 years ago, I was struck on the inside of my knee in a sports event.  The pain was initially intense, then subsided utilizing RICE techniques.  I have avoided running and hiking to relieve pressure on the knee but recently decided that I need to run again.  I am concerned about catastrophic failure of the knee.  Is there a test to check for strength and stability as I begin to exercise again?\n\n",
    "posted_time": "Post  by Runner Guy » Sun Jul 08, 2007 10:53 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=44324&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p44324"
  },
  {
    "author": "Dr. Chan Lowe  Medical Doctor Posts: 4069 Joined: Fri Dec 08, 2006 3:35 pm",
    "title": "[no title]",
    "content": "Much of the knee can easily be examined by your doctor.  It involves pulling/pushing in various ways to assess the integrity of the multiple ligaments that hold the knee together.    If all is well on the physical exam, there is usually no need for further imaging and running should be fine.  Best wishes.\n\n",
    "posted_time": "Post  by Dr. Chan Lowe » Wed Jul 18, 2007 4:57 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=44801&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p44801"
  },
  {
    "author": "stash  Guest Posts: 1 Joined: Thu Apr 12, 2007 2:01 am Location: Tokyo, Japan",
    "title": "Neck burning/tingling",
    "content": "To whom it may concern:  I am a 34 y/o male competitive grappler.  I exercise daily, doing a combination of calisthenics, weight lifting, and Jiu-Jitsu/wrestling.  Although I can't recall any particular injury and I'm not in pain, when I shrug my left shoulder or lay on my left side, I get a strange tingling or burning sensation up my neck and to my jaw on the left side.  This has continued for about 2 weeks, but no change.  I'm not in pain but alarmed.  I suspected disc compression or a pinched nerve?? Any thoughts??  Thank you for your time in advance.\n\n",
    "posted_time": "Post  by stash » Mon Apr 16, 2007 6:59 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=40842&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p40842"
  },
  {
    "author": "Marceline F, RN  Nurse Posts: 229 Joined: Wed Feb 28, 2007 1:54 am",
    "title": "[no title]",
    "content": "Dear Henry, Aggressive full-body contact sports can cause different types of injuries in the competitors.  While you may not recall a specific trauma or incident that may have caused your current neck burning and tingling, it does seem possible that a partial subluxation in the neck may have occurred either acutely or over a period of time.  Many competitors have developed a personal style of wrestling or grappling that includes favoring one side over the other, or one angle over another.  As you study your opponent prior to a match, these moves may be ones you watch for.  At the same time, you too may have developed certain habits of guarding or attack that favor certain angles.  Over a period of time the c-spine can succumb to stress or pressure and cause problems in the disks, the disk spaces, and the nerves passing through the spinal column.  A Cat Scan of the neck, maybe even an MRI would be a valuable diagnostic tool to help determine if you indeed have any damaged areas in your spinal column. I would certainly have it investigated by a physician prior to any further contact matches, to be sure you do not have something wrong right on the brink of disasterous. Your next match could be your last.\n\n",
    "posted_time": "Post  by Marceline F, RN » Tue Apr 17, 2007 3:32 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=40900&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p40900"
  },
  {
    "author": "rcovingt  Guest Posts: 1 Joined: Fri Feb 24, 2006 2:00 pm",
    "title": "Sleep Change After Starting Exercise",
    "content": "I am a 50 year old male in good health.  While I am in reasonable shape, I recently began an exercise program for the first time since high school.  I do 30 minutes of cardio 6 days a week, weights 3 tims a week, and some swimming.  At the same time I started exercising, I also pushed my bed time up 30 minutes to allow for extra sleep.  While I had been sleeping consistantly 7 hours per night, immediately after beginning the exercise program, I began waking up 2 hours earlier than normal, and not being able to go back to sleep.  This pattern has continued on a daily basis since that time.  I do not feel sleep deprived at all, and my energy is excellent, but I am wondering if the exercise is related to the sudden sleep pattern change.  Thanks,  Robert\n\n",
    "posted_time": "Post  by rcovingt » Fri Feb 24, 2006 2:09 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=31291&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p31291"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi rcovingt, Exercise certainly increases energy, decreases depression, and it is not an impossibility that sleep pattern changes may occur. As long as you do not feel sleep deprived, and you feel refreshed upon awakening, I would not consider this as a harm or detriment. Sincerely, Theresa Jones, RN\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Mon Mar 27, 2006 9:42 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=32199&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p32199"
  },
  {
    "author": "Acrobat  Guest Posts: 30 Joined: Sat May 29, 2004 11:51 pm Location: Temporarily in Canada",
    "title": "Aerobic Excersise suggestion",
    "content": "Hi, this may sound silly but its a real problem i have. I have agorophobia which means i don't like leaving the house. Ive been putting on alot of weight and feel generally unfit and unhealthy. I did situps but it built muscle under the fat on my stomache and i don't want that.  Can anyone suggest a good aerobic excersise that will help me burn off fat from all over my body and get my heart pumping? I cant go running because i don't like going outside and feel paranoid. And i tried skipping but i couldnt get a good work out from it because my arms just got tired.  I don't have any stairs i can run up or down, and running on the spot doesnt work well enough. I tried doing shuttle runs (10 paces in one direction then back the other way and repeat) but i heard that is bad for joins like knees and ankles. Is that true? So i need something i can do in the back yard that is aerobic like squat thrusts or something, but more aerobic and for the entire body and that doesnt build muscle.  p.s. i hardly eat any calories or sugar or fatty foods but i hardly leave the house so i don't burn off any calories at all, so i get fat easily.\n\n",
    "posted_time": "Post  by Acrobat » Tue Apr 19, 2005 5:28 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=12563&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p12563"
  },
  {
    "author": "Summit  Guest Posts: 3 Joined: Wed Apr 20, 2005 2:06 am Location: California",
    "title": "[no title]",
    "content": "I would check with a therapist for the phobia problem. As far as the exercise goes, get a good jump-rope and maybe a jumpping video off the internet. It is cheap and a great workout when you learn the different ways to jump. I think you should seriously seek a therapists help more than anything. I'm not a doctor though, and it is just my opinion.\n\n",
    "posted_time": "Post  by Summit » Thu Apr 21, 2005 12:06 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=12656&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p12656"
  },
  {
    "author": "Acrobat  Guest Posts: 30 Joined: Sat May 29, 2004 11:51 pm Location: Temporarily in Canada",
    "title": "[no title]",
    "content": "Thanks Summit.  I will try with the rope again and keep doing it to break a sweat and hopefully get fitter. As for a therapist, ive always been scared of going to one because there is a bigger stigma about it here in the UK compared to in the US. I might consider it tho.  And in honesty, im not really very agoraphobic, but i have a similar problem which im kinda embarassed to mention because its quite silly sounding.\n\n",
    "posted_time": "Post  by Acrobat » Fri Apr 22, 2005 5:19 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=12724&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p12724"
  },
  {
    "author": "Dresta  Guest Posts: 2 Joined: Sun Oct 02, 2005 11:19 am Location: Illinois",
    "title": "[no title]",
    "content": "Hi Acrobat,  I am not a doctor either but I was involved in a good workout regimen that helped me burn alot of calories and lose about 30 lbs. all over.  Beachbody.com or Power 90. It is a mix of cardio and sculpting and other things.  Its basically cardio every other day and sculpting every other day with one day of rest.  Check it out.    It did wonders for my wife and I and we also used an online progress program for diet and exercise and also chatroom setup for interaction between other people doing the program all over the world.    Pretty cool stuff.  The hardest part is the first couple weeks. (it is in everything).  But I guarantee that it will be fulfilling.  Hope I can help.  Take care.\n\n",
    "posted_time": "Post  by Dresta » Sun Oct 02, 2005 11:57 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=22107&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p22107"
  },
  {
    "author": "lasalle  Guest Posts: 1 Joined: Tue Oct 11, 2005 10:03 am Location: minneapolis",
    "title": "marathon running/dehydration",
    "content": "I'm a 24yr/old female who had difficulty with a marathon. I had trained for 18 weeks doing all the required long distance training runs (19-20 milers) with no problems with dehydration even in the hot summer months. When I ran this weekend in chicago the temps were 50-62*F. I followed my same pre-race routines eating and drinking fluids as I did in training. I was urinating pre-race and during race as usual and taking gatorade high endurance that was offered at the \"aid stations\". By the 6 mile mark I was feeling dizzy. The gatorade was giving me nausea so I just took water at the aid stations after that. At 13 miles I was still dizzy, and I was soooo thirsty but when I drank water it just sat in my stomach ( I could feel it when I ran) At 17 it was getting difficult to run: still dizzy, couldn't get my breath and no matter how much I drank I was still thirsty. I did finnish, but I walked alot in between short runs. I ended up in the medical tent afterwards and they said I as dehydrated. I don't understand how I could get dehydrated starting at 6 miles when I had followed my training with taking in fluids pre-and during the race. The only thing I did different was take 1dose of DayQuil COld and Flu 18 hours before the race because I thought I was starting to get a cold(scratchy throat)[/i]\n\n",
    "posted_time": "Post  by lasalle » Tue Oct 11, 2005 10:31 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=23085&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p23085"
  },
  {
    "author": "Acrobat  Guest Posts: 30 Joined: Sat May 29, 2004 11:51 pm Location: Temporarily in Canada",
    "title": "[no title]",
    "content": "Hi all, I couldn't figure out how to make a new topic so i decided to post in this one. Its maybe related anyway.  Since my post ive managed to lose lots of weight and im much fitter and healthier now. My problem of going outside is gone now too and i manage to go for a jog a few times a week.  My body is much fitter now and looks much better and i have a 6 pack stomache. Unfortunatly i have one problem i just cant get rid of. My neck....  It looks like its sagging alot and its only happened since i turned about 25, so im aware its a natural thing that happens with age. But the skin itself is actually very firm, and under the skin is very firm and i can feel my tongue etc... Basically what im saying is that there is no fat on my neck or under my chin, but it still has gone from sloping upwards from under my chin to my neck, through horizontal and now its sloping downwards from my chin down to my adam's apple.  It changes the whole appearance of my face and i look alot older now. I know people can get surgery to get a neck tuck or whatever, but i don't think that would help me because its not lose skin. I can make it go back to looking like a perfect 18 year old by pushing my tongue against my teeth or by closing my throat. Unfortunatly i cant breath when my throat is closed :P and i cant push my teeth with my tongue forever.   So does anyone know an excersise i can do to fix or atleast improve my neck? Its really something that bothers me alot and will effect my profession. I have seen people older than me and even people in their 30's who have a perfect neck and jawline and don't have the problem i have. Some do.... and obviously everyone is different from heriditary and genetic reasons, but i have to find something i can do to atleast improve my neck, its noticable to other people so not in my mind.  Please help.\n\n",
    "posted_time": "Post  by Acrobat » Tue Nov 29, 2005 9:22 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=25891&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p25891"
  },
  {
    "author": "nalge  Guest Posts: 1 Joined: Sat Apr 09, 2005 9:37 pm Location: Canada",
    "title": "Does lifting weights stunt growth?",
    "content": "Hello,  I am 5'7, 16 and have been lifting weights for about 8 months now. I am just asking all you people who know your medical stuff your opinion on the \"Does lifting weights stunt growth?\" topic. I like weight training and body building but if it will cause me to not reach my maximum height I can wait the few more years. Can someone please shed some light on this topic. I know some of you are Doctors and thought you would know the truth to this. Thanks!\n\n",
    "posted_time": "Post  by nalge » Sat Apr 09, 2005 9:45 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=12129&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p12129"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi nalge, There has been some research that suggests that heavy, strenuous, weight lifting during early adolecence may alter growth plates. Proper form and lifting techniques should be used for your particular muscles endurance. This aides in prevention of injuries.  Always have a physical evaluation before beginning an exercise regimen. Sincerely, Rntdj\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Fri Jul 15, 2005 4:31 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=16834&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p16834"
  },
  {
    "author": "jsnone1  Guest Posts: 3 Joined: Sun Jul 03, 2005 12:51 pm Location: USA",
    "title": "Injured Testicle---will it go away???",
    "content": "I rode my first wheelie on my new motorcycle, when I came down I smashed my right testicle against the gas tank, immediate pain, then it kinda went away, then an hour later I noticed swelling, it has swollen to about the size of a kiwi, it has now been almost 24 hours and it does not seem that the swelling has went down.\n\n",
    "posted_time": "Post  by jsnone1 » Sun Jul 03, 2005 12:56 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=16243&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p16243"
  },
  {
    "author": "Shannon Morgan, CMA  Medical Assistant Posts: 530 Joined: Fri May 06, 2005 6:28 pm Location: Dallas, Texas. USA.",
    "title": "[no title]",
    "content": "Go to the ER now, if you haven't.\n\n",
    "posted_time": "Post  by Shannon Morgan, CMA » Tue Jul 05, 2005 9:46 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=16316&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p16316"
  },
  {
    "author": "jsnone1  Guest Posts: 3 Joined: Sun Jul 03, 2005 12:51 pm Location: USA",
    "title": "[no title]",
    "content": "I went to the Urgent care Sunday after work, they inspected mt testicle and told me to wear a jock strap, and gave me Tylenol 3 for the pain, I got the jock strap that night, it seemed to hurt more with it on, but I wore it, the pain pills are working good, but I think it has actually gotten a little bigger, the skin of my scrotum on that side is also thick and hard, the other side is normal.....$50 a pop to go back.....any advice is appreciated!!!!!!\n\n",
    "posted_time": "Post  by jsnone1 » Tue Jul 05, 2005 7:40 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=16344&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p16344"
  },
  {
    "author": "Shannon Morgan, CMA  Medical Assistant Posts: 530 Joined: Fri May 06, 2005 6:28 pm Location: Dallas, Texas. USA.",
    "title": "[no title]",
    "content": "I'm concerned that it is still swelling; you should call the clinic and tell them about this.    Did they suggest icing it?  Did they tell you to call if it got worse?\n\n",
    "posted_time": "Post  by Shannon Morgan, CMA » Tue Jul 05, 2005 7:55 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=16346&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p16346"
  },
  {
    "author": "SmashbrothaX  Guest Posts: 1 Joined: Wed Apr 20, 2005 1:35 pm Location: Novi, MI  Contact:   Contact SmashbrothaX       AOL",
    "title": "Working out first thing in the morning",
    "content": "Hi everyone.  I been having a problem with \"waking up\" in the morning.  I have no problem getting up with my alarm, but I'm very tired for most of the morning (even after drinking coffee/tea).  So, I've been thinking about working out in the morning, wondering if that will help.  I'm just interested in what the pros/cons are in working out after working out/before breakfast.  Thanks!\n\n",
    "posted_time": "Post  by SmashbrothaX » Fri Jun 24, 2005 7:50 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=15741&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p15741"
  },
  {
    "author": "Shannon Morgan, CMA  Medical Assistant Posts: 530 Joined: Fri May 06, 2005 6:28 pm Location: Dallas, Texas. USA.",
    "title": "[no title]",
    "content": "Working out in the morning is recommended after eating.  There is no ready fuel to supply energy for the body to work.  The old thinking was that since there was little to no blood sugar, it would burn fat.  Not true.  The body always burns any type of sugar it can get first, which in that case would be glycogen which is stored in the muscles.  Therefore, it burns muscle, and weaken you, the opposite of what you want!  Only when it burns the muscle free of any sugar will it burn fat.  It is best to fuel the body with \"good\" carbs 30-60 minutes before you exercise.  Good carbs are whole grains, whole wheat bread, plain oatmeal, no sugar (the best option) or whole grain cereal, which is the last, because there is always added sugar.  Make sure you get protein with it (2 eggs are good, or egg substitute for less cholesterol) or cottage cheese, and some juice (not from concentrate).  After a while doing this regularly (take two days off per week, your muscles need recovery time), your metabolism will move faster and burn fat.  Do not expect results right away and do not skip meals, it will slow your metabolism.  I hope that helps!\n\n",
    "posted_time": "Post  by Shannon Morgan, CMA » Fri Jun 24, 2005 8:01 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=15743&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p15743"
  },
  {
    "author": "ashure  Guest Posts: 4 Joined: Fri Apr 01, 2005 9:36 pm Location: Indiana",
    "title": "I hit the wall with the side of elbow",
    "content": ":( I was playing basketball went to save the ball and hit the wall with the side of elbow  I brused instantly and turend red. Then I got A EGG size lump on it. I can still bend it  but its the twisting that hurt. The part that hurts the most is on the back of the arm just above the elbow....What do you think is worng and should I go to the doctor\n\n",
    "posted_time": "Post  by ashure » Fri Apr 01, 2005 10:28 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=11733&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p11733"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi ashure, Bursitis of the elbow from injury usually reflects a painful lump over the tip of the elbow. Application of ice packs (on 15-20 minutes three or four times daily) elevating the arm above the level of your heart and taking anti-inflammatory medications usually provide relief. However, I would suggest an evaluation to assure this is the only treatment necessary and no other anomalies are present. Sincerely, Rntdj\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Sat Apr 02, 2005 6:32 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=11745&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p11745"
  },
  {
    "author": "elias  Guest Posts: 15 Joined: Tue Jan 18, 2005 3:40 am Location: Torrance, CA  Contact:   Contact elias       AOL",
    "title": "excercise time per day",
    "content": "how many minutes a day do we need to excercise? like 30 minutes right? does walking count?\n\n",
    "posted_time": "Post  by elias » Wed Jan 26, 2005 2:27 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8588&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p8588"
  },
  {
    "author": "Kirsty_Oz  Guest Posts: 64 Joined: Wed Aug 18, 2004 3:59 am Location: Australia",
    "title": "[no title]",
    "content": "walking is often the most suggested form of exercise, because it is easy, convenient and most people enjoy it. in the state of australia that i live in it is highly publicised to partake in 30 minutes of physical activity a day... even if you break it up 3X10. 30 minutes is the recommended to maintain optimal health.\n\n",
    "posted_time": "Post  by Kirsty_Oz » Wed Jan 26, 2005 2:34 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8589&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p8589"
  },
  {
    "author": "elias  Guest Posts: 15 Joined: Tue Jan 18, 2005 3:40 am Location: Torrance, CA  Contact:   Contact elias       AOL",
    "title": "[no title]",
    "content": "oh? dividing it up is ok too? sweet\n\n",
    "posted_time": "Post  by elias » Wed Jan 26, 2005 2:36 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8590&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p8590"
  },
  {
    "author": "Kirsty_Oz  Guest Posts: 64 Joined: Wed Aug 18, 2004 3:59 am Location: Australia",
    "title": "[no title]",
    "content": "most people are probably more inclined to exercise in 10-20 bursts. remember, you need an elevated heart rate whilst walking for it to be most effective.... but not too high! walk so you can carry a conversation. you are walking too fast if you are gasping for breathe whilst speaking, and too slow if you can sing!.  if you are starting a exercise regime for health reasons (weight loss or heart health etc), maybe consider taking to you local gp and see what they suggest.\n\n",
    "posted_time": "Post  by Kirsty_Oz » Wed Jan 26, 2005 3:14 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8591&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p8591"
  },
  {
    "author": "elias  Guest Posts: 15 Joined: Tue Jan 18, 2005 3:40 am Location: Torrance, CA  Contact:   Contact elias       AOL",
    "title": "[no title]",
    "content": "sorry, what's a gp?\n\n",
    "posted_time": "Post  by elias » Wed Jan 26, 2005 11:54 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8599&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p8599"
  },
  {
    "author": "Kirsty_Oz  Guest Posts: 64 Joined: Wed Aug 18, 2004 3:59 am Location: Australia",
    "title": "[no title]",
    "content": "a general practitioner. a local doctor,\n\n",
    "posted_time": "Post  by Kirsty_Oz » Wed Jan 26, 2005 8:42 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8619&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p8619"
  },
  {
    "author": "Jan  Guest Posts: 4 Joined: Mon Dec 20, 2004 9:22 pm Location: Colorado",
    "title": "Difficulty following exercise and insomnia",
    "content": "Hello.  I have spent the last four years practicing wellness to overcome something that is kind of like chronic fatigue.  I am much better now because I have worked hard at improving my health, but two problems remain which I have been unable to resolve.  Insomnia -- I wake up at 3 a.m. with palpitations and tension, and cannot fall back asleep for 3 hours.  Then I can sometimes sleep for a little while.  I also experience the palpitations sometimes when I am trying to fall asleep, but this is not a major issue.  Stress makes the insomnia worse.  Problems after exercising -- The last two times I did strength training (minimal - four machines for 1 minute each), about 3 hours after exercising, I became very cold, tense, and it seemed like there was some kind of spasm in my right abdomen just around or below the liver.  The energy was cut off to my upper body.  The palpitations and tension were strong.  What finally ended this episode was drinking hot herbal tea, which seemed to relax my liver.    Does anyone have any idea what might be going on?  The main clue I have to go on is about 7 years ago, under a doctor's care, I took some pregnenolone.  It caused palpitations, which increased with more pregnenelone, and which did not go away after I stopped taking it.    Thanks in advance for any thoughts or ideas on the subject.  Any comments are welcome and will receive my due consideration.  I would like to be able to sleep and exercise.  Best wishes, Jan\n\n",
    "posted_time": "Post  by Jan » Mon Dec 20, 2004 9:32 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=7216&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p7216"
  },
  {
    "author": "Dr. Russell M  Medical Doctor Posts: 650 Joined: Mon Jun 09, 2003 12:34 pm Location: USA",
    "title": "[no title]",
    "content": "Hi!  How were you diagnosed with autonomic dysregulation previously? Was the right-abdominal 'spasm' an isolated event?  bill\n\n",
    "posted_time": "Post  by Dr. Russell M » Wed Dec 22, 2004 12:24 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=7259&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p7259"
  },
  {
    "author": "Jan  Guest Posts: 4 Joined: Mon Dec 20, 2004 9:22 pm Location: Colorado",
    "title": "[no title]",
    "content": "Thanks, Bill.  An informal diagnosis of \"dysautonomia\" (autonomic dysregulation) was given by a retired holistic md friend of mine.  It has improved greatly, except for the insomnia.  The right side spasms first originated following a liver flush.  They continued intermittently,  and were not helped by two more liver flushes, nor by acupuncture, chinese herbs, or typical liver aids like alpha lipoic acid or castor oil packs.  B12, Vitamin C and Iron, and N-A-C helped the liver restore normalcy. Then, however, the right side spasms started again following a very small amount of strength training/exercise.  Best wishes, Jan\n\n",
    "posted_time": "Post  by Jan » Thu Dec 23, 2004 9:27 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=7308&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p7308"
  },
  {
    "author": "Jan  Guest Posts: 4 Joined: Mon Dec 20, 2004 9:22 pm Location: Colorado",
    "title": "[no title]",
    "content": "Dear Bill and others,  I'm looking forward to your responses.  I am also interested in any reading recommendations you might be able to offer for my problem.    Thanks, Jan\n\n",
    "posted_time": "Post  by Jan » Tue Dec 28, 2004 10:28 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=7465&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p7465"
  },
  {
    "author": "Jan  Guest Posts: 4 Joined: Mon Dec 20, 2004 9:22 pm Location: Colorado",
    "title": "Autonomic dysregulation",
    "content": "I'm really looking forward to anyone's reply.  Thanks so much, Jan\n\n",
    "posted_time": "Post  by Jan » Wed Jan 05, 2005 1:27 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=7794&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p7794"
  },
  {
    "author": "Dr. Russell M  Medical Doctor Posts: 650 Joined: Mon Jun 09, 2003 12:34 pm Location: USA",
    "title": "[no title]",
    "content": "Hi!  You seem to have followed alternative medicines, which I am little aware of. Have you been to a regular MD with your problems? If so, what is your doctor's opinion? If not, I suggest you visit your doctor to be examined.  bill\n\n",
    "posted_time": "Post  by Dr. Russell M » Thu Jan 06, 2005 11:31 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=7825&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p7825"
  },
  {
    "author": "princessxali  Guest Posts: 7 Joined: Thu Dec 23, 2004 12:34 am Location: united kingdom  Contact:   Contact princessxali       Website   Yahoo Messenger   AOL",
    "title": "exercises for stomach",
    "content": "hi there all,  I am wondering what is the best sort of exercise to get my stomach a bit flatter for the past 3 years i have been pregnant and had caesereans each time so where the scar is I have a bit of stomach that hangs over it will i ever get rid of this or should i learn to live with it? my youngest is 15 months old now so is it safe to exercise on my stomach it still feels tender around the scar any help gratefully received.\n\n",
    "posted_time": "Post  by princessxali » Thu Dec 23, 2004 11:45 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=7298&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p7298"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Hi princessxali, It is always best to begin with light exercise, avoiding crunches and situps at first. Try beginning with a light aroebic exercise. Remember, don´t jump into anything too quickly. If you begin to feel pain in your incision area, stop exercising at once. If the pain continues, be sure to let your doctor know as soon as possible.  If you all goes well then you should depend on crunches in addition to dieting. It takes time and alot of effort. But the results are always rewarding and long lasting.  Best regards,\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Fri Dec 24, 2004 2:51 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=7331&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p7331"
  },
  {
    "author": "princessxali  Guest Posts: 7 Joined: Thu Dec 23, 2004 12:34 am Location: united kingdom  Contact:   Contact princessxali       Website   Yahoo Messenger   AOL",
    "title": "[no title]",
    "content": "hi doctor  than you for replying i will try that thanks once again.\n\n",
    "posted_time": "Post  by princessxali » Fri Dec 24, 2004 3:19 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=7333&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p7333"
  },
  {
    "author": "stephanygagnon  Guest Posts: 2 Joined: Mon Apr 26, 2004 7:03 pm Location: Quebec",
    "title": "Vomits right after exercise",
    "content": "Hi, I'm here because I'm very worried about my boyfriend. He plays hochey, and at the last game, he had to stop because he had trouble to breathe, he was dizzy, was seeing black spot and he vomited. It happened to him 3 times since he re-started hockey. (He hadnt played for one entire year)  I think it may be because he just re-started hockey. I don't know...please reassure me.   -Stef-\n\n",
    "posted_time": "Post  by stephanygagnon » Sun Sep 19, 2004 7:15 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5422&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p5422"
  },
  {
    "author": "Dr. Russell M  Medical Doctor Posts: 650 Joined: Mon Jun 09, 2003 12:34 pm Location: USA",
    "title": "[no title]",
    "content": "Hi!  Did he have himself examined by a doctor after these episodes? Is his blood pressure normal?  bill\n\n",
    "posted_time": "Post  by Dr. Russell M » Fri Sep 24, 2004 3:58 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5554&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p5554"
  },
  {
    "author": "Frvade  Guest Posts: 8 Joined: Thu Aug 26, 2004 10:19 pm Location: Virginia",
    "title": "Pull Ups",
    "content": "I was wondering if different ways of doing pulls have been medically shown to improve muscle development or if they vary what muscles are worked. I was wondering if A. does holding your hands on the bar close together or wide apart work your musles more or less and B. does the exercise work different muscles if you face your closed hand towards you or away from you (ie are your fingers towards you or away from you... I'm hoping I got my question across, since you can face your hands 2 ways)?\n\n",
    "posted_time": "Post  by Frvade » Tue Sep 07, 2004 3:17 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5179&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p5179"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Hello Frvade,  You are using a different group of muscles with each of these exercises. You should always have a trainer at the begining until you are experienced enough as you could injure yourself if you do not do the exercises properly.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Tue Sep 07, 2004 6:46 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5184&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p5184"
  },
  {
    "author": "Frvade  Guest Posts: 8 Joined: Thu Aug 26, 2004 10:19 pm Location: Virginia",
    "title": "Weight-lifting question",
    "content": "Hey,     I've heard it's bad if you work the same muscle groups multiple days in a row and that doing so can also do more harm than good, but I've also heard of major fitness buffs who do the same workout everyday at 4 am. Thus I was wondering which is true. Will doing the same lifting exercises daily be harmful as opposed to beneficial.\n\n",
    "posted_time": "Post  by Frvade » Fri Aug 27, 2004 11:13 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=4906&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p4906"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Hello, Putting too much strain on a certain group of muscles will probably be counter productive. As in any training program, rest is an essential factor. It's important to leave a day between exercising a specific body part or muscle in order to reap the benefits of your hard work. Weightlifting may cause micro-tears in the muscle fiber(s) that temporarily reduce strength. These tears are thought to cause some of the soreness you feel after a new exercise or tough workout. During this crucial rest time, your muscles are building protein and getting stronger. It takes about two days to heal the muscle fibers torn by weightlifting.   One safe schedule would focus on different muscle groups in three-day cycles, leaving two days in between the same group. For example:    Day one: back and biceps  Day two: chest and triceps  Day three: legs and abs  Day four: repeat day one  Best regards,\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Sat Aug 28, 2004 12:00 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=4914&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p4914"
  },
  {
    "author": "chrisy  Guest Posts: 11 Joined: Sun Nov 02, 2003 11:39 am Location: NY",
    "title": "Stretching pain right below her knee",
    "content": "Dear Doctor,     A few days ago, my mother experience this stretching pain right below her knee. It felt like someone riped the muscle off her bone. A day later, the pain is gone but so is the muscle. it's just skin and bone. now there's a hollow. what is this strange problem? Thanks. -christina\n\n",
    "posted_time": "Post  by chrisy » Wed Jul 21, 2004 12:12 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=4183&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p4183"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Hello Chrisy Its very difficult for me to evaluate your mother's problem over the internet. However, the pain you described is most often seen in muscle spasm. The muscle contracts really hard that it becomes painful. Naturally, if it contracts it becomes more prominent and your mother can easily feal it. Once it relaxes again it returns to normal and can be hardly felt unless it is contracted e.g. by flexing the toes up (dorsiflexion).  Causes of transient muscle spasm include: fatigue, mineral abnormalities and could also be a normal physiological process.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Wed Jul 21, 2004 1:55 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=4188&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p4188"
  },
  {
    "author": "chrisy  Guest Posts: 11 Joined: Sun Nov 02, 2003 11:39 am Location: NY",
    "title": "Thank you Dr. Fouad",
    "content": "Thank you for replying, it definitely made me feel better. But is it normal for her to feel hot (on her legs) when she's not hot to the touch? and it's a hollow on her right leg but her left feels normal. Thanks.\n\n",
    "posted_time": "Post  by chrisy » Wed Jul 21, 2004 11:22 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=4192&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p4192"
  },
  {
    "author": "yawzerz  Guest Posts: 1 Joined: Sun Mar 30, 2003 10:34 am",
    "title": "how can someone eliminate static from the body.",
    "content": "i get static so bad that i vannot comb my hair a my skin becomes staticky and very dry\n\n",
    "posted_time": "Post  by yawzerz » Sun Mar 30, 2003 10:38 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=577&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p577"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "The static in your body is related to your surroundings and the clothes you are wearing whether they conduct electricity or not. Does anyone else in the house / place complain of this? Does it happen to you everywhere regardless of place   Tamer Fouad, M.D.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Thu Apr 03, 2003 11:46 am",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=593&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p593"
  },
  {
    "author": "Dr. Yasser Mokhtar  Medical Doctor Posts: 1387 Joined: Sun Dec 29, 2002 1:24 pm",
    "title": "Re: Statics",
    "content": "Dear Liz,  i think that if you are combing you hair with a plastic comb or other brushes, try combing it with a comb made of wood which will not cause any static what so ever and will improve your hair's dryness.  Thank you very much for using our website http://doctorslounge.com and i hope that this information helped.   Yasser Mokhtar, M.D.\n\n",
    "posted_time": "Post  by Dr. Yasser Mokhtar » Fri Apr 04, 2003 7:21 pm",
    "category": "Miscellaneous Medical Topics",
    "sub_category": "Sports medicine",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=600&sid=b7c2fb106f7896ac4afe99d13f40b0c1#p600"
  }
]