[
  {
    "author": "d99  Guest Posts: 1 Joined: Tue Oct 27, 2009 3:27 pm Gender: Male",
    "title": "Genetics Passed on from Grandparents when having children?",
    "content": "Hello,  I'm wondering how genetics fall into play from the grandparents and great grandparents when having children? For example, my partner has a very sick family (sister has dead kidneys, father has parkinsons disease, mother has arthiritis, grandparents on both sides died from cancer along with the great-grandparents). My partner has nothing and I don't have any issues on my side. If I have children with my partner, will any of these diseases or problems be passed on from my partners side of the family? Should I be worried?  Thank You\n\n",
    "posted_time": "Post  by d99 » Tue Oct 27, 2009 3:31 pm",
    "category": "Medical Students",
    "sub_category": "Studying Basic Sciences",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=84990&sid=f920a4a5dd430d70c1ebe3fc70219721#p84990"
  },
  {
    "author": "Dr.M.Aroon kamath  Medical Doctor Posts: 1340 Joined: Mon Sep 28, 2009 11:20 am Gender: Male Location: Salalah, Sultanate of Oman.",
    "title": "Re: Genetics Passed on from Grandparents when having children?",
    "content": "Hi, Let me try to explain(to the best of my ability),how a certain disease is inherited. To put it very simply,a disease becomes 'inheritable' only when a certain abnormal gene(mutated) is present in the 'gonadal cells'.(the spermatozoa or the ova). A chromosomal abnormality or a mutation when present in somatic cells but not in the gonadal cells, is not 'inheritable'. Some of these mutations are 'dominant' and others 'recessive'. We all get one half of our genetic material from the father and the other half from the mother.  A 'dominant' mutation just needs one copy (from one parent) to manifest as a condition(disease or disorder) or as a 'trait', whereas, a  'recessive' gene will manifest only if BOTH copies are present(from either parent).  To make it more complicated, there is what is known as the 'penetrance' of a gene.This also plays a part in determining whether a mutation would actually manifest and in what percentage of the people who carry the gene.\"Expressivity' determines the degree of expression of a given genetic disorder or trait.  Generally, the recessive genes produce a more severe disease, disorder or a trait.  I hope this information may be of help to you. Best wishes!\n\n",
    "posted_time": "Post  by Dr.M.Aroon kamath » Fri Nov 20, 2009 7:11 pm",
    "category": "Medical Students",
    "sub_category": "Studying Basic Sciences",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=87463&sid=f920a4a5dd430d70c1ebe3fc70219721#p87463"
  },
  {
    "author": "Anna",
    "title": "Biochemistry",
    "content": "What are fatty acid binding proteins and what do they do?\n\n",
    "posted_time": "Post  by Anna » Sat Jan 04, 2003 6:11 am",
    "category": "Medical Students",
    "sub_category": "Studying Basic Sciences",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=84&sid=f920a4a5dd430d70c1ebe3fc70219721#p84"
  },
  {
    "author": "Dr. Safaa Mahmoud  Medical Doctor Posts: 1434 Joined: Sat Jan 04, 2003 7:53 am",
    "title": "[no title]",
    "content": "Lipids are organic compounds that are insoluble in water but soluble in ether, benzene or chloroform. They have important bilogical functions e.g. component of the cell membrane structure. Lipids are classified into simple lipids, conjugated and lipid derivatives. Simple lipids are esters of fatty acids e.g. triglycerides. Conjugated lipids are conjugates of lipids and another compound e.g. phospholipids. Derived lipids are hydrolytic products of simple and conjugated lipids.  90% of alimentary fat are trigylecrides. Phospholipids and cholesterol constitute the remaining 10%. The final digestive products of triglycerides are monoglyceride and fatty acids which are soluble in bile and form micelles which can traverse the intestinal mucosa cell membrane. Fatty acids are then transformed into acetyl CoA (CoAsh and ATP are required for the reaction). There are protiens called acyl carrier protiens that  carry acyle group of the coressponding fatty acids.Acetyl CoA is utilized for the formation of triglycerides. Triglycerides and cholesterol esters form lipoprotein particle (a complex of apoprotien molecule and phospholipids). Lipoproteins are ableto traverse the intestinal lumen driving lipids into the circulation.  Lipoproteins are conjugated proteins and lipids that are important cellular compounds that act as lipid transporters. The central part of a lipoprotein molecule contains the triglyceride and cholesterol ester while the surface is of apoprotiens, phospholipids, and cholesterol. Lipoproteins are divided into 4 main groups: Chylomicrons which are lipoproteins that carry dietary cholesterol and triglyceride from intestine to the liver and peripheral tissues respectively. To be secreted by intestinal cells a specific apolipoprotien called B48 mediate its binding to specific receptors. VLDL (very low density lipoproteins) which transfer triglyceride from the liver to peripheral tissue. B100 mediates its secretion. LDL which transfer cholesterol from the liver to tissues and its excess preclude high risk for atherosclerosis and ischemic heart disease. B100 mediates its binding for cell receptors for endocytosis. HDL which is the protective of atherosclerosis since it transfer cholesterol from tissues back to the liver. Lipoprotein lipase enable cells to uptake fatty acids from chylomicron and VLDL. Hormone sensitive lipase works during the lipolysis of stored triglycerides.  Fatty acids are stored in the adipose tissue in the form of triglyceride esters. Lipolyis is inhibited by insulin(stimulate lipogenesis) and stimulated only during fasting and physical exercise by the effect of ant-insulin hormones(adrenalin). Adrenalin stimulate B receptors to activate chain of reaction mediated by production of c-AMP and the activation of hormone sensitive lipase. Free fatty acid and monoglycerides are end products of this chain of reactions. Free fatty acids carried by albumin, transported in the blood plasma to be used for energy production through B oxidation in the mitochondria of different tissues (skeletal ms and liver). Monoglycerides are transported to liver and enter the process of gluconeogenesis.  Transport of FA inside the mitochondria through the mitochondrial membrane is facilitated a protein called carnitine (carnitine shuttle). Carnitine shuttle mechanism:  FA are transformed to the corresponding acyle CoA in the cytosol by the aid of the enzyme CoA synthetase and ATP. At the external mitochondrail membrane carnitine is esterified by the aid of an enzyme called carnitine acyle transferase1 and acylcarnitine is formed. Along the internal mitochondrial membrane there is carnitine acylcarnitine translocase transport the complex into the mitochondria along the internal michochondrial membrane. By the action of another carnitine transferase 2 ; acyle CoA is released ready for B oxidation and carnitine is translocated through the membrane back.  Fatty acid synthesis occurs in the cytosol of liver, adipose tissue and occasionally in the mammary gland during lactation. During normal feeding fatty acids are formed from acetyl CoA derived by carbohydrate metabolism. Synthesis of fatty acids mandates the transfer of acyle from the mitochondria to the cell cytosol where they covalently bind to acyle carrier protein (ACP). Successive carboxylation of  acetyl CoA leads to the formation of malonyl CoA, the main substrate of fatty acid chain synthesis. Transport of FA to the cell cytosol is mediated by citrate shuttle: inside the mitochondria citrate is formed by the interaction between  acetyl CoA and oxaloacetic acids by the aid of specific protein enzyme citrate synthetase. The conformational changes it makes by its two subunits, render the reaction products in accessible to water. They can then traverse the mitochondrial membrane to cytosol where acetyl CoA and oxaloacetic are released free to be used by the cell.. thanks.\n\n",
    "posted_time": "Post  by Dr. Safaa Mahmoud » Tue Jan 07, 2003 6:56 am",
    "category": "Medical Students",
    "sub_category": "Studying Basic Sciences",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=104&sid=f920a4a5dd430d70c1ebe3fc70219721#p104"
  },
  {
    "author": "zac attack  Guest Posts: 2 Joined: Fri Oct 14, 2005 7:05 am Location: Cambridge",
    "title": "CHD",
    "content": "Hi, how do you test for coronary heart diesease, what are the usual symptoms and is it caused by human factors like excercise that we can control or other factors like family history thanks a lot zac attack\n\n",
    "posted_time": "Post  by zac attack » Wed Oct 26, 2005 6:56 am",
    "category": "Medical Students",
    "sub_category": "Studying Basic Sciences",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=24064&sid=f920a4a5dd430d70c1ebe3fc70219721#p24064"
  },
  {
    "author": "Debbie Miller, RN  Nurse Posts: 4746 Joined: Mon Apr 16, 2007 2:41 pm Gender: Female Location: USA",
    "title": "[no title]",
    "content": "I will partially answer your question.  In health matters such as coronary risk, there are multiple factors that contribute.  Genetics is a part of this so it is good to be familiar with your family history.  If this shows risk factors, you would want to be especially diligent in screenings and other healthy compensating measures.  Activity, diet and lifestyle are all major contributors so it is wise to eat well, exercise regularly, avoid risky behaviors such as smoking, alcohol and drug consumption or unhealthy sexual practices.  If you haven't learned of your family background, it is an excellent thing to plan to do at the next family gathering.  Ask as many family members as you can what they know about your ancestors (grandparents, etc) such as how they died, what kinds of health issues did they deal with, mental health concerns, etc.  Then use this information to plan your life choices.    In many patients, the first symptom of coronary artery diseas (CAD) is myocardial infarction or sudden death, with no preceding chest pain as a warning. For this reason, doctors perform screening tests to detect signs of CAD before serious medical events occur. Screening tests are of particular importance for patients with risk factors for CAD. These risk factors include a family history of CAD at relatively young ages, an abnormal serum cholesterol profile, cigarette smoking, elevated blood pressure (hypertension), and diabetes mellitus.  Initial screening for CAD commonly involves stressing the heart under controlled conditions. These stress tests are able to detect the presence of flow-limiting blockages in the coronary arteries. There are two basic types of stress tests; those that involve exercising the patient to stress the heart (exercise cardiac stress tests), and those that involve chemically stimulating the heart directly to mimic the stress of exercise (physiologic stress testing). Physiologic stress testing can be used for patients who are unable to exercise.  Exercise Cardiac Stress Test or ECST (Treadmill Stress Test) is the most widely used cardiac stress test. The patient exercises on a treadmill according to a standardized protocol, with progressive increases in the speed and elevation of the treadmill (typically changing at three minute intervals). During the ECST, the patient's electrocardiogram (EKG), heart rate, heart rhythm, and blood pressure are continuously monitored.   Another supplement to the routine ECST is stress the echocardiogram.  During stress echocardiography, the sound waves of ultrasound are used to produce images of the heart at rest and at the peak of exercise.  When screening for CAD, the doctor will decide if screening tests are indicated and which test is most appropriate. The doctor will have detailed information regarding what testing involves and the implications of the results for each individual.  I hope this helps.  Let us know if you have other questions.\n\n",
    "posted_time": "Post  by Debbie Miller, RN » Fri Jun 22, 2007 8:26 am",
    "category": "Medical Students",
    "sub_category": "Studying Basic Sciences",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=43769&sid=f920a4a5dd430d70c1ebe3fc70219721#p43769"
  },
  {
    "author": "doc_gy  Guest Posts: 2 Joined: Wed Sep 17, 2003 10:19 am Location: philippines  Contact:   Contact doc_gy       Yahoo Messenger",
    "title": "CV stroke",
    "content": "what is the reason for left sided weakness, slurring of speech and left sided drooping of the face in CV stroke patients. the patient's CT scan shows an infarction of the right frontal lobe. what particular parts of the fontal lobe and branch of the middle cerebral artery are affected?  gorgeous_gy@charmed.ph\n\n",
    "posted_time": "Post  by doc_gy » Sat Nov 15, 2003 9:10 pm",
    "category": "Medical Students",
    "sub_category": "Studying Basic Sciences",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1675&sid=f920a4a5dd430d70c1ebe3fc70219721#p1675"
  },
  {
    "author": "dlugose  Guest Posts: 38 Joined: Tue Feb 22, 2005 6:08 pm Gender: Male Location: Boulder, CO, USA",
    "title": "[no title]",
    "content": "Try reading http://www.emedicine.com/pmr/topic77.htm  or http://neuro.psyc.memphis.edu/NeuroPsyc/np-dx-vasc.htm or google.com and search on cva \"frontal lobe\" \"cerebral artery\" speech.  Phrases need to be in quotes to restrict search to pages with words together.\n\n",
    "posted_time": "Post  by dlugose » Wed Oct 26, 2005 11:19 am",
    "category": "Medical Students",
    "sub_category": "Studying Basic Sciences",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=24089&sid=f920a4a5dd430d70c1ebe3fc70219721#p24089"
  },
  {
    "author": "sanchez",
    "title": "life expantacy",
    "content": "i have a question.i have a theory on people living betterand longer.not knowing the have a teminal disease like cancer,hiv exc.im looking for an article on this subject.if any one could help me out on this issue.i think that people that find out the are teminally ill.their condition accelerates due to the psychological impact they get when they do find out.if any one is aware of an article on this subject can the let me know where i can find such information.\n\n",
    "posted_time": "Post  by sanchez » Mon Aug 11, 2003 12:45 am",
    "category": "Medical Students",
    "sub_category": "Studying Basic Sciences",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1200&sid=f920a4a5dd430d70c1ebe3fc70219721#p1200"
  },
  {
    "author": "PAXILHEAD  Guest Posts: 2 Joined: Fri Jun 24, 2005 3:36 pm",
    "title": "[no title]",
    "content": "It's like Lung Cancer, they don't die from the cigarrettes, they die from guilt...\n\n",
    "posted_time": "Post  by PAXILHEAD » Tue Jun 28, 2005 8:54 am",
    "category": "Medical Students",
    "sub_category": "Studying Basic Sciences",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=15969&sid=f920a4a5dd430d70c1ebe3fc70219721#p15969"
  },
  {
    "author": "catcat  Guest Posts: 1 Joined: Fri Apr 29, 2005 2:06 pm Location: massachusett",
    "title": "Medical Technology Help!",
    "content": "HI friends. I am studying in this University with a major Medical Technology major. I finish all the requirements course and now I need one year training in the hospital so I can graduate it with a BS degree in my shool and a certificate for Med Tech. When I appy to this hospital they require me a Reccomend Letter from my Advisor, so I can get in there program for training. I ask my Advisor for a Reccomend Letter as they require me. My Advisor told me he did send to them twice one by mail and the other by email . However, They said they did not receive it yet. AS the end they reject me because I am too late for it. I don't know what to do ? Please give me some advise, thank you!\n\n",
    "posted_time": "Post  by catcat » Fri Apr 29, 2005 2:16 pm",
    "category": "Medical Students",
    "sub_category": "Studying Basic Sciences",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=13116&sid=f920a4a5dd430d70c1ebe3fc70219721#p13116"
  },
  {
    "author": "Dr. Tamer Fouad  Medical Doctor Posts: 2563 Joined: Thu Jan 02, 2003 6:19 pm Gender: Male",
    "title": "[no title]",
    "content": "Hi catcat, I don't think there is anything you can do. It's very unfortunate that your recommendation letter didn't arrive on time.\n\n",
    "posted_time": "Post  by Dr. Tamer Fouad » Mon May 02, 2005 3:51 pm",
    "category": "Medical Students",
    "sub_category": "Studying Basic Sciences",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=13271&sid=f920a4a5dd430d70c1ebe3fc70219721#p13271"
  },
  {
    "author": "nymomkiana11  Guest Posts: 1 Joined: Tue Mar 22, 2005 8:24 pm Location: Student Gardner-Webb",
    "title": "Red Blood Cells",
    "content": "What would happen to a person if his or her Red Blood cells lived more and less than 120 days?  If a person has a clinical problem how might they compensate for this\n\n",
    "posted_time": "Post  by nymomkiana11 » Tue Mar 22, 2005 8:29 pm",
    "category": "Medical Students",
    "sub_category": "Studying Basic Sciences",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=11235&sid=f920a4a5dd430d70c1ebe3fc70219721#p11235"
  },
  {
    "author": "Dr. D. Sawh  Medical Doctor Posts: 18 Joined: Sun Mar 20, 2005 7:05 am Location: GUYANA  Contact:   Contact Dr. D. Sawh       Yahoo Messenger   AOL",
    "title": "Red Blood Cells",
    "content": "Hello nymomkiana11, Thanks for your question. The average life span of a red cell (erythrocyte) is approx. 120 days. Less than 1% is destroyed per day. This represents a release of about 20mg of iron but most of this is re-used for haematopoiesis. IF AN AVERAGE RED CELL LIVES FOR MORE THAN 120 DAYS, IT WOULD EVENTUALLY BE DEGRADED VIA ENZYMATIC REACTIONS IN BOTH THE LIVER & SPLEEN. IF IT LIVES FOR LESS THAN 120 DAYS, THEN MORE RED CELLS WOULD HAVE TO BE FORMED IN ORDER TO COMPENSATE FOR THE LOSS BECAUSE LESS OXYGEN AND NUTRIENTS WOULD REACH THE TISSUES OF OUR BODY, THEREBY CAUSING ANOXIA / HYPOXIA AND SUBSEQUENTLY ANAEMIA. REMEMBER, FOR EVERY WHITE BLOOD CELL THERE ARE 600 RED BLOOD CELLS & IT IS THE RED CELLS THAT ARE RESPONSIBLE FOR THE RED COLOUR OF OUR BLOOD. The actual loss of iron in a human male is about 1mg daily and occurs via the skin, hair and urine. the loss in female is more uncertain and in the menstruating woman might be up to 2-3mg daily as the menstrual flow forms a major source of blood loss. Whilst this flow is often about 50mls , it could easily rise to 250mls(125mg of iron). THE NEED FOR IRON INCREASES DRAMATICALLY IN PREGNANCY AND LACTATION AS THE FETUS REQUIRES SOME 200-400MG OF IRON, AS WELL AS THE PLACENTA AS WELL AS DURING CHILDBIRTH. There is some saving due to the amenorrhoea(absence of menstruation) of pregnancy, so the net loss might be negligible or as much as 500-700mg. WITH REGARDS TO THE CLINICAL PROBLEM AND COMPENSATION, I CANNOT ANSWER THIS QUES. FULLY BECAUSE FIRSTLY, U DID NOT MENTION WHETHER IT IS AN ASSIGNMENT OR RESEARCH PROJECT, ETC. AND SECONDLY, YOU NEED TO BE MORE SPECIFIC AS TO WHAT CLINICAL PROBLEM / CONDITION U ARE REALLY TALKING ABOUT e.g. IRON DEFICIENCY ANAEMIA, APLASTIC ANAEMIA, MEGALOBLASTIC ANAEMIA, HAEMOLYTIC ANAEMIA, ETC. LOOKING FORWARD TO A SWIFT AND SPECIFIC RESPONSE FROM U  A. S. A.P. WITH DETAILS.   YOURS TRULY, D.SAWH  M.Sc., Pharm.D., M.D., F.R.C.P.\n\n",
    "posted_time": "Post  by Dr. D. Sawh » Sun Apr 03, 2005 6:32 am",
    "category": "Medical Students",
    "sub_category": "Studying Basic Sciences",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=11813&sid=f920a4a5dd430d70c1ebe3fc70219721#p11813"
  },
  {
    "author": "Sanddpm@aol.com",
    "title": "Please take my 1-2 question Survey",
    "content": "To all doctors and pre-med students. Would you please help me in my research by replying to the one or two questions below? It would be greatly appreciated and provide future students with realistic expectations regarding the practice of Medicine in 2003. Thank You!!!! Please send responses to Sanddpm@aol.com. Feel free to request results of mini poll.    1) This question is for pre-med students and all Medical Doctors  What are or were, your reasons for wanting to become a physician? (List as many letters that apply and in order of most important)  A-independence B-high income C-respect D-power to help people E-not sure  F-other_____________________________________________________   2.) These 2 questions are for Doctors who've been out of residency 3 years or less  Now that you are practicing medicine, which of the following if any, do you feel dissapointed by it's actual level of presence in the field? (List as many letters that apply and in order of most dissapointed. )  A- independence B-Income C-respect D-Power to help People E-none apply  F-other________________________________________________________   If you knew then what you know now, would you have chosen a different career path? Y N\n\n",
    "posted_time": "Post  by Sanddpm@aol.com » Sun Jun 29, 2003 1:14 am",
    "category": "Medical Students",
    "sub_category": "Studying Basic Sciences",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1045&sid=f920a4a5dd430d70c1ebe3fc70219721#p1045"
  },
  {
    "author": "Rhonda P, CEP  Paramedic Posts: 252 Joined: Wed Mar 16, 2005 8:37 am Gender: Female Location: USA",
    "title": "your poll",
    "content": "Hello, this mini poll is from June 2003 and I'm not a Doctor but I am going to reply to ask ... \"Is anyone in here??\"   I'm pretty sure this is not longer needed but I thought I would ask\n\n",
    "posted_time": "Post  by Rhonda P, CEP » Fri Mar 18, 2005 4:01 pm",
    "category": "Medical Students",
    "sub_category": "Studying Basic Sciences",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=11032&sid=f920a4a5dd430d70c1ebe3fc70219721#p11032"
  },
  {
    "author": "zhhoo  Guest Posts: 1 Joined: Wed Jun 09, 2004 1:59 am Location: Edinburgh, Uk",
    "title": "Kidney Transplantation",
    "content": "I am a medical student and have created a web page about kidney transplantation. I'm hoping that this would be of interest to patients: click here!\n\n",
    "posted_time": "Post  by zhhoo » Wed Jun 09, 2004 2:00 am",
    "category": "Medical Students",
    "sub_category": "Studying Basic Sciences",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3622&sid=f920a4a5dd430d70c1ebe3fc70219721#p3622"
  },
  {
    "author": "Rhonda P, CEP  Paramedic Posts: 252 Joined: Wed Mar 16, 2005 8:37 am Gender: Female Location: USA",
    "title": "Your website",
    "content": "This is a nice website, do you still keep it up? Can I refer people to it from here?\n\n",
    "posted_time": "Post  by Rhonda P, CEP » Fri Mar 18, 2005 3:57 pm",
    "category": "Medical Students",
    "sub_category": "Studying Basic Sciences",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=11030&sid=f920a4a5dd430d70c1ebe3fc70219721#p11030"
  },
  {
    "author": "bobby  Guest Posts: 1 Joined: Sun Oct 17, 2004 1:10 pm Location: USA",
    "title": "Visual Learning&Mnemonics ?",
    "content": "I can't keep the drug names straight...  I'm debating whether to get a subscription to Mediglyphics.com or buying \"Funny Pharm\" or \"Visual Mnemonics in Pharmacology\" books - Did anyone here have any experiences/reccommendations pertaining to those books?  - Bobby\n\n",
    "posted_time": "Post  by bobby » Sun Oct 17, 2004 1:18 pm",
    "category": "Medical Students",
    "sub_category": "Studying Basic Sciences",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=5913&sid=f920a4a5dd430d70c1ebe3fc70219721#p5913"
  },
  {
    "author": "Rhonda P, CEP  Paramedic Posts: 252 Joined: Wed Mar 16, 2005 8:37 am Gender: Female Location: USA",
    "title": "drugs",
    "content": "what drugs are you working on learning right now? Oops, never mind, You've probably learned them by now, LOL, look at the date you wrote this!!\n\n",
    "posted_time": "Post  by Rhonda P, CEP » Fri Mar 18, 2005 2:28 am",
    "category": "Medical Students",
    "sub_category": "Studying Basic Sciences",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=10992&sid=f920a4a5dd430d70c1ebe3fc70219721#p10992"
  },
  {
    "author": "GhettoSocks  Guest Posts: 1 Joined: Thu Feb 03, 2005 1:26 am Location: Santa Barbara",
    "title": "Passing out in Biology",
    "content": "Ever since I was really little I always passed out whenever anything medical was mentioned (this site is dangerous for me). I've learned to control the passing out by walking outside and not thinking about it. I'm having a particularily hard time in Biology because of all of the references to blood, diseases and viruses. Today in class my teacher was talking about AIDs and I almost passed out. It's not that I'm grossed out, it comes without warning and all of a sudden I get light headed and my ears ring a bit. I've been wondering for a while now what could possibly be wrong with me. I may just have some psychological problem, but I have no idea where that came from. My mom and her dad are the same way, they can't see blood, look at shots, hear about diseases or sicknesses in any form, and if they read about something they get nausous just like me. It's strange, and I just don't know what to say about it. I want to get to the bottom of it because I just can't keep running out of class like I've been doing. Please help!!\n\n",
    "posted_time": "Post  by GhettoSocks » Thu Feb 03, 2005 1:40 am",
    "category": "Medical Students",
    "sub_category": "Studying Basic Sciences",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8862&sid=f920a4a5dd430d70c1ebe3fc70219721#p8862"
  },
  {
    "author": "Theresa Jones, RN  Nurse Posts: 2365 Joined: Tue Sep 28, 2004 10:21 am",
    "title": "[no title]",
    "content": "Hi GhettoSocks, I can certainly understand what your saying. Actually there were a couple of medical procedures which made me feel the same way and took some time for this to dissipate. This is actually a  phobia, fear of an object, situation, event, etc.  In many cases fear is a learned behavior. Fear/stressors cause symptoms such as feeling hot, sweaty, flushed, increases in heart rate, nausea, dizziness, and fainting. Thoughts and feelings which create fear can initiate the fight or flight response in all of us. A potential threat or situation causes the release of adrenaline in our bodies which causes an immediate increase in heart rate, breathing, etc., which in turn causes even more adrenaline to be released. We can trick our bodies into a calm state by slowing the breathing down, which in turn slows down the heart rate which stops the release of adrenaline. If you could practice relaxation techniques to reduce the anxiety when exposure to the situations occur, this may help resolve the problem. Here is a suggestion for a simple breathing technique called triangle breathing  1. Inhale for 3 SLOW seconds  2. HOLD IT for 3 SLOW seconds  3. Exhale completely for 3 SLOW seconds.  4. Repeat 3 times.  I hope you find this helpful. Sincerely, Rntdj\n\n",
    "posted_time": "Post  by Theresa Jones, RN » Thu Feb 03, 2005 3:55 am",
    "category": "Medical Students",
    "sub_category": "Studying Basic Sciences",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8864&sid=f920a4a5dd430d70c1ebe3fc70219721#p8864"
  },
  {
    "author": "Guest",
    "title": "biological cell membranes",
    "content": "How does pH affect the permeability of a beetroot membrane?\n\n",
    "posted_time": "Post  by Guest » Mon Feb 17, 2003 5:14 am",
    "category": "Medical Students",
    "sub_category": "Studying Basic Sciences",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=365&sid=f920a4a5dd430d70c1ebe3fc70219721#p365"
  },
  {
    "author": "Suchi Chadalavada  Guest Posts: 1 Joined: Sat Jan 29, 2005 8:25 am Location: Kent",
    "title": "Re: biological cell membranes",
    "content": "Have you got an answer to this question yet, because I am doing my biolgy investigation on this and also want to know.\n\n",
    "posted_time": "Post  by Suchi Chadalavada » Sat Jan 29, 2005 8:31 am",
    "category": "Medical Students",
    "sub_category": "Studying Basic Sciences",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=8693&sid=f920a4a5dd430d70c1ebe3fc70219721#p8693"
  },
  {
    "author": "Richard C. Loria, M.D.  Guest Posts: 2 Joined: Sat Jun 05, 2004 7:01 pm Location: Washington D.C.",
    "title": "Cranial Nerve Anatomy Without Mnemonics",
    "content": "Here is a great tool to visually reinforce Cranial Nerve Anatomy.  This is a watch with art work representing the 12 Cranial Nerves.  The watch was recently on display at the American Academy of Neurology Meeting in San Francisco where it was auctioned off for double it's retail costs.  The watch and details are available at:  www.cranialnervewatch.com  This is an educational tool which is fun, useful, and a great conversation piece.  Best wishes for your medical studies,  Richard C. Loria, M.D. Founder, Nervous Tic Enterprises\n\n",
    "posted_time": "Post  by Richard C. Loria, M.D. » Sat Jun 05, 2004 7:10 pm",
    "category": "Medical Students",
    "sub_category": "Studying Basic Sciences",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3594&sid=f920a4a5dd430d70c1ebe3fc70219721#p3594"
  },
  {
    "author": "Richard C. Loria, M.D.  Guest Posts: 2 Joined: Sat Jun 05, 2004 7:01 pm Location: Washington D.C.",
    "title": "Re:  Shipping to Europe",
    "content": "Yes, we will ship to Europe.  It may take a little bit longer than usual but we have sent to Spain already.  Dr. Loria\n\n",
    "posted_time": "Post  by Richard C. Loria, M.D. » Tue Jun 08, 2004 6:44 pm",
    "category": "Medical Students",
    "sub_category": "Studying Basic Sciences",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=3619&sid=f920a4a5dd430d70c1ebe3fc70219721#p3619"
  },
  {
    "author": "Doc Zarrin  Guest Posts: 1 Joined: Wed Jul 14, 2004 7:28 am Location: Pakistan",
    "title": "First post of mine.",
    "content": "This is my first post in this forum. I am being very generous with my words. Thankyou wonderful site. That is all I have to say for the moment.\n\n",
    "posted_time": "Post  by Doc Zarrin » Wed Jul 14, 2004 7:42 am",
    "category": "Medical Students",
    "sub_category": "Studying Basic Sciences",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=4067&sid=f920a4a5dd430d70c1ebe3fc70219721#p4067"
  },
  {
    "author": "doc_gy  Guest Posts: 2 Joined: Wed Sep 17, 2003 10:19 am Location: philippines  Contact:   Contact doc_gy       Yahoo Messenger",
    "title": "URGENT: HELP! anatomists pls. . .",
    "content": "are there any anatomists here? or better yet, neuroanotomists? or anybody who knows one? pls email me asap. i would be needing a little help about CV stroke. thanks!\n\n",
    "posted_time": "Post  by doc_gy » Sat Nov 08, 2003 11:49 am",
    "category": "Medical Students",
    "sub_category": "Studying Basic Sciences",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1601&sid=f920a4a5dd430d70c1ebe3fc70219721#p1601"
  },
  {
    "author": "drsohel  Guest Posts: 1 Joined: Thu May 22, 2003 10:30 am",
    "title": "[no title]",
    "content": "Dear doc,                Would you kindly mention what kind of help you require about CV stroke.I will try to help you.Also you didn't mention your name.  Regards,\n\n",
    "posted_time": "Post  by drsohel » Sun Nov 09, 2003 1:35 pm",
    "category": "Medical Students",
    "sub_category": "Studying Basic Sciences",
    "url": "https://www.doctorslounge.com/forums/viewtopic.php?p=1606&sid=f920a4a5dd430d70c1ebe3fc70219721#p1606"
  }
]